package PDK::Firewall::Element::Address::H3c;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 引用 PDK::Firewall::Element::Address::Role 角色
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::Address::Role';

__PACKAGE__->meta->make_immutable;
1;
