package PDK::Firewall::Element::Address::Paloalto;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 继承 PDK::Firewall::Element::Address::Role 角色 方法属性
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::Address::Role';

#------------------------------------------------------------------------------
# 定义 PDK::Firewall::Element::Address::Paloalto 方法属性
#------------------------------------------------------------------------------
has fqdn => (is => 'ro', writer => 'setFqdn');

has tag => (is => 'ro', writer => 'setTag');

__PACKAGE__->meta->make_immutable;
1;
