Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/J/Jifty-Plugin-OpenID/share/po/*.po
Languages: fr

source: Continue
fr: Continuer

source: Go for it!
fr: Essayer ces valeurs !

source: If the username provided conflicts with an existing username or contains invalid characters, you will have to give us a new one.
fr: Si le nom d'utilisateur est déjà utilisé ou contient des caractères non autorisés, vous devez en définir un autre.

source: If you have a Livejournal or other OpenID account, you don't even need to sign up. Just log in.
fr: Si vous avez un compte OpenID, vous n'avez pas besoin de créer un compte. Vous pouvez directement vous connecter.

source: Invalid OpenID URL. Please check to make sure it is correct. (%1)
fr: URL OpenID incorrecte. Merci de la vérifier. (%1)

source: It looks like someone is already using that OpenID.
fr: Cet identifiant OpenID est déjà utilisé par un utilisateur.

source: Login with OpenID
fr: Identification OpenID

source: Login with your OpenID
fr: Se connecter avec votre OpenID

source: OpenID URL
fr: URL OpenID

source: For example: you.livejournal.com
fr: Par exemple: you.livejournal.com

source: OpenID verification failed. It looks like you cancelled the OpenID verification request.
fr: La vérification OpenID a échouée. Vous avez peut-être annulé la demande de vérification.

source: A link to confirm this email will be sent to receive later notifications.
fr: Un message pour confirmer cet email vous sera envoyé.

source: OpenID verification failed:
fr: Vérification OpenId échouée:

source: Set your username
fr: Définissez votre nom d'utilisateurs

source: Sign in with your Google Account
fr: Se connecter avec un compte Google

source: Sign in with your MyOpenID Account
fr: Se connecter avec un compte MyOpenID

source: Sign in with your Yahoo account
fr: Se connecter avec un compte Yahoo

source: The OpenID '%1' has been linked to your account.
fr: L'identifiant OpenID '%1' a été attaché à votre compte.

source: We need you to set a username or quickly check the one associated with your OpenID. Your username is what other people will see when you ask questions or make suggestions
fr: Vous devez définir ou vérifier le nom d'utilisateur associé à votre IOpenID. C'est ce nom d'utilisateur qui apparaîtra lorsque vous publierez des informations.

source: Welcome back,
fr: Re-bonjour,

source: Welcome,
fr: Bienvenue,

source: You already logged in.
fr: Vous êtes déjà connecté.
