<html><head><title>Acme::Web::PodDisplay</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" >
</head>
<body class='pod'>
<!--
  generated by Pod::Simple::HTML v3.20,
  using Pod::Simple::PullParser v3.20,
  under Perl v5.016000 at Thu Mar 14 01:11:08 2013 GMT.

 If you want to change this HTML document, you probably shouldn't do that
   by changing it directly.  Instead, see about changing the calling options
   to Pod::Simple::HTML, and/or subclassing Pod::Simple::HTML,
   then reconverting this document from the Pod source.
   When in doubt, email the author of Pod::Simple::HTML for advice.
   See 'perldoc Pod::Simple::HTML' for more info.

-->

<!-- start doc -->
<a name='___top' class='dummyTopAnchor' ></a>

<h1><a class='u'
name="NAME"
>NAME</a></h1>

<p>Acme::Web::PodDisplay - Module for testing various CPAN web interfaces and their POD interactions</p>

<h1><a class='u'
name="SYNOPSIS"
>SYNOPSIS</a></h1>

<pre>   use Acme::Web::PodDisplay</pre>

<h1><a class='u'
name="DESCRIPTION"
>DESCRIPTION</a></h1>

<p>Acme::Web::PodDisplay does nothing. It&#39;s used to test how various CPAN web interfaces work with combinations of PM and POD files.</p>

<h1><a class='u'
name="SOURCE"
>SOURCE</a></h1>

<p>This POD documentation is from the PodDisplay.pm file.</p>

<h1><a class='u'
name="SIMPLE_POD"
>SIMPLE POD</a></h1>

<p>Basics: <i>Italics</i> <b>bold</b> <code>code</code></p>

<p>Escapes: &#60; &#62; | / &#233; &#8222;</p>

<p>Filenames: <em>.cshrc</em></p>

<p>Z code: N&#60;3</p>

<p>X code: <!--
	INDEX: topic name
--></p>

<p>S code: $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z | $x&#160;?&#160;$y&#160;:&#160;$z</p>

<p>Links:</p>

<ul>
<li><a href="http://search.cpan.org/perldoc?perldiag" class="podlinkpod"
>Perl Error Messages</a></li>

<li><a href="http://search.cpan.org/perldoc?perlsyn#Statement_Modifiers" class="podlinkpod"
>postfix &#34;if&#34;</a></li>

<li><a href="#BEGIN_FORMATS" class="podlinkpod"
>The Next Section</a></li>

<li><a href="http://www.perl.org/" class="podlinkurl"
>http://www.perl.org/</a></li>

<li><a href="http://www.perl.org/" class="podlinkurl"
>The Perl Home Page</a></li>

<li><a href="http://search.cpan.org/perldoc?Acme%3A%3AWeb%3A%3APodDisplay" class="podlinkpod"
>Acme::Web::PodDisplay</a></li>

<li><a href="http://search.cpan.org/perldoc?Acme%3A%3AWeb%3A%3APodDisplay%3A%3ADeeper" class="podlinkpod"
>Acme::Web::PodDisplay::Deeper</a></li>

<li><a href="http://search.cpan.org/perldoc?Acme%3A%3AWeb%3A%3APodDisplay%3A%3ADeeper#html" class="podlinkpod"
>&#34;html&#34; in Acme::Web::PodDisplay::Deeper</a></li>

<li><a href="http://search.cpan.org/perldoc?Acme%3A%3AWeb%3A%3APodDisplay%3A%3ADeeper#html" class="podlinkpod"
>The &#34;html&#34; subsection</a></li>

<li><a href="http://search.cpan.org/perldoc?Class%3A%3AC3%3A%3AComponentised#load_components(_%40comps_)" class="podlinkpod"
>load_components</a></li>

<li><a href="http://search.cpan.org/perldoc?Class%3A%3AC3%3A%3AComponentised#load_components(_%40comps_)" class="podlinkpod"
>&#34;load_components( @comps )&#34; in Class::C3::Componentised</a></li>
</ul>

<p>Multi-brackets:</p>

<ul>
<li><code>$a &#60;=&#62; $b</code></li>

<li><code>$a &#60;=&#62; $b</code></li>

<li><code>$a &#60;=&#62; $b</code></li>

<li><code>$a &#60;=&#62; $b</code></li>

<li><code>$a &#60;=&#62; $b</code></li>

<li><code>open(X, &#34;&#62;&#62;thing.dat&#34;) || die $!</code></li>

<li><code>$foo-&#62;bar();</code></li>
</ul>

<h1><a class='u'
name="BEGIN_FORMATS"
>BEGIN FORMATS</a></h1>

<h2><a class='u'
name="HTML"
>HTML</a></h2>

<hr>
<img src="http://st.pimg.net/perlweb/images/icons/camel.v7265f46.png">
<p>This is a raw HTML paragraph.  Here's a <a href="http://www.perl.org/">link</a>.</p>


<table>
   <tr>
      <th>Header</th>
      <th>Thingy</th>
   </tr>
   <tr>
      <td>Item 1</td>
      <td>Cell 1b</td>
   </tr>
   <tr>
      <td>Item 2</td>
      <td>Cell 2b</td>
   </tr>
</table>


<p>For block example, with <b>bold text</b></p>


<h2><a class='u'
name="Text"
>Text</a></h2>

<h2><a class='u'
name="Comment"
>Comment</a></h2>

<h1><a class='u'
name="ENCODINGS"
>ENCODINGS</a></h1>

<p>This document is a UTF-8 doc with an <code>=encoding</code> tag. This line drawing should look a bit better than ASCII art:</p>

<pre>   Input &#9472;&#9472;&#9516;&#9472;&#9472; InThingy &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Output + OutThingy
           &#9500;&#9472;&#9472; InThingy + Foobar &#9472;&#9472;&#9516;&#9472;&#9472; Output + OutThingy
           &#9474;                       &#9492;&#9472;&#9472; Output + OutThingy
           &#9500;&#9472;&#9472; InThingy + Foobar &#9472;&#9472;&#9516;&#9472;&#9472; Output + OutThingy
           &#9492;&#9472;&#9472; InThingy &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9496;
   Input &#9472;&#9472;&#9516;&#9472;&#9472; InThingy &#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472; Output + OutThingy
           &#9492;&#9472;&#9472; InThingy + Foobar &#9472;&#9472;&#9472;&#9472;&#9472; Output + OutThingy</pre>

<p>Here&#39;s a random snippet of UTF-8 characters:</p>

<p>&#9312; &#9313; &#9314; &#9315; &#9316; &#9317; &#9318; &#9319; &#9320; &#9321; &#9322; &#9323; &#9324; &#9325; &#9326; &#9327; &#9328; &#9329; &#9330; &#9331; &#9332; &#9333; &#9334; &#9335; &#9336; &#9337; &#9338; &#9339; &#9340; &#9341; &#9342; &#9343; &#9344; &#9345; &#9346; &#9347; &#9348; &#9349; &#9350; &#9351; &#9352; &#9353; &#9354; &#9355; &#9356; &#9357; &#9358; &#9359; &#9360; &#9361; &#9362; &#9363; &#9364; &#9365; &#9366; &#9367; &#9368; &#9369; &#9370; &#9371; &#9372; &#9373; &#9374; &#9375; &#9376; &#9377; &#9378; &#9379; &#9380; &#9381; &#9382; &#9383; &#9384; &#9385; &#9386; &#9387; &#9388; &#9389; &#9390; &#9391; &#9392; &#9393; &#9394; &#9395; &#9396; &#9397; &#9398; &#9399; &#9400; &#9401; &#9402; &#9403; &#9404; &#9405; &#9406; &#9407; &#9408; &#9409; &#9410; &#9411; &#9412; &#9413; &#9414; &#9415; &#9416; &#9417; &#9418; &#9419; &#9420; &#9421; &#9422; &#9423; &#9424; &#9425; &#9426; &#9427; &#9428; &#9429; &#9430; &#9431; &#9432; &#9471; &#9472; &#9473; &#9474; &#9475; &#9476; &#9477; &#9478; &#9479; &#9480; &#9481; &#9482; &#9483; &#9484; &#9485; &#9433; &#9434; &#9435; &#9436; &#9437; &#9438; &#9439; &#9440; &#9441; &#9442; &#9443; &#9444; &#9445; &#9446; &#9447; &#9448; &#9449; &#9450; &#9451; &#9452; &#9453; &#9454; &#9455; &#9456; &#9457; &#9458; &#9459; &#9460; &#9486; &#9487; &#9488; &#9489; &#9490; &#9491; &#9492; &#9493; &#9494; &#9495; &#9496; &#9497; &#9498; &#9499; &#9500; &#9501; &#9502; &#9503; &#9504; &#9505; &#9506; &#9507; &#9508; &#9509; &#9510; &#9511; &#9512; &#9513; &#9514; &#9515; &#9516; &#9517; &#9518; &#9519; &#9520; &#9521; &#9522; &#9523; &#9524; &#9525; &#9526; &#9527; &#9528; &#9529; &#9530; &#9531; &#9532; &#9533; &#9534; &#9535; &#9536; &#9537; &#9538; &#9539; &#9540; &#9541; &#9542; &#9543; &#9544; &#9545; &#9546; &#9547; &#9548; &#9549; &#9550; &#9551; &#9552; &#9553; &#9554; &#9555; &#9556; &#9557; &#9558; &#9559; &#9560; &#9561; &#9562; &#9563; &#9564; &#9565; &#9566; &#9567; &#9568; &#9569; &#9570; &#9571; &#9572; &#9573; &#9574; &#9575; &#9576; &#9577; &#9578; &#9579; &#9580; &#9581; &#9582; &#9583; &#9584; &#9585; &#9586; &#9587; &#9588; &#9589; &#9590; &#9591; &#9592; &#9593; &#9594; &#9595; &#9596; &#9597; &#9598; &#9599; &#9600; &#9601; &#9602; &#9603; &#9604; &#9605; &#9606; &#9607; &#9608; &#9609; &#9610; &#9611; &#9612; &#9613; &#9614; &#9615; &#9616; &#9617; &#9618; &#9619; &#9620; &#9621; &#9622; &#9623; &#9624; &#9625; &#9626; &#9627; &#9628; &#9629; &#9630; &#9631; &#9632; &#9633; &#9634; &#9635; &#9636; &#9637; &#9638; &#9639; &#9640; &#9641; &#9642; &#9643; &#9644; &#9645; &#9646; &#9647; &#9648; &#9649; &#9650; &#9651; &#9652; &#9653; &#9654; &#9655; &#9656; &#9657; &#9658; &#9659; &#9660; &#9661; &#9662; &#9663; &#9664; &#9665; &#9666; &#9667; &#9668; &#9669; &#9670; &#9671; &#9672; &#9673; &#9674; &#9675; &#9676; &#9677; &#9678; &#9679; &#9680; &#9681; &#9682; &#9683; &#9684; &#9685; &#9686; &#9687; &#9688; &#9689; &#9690; &#9691; &#9692; &#9693; &#9694; &#9695; &#9696; &#9697; &#9698; &#9699; &#9700; &#9701; &#9702; &#9703; &#9704; &#9705; &#9706; &#9707; &#9708; &#9709; &#9710; &#9711; &#9712; &#9713; &#9714; &#9715; &#9716; &#9717; &#9718; &#9719; &#9720; &#9721; &#9722; &#9723; &#9724; &#9725; &#9726; &#9727; &#9728; &#9729; &#9730; &#9731; &#9732; &#9733; &#9734; &#9735; &#9736; &#9737; &#9738; &#9739; &#9740; &#9741; &#9742; &#9743; &#9744; &#9745; &#9746; &#9747; &#9748; &#9749; &#9750; &#9751; &#9752; &#9753; &#9754; &#9755; &#9756; &#9757; &#9758; &#9759; &#9760; &#9761; &#9762; &#9763; &#9764; &#9765; &#9766; &#9767; &#9768; &#9769; &#9770; &#9771; &#9772; &#9773; &#9774; &#9775; &#9776; &#9777; &#9778; &#9779; &#9780; &#9781; &#9782; &#9783; &#9888; &#9889; &#9890; &#9891; &#9892; &#9893; &#9894; &#9895; &#9896; &#9897; &#9898; &#9899; &#9838; &#9839; &#9840; &#9841; &#9842; &#9843; &#9844; &#9845; &#9846; &#9847; &#9848; &#9849; &#9850; &#9851; &#9852; &#9853; &#9854; &#9855; &#9856; &#9857; &#9858; &#9859; &#9860; &#9861; &#9862; &#9863; &#9864; &#9865; &#9866; &#9867; &#9868; &#9869; &#9870; &#9871; &#9872; &#9873; &#9874; &#9875; &#9876; &#9877; &#9878; &#9879; &#9880; &#9881; &#9882; &#9883; &#9884; &#9900; &#9901; &#9902; &#9903; &#9904; &#9905; &#9906; &#9907; &#9908; &#9909; &#9910; &#9911; &#9912; &#9985; &#9986; &#9987; &#9988; &#9990; &#9991; &#9992; &#9993; &#9996; &#9997; &#9998; &#9999; &#10000; &#10001; &#10002; &#10003; &#10004; &#10005; &#10006; &#10007; &#10008; &#10009; &#10010; &#10011; &#10012; &#10013; &#10014; &#10015; &#10016; &#10017; &#10018; &#10019; &#10020; &#10021; &#10022; &#10023; &#10025; &#10026; &#10027; &#10028; &#10029; &#10030; &#10031; &#10032; &#10033; &#10034; &#10035; &#10036; &#10037; &#10038; &#10039; &#10040; &#10041; &#10042; &#10043; &#10044; &#10045; &#10046; &#10047; &#10048; &#10049; &#10050; &#10051; &#10052; &#10053; &#10054; &#10055; &#10056; &#10057; &#10058; &#10059; &#10061; &#10063; &#10064; &#10065; &#10066; &#10070; &#10081; &#10082; &#10083; &#10084; &#10085; &#10086; &#10087; &#10088; &#10089; &#10090; &#10091; &#10092; &#10093; &#10094; &#10095; &#10096; &#10097; &#10098; &#10099; &#10100; &#10101; &#10102; &#10103; &#10104; &#10105; &#10106; &#10107; &#10108; &#10109; &#10110; &#10111; &#10112; &#10113; &#10114; &#10115; &#10116; &#10117; &#10118; &#10119; &#10120; &#10072; &#10073; &#10074; &#10075; &#10076; &#10077; &#10078; &#10161; &#10162; &#10163; &#10164; &#10165; &#10166; &#10167; &#10168; &#10136; &#10137; &#10138; &#10139; &#10140; &#10141; &#10142; &#10143; &#10144; &#10145; &#10146; &#10147; &#10148; &#10149; &#10150; &#10151; &#10152; &#10153; &#10154; &#10155; &#10156; &#10157; &#10158; &#10159; &#10121; &#10122; &#10123; &#10124; &#10125; &#10126; &#10127; &#10128; &#10129; &#10130; &#10131; &#10132; &#10169; &#10170; &#10171; &#10172; &#10173; &#10174; &#10175; &#10181; &#10182; &#10208; &#10209; &#10214; &#10215; &#10216; &#10217; &#10218; &#10219; &#10224; &#10225; &#10226; &#10227; &#10228; &#10229; &#3424; &#3425; &#5121; &#5122; &#5123; &#5124; &#5125; &#3757; &#3758; &#3759; &#3760; &#3761; &#3762; &#3763; &#3764; &#3765; &#3766; &#3767; &#3768; &#3769; &#5126; &#5127; &#5128; &#5129; &#5130; &#5131; &#5132; &#5133; &#5134; &#5135; &#5136; &#5137; &#5138; &#5139; &#5140; &#5141; &#5142; &#5143; &#5144; &#5145; &#5146; &#5147; &#5148; &#5149; &#5150; &#5151; &#5152; &#5153; &#5154; &#5155; &#5156; &#5157; &#5158; &#5159; &#5160; &#5161; &#5162; &#5163; &#5164; &#5165; &#5166; &#5167; &#5168; &#5169; &#5170; &#5171; &#5172; &#5173; &#5174; &#5175; &#5176; &#5177; &#5178; &#5179; &#5180; &#5181; &#5182; &#5183; &#5184; &#5185; &#5186; &#5187; &#5188; &#5189; &#5190; &#5191; &#5192; &#5193; &#5194; &#5195; &#5196; &#5197; &#5198; &#5199; &#5200; &#5201; &#5202; &#5203; &#5204; &#5205; &#5206; &#5207; &#5208; &#5209; &#5210; &#5211; &#5212; &#5213; &#5214; &#5215; &#5216; &#5217; &#5218; &#5219; &#5220; &#5221; &#5222; &#5223; &#5224; &#5225; &#5226; &#5227; &#5228; &#5229; &#5230; &#5231; &#5232; &#5233; &#5234; &#5235; &#5236; &#5237; &#5238; &#5239; &#5240; &#5241; &#5242; &#5243; &#5244; &#5245; &#5246; &#5247; &#5248; &#5249; &#5250; &#5251; &#5252; &#5253; &#5254; &#5255; &#5256; &#5257; &#5258; &#5259; &#5260; &#5261; &#5262; &#5263; &#5264; &#5265; &#5266; &#5267; &#5268; &#5269; &#5270; &#5271; &#5272; &#5273; &#5274; &#5275; &#5276; &#5277; &#5278; &#5279; &#5280; &#5281; &#5282; &#5283; &#5284; &#5285; &#5286; &#5287; &#5288; &#5289; &#5290; &#5291; &#5292; &#5293; &#5294; &#5295; &#5296; &#5297; &#5298; &#5299; &#5300; &#5301; &#5302; &#5303; &#5304; &#5305; &#5306; &#5312; &#5313; &#5314; &#5315; &#5316; &#5317; &#5318; &#5319; &#5320; &#5321; &#5322; &#5323; &#5324; &#5325; &#5326; &#5327; &#5328; &#5329; &#5330; &#5331; &#5332; &#5333; &#5334; &#5335; &#5336; &#5337; &#5338; &#5339; &#5340; &#5341; &#5342; &#5343; &#5344; &#5345; &#5346; &#5347; &#5348; &#5349; &#5350; &#5351; &#5352; &#5353; &#5366; &#5367; &#5368; &#5369; &#5370; &#5371; &#5372; &#5373; &#5374; &#5375; &#5376; &#5377; &#5378; &#5379; &#5380; &#5381; &#5382; &#5383; &#5392; &#5393; &#5394; &#5395; &#5396; &#5397; &#5398; &#5399; &#5400; &#5401; &#5402; &#5403; &#5404; &#5405; &#5406; &#5407; &#5408; &#5409; &#5410; &#5411; &#5412; &#5413; &#5414; &#5415; &#5416; &#5417; &#5418; &#5419; &#5420; &#5421; &#5422; &#5423; &#5424; &#5425; &#5426; &#5427; &#5428; &#5429; &#5430; &#5431; &#5432; &#5433; &#5434; &#5435; &#5436; &#5437; &#5438; &#5458; &#5459; &#5460; &#5461; &#5462; &#5463; &#5464; &#5465; &#5466; &#5467; &#5468; &#5469; &#5470; &#5471; &#5472; &#5473; &#5474; &#5475; &#5476; &#5477; &#5478; &#5479; &#5480; &#5481; &#5482; &#5440; &#5441; &#5442; &#5443; &#5444; &#5445; &#5446; &#5447; &#5448; &#5449; &#5450; &#5451; &#5452; &#5453; &#5454; &#5455; &#5456; &#5514; &#5515; &#5516; &#5517; &#5518; &#5519; &#5520; &#5521; &#5522; &#5523; &#5524; &#5525; &#5526; &#5492; &#5493; &#5494; &#5495; &#5496; &#5497; &#5498; &#5499; &#5500; &#5501; &#5502; &#5503; &#5504; &#5505; &#5506; &#5507; &#5508; &#5509; &#5761; &#5762; &#5763; &#5764; &#5765; &#5766; &#5767; &#5768; &#5769; &#5770; &#5771; &#5772; &#5773; &#5774; &#5775; &#5776; &#5777; &#5778; &#5779; &#5780; &#5742; &#5601; &#5598; &#5540; &#5541; &#5542; &#5543; &#5544; &#5545; &#5546; &#5547; &#5548; &#5549; &#5550; &#5551; &#5536; &#5537; &#5538; &#5539; &#5781; &#5782; &#5783; &#5784; &#5785; &#5786; &#5787; &#5788; &#7424; &#7425; &#7426; &#7427; &#7428; &#7429; &#7430; &#7431; &#7432; &#7433; &#7434; &#7435; &#7436; &#7437; &#7438; &#7439; &#7440; &#7441; &#7442; &#7443; &#7444; &#7445; &#7446; &#7447; &#7448; &#7449; &#7450; &#7451; &#7452; &#7453; &#7454; &#7455; &#7456; &#7457; &#7458; &#7459; &#7460; &#7461; &#7462; &#7463; &#7464; &#7465; &#7466; &#7467; &#7468; &#7469; &#7470; &#7471; &#7472; &#7473; &#7474; &#7475; &#7476; &#7477; &#7478; &#7479; &#7480; &#7481; &#7482; &#7483; &#7484; &#7485; &#7486; &#7487; &#7488; &#7489; &#7490; &#7491; &#7492; &#7493; &#7494; &#7495; &#7496; &#7497; &#7498; &#7499; &#7500; &#7501; &#7502; &#7503; &#7504; &#7505; &#7506; &#7507; &#7508; &#7509; &#7510; &#7511; &#7512; &#7513; &#7514; &#7515; &#7516; &#7517; &#7518; &#7519; &#7520; &#7521; &#7522; &#7523; &#7524; &#7525; &#7526; &#7527; &#7528; &#7529; &#7530; &#7531; &#7532; &#7533; &#7534; &#7535; &#7536; &#7537; &#7538; &#7539; &#7540; &#7541; &#7542; &#7543; &#7544; &#7545; &#7546; &#7547; &#7548; &#7549; &#7550; &#7551; &#7552; &#7553; &#7554; &#7555; &#7556; &#7557; &#7558; &#7559; &#7560; &#7561; &#7562; &#7563; &#7564; &#7565; &#7566; &#7567; &#7568; &#7569; &#7570; &#7571; &#7572; &#7573; &#7574; &#7575; &#7576; &#7577; &#7578; &#7579; &#7580; &#7581; &#7582; &#7583; &#7584; &#7585; &#7586; &#7587; &#7588; &#7589; &#7590; &#7591; &#7592; &#7593; &#7594; &#7595; &#7596; &#7597; &#7598; &#7599; &#7600; &#7601; &#7602; &#7603; &#7604; &#7605; &#7606; &#7607; &#7608; &#7609; &#7610; &#7611; &#7612; &#7613; &#7614; &#7615; &#8178; &#8179; &#8180; &#8182; &#8183; &#8184; &#908; &#8186; &#911; &#8188; &#8277; &#8278; &#8279; &#8280; &#8281; &#8282; &#8283; &#8284; &#8226; &#8227; &#8209; &#8210; &#8211; &#8212; &#8213; &#8214; &#8215; &#8216; &#8217; &#8218; &#8219; &#8220; &#8221; &#8222; &#8223; &#8224; &#8225; &#8240; &#8242; &#8243; &#8244; &#8245; &#8246; &#8247; &#8248; &#8249; &#8250; &#8251; &#8252; &#8253; &#8254; &#8255; &#8256; &#8257; &#8258; &#8259; &#8260; &#8261; &#8262; &#8272; &#8273; &#8368; &#8369; &#8370; &#8371; &#8372; &#8373; &#8401; &#8402; &#8403; &#8404; &#8405; &#8406; &#8407; &#8408; &#8409; &#8410; &#8411; &#8412; &#8413; &#8414; &#8415; &#8416; &#8417; &#8418; &#8419; &#8420; &#8421; &#8422; &#8423; &#8424; &#8425; &#8426; &#8304; &#8305; &#8308; &#8309; &#8310; &#8311; &#8312; &#8313; &#8314; &#8315; &#8316; &#8317; &#8318; &#8319; &#8320; &#8321; &#8322; &#8323; &#8324; &#8325; &#8326; &#8327; &#8328; &#8329; &#8330; &#8331; &#8332; &#8333; &#8334; &#8336; &#8337; &#8338; &#8339; &#8340; &#8448; &#8449; &#8450; &#8451; &#8452; &#8453; &#8454; &#8455; &#8456; &#8457; &#8458; &#8459; &#8460; &#8461; &#8462; &#8463; &#8464; &#8465; &#8466; &#8467; &#8468; &#8469; &#8470; &#8471; &#8472; &#8473; &#8474; &#8475; &#8476; &#8477; &#8478; &#8479; &#8480; &#8481; &#8482; &#8483; &#8484; &#8485; &#937; &#8487; &#8488; &#8489; K &#197; &#8492; &#8493; &#8494; &#8495; &#8496; &#8497; &#8498; &#8499; &#8500; &#8531; &#8532; &#8533; &#8534; &#8535; &#8536; &#8537; &#8538; &#8539; &#8540; &#8541; &#8542; &#8543; &#8544; &#8545; &#8546; &#8547; &#8548; &#8549; &#8550; &#8551; &#8552; &#8553; &#8554; &#8555; &#8556; &#8501; &#8502; &#8503; &#8504; &#8505; &#8506; &#8507; &#8508; &#8509; &#8510; &#8511; &#8512; &#8513; &#8514; &#8515; &#8516; &#8517; &#8518; &#8519; &#8520; &#8521; &#8522; &#8523; &#8525; &#8526; &#8557; &#8558; &#8559; &#8560; &#8561; &#8562; &#8563; &#8564; &#8565; &#8566; &#8567; &#8568; &#8569; &#8570; &#8571; &#8572; &#8573; &#8574; &#8575; &#8576; &#8577; &#8578; &#8579; &#8580; &#8592; &#8593; &#8594; &#8595; &#8596; &#8597; &#8598; &#8599; &#8600; &#8601; &#8602; &#8603; &#8604; &#8605; &#8606; &#8607; &#8608; &#8609; &#8610; &#8611; &#8612; &#8613; &#8614; &#8615; &#8616; &#8617; &#8618; &#8619; &#8620; &#8621; &#8622; &#8623; &#8624; &#8625; &#8626; &#8627; &#8628; &#8629; &#8630; &#8631; &#8632; &#8633; &#8634; &#8635; &#8636; &#8637; &#8638; &#8639; &#8640; &#8641; &#8642; &#8643; &#8644; &#8645; &#8646; &#8647; &#8648; &#8649; &#8650; &#8651; &#8652; &#8653; &#8654; &#8655; &#8656; &#8657; &#8658; &#8659; &#8660; &#8661; &#8662; &#8663; &#8664; &#8665; &#8666; &#8667; &#8668; &#8669; &#8670; &#8671; &#8672; &#8673; &#8674; &#8675; &#8676; &#8677; &#8678; &#8679; &#8680; &#8681; &#8682; &#8683; &#8684; &#8685; &#8686; &#8687; &#8688; &#8689; &#8690; &#8691; &#8692; &#8693; &#8694; &#8695; &#8696; &#8697; &#8698; &#8699; &#8700; &#8701; &#8702; &#8703; &#8704; &#8705; &#8706; &#8707; &#8708; &#8709; &#8710; &#8711; &#8712; &#8713; &#8714; &#8715; &#8716; &#8717; &#8718; &#8719; &#8720; &#8721; &#8722; &#8723; &#8724; &#8725; &#8726; &#8727; &#8728; &#8729; &#8730; &#8731; &#8732; &#8733; &#8734; &#8735; &#8736; &#8737; &#8738; &#8739; &#8740; &#8741; &#8742; &#8743; &#8744; &#8745; &#8746; &#8747; &#8748; &#8749; &#8750; &#8751; &#8752; &#8753; &#8754; &#8755; &#8756; &#8757; &#8758; &#8759; &#8760; &#8761; &#8762; &#8763; &#8764; &#8765; &#8766; &#8767; &#8768; &#8769; &#8770; &#8771; &#8772; &#8773; &#8774; &#8775; &#8776; &#8777; &#8778; &#8779; &#8780; &#8781; &#8782; &#8783; &#8784; &#8785; &#8786; &#8787; &#8788; &#8789; &#8790; &#8791; &#8792; &#8793; &#8794; &#8795; &#8796; &#8797; &#8798; &#8799; &#8800; &#8801; &#8802; &#8803; &#8804; &#8805; &#8806; &#8807; &#8808; &#8809; &#8810; &#8811; &#8812; &#8813; &#8814; &#8815; &#8816; &#8817; &#8818; &#8819; &#8820; &#8821; &#8822; &#8823; &#8824; &#8825; &#8826; &#8827; &#8828; &#8829; &#8830; &#8831; &#8832; &#8833; &#8834; &#8835; &#8836; &#8837; &#8838; &#8839; &#8840; &#8841; &#8842; &#8843; &#8844; &#8845; &#8846; &#8847; &#8848; &#8849; &#8850; &#8851; &#8852; &#8853; &#8854; &#8855; &#8856; &#8857; &#8858; &#8859; &#8860; &#8861; &#8862; &#8863; &#8864; &#8865; &#8866; &#8867; &#8868; &#8869; &#8870; &#8871; &#8872; &#8873; &#8874; &#8875; &#8876; &#8877; &#8878; &#8879; &#8880; &#8881; &#8882; &#8883; &#8884; &#8885; &#8886; &#8887; &#8888; &#8889; &#8890; &#8891; &#8892; &#8893; &#8894; &#8895; &#8896; &#8897; &#8898; &#8899; &#8900; &#8901; &#8902; &#8903; &#8904; &#8905; &#8906; &#8907; &#8908; &#8909; &#8910; &#8911; &#8912; &#8913; &#8914; &#8915; &#8916; &#8917; &#8918; &#8919; &#8920; &#8921; &#8922; &#8923; &#8924; &#8925; &#8926; &#8927; &#8928; &#8929; &#8930; &#8931; &#8932; &#8933; &#8934; &#8935; &#8936; &#8937; &#8938; &#8939; &#8940; &#8941; &#8942; &#8943; &#8944; &#8945; &#8946; &#8947; &#8948; &#8949; &#8950; &#8951; &#8952; &#8953; &#8954; &#8955; &#8956; &#8957; &#8958; &#8959; &#8960; &#8961; &#8962; &#8963; &#8964; &#8965; &#8966; &#8967; &#8968; &#8969; &#8970; &#8971; &#8972; &#8973; &#8974; &#8975; &#8976; &#8977; &#8978; &#8979; &#8980; &#8981; &#8982; &#8983; &#8984; &#8985; &#8986; &#8987; &#8988; &#8989; &#8990; &#8991; &#8992; &#8993; &#8994; &#8995; &#8996; &#8997; &#8998; &#8999; &#9166; &#9167; &#9178; &#9179; &#9180; &#9181; &#9066; &#9067; &#9068; &#9069; &#9070; &#9071; &#9072; &#9073; &#9074; &#9075; &#9076; &#9077; &#9078; &#9079; &#9080; &#9081; &#9082; &#9085; &#9088; &#9089; &#9090; &#9091; &#9095; &#9096; &#9097; &#9098; &#9099; &#9108; &#9109; &#9115; &#9116; &#9117; &#9118; &#9119; &#9120; &#9121; &#9122; &#9123; &#9124; &#9125; &#9126; &#9127; &#9128; &#9129; &#9130; &#9131; &#9132; &#9133; &#9134; &#9135; &#9136; &#9137; &#9138; &#9139; &#9140; &#9141; &#9142; &#9143; &#9216; &#9217; &#9218; &#9219; &#9220; &#9221; &#9222; &#9223; &#9224; &#9225; &#9226; &#9227; &#9228; &#9229; &#9230; &#9231; &#9232; &#9233; &#9234; &#9235; &#9182; &#9183; &#9184; &#9187; &#9189; &#9280; &#9281; &#9282; &#9283; &#9284; &#9285; &#9286; &#9287; &#9288; &#9289; &#9236; &#9237; &#9238; &#9239; &#9240; &#9241; &#9242; &#9243; &#9244; &#9245; &#9246; &#9247; &#9248; &#9249; &#9250; &#9251; &#9252;</p>

<p>Same thing in codeblock form:</p>

<pre>   &#9312; &#9313; &#9314; &#9315; &#9316; &#9317; &#9318; &#9319; &#9320; &#9321; &#9322; &#9323; &#9324; &#9325; &#9326; &#9327; &#9328; &#9329; &#9330; &#9331; &#9332; &#9333; &#9334; &#9335; &#9336; &#9337; &#9338; &#9339; &#9340; &#9341; &#9342; &#9343; &#9344; &#9345; &#9346; &#9347; &#9348; &#9349; &#9350; &#9351; &#9352; &#9353; &#9354; &#9355; &#9356; &#9357; &#9358; &#9359; &#9360;
   &#9361; &#9362; &#9363; &#9364; &#9365; &#9366; &#9367; &#9368; &#9369; &#9370; &#9371; &#9372; &#9373; &#9374; &#9375; &#9376; &#9377; &#9378; &#9379; &#9380; &#9381; &#9382; &#9383; &#9384; &#9385; &#9386; &#9387; &#9388; &#9389; &#9390; &#9391; &#9392; &#9393; &#9394; &#9395; &#9396; &#9397; &#9398; &#9399; &#9400; &#9401; &#9402; &#9403; &#9404; &#9405; &#9406; &#9407; &#9408; &#9409;
   &#9410; &#9411; &#9412; &#9413; &#9414; &#9415; &#9416; &#9417; &#9418; &#9419; &#9420; &#9421; &#9422; &#9423; &#9424; &#9425; &#9426; &#9427; &#9428; &#9429; &#9430; &#9431; &#9432; &#9471; &#9472; &#9473; &#9474; &#9475; &#9476; &#9477; &#9478; &#9479; &#9480; &#9481; &#9482; &#9483; &#9484; &#9485; &#9433; &#9434; &#9435; &#9436; &#9437; &#9438; &#9439; &#9440; &#9441; &#9442; &#9443;
   &#9444; &#9445; &#9446; &#9447; &#9448; &#9449; &#9450; &#9451; &#9452; &#9453; &#9454; &#9455; &#9456; &#9457; &#9458; &#9459; &#9460; &#9486; &#9487; &#9488; &#9489; &#9490; &#9491; &#9492; &#9493; &#9494; &#9495; &#9496; &#9497; &#9498; &#9499; &#9500; &#9501; &#9502; &#9503; &#9504; &#9505; &#9506; &#9507; &#9508; &#9509; &#9510; &#9511; &#9512; &#9513; &#9514; &#9515; &#9516; &#9517;
   &#9518; &#9519; &#9520; &#9521; &#9522; &#9523; &#9524; &#9525; &#9526; &#9527; &#9528; &#9529; &#9530; &#9531; &#9532; &#9533; &#9534; &#9535; &#9536; &#9537; &#9538; &#9539; &#9540; &#9541; &#9542; &#9543; &#9544; &#9545; &#9546; &#9547; &#9548; &#9549; &#9550; &#9551; &#9552; &#9553; &#9554; &#9555; &#9556; &#9557; &#9558; &#9559; &#9560; &#9561; &#9562; &#9563; &#9564; &#9565; &#9566;
   &#9567; &#9568; &#9569; &#9570; &#9571; &#9572; &#9573; &#9574; &#9575; &#9576; &#9577; &#9578; &#9579; &#9580; &#9581; &#9582; &#9583; &#9584; &#9585; &#9586; &#9587; &#9588; &#9589; &#9590; &#9591; &#9592; &#9593; &#9594; &#9595; &#9596; &#9597; &#9598; &#9599; &#9600; &#9601; &#9602; &#9603; &#9604; &#9605; &#9606; &#9607; &#9608; &#9609; &#9610; &#9611; &#9612; &#9613; &#9614; &#9615;
   &#9616; &#9617; &#9618; &#9619; &#9620; &#9621; &#9622; &#9623; &#9624; &#9625; &#9626; &#9627; &#9628; &#9629; &#9630; &#9631; &#9632; &#9633; &#9634; &#9635; &#9636; &#9637; &#9638; &#9639; &#9640; &#9641; &#9642; &#9643; &#9644; &#9645; &#9646; &#9647; &#9648; &#9649; &#9650; &#9651; &#9652; &#9653; &#9654; &#9655; &#9656; &#9657; &#9658; &#9659; &#9660; &#9661; &#9662; &#9663; &#9664;
   &#9665; &#9666; &#9667; &#9668; &#9669; &#9670; &#9671; &#9672; &#9673; &#9674; &#9675; &#9676; &#9677; &#9678; &#9679; &#9680; &#9681; &#9682; &#9683; &#9684; &#9685; &#9686; &#9687; &#9688; &#9689; &#9690; &#9691; &#9692; &#9693; &#9694; &#9695; &#9696; &#9697; &#9698; &#9699; &#9700; &#9701; &#9702; &#9703; &#9704; &#9705; &#9706; &#9707; &#9708; &#9709; &#9710; &#9711; &#9712; &#9713;
   &#9714; &#9715; &#9716; &#9717; &#9718; &#9719; &#9720; &#9721; &#9722; &#9723; &#9724; &#9725; &#9726; &#9727; &#9728; &#9729; &#9730; &#9731; &#9732; &#9733; &#9734; &#9735; &#9736; &#9737; &#9738; &#9739; &#9740; &#9741; &#9742; &#9743; &#9744; &#9745; &#9746; &#9747; &#9748; &#9749; &#9750; &#9751; &#9752; &#9753; &#9754; &#9755; &#9756; &#9757; &#9758; &#9759; &#9760; &#9761; &#9762;
   &#9763; &#9764; &#9765; &#9766; &#9767; &#9768; &#9769; &#9770; &#9771; &#9772; &#9773; &#9774; &#9775; &#9776; &#9777; &#9778; &#9779; &#9780; &#9781; &#9782; &#9783; &#9888; &#9889; &#9890; &#9891; &#9892; &#9893; &#9894; &#9895; &#9896; &#9897; &#9898; &#9899; &#9838; &#9839; &#9840; &#9841; &#9842; &#9843; &#9844; &#9845; &#9846; &#9847; &#9848; &#9849; &#9850; &#9851; &#9852; &#9853;
   &#9854; &#9855; &#9856; &#9857; &#9858; &#9859; &#9860; &#9861; &#9862; &#9863; &#9864; &#9865; &#9866; &#9867; &#9868; &#9869; &#9870; &#9871; &#9872; &#9873; &#9874; &#9875; &#9876; &#9877; &#9878; &#9879; &#9880; &#9881; &#9882; &#9883; &#9884; &#9900; &#9901; &#9902; &#9903; &#9904; &#9905; &#9906; &#9907; &#9908; &#9909; &#9910; &#9911; &#9912; &#9985; &#9986; &#9987; &#9988; &#9990;
   &#9991; &#9992; &#9993; &#9996; &#9997; &#9998; &#9999; &#10000; &#10001; &#10002; &#10003; &#10004; &#10005; &#10006; &#10007; &#10008; &#10009; &#10010; &#10011; &#10012; &#10013; &#10014; &#10015; &#10016; &#10017; &#10018; &#10019; &#10020; &#10021; &#10022; &#10023; &#10025; &#10026; &#10027; &#10028; &#10029; &#10030; &#10031; &#10032; &#10033; &#10034; &#10035; &#10036; &#10037; &#10038; &#10039; &#10040; &#10041; &#10042;
   &#10043; &#10044; &#10045; &#10046; &#10047; &#10048; &#10049; &#10050; &#10051; &#10052; &#10053; &#10054; &#10055; &#10056; &#10057; &#10058; &#10059; &#10061; &#10063; &#10064; &#10065; &#10066; &#10070; &#10081; &#10082; &#10083; &#10084; &#10085; &#10086; &#10087; &#10088; &#10089; &#10090; &#10091; &#10092; &#10093; &#10094; &#10095; &#10096; &#10097; &#10098; &#10099; &#10100; &#10101; &#10102; &#10103; &#10104; &#10105; &#10106;
   &#10107; &#10108; &#10109; &#10110; &#10111; &#10112; &#10113; &#10114; &#10115; &#10116; &#10117; &#10118; &#10119; &#10120; &#10072; &#10073; &#10074; &#10075; &#10076; &#10077; &#10078; &#10161; &#10162; &#10163; &#10164; &#10165; &#10166; &#10167; &#10168; &#10136; &#10137; &#10138; &#10139; &#10140; &#10141; &#10142; &#10143; &#10144; &#10145; &#10146; &#10147; &#10148; &#10149; &#10150; &#10151; &#10152; &#10153; &#10154; &#10155;
   &#10156; &#10157; &#10158; &#10159; &#10121; &#10122; &#10123; &#10124; &#10125; &#10126; &#10127; &#10128; &#10129; &#10130; &#10131; &#10132; &#10169; &#10170; &#10171; &#10172; &#10173; &#10174; &#10175; &#10181; &#10182; &#10208; &#10209; &#10214; &#10215; &#10216; &#10217; &#10218; &#10219; &#10224; &#10225; &#10226; &#10227; &#10228; &#10229; &#3424; &#3425; &#5121; &#5122; &#5123; &#5124; &#5125; &#3757; &#3758; &#3759;
   &#3760; &#3761; &#3762; &#3763; &#3764; &#3765; &#3766; &#3767; &#3768; &#3769; &#5126; &#5127; &#5128; &#5129; &#5130; &#5131; &#5132; &#5133; &#5134; &#5135; &#5136; &#5137; &#5138; &#5139; &#5140; &#5141; &#5142; &#5143; &#5144; &#5145; &#5146; &#5147; &#5148; &#5149; &#5150; &#5151; &#5152; &#5153; &#5154; &#5155; &#5156; &#5157; &#5158; &#5159; &#5160; &#5161; &#5162; &#5163; &#5164;
   &#5165; &#5166; &#5167; &#5168; &#5169; &#5170; &#5171; &#5172; &#5173; &#5174; &#5175; &#5176; &#5177; &#5178; &#5179; &#5180; &#5181; &#5182; &#5183; &#5184; &#5185; &#5186; &#5187; &#5188; &#5189; &#5190; &#5191; &#5192; &#5193; &#5194; &#5195; &#5196; &#5197; &#5198; &#5199; &#5200; &#5201; &#5202; &#5203; &#5204; &#5205; &#5206; &#5207; &#5208; &#5209; &#5210; &#5211; &#5212; &#5213;
   &#5214; &#5215; &#5216; &#5217; &#5218; &#5219; &#5220; &#5221; &#5222; &#5223; &#5224; &#5225; &#5226; &#5227; &#5228; &#5229; &#5230; &#5231; &#5232; &#5233; &#5234; &#5235; &#5236; &#5237; &#5238; &#5239; &#5240; &#5241; &#5242; &#5243; &#5244; &#5245; &#5246; &#5247; &#5248; &#5249; &#5250; &#5251; &#5252; &#5253; &#5254; &#5255; &#5256; &#5257; &#5258; &#5259; &#5260; &#5261; &#5262;
   &#5263; &#5264; &#5265; &#5266; &#5267; &#5268; &#5269; &#5270; &#5271; &#5272; &#5273; &#5274; &#5275; &#5276; &#5277; &#5278; &#5279; &#5280; &#5281; &#5282; &#5283; &#5284; &#5285; &#5286; &#5287; &#5288; &#5289; &#5290; &#5291; &#5292; &#5293; &#5294; &#5295; &#5296; &#5297; &#5298; &#5299; &#5300; &#5301; &#5302; &#5303; &#5304; &#5305; &#5306; &#5312; &#5313; &#5314; &#5315; &#5316;
   &#5317; &#5318; &#5319; &#5320; &#5321; &#5322; &#5323; &#5324; &#5325; &#5326; &#5327; &#5328; &#5329; &#5330; &#5331; &#5332; &#5333; &#5334; &#5335; &#5336; &#5337; &#5338; &#5339; &#5340; &#5341; &#5342; &#5343; &#5344; &#5345; &#5346; &#5347; &#5348; &#5349; &#5350; &#5351; &#5352; &#5353; &#5366; &#5367; &#5368; &#5369; &#5370; &#5371; &#5372; &#5373; &#5374; &#5375; &#5376; &#5377;
   &#5378; &#5379; &#5380; &#5381; &#5382; &#5383; &#5392; &#5393; &#5394; &#5395; &#5396; &#5397; &#5398; &#5399; &#5400; &#5401; &#5402; &#5403; &#5404; &#5405; &#5406; &#5407; &#5408; &#5409; &#5410; &#5411; &#5412; &#5413; &#5414; &#5415; &#5416; &#5417; &#5418; &#5419; &#5420; &#5421; &#5422; &#5423; &#5424; &#5425; &#5426; &#5427; &#5428; &#5429; &#5430; &#5431; &#5432; &#5433; &#5434;
   &#5435; &#5436; &#5437; &#5438; &#5458; &#5459; &#5460; &#5461; &#5462; &#5463; &#5464; &#5465; &#5466; &#5467; &#5468; &#5469; &#5470; &#5471; &#5472; &#5473; &#5474; &#5475; &#5476; &#5477; &#5478; &#5479; &#5480; &#5481; &#5482; &#5440; &#5441; &#5442; &#5443; &#5444; &#5445; &#5446; &#5447; &#5448; &#5449; &#5450; &#5451; &#5452; &#5453; &#5454; &#5455; &#5456; &#5514; &#5515; &#5516;
   &#5517; &#5518; &#5519; &#5520; &#5521; &#5522; &#5523; &#5524; &#5525; &#5526; &#5492; &#5493; &#5494; &#5495; &#5496; &#5497; &#5498; &#5499; &#5500; &#5501; &#5502; &#5503; &#5504; &#5505; &#5506; &#5507; &#5508; &#5509; &#5760; &#5761; &#5762; &#5763; &#5764; &#5765; &#5766; &#5767; &#5768; &#5769; &#5770; &#5771; &#5772; &#5773; &#5774; &#5775; &#5776; &#5777; &#5778; &#5779; &#5780;
   &#5742; &#5601; &#5598; &#5540; &#5541; &#5542; &#5543; &#5544; &#5545; &#5546; &#5547; &#5548; &#5549; &#5550; &#5551; &#5536; &#5537; &#5538; &#5539; &#5781; &#5782; &#5783; &#5784; &#5785; &#5786; &#5787; &#5788; &#7424; &#7425; &#7426; &#7427; &#7428; &#7429; &#7430; &#7431; &#7432; &#7433; &#7434; &#7435; &#7436; &#7437; &#7438; &#7439; &#7440; &#7441; &#7442; &#7443; &#7444; &#7445;
   &#7446; &#7447; &#7448; &#7449; &#7450; &#7451; &#7452; &#7453; &#7454; &#7455; &#7456; &#7457; &#7458; &#7459; &#7460; &#7461; &#7462; &#7463; &#7464; &#7465; &#7466; &#7467; &#7468; &#7469; &#7470; &#7471; &#7472; &#7473; &#7474; &#7475; &#7476; &#7477; &#7478; &#7479; &#7480; &#7481; &#7482; &#7483; &#7484; &#7485; &#7486; &#7487; &#7488; &#7489; &#7490; &#7491; &#7492; &#7493; &#7494;
   &#7495; &#7496; &#7497; &#7498; &#7499; &#7500; &#7501; &#7502; &#7503; &#7504; &#7505; &#7506; &#7507; &#7508; &#7509; &#7510; &#7511; &#7512; &#7513; &#7514; &#7515; &#7516; &#7517; &#7518; &#7519; &#7520; &#7521; &#7522; &#7523; &#7524; &#7525; &#7526; &#7527; &#7528; &#7529; &#7530; &#7531; &#7532; &#7533; &#7534; &#7535; &#7536; &#7537; &#7538; &#7539; &#7540; &#7541; &#7542; &#7543;
   &#7544; &#7545; &#7546; &#7547; &#7548; &#7549; &#7550; &#7551; &#7552; &#7553; &#7554; &#7555; &#7556; &#7557; &#7558; &#7559; &#7560; &#7561; &#7562; &#7563; &#7564; &#7565; &#7566; &#7567; &#7568; &#7569; &#7570; &#7571; &#7572; &#7573; &#7574; &#7575; &#7576; &#7577; &#7578; &#7579; &#7580; &#7581; &#7582; &#7583; &#7584; &#7585; &#7586; &#7587; &#7588; &#7589; &#7590; &#7591; &#7592;
   &#7593; &#7594; &#7595; &#7596; &#7597; &#7598; &#7599; &#7600; &#7601; &#7602; &#7603; &#7604; &#7605; &#7606; &#7607; &#7608; &#7609; &#7610; &#7611; &#7612; &#7613; &#7614; &#7615; &#8178; &#8179; &#8180; &#8182; &#8183; &#8184; &#908; &#8186; &#911; &#8188; &#8277; &#8278; &#8279; &#8280; &#8281; &#8282; &#8283; &#8284; &#8226; &#8227; &#8209; &#8210; &#8211; &#8212; &#8213; &#8214;
   &#8215; &#8216; &#8217; &#8218; &#8219; &#8220; &#8221; &#8222; &#8223; &#8224; &#8225; &#8240; &#8242; &#8243; &#8244; &#8245; &#8246; &#8247; &#8248; &#8249; &#8250; &#8251; &#8252; &#8253; &#8254; &#8255; &#8256; &#8257; &#8258; &#8259; &#8260; &#8261; &#8262; &#8272; &#8273; &#8368; &#8369; &#8370; &#8371; &#8372; &#8373; &#8401; &#8402; &#8403; &#8404; &#8405; &#8406; &#8407; &#8408;
   &#8409; &#8410; &#8411; &#8412; &#8413; &#8414; &#8415; &#8416; &#8417; &#8418; &#8419; &#8420; &#8421; &#8422; &#8423; &#8424; &#8425; &#8426; &#8304; &#8305; &#8308; &#8309; &#8310; &#8311; &#8312; &#8313; &#8314; &#8315; &#8316; &#8317; &#8318; &#8319; &#8320; &#8321; &#8322; &#8323; &#8324; &#8325; &#8326; &#8327; &#8328; &#8329; &#8330; &#8331; &#8332; &#8333; &#8334; &#8336; &#8337;
   &#8338; &#8339; &#8340; &#8448; &#8449; &#8450; &#8451; &#8452; &#8453; &#8454; &#8455; &#8456; &#8457; &#8458; &#8459; &#8460; &#8461; &#8462; &#8463; &#8464; &#8465; &#8466; &#8467; &#8468; &#8469; &#8470; &#8471; &#8472; &#8473; &#8474; &#8475; &#8476; &#8477; &#8478; &#8479; &#8480; &#8481; &#8482; &#8483; &#8484; &#8485; &#937; &#8487; &#8488; &#8489; K &#197; &#8492; &#8493;
   &#8494; &#8495; &#8496; &#8497; &#8498; &#8499; &#8500; &#8531; &#8532; &#8533; &#8534; &#8535; &#8536; &#8537; &#8538; &#8539; &#8540; &#8541; &#8542; &#8543; &#8544; &#8545; &#8546; &#8547; &#8548; &#8549; &#8550; &#8551; &#8552; &#8553; &#8554; &#8555; &#8556; &#8501; &#8502; &#8503; &#8504; &#8505; &#8506; &#8507; &#8508; &#8509; &#8510; &#8511; &#8512; &#8513; &#8514; &#8515; &#8516;
   &#8517; &#8518; &#8519; &#8520; &#8521; &#8522; &#8523; &#8525; &#8526; &#8557; &#8558; &#8559; &#8560; &#8561; &#8562; &#8563; &#8564; &#8565; &#8566; &#8567; &#8568; &#8569; &#8570; &#8571; &#8572; &#8573; &#8574; &#8575; &#8576; &#8577; &#8578; &#8579; &#8580; &#8592; &#8593; &#8594; &#8595; &#8596; &#8597; &#8598; &#8599; &#8600; &#8601; &#8602; &#8603; &#8604; &#8605; &#8606; &#8607;
   &#8608; &#8609; &#8610; &#8611; &#8612; &#8613; &#8614; &#8615; &#8616; &#8617; &#8618; &#8619; &#8620; &#8621; &#8622; &#8623; &#8624; &#8625; &#8626; &#8627; &#8628; &#8629; &#8630; &#8631; &#8632; &#8633; &#8634; &#8635; &#8636; &#8637; &#8638; &#8639; &#8640; &#8641; &#8642; &#8643; &#8644; &#8645; &#8646; &#8647; &#8648; &#8649; &#8650; &#8651; &#8652; &#8653; &#8654; &#8655; &#8656;
   &#8657; &#8658; &#8659; &#8660; &#8661; &#8662; &#8663; &#8664; &#8665; &#8666; &#8667; &#8668; &#8669; &#8670; &#8671; &#8672; &#8673; &#8674; &#8675; &#8676; &#8677; &#8678; &#8679; &#8680; &#8681; &#8682; &#8683; &#8684; &#8685; &#8686; &#8687; &#8688; &#8689; &#8690; &#8691; &#8692; &#8693; &#8694; &#8695; &#8696; &#8697; &#8698; &#8699; &#8700; &#8701; &#8702; &#8703; &#8704; &#8705;
   &#8706; &#8707; &#8708; &#8709; &#8710; &#8711; &#8712; &#8713; &#8714; &#8715; &#8716; &#8717; &#8718; &#8719; &#8720; &#8721; &#8722; &#8723; &#8724; &#8725; &#8726; &#8727; &#8728; &#8729; &#8730; &#8731; &#8732; &#8733; &#8734; &#8735; &#8736; &#8737; &#8738; &#8739; &#8740; &#8741; &#8742; &#8743; &#8744; &#8745; &#8746; &#8747; &#8748; &#8749; &#8750; &#8751; &#8752; &#8753; &#8754;
   &#8755; &#8756; &#8757; &#8758; &#8759; &#8760; &#8761; &#8762; &#8763; &#8764; &#8765; &#8766; &#8767; &#8768; &#8769; &#8770; &#8771; &#8772; &#8773; &#8774; &#8775; &#8776; &#8777; &#8778; &#8779; &#8780; &#8781; &#8782; &#8783; &#8784; &#8785; &#8786; &#8787; &#8788; &#8789; &#8790; &#8791; &#8792; &#8793; &#8794; &#8795; &#8796; &#8797; &#8798; &#8799; &#8800; &#8801; &#8802; &#8803;
   &#8804; &#8805; &#8806; &#8807; &#8808; &#8809; &#8810; &#8811; &#8812; &#8813; &#8814; &#8815; &#8816; &#8817; &#8818; &#8819; &#8820; &#8821; &#8822; &#8823; &#8824; &#8825; &#8826; &#8827; &#8828; &#8829; &#8830; &#8831; &#8832; &#8833; &#8834; &#8835; &#8836; &#8837; &#8838; &#8839; &#8840; &#8841; &#8842; &#8843; &#8844; &#8845; &#8846; &#8847; &#8848; &#8849; &#8850; &#8851; &#8852;
   &#8853; &#8854; &#8855; &#8856; &#8857; &#8858; &#8859; &#8860; &#8861; &#8862; &#8863; &#8864; &#8865; &#8866; &#8867; &#8868; &#8869; &#8870; &#8871; &#8872; &#8873; &#8874; &#8875; &#8876; &#8877; &#8878; &#8879; &#8880; &#8881; &#8882; &#8883; &#8884; &#8885; &#8886; &#8887; &#8888; &#8889; &#8890; &#8891; &#8892; &#8893; &#8894; &#8895; &#8896; &#8897; &#8898; &#8899; &#8900; &#8901;
   &#8902; &#8903; &#8904; &#8905; &#8906; &#8907; &#8908; &#8909; &#8910; &#8911; &#8912; &#8913; &#8914; &#8915; &#8916; &#8917; &#8918; &#8919; &#8920; &#8921; &#8922; &#8923; &#8924; &#8925; &#8926; &#8927; &#8928; &#8929; &#8930; &#8931; &#8932; &#8933; &#8934; &#8935; &#8936; &#8937; &#8938; &#8939; &#8940; &#8941; &#8942; &#8943; &#8944; &#8945; &#8946; &#8947; &#8948; &#8949; &#8950;
   &#8951; &#8952; &#8953; &#8954; &#8955; &#8956; &#8957; &#8958; &#8959; &#8960; &#8961; &#8962; &#8963; &#8964; &#8965; &#8966; &#8967; &#8968; &#8969; &#8970; &#8971; &#8972; &#8973; &#8974; &#8975; &#8976; &#8977; &#8978; &#8979; &#8980; &#8981; &#8982; &#8983; &#8984; &#8985; &#8986; &#8987; &#8988; &#8989; &#8990; &#8991; &#8992; &#8993; &#8994; &#8995; &#8996; &#8997; &#8998; &#8999;
   &#9166; &#9167; &#9178; &#9179; &#9180; &#9181; &#9066; &#9067; &#9068; &#9069; &#9070; &#9071; &#9072; &#9073; &#9074; &#9075; &#9076; &#9077; &#9078; &#9079; &#9080; &#9081; &#9082; &#9085; &#9088; &#9089; &#9090; &#9091; &#9095; &#9096; &#9097; &#9098; &#9099; &#9108; &#9109; &#9115; &#9116; &#9117; &#9118; &#9119; &#9120; &#9121; &#9122; &#9123; &#9124; &#9125; &#9126; &#9127; &#9128;
   &#9129; &#9130; &#9131; &#9132; &#9133; &#9134; &#9135; &#9136; &#9137; &#9138; &#9139; &#9140; &#9141; &#9142; &#9143; &#9216; &#9217; &#9218; &#9219; &#9220; &#9221; &#9222; &#9223; &#9224; &#9225; &#9226; &#9227; &#9228; &#9229; &#9230; &#9231; &#9232; &#9233; &#9234; &#9235; &#9182; &#9183; &#9184; &#9187; &#9189; &#9280; &#9281; &#9282; &#9283; &#9284; &#9285; &#9286; &#9287; &#9288;
   &#9289; &#9236; &#9237; &#9238; &#9239; &#9240; &#9241; &#9242; &#9243; &#9244; &#9245; &#9246; &#9247; &#9248; &#9249; &#9250; &#9251; &#9252;</pre>

<h1><a class='u'
name="BULLETS"
>BULLETS</a></h1>

<dl>
<dt><a name="No_Indent_-_Bullet_1"
>No Indent - Bullet 1</a></dt>

<dd>
<dt><a name="No_Indent_-_Bullet_2"
>No Indent - Bullet 2</a></dt>

<dd>
<dt><a name="No_Indent_-_Bullet_3"
>No Indent - Bullet 3</a></dt>
</dl>

<dl>
<dt><a name="Indent_Level_1_-_Bullet_1"
>Indent Level 1 - Bullet 1</a></dt>

<dd>
<dt><a name="Indent_Level_1_-_Bullet_2"
>Indent Level 1 - Bullet 2</a></dt>

<dd>
<dt><a name="Indent_Level_1_-_Bullet_3"
>Indent Level 1 - Bullet 3</a></dt>
</dl>

<dl>
<dt><a name="Indent_Level_2_-_Bullet_1"
>Indent Level 2 - Bullet 1</a></dt>

<dd>
<dt><a name="Indent_Level_2_-_Bullet_2"
>Indent Level 2 - Bullet 2</a></dt>

<dd>
<dt><a name="Indent_Level_2_-_Bullet_3"
>Indent Level 2 - Bullet 3</a></dt>
</dl>

<dl>
<dt><a name="Indent_Level_3_-_Bullet_1"
>Indent Level 3 - Bullet 1</a></dt>

<dd>
<dt><a name="Indent_Level_3_-_Bullet_2"
>Indent Level 3 - Bullet 2</a></dt>

<dd>
<dt><a name="Indent_Level_3_-_Bullet_3"
>Indent Level 3 - Bullet 3</a></dt>
</dl>

<dl>
<dt><a name="Indent_Level_4_-_Bullet_1"
>Indent Level 4 - Bullet 1</a></dt>

<dd>
<dt><a name="Indent_Level_4_-_Bullet_2"
>Indent Level 4 - Bullet 2</a></dt>

<dd>
<dt><a name="Indent_Level_4_-_Bullet_3"
>Indent Level 4 - Bullet 3</a></dt>
</dl>

<dl>
<dt><a name="Nest_Level_1"
>Nest Level 1</a></dt>

<dd>
<dl>
<dt><a name="Nest_Level_2"
>Nest Level 2</a></dt>

<dd>
<dl>
<dt><a name="Nest_Level_3"
>Nest Level 3</a></dt>

<dd>
<dl>
<dt><a name="Nest_Level_4"
>Nest Level 4</a></dt>
</dl>
</dd>
</dl>
</dd>
</dl>
</dd>
</dl>

<dl>
<dt><a 
>One big item line. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</a></dt>

<dd>
<dt><a 
>Single paragraph. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</a></dt>

<dd>
<dt><a 
>Multiple paragraphs. Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.</a></dt>

<dd>
<p>At vero eos et accusamus et iusto odio dignissimos ducimus qui blanditiis praesentium voluptatum deleniti atque corrupti quos dolores et quas molestias excepturi sint occaecati cupiditate non provident, similique sunt in culpa qui officia deserunt mollitia animi, id est laborum et dolorum fuga. Et harum quidem rerum facilis est et expedita distinctio. Nam libero tempore, cum soluta nobis est eligendi optio cumque nihil impedit quo minus id quod maxime placeat facere possimus, omnis voluptas assumenda est, omnis dolor repellendus. Temporibus autem quibusdam et aut officiis debitis aut rerum necessitatibus saepe eveniet ut et voluptates repudiandae sint et molestiae non recusandae. Itaque earum rerum hic tenetur a sapiente delectus, ut aut reiciendis voluptatibus maiores alias consequatur aut perferendis doloribus asperiores repellat.</p>
</dd>
</dl>

<h1><a class='u'
name="Header_One"
>Header One</a></h1>

<p>Text within Header One</p>

<h2><a class='u'
name="Header_Two"
>Header Two</a></h2>

<p>Text within Header Two</p>

<h3><a class='u'
name="Header_Three"
>Header Three</a></h3>

<p>Text within Header Three</p>

<h4><a class='u'
name="Header_Four"
>Header Four</a></h4>

<p>Text within Header Four</p>

<h1><a class='u'
name="AVAILABILITY"
>AVAILABILITY</a></h1>

<p>The project homepage is <a href="https://github.com/SineSwiper/Acme-Web-PodDisplay/wiki" class="podlinkurl"
>https://github.com/SineSwiper/Acme-Web-PodDisplay/wiki</a>.</p>

<p>The latest version of this module is available from the Comprehensive Perl Archive Network (CPAN). Visit <a href="http://www.perl.com/CPAN/" class="podlinkurl"
>http://www.perl.com/CPAN/</a> to find a CPAN site near you, or see <a href="https://metacpan.org/module/Acme::Web::PodDisplay/" class="podlinkurl"
>https://metacpan.org/module/Acme::Web::PodDisplay/</a>.</p>

<h1><a class='u'
name="SUPPORT"
>SUPPORT</a></h1>

<h2><a class='u'
name="Internet_Relay_Chat"
>Internet Relay Chat</a></h2>

<p>You can get live help by using IRC ( Internet Relay Chat ). If you don&#39;t know what IRC is, please read this excellent guide: <a href="http://en.wikipedia.org/wiki/Internet_Relay_Chat" class="podlinkurl"
>http://en.wikipedia.org/wiki/Internet_Relay_Chat</a>. Please be courteous and patient when talking to us, as we might be busy or sleeping! You can join those networks/channels and get help:</p>

<ul>
<li>irc.perl.org
<p>You can connect to the server at &#39;irc.perl.org&#39; and join this channel: #distzilla then talk to this person for help: SineSwiper.</p>
</li>
</ul>

<h2><a class='u'
name="Bugs_/_Feature_Requests"
>Bugs / Feature Requests</a></h2>

<p>Please report any bugs or feature requests via <a href="http://search.cpan.org/perldoc?GitHub" class="podlinkpod"
><a href="https://github.com/SineSwiper/Acme-Web-PodDisplay/issues" class="podlinkurl"
>https://github.com/SineSwiper/Acme-Web-PodDisplay/issues</a></a>.</p>

<h1><a class='u'
name="AUTHOR"
>AUTHOR</a></h1>

<p>Brendan Byrd &#60;BBYRD@CPAN.org&#62;</p>

<h1><a class='u'
name="COPYRIGHT_AND_LICENSE"
>COPYRIGHT AND LICENSE</a></h1>

<p>Brendan Byrd has dedicated the work to the Commons by waiving all of his or her rights to the work worldwide under copyright law and all related or neighboring legal rights he or she had in the work, to the extent allowable by law.</p>

<p>Works under CC0 do not require attribution. When citing the work, you should not imply endorsement by the author.</p>

<!-- end doc -->

</body></html>
