Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: retrieving rpm files from medium "%s"...
ast: obteniendo ficheros rpm dende'l mediu "%s"...
ca: s'estan recuperant els fitxers rpm de la font "%s"...
cs: načítám RPM soubory ze zdroje "%s"...
cy: adfer ffeiliau rpm o gyfrwng [%s]
da: henter rpm-filer fra medie '%s'...
el: ανάκτηση αρχείων rpm από το μέσο "%s"...
es: obteniendo archivos rpm desde el soporte «%s» ...
et: RPM-failide tõmbamine andmekandjalt "%s"...
eu: rpm fitxategiak berreskuratzen "%s" euskarritik...
fi: Noudetaan rpm-paketteja medialta "%s"...
fr: récupération des fichiers rpm à partir de « %s »...
gl: recuperando ficheiros rpm do medio "%s"...
he: מעתיק חבילות תוכנה מהמקור "%s"...
hu: RPM-fájlok behozatala a(z) "%s" adatforrásból...
id: mengambil file rpm dari media "%s"...
is: sæki rpm skrá frá miðli "%s"...
it: recupero i file rpm dal supporto "%s"...
nb: mottar rpm-filer fra mediet %s …
nl: bezig met ontvangen van rpm bestanden van medium "%s"...
nn: Lastar ned rpm-filer frå mediet «%s» ...
pl: pobieranie plików rpm z nośnika "%s"...
pt: a transferir os ficheiros rpm a partir da média "%s"...
pt_br: buscando os arquivos rpm da mídia "%s"...
ro: se preiau fișierele rpm de pe mediul „%s”...
ru: загружаются rpm-файлы из источника «%s»...
sl: prenos datotek rpm iz vira »%s« …
sq: rikuperimi i skedareve rpm nga burimi"%s"...
sv: hämtar RPM-filer från media "%s"...
tr: rpm dosyaları "%s" ortamından alınıyor...

source: [repackaging]
ca: [reempaquetament]
cs: [přebaluje se]
cy: [ailbecynnu]
da: [genpakning]
es: [reempaquetado]
eu: [birpaketatzen]
fi: [uudelleenpaketoidaan]
he: [אורז מחדש]
hu: [újracsomagolás]
id: [pemaketan ulang]
is: [endurpökkun]
it: [rimpacchetto]
nb: [ompakking]
pl: [ponowne tworzenie pakietu]
pt: [re-empacotar]
ro: [reîmpachetare]
sv: [ompaketering]
tr: [tekrar paketleniyor]

source: created transaction for installing on %s (remove=%d, install=%d, upgrade=%d)
ast: transacción criada pa instalar sobro %s (desaniciar=%d, instalar=%d, anovar=%d)
ca: s'ha creat una transacció per instal·lar a %s (elimina=%d, instal·la=%d, actualitza=%d)
cs: vytvořena transakce pro instalaci na %s (odstranění=%d, instalace=%d, aktualizace=%d)
cy: crëwyd trosglwyddiad ar gyfer gosod ar %s (tynnu=%d, gosod=%d, uwchraddio=%d)
da: oprettede transaktion for installering på %s (fjern=%d, installér=%d, opgradér=%d)
el: δημιουργήθηκε transaction για εγκατάσταση στο %s (αφαίρεση=%d, εγκατάσταση=%d, αναβάθμιση=%d)
es: transacción creada para instalar sobre %s (quitar=%d, instalar=%d, actualizar=%d)
et: tehing %s paigaldamiseks loodud (eemaldus=%d, paigaldus=%d, uuendus=%d)
eu: transakzioa sortu da %s(e)n instalatzeko (kendu=%d, instalatu=%d,eguneratu=%d)
fi: Luotiin asennustapahtuma kohteelle %s (poisto=%d, asennus=%d, päivitys=%d)
fr: transaction créée pour l'installation sur %s (remove=%d, install=%d, upgrade=%d)
gl: creouse unha transacción para instalar en %s (eliminar=%d, instalar=%d, actualizar=%d)
he: יצר עסקה עבור התקנה על %s (הסרה=%d, התקנה=%d, עדכון=%d)
hu: a telepítési műveletek elkezdődtek ide: %s (eltávolítás=%d, telepítés=%d, frissítés=%d)
id: membuat transaksi untuk instalasi di %s (hapus=%d, instal=%d, upgrade=%d)
is: bjó til færslu fyrir uppsetningu á %s (fjarlægi=%d, set inn=%d, uppfæri=%d)
it: creata transazione per installare su %s (rimuove=%d, installa=%d, aggiorna=%d)
nb: Opprettet transaksjon for installasjon på %s (fjern=%d, installer=%d, oppgrader=%d)
nl: transactie aangemaakt om te installeren op %s (verwijderen=%d, installeren=%d, vernieuwen=%d)
nn: Laga transaksjon for installering på «%s» (remove: %d – install: %d – upgrade: %d)
pl: utworzono transakcję dla instalacji na %s (usuwanie=%d, instalacja=%d, aktualizacja=%d)
pt: transacção criada para instalar em %s (remover=%d, instalar=%d, actualizar=%d)
pt_br: Criada transação para instalar em %s (remover=%d, instalar=%d, atualizar=%d)
ro: tranzacție creată pentru instalarea pe %s (înlăturate=%d, instalate=%d, actualizate=%d)
ru: создана транзакция для установки на %s (remove=%d, install=%d, upgrade=%d)
sl: določeno je bilo opravilo za nameščanje na %s (odstrani=%d, namesti=%d, nadgradi=%d)
sq: krijimi i një akcioni transmetues për një instalim në %s (remove=%d, install=%d, upgrade=%d)
sv: skapade transaktion för installation på %s (ta bort=%d, installera=%d, uppdatera=%d)
tr: %s üzerine yükleme için işlem yaratıldı (sil=%d, yükle=%d, güncelle=%d)

source: unable to create transaction
ast: nun puede criase transacción
ca: no s'ha pogut crear la transacció
cs: nelze vytvořit transakci
cy: methu creu trosglwyddiad.
da: kan ikke oprette transaktion
el: Αδυναμία δημιουργίας transaction
es: no se puede crear transacción
et: tehingu loomine nurjus
eu: ezin da transakziorik sortu
fi: Tapahtumaa ei voitu luoda
fr: impossible de créer la transaction
gl: non se puido crear a transacción
he: בלתי אפשרי לעשות עסקה
hu: egy művelet elvégzése nem sikerült
id: gagal membuat transaksi
is: Gat ekki búið til færslu
it: impossibile creare la transazione
nb: klarte ikke å opprette transaksjon.
nl: Niet in staat om transactie aan te maken.
nn: Klarte ikkje laga transaksjon.
pl: nie można utworzyć transakcji
pt: não é possível criar a transacção
pt_br: incapaz de criar a transação
ro: nu se poate crea tranzacția
ru: не удаётся создать транзакцию
sl: opravila ni mogoče izvesti
sq: i pa mundur krijimi i një akcioni transmetues
sv: kunde inte skapa transaktion
tr: işlem oluşturulamıyor

source: unable to extract rpm from delta-rpm package %s
ast: nun puede estraeyese'l rpm del paquete delta-rpm %s
cs: nelze extrahovat RPM z delta-rpm balíčku %s
cy: methu tynnu rpm o becyn delta-rpm %s
da: kan ikke udpakke rpm fra delta-rpm pakke %s
el: αδυναμία εξαγωγής rpm από το πακέτο delta-rpm %s
es: no se puede extraer el rpm del paquete delta-rpm %s
et: RPM-i ekstraktimine delta-rpm-paketist %s nurjus
eu: ezin da rpm atera %s delta-rpm paketetik
fi: Paketin %s purkaminen Delta-RPM-paketista ei onnistu
fr: impossible d'extraire le rpm du paquetage delta-rpm %s
gl: non foi posible extraer o rpm dende o paquete delta-rpm %s
he: אין אפשרות לחלץ rpm מתוך חבילת delta-rpm ששמה %s
hu: nem sikerült kimásolni az RPM-csomagot a(z) "%s" delta-rpm csomagból
id: tidak bisa mengurai rpm dari paket delta-rpm %s
is: gat ekki dregið rpm úr breytinga-rpm pakka %s
it: impossibile estrarre un rpm dal pacchetto delta-rpm %s
nb: klarte ikke pakke ut rpm fra delta-rpm %s
nl: kan rpm niet uit delta-rpm-pakket %s uitpakken
nn: Klarte ikkje henta ut rpm frå delta-rpm-pakken «%s».
pl: nie można wypakować pakietu rpm z pakietu delta-rpm %s
pt: não é possível extrair o rpm do pacote delta-rpm %s
pt_br: incapaz de extrair rpm do pacote delta-rpm %s
ro: nu se poate extrage fișierul rpm din pachetul delta-rpm %s
ru: не удаётся извлечь rpm-файл из пакета delta-rpm %s
sl: razširitev paketa rpm iz paketa delta-rpm %s ni možna
sq: i paaftë për nxjerrjen e rpm nga paketa delta-rpm %s
sv: kan inte extrahera rpm från delta-rpm paket %s
tr: rpm, %s delta-rpm paketinden çıkartılamıyor

source: unable to install package %s
ast: nun puede instalase'l paquete %s
ca: no s'ha pogut instal·lar el paquet %s
cs: nelze nainstalovat balíček %s
cy: methu gosod pecyn %s
da: kunne ikke installere pakke %s
el: αδυναμία εγκατάστασης του πακέτου %s
es: no se puede instalar el paquete %s
et: paketi %s paigaldamine nurjus
eu: ezin da %s paketea instalatu
fi: Pakettia %s ei voitu asentaa
fr: impossible d'installer le paquetage %s
gl: non foi posible instalar o paquete %s
he: התקנת החבילה %s נכשלה
hu: a(z) "%s" csomag telepítése sikertelen
id: gagal menginstal paket %s
is: get ekki sett inn pakka %s
it: impossibile installare il pacchetto %s
nb: klarte ikke installere pakke %s
nl: kon volgend pakket niet installeren: %s
nn: Klarte ikkje installera pakken «%s»
pl: nie można zainstalować pakietu %s
pt: não é possível instalar o pacote %s
pt_br: incapaz de instalar o pacote %s
ro: nu se poate instala pachetul %s
ru: не удаётся установить пакет %s
sl: namestitev paketa %s ni možna
sq: i pa mundur instalimi i pakos %s
sv: kan inte installera paket %s
tr: %s paketi kurulamıyor

source: removing bad rpm (%s) from %s
ast: desaniciando rpm nun válidu (%s) dende %s
ca: s'està eliminant el paquet rpm dolent (%s) de %s
cs: odstraňují se vadné RPM balíčky (%s) z %s
cy: tynnu rpm gwallus (%s) o %s
da: fjerner dårlig rpm-pakke (%s) fra %s
el: αφαίρεση του κακοδιατυπομένου rpm (%s) από το %s
es: quitando rpm no válido (%s) desde %s
et: vigase RPM-faili (%s) eemaldamine %s-st
eu: (%s) rpm okerra %s-tik ezabatzen
fi: Poistetaan viallinen paketti (%s) kansiosta %s
fr: suppression des paquetages bogués (%s) de %s
he: מסיר חבילה תקולה (%s) מתוך %s
hu: hibás RPM-csomagok (%s) eltávolítása innen: %s
is: fjarlægi gallað rpm (%s) frá %s
it: Rimozione degli rpm difettosi (%s) da %s
nb: fjerner dårlig rpm (%s) fra %s
nl: verwijderen van onjuiste rpm (%s) uit %s
nn: Fjernar ugyldig rpm-pakke (%s) frå «%s».
pl: usuwanie niepoprawnego pakietu rpm (%s) z %s
pt: a remover rpm danificado (%s) de %s
pt_br: removendo rpm ruim (%s) de %s
ro: se înlătură pachetul deteriorat (%s) din %s
ru: удаляются неверные rpm-файлы (%s) из %s
sl: odstranjevanje paketa rpm z napako (%s) iz %s
sq: heqje e rpm së keqe (%s) nga %s
sv: tar bort felaktig rpm (%s) från %s
tr: hatalı rpm (%s), %s kaynağından kaldırılıyor

source: removing %s failed: %s
ast: falló desaniciu de %s: %s
ca: la supressió de %s ha fallat: %s
cs: odstranění %s selhalo: %s
cy: tynnu %s methodd: %s
da: fjernelse af %s mislykkedes: %s
el: η αφαίρεση του %s απέτυχε: %s
es: falló la eliminación de %s: %s
et: %s eemaldamine nurjus: %s
eu: %s ezabatzeak huts egin du: %s
fi: Paketin %s poistaminen epäonnistui: %s
fr: la suppression de %s a échouée : %s
gl: fallo ó eliminar %s: %s
he: הסרת %s נכשלה: %s
hu: %s eltávolítása sikertelen: %s
is: mistókst að fjarlægja %s: %s
it: rimozione di %s non riuscita: %s
nb: fjerning av %s mislyktes: %s
nl: verwijderen van %s mislukt: %s
nn: Klarte ikkje fjerna %s: %s
pl: usuwanie %s nie powiodło się: %s
pt: falha ao remover %s: %s
pt_br: removendo %s com falha: %s
ro: înlăturarea lui %s a eșuat: %s
ru: не удалось удалить %s: %s
sl: odstranjevanje %s je spodletelo: %s
sq: heqja %s dështoj: %s
sv: borttagning av %s misslyckades: %s
tr: %s 'in kaldırılması başarısız oldu: %s

source: Removing package %s
ca: S'està eliminant el paquet %s
cs: Odstraňuje se balíček %s
cy: Tynnu pecyn %s.
da: Fjerner pakke %s
es: Quitando paquete %s
eu: %s paketea ezabatzen
fi: Poistetaan paketti %s
gl: Eliminando o paquete %s
he: מסיר חבילה %s
hu: A(z) %s csomag eltávolítása folyik
is: Fjarlægi pakka %s
it: Rimozione del pacchetto %s
nb: Fjerner pakke %s
pl: Usuwanie pakietu %s
pt: A remover o pacote %s
ro: Se înlătură pachetul %s
sv: Tar bort paket %s
tr: %s paketi kaldırılıyor

source: removing package %s
ast: desaniciando paquete %s
ca: s'està eliminant el paquet %s
cs: odstraňuje se balíček %s
cy: tynnu pecyn %s.
da: fjerner pakke %s
el: αφαίρεση του πακέτου %s
es: quitando paquete %s
et: paketi %s eemaldamine
eu: %s paketea kentzen
fi: Poistetaan paketti %s
fr: désinstallation du paquetage %s
gl: eliminando o paquete %s
he: מסיר חבילה %s
hu: a(z) %s csomag eltávolítása folyik
id: menghapus paket %s
is: fjarlægi pakka %s
it: rimozione del pacchetto %s
nb: fjerner pakke %s
nl: bezig met verwijderen van pakket %s
nn: Fjernar pakken «%s».
pl: usuwanie pakietu %s
pt: a remover o pacote %s
pt_br: removendo pacote %s
ro: se înlătură pachetul %s
ru: удаляется пакет %s
sl: odstranjevanje paketa %s
sq: heqje paketës %s
sv: tar bort paket %s
tr: %s paketi kaldırılıyor

source: removing installed rpms (%s) from %s
ast: desaniciando rpms instalaos (%s) dende %s
ca: s'estan eliminant els paquets rpms instal·lats (%s) de %s
cs: odstraňují se nainstalované RPM balíčky (%s) z %s
cy: tynnu rpm wedi eu gosod (%s) o %s
da: fjerner installerede pakker (%s) fra %s
el: αφαίρεση των εγκατεστημένων rpm (%s) από το %s
es: quitando rpms instalados (%s) desde %s
et: paigaldatud RPM-failide (%s) eemaldamine asukohast %s
eu: %2$s-n instalatutako rpm-ak (%1$s) ezabatzen
fi: Poistetaan asennetut paketit (%s) kansiosta %s
fr: suppression des paquetages installés (%s) de %s
he: מסיר חבילות מותקנות (%s) מתוך %s
hu: a telepített RPM-csomagok (%s) eltávolítása innen: %s
id: menghapus rpm yang terinstall (%s) dari %s
is: fjarlægi uppsett rpm (%s) frá %s
it: rimozione degli rpm installati (%s) da %s
nb: fjerner installerte pakker (%s) fra %s
nl: geïnstalleerde rpms (%s) worden verwijderd uit %s
nn: Fjernar installerte rpm-pakkar (%s) frå «%s».
pl: usuwanie zainstalowanych pakietów rpm (%s) z %s
pt: a remover os rpms instalados (%s) de %s
pt_br: removendo rpms instalados (%s) de %s
ro: se înlătură pachetele instalate (%s) din %s
ru: удаляются установленные rpm-файлы (%s) из %s
sl: odstranjevanje nameščenega rpm (%s) iz %s
sq: heqja e rpms së instaluar (%s) nga %s
sv: tar bort installerade rpms (%s) från %s
tr: kurulu rpm'ler (%s), %s kaynağından kaldırılıyor

source: More information on package %s
ast: Más información sobro'l paquete %s
ca: Més informació sobre el paquet %s
cs: Více informací o balíčku %s
cy: Rhagor o wybodaeth ar becyn %s
da: Mere information om pakke %s
el: Περισσότερες πληροφορίες στο πακέτο %s
es: Más información sobre el paquete %s
et: Rohkem infot paketi %s kohta
eu: Informazio gehiago %s paketeari buruz
fi: Lisätietoja paketista %s
fr: Plus d'information sur le paquetage %s
gl: Máis información no paquete %s
he: מידע נוסף על החבילה %s
hu: További információ a(z) %s csomagról
id: Informasi tambahan pada paket %s
is: Meiri upplýsingar um pakka %s
it: Più informazioni sul pacchetto %s
nb: Mer informasjon om pakka %s
nl: Meer informatie over pakket %s
nn: Meir informasjon om pakken «%s»
pl: Więcej informacji o pakiecie %s
pt: Mais informação do pacote %s
pt_br: Mais informações no pacote %s
ro: Informații suplimentare despre pachetul %s
ru: Дополнительная информация о пакете %s
sl: Več podatkov o paketu %s
sq: Më shumë informacion mbi paketën %s
sv: Mer information om paket %s
tr: %s paketi hakkında daha fazla bilgi...

source: Cannot create ldap cache directory
ast: Nun puede criase'l direutoriu caché de LDAP
ca: No s'ha pogut crear el directori cau de ldap
cs: Nelze vytvořit adresář vyrovnávací paměti LDAP
cy: Methu creu cyfeiriadur storfa Idap
da: Kan ikke lave ldap-mellemlagerkatalog.
el: Αδυναμία δημιουργίας του καταλόγου ldap cache
es: No se puede crear el directorio caché de LDAP
et: LDAP puhvri kataloogi loomine nurjus
eu: Ezin da ldap katxe direktorioa sortu
fi: LDAP-välimuistikansiota ei voitu luoda
fr: Impossible de créer le cache de l'annuaire ldap
gl: Non se puido crear o directorio de caché de ldap
he: לא ניתן ליצור ספריית מטמון ל-ldap
hu: Nem sikerült létrehozni az LDAP gyorstár-könyvtárát
id: Tidak bisa membuat direktori cache ldap
is: Get ekki skrifað í LDAP biðmöppu
it: Impossibile creare la directory cache per ldap
nb: Kan ikke lage mellomlagermappe for LDAP
nl: Kan ldap-buffermap niet aanmaken
nn: Kan ikkje laga ldap-mellomlagermappe.
pl: Utworzenie katalogu pamięci podręcznej dla ldap było niemożliwe
pt: Não é possível criar o directório de caixa ldap
pt_br: Não foi possível diretório cache do ldap
ro: Nu se poate crea directorul LDAP de pretampon
ru: Не удаётся создать каталог для кэширования ldap
sl: Ustvarjanje predpomnilniške mape za LDAP ni možno
sq: Nuk mund të krijohen skedarë historie ldap
sv: Kan inte skapa ldap cache katalog
tr: ldap geçici dizini oluşturulamıyor

source: Cannot write cache file for ldap
ast: Nun puede escribise'l ficheru caché pa ldap
ca: No s'ha pogut escriure el fitxer cau per a ldap
cs: Nelze zapsat soubor s vyrovnávací pamětí pro LDAP
cy: Methu ysgrifennu ffeil storfa ar gyfer Idap
da: Kan ikke skrive mellemlagerfil for ldap.
el: Αδυναμία εγγραφής του αρχείου προσωρινής μνήμης για το ldap
es: No se puede escribir el archivo caché para LDAP
et: LDAP-i puhvrifaili kirjutamine nurjus
eu: Ezin da ldap-entzako katxe fitxategia idatzi
fi: LDAP-välimuistitiedostoa ei voitu kirjoittaa
fr: Impossible d'écrire le fichier de cache pour ldap
gl: Non se puido escribir o ficheiro de caché para ldap
he: לא ניתן לכתוב קובץ מטמון עבור ldap
hu: Nem sikerült írni az LDAP gyorstár-fájlját
id: Tidak bisa menulis file cache untuk ldap
is: Get ekki skrifað bið-skrá fyrir LDAP
it: Impossibile scrivere il file cache per ldap
nb: Kan ikke skrive mellomlagerfil for LDAP
nl: Kan bufferbestand voor ldap niet schrijven
nn: Kan ikkje skriva mellomlagerfil for ldap.
pl: Zapisanie pliku bufora dla ldap było niemożliwe
pt: Não é possível escrever o ficheiro de caixa para ldap
pt_br: Não foi possível escrever arquivo de cache do ldap
ro: Nu se poate scrie fișierul pretampon pentru LDAP
ru: Не удаётся записать файл кэша для ldap
sl: zapisovanje predpomnilniške datoteke za LDAP ni možno
sq: Nuk mund të shkruaj skedarë historie për ldap
sv: Kan inte skriva cache fil för ldap
tr: ldap geçici dosyasına yazılamıyor

source: No server defined, missing uri or host
ast: Nun definío'l sirvidor, falta la uri o l'agospiador
cs: Není definován žádný server, chybí URI nebo počítač
cy: Heb ddiffinio gweinydd, uri neu westeiwr coll
da: Ingen server defineret. Mangler adresse eller værtsnavn.
el: Δεν προσδιορίστηκε εξυπηρετητής, δεν βρέθηκε το uri ή ο υπολογιστής
es: No se definió servidor, falta la URI o el host
et: Serverit pole määratud, URI või masin puudub
eu: Ez da zerbitzaririk zehaztu, uri edo ostalaria falta da
fi: Palvelinta ei ole asetettu tai verkko-osoite puuttuu
fr: Aucun serveur défini : uri ou hôte manquant
gl: Servidor non definido, falta o uri ou a máquina
he: לא הוגדר שרת, חסר URI או מארח
hu: Nincs megadva kiszolgáló - hiányzó URI vagy gépnév
id: Tidak ada server yang didefinisikan, uri atau host yang tidak ada
is: Engin miðlari skráður, vantar slóð eða miðlara
it: Nessun server definito. Manca l'uri o l'host
nb: Ingen tjener angitt, mangler adresse eller vertnavn
nl: Geen server gedefinieerd, uri of hostcomputer ontbreekt
nn: Ingen tenar definert. Manglar adresse eller vertsnamn.
pl: Nie zdefiniowano serwera, brak URI lub hosta
pt: Nenhum servidor definido, falta o url ou endereço
pt_br: Nenhum servidor definido, uri ou host não informados
ro: Server nedefinit, lipsește URI sau gazda
ru: Сервер не определён; отсутствует URI или хост
sl: Strežnik ni naveden, manjka URI ali pa gostitelj
sq: Asnjë server nuk përcaktohet, mungon uri ose host
sv: Ingen server definierad, uri eller host saknas
tr: Sunucu tanımlanmamış, uri veya makine bulunamıyor

source: No base defined
ast: Base nun definida
ca: No hi ha cap base definida
cs: Nebyl zadán žádný základ
cy: Sail heb ei ddiffinio
da: Ingen base angivet
el: Δεν ορίστηκε βάση
es: No se definió base
et: Baas pole määratud
eu: Ez da oinarria definitu
fi: Juurta ei ole määritelty
fr: Pas de base spécifiée
he: לא הוגדר בסיס
hu: Nincs megadva alap
id: Tidak ada dasar yang ditentukan
is: Enginn grunnur tilgreindur
it: Nessuna base specificata
nb: Ingen grunnadresse angitt
nl: Geen basis gedefinieerd
nn: Inga grunnadresse definert.
pl: Nie zdefiniowano podstawy
pt: Nenhuma base definida
pt_br: Base não definida
ro: Bază nedefinită
ru: База не определена
sl: Izhodišče ni navedeno
sq: Asnjë bazë e përcaktuar
sv: Ingen bas definierad
tr: Komut belirtmemişsiniz

source: Cannot connect to ldap uri:
ast: Nun puede coneutase a la uri ldap:
ca: No s'ha pogut connectar amb la uri de ldap:
cs: Nelze se připojit k URI LDAP:
cy: Methu cysylltu æg uri ldap:
da: Kan ikke opkoble til LDAP-adresse:
el: Αδυναμία σύνδεσης στο ldap uri:
es: No se puede conectar a la URI LDAP:
et: Ühendus LDAP URI-ga nurjus:
eu: Ezin da ldap uri-ra konektatu:
fi: Ei saada yhteyttä LDAP-osoitteeseen:
fr: Impossible de se connecter à l'uri ldap :
gl: Non se puido conectar ó uri de ldap:
he: לא ניתן להתחבר אל ה-URI של ldap:
hu: Nem lehet kapcsolódni az LDAP-URI-hoz:
id: Tidak dapat terhubung ke url ldap :
is: Get ekki tengst LDAP slóð :
it: Impossibile connettersi all'uri ldap:
nb: Kan ikke koble til LDAP-adresse:
nl: Kan geen verbinding maken ldap-uri:
nn: Kan ikkje kopla til LDAP-adresse:
pl: Połączenie z Uri ldap było niemożliwe:
pt: Não é possível conectar ao url ldap:
pt_br: Não foi possível conectar-se à uri ldap:
ro: Conectare imposibilă la URI LDAP:
ru: Не удаётся подключиться к ldap по URI:
sl: Ni se možno povezati z LDAP URI-jem:
sq: Nuk mund të lidhet me ldap uri:
sv: Kan inte ansluta till ldap uri:
tr: ldap uri bağlanılamıyor:

source: %s database is locked, process %d is already using it
ast: la base de datos %s ta bloqueada, procesu %d ta usándola
cs: Databáze %s je zamčená, už ji používá jiný proces %d
da: %s-database er låst, proces %d bruger den allerede
el: η βάση δεδομένων %s είναι κλειδωμένη, χρησιμοποιείται από την διεργασία %d.
es: la base de datos %s está bloqueada, el proceso %d la está utilizando)
et: %s andmebaas on lukus, seda kasutab juba protsess %d
eu: %s datubasea giltzatuta dago, %d prozesua hura erabiltzen ari da
fi: %s-tietokanta on lukittu, prosessi %d käyttää sitä
fr: la base de donnée %s est verrouillée, le programme %d l'utilise
hu: az %s adatbázis zárolt, a(z) %d folyamat már használja
it: Il database %s è bloccato, il processo %d lo sta usando
nb: %s-databasen er låst, den brukes allerede av prosessen %d
nl: %s-database is gesloten, proces %d gebruikt het al
nn: %s-databasen er låst (prosess %d brukar han).
pl: %s baza danych zablokowana, proces %d właśnie jej używa
pt: base de dados %s trancada, o processo %d já a está a usar
pt_br: a database %s está trancada porque o processo %d já está usando ela
ro: Baza de date %s este blocată, este utilizată de procesul %d
ru: %s база заблокирована, ее уже использует процесс %d
sl: Podatkovna zbirka %s je zaklenjena, uporablja jo že opravilo %d
sq: %s baza e të dhënave është kyçur, një procesi %d tashmë po e përdor
sv: %s databas är låst, processen %d använder den redan
tr: %s veritabanı kilitli. %d işlemi onu kullanıyor.

source: %s database is locked (another program is already using it)
ast: la base de datos %s ta bloquiada (ta siendo usada por otru programa)
cs: Databáze %s je zamčená (už ji používá jiný program)
cy: Mae cronfa ddata %s wedi ei chloi (mae rhaglen arall yn ei defnyddio)
da: %s-database er låst (et andet program bruger den allerede)
el: η βάση δεδομένων %s είναι κλειδωμένη (ένα άλλο πρόγραμμα τη χρησιμοποιεί ήδη)
es: la base de datos %s está bloqueada (está siendo usada por otro programa)
et: %s andmebaas on lukus (seda kasutab teine programm)
eu: %s datubasea giltzatuta dago (beste programa bat hura erabiltzen ari da)
fi: %s-tietokanta on lukittu (toisen prosessin käytössä)
fr: la base de donnée %s est verrouillée (un autre programme l'utilise)
gl: A base de datos de %s está bloqueada (xa a está usando outro programa)
hu: a(z) %s adatbázis zárolt (másik program már használja)
is: %s gagnagrunnur læstur (annað forrit er þegar að nota hann)
it: Il database %s è bloccato (un altro programma lo sta usando)
nb: databasen %s er låst (et annet program bruker den)
nl: %s-database is gesloten (een ander programma gebruikt hem al)
nn: %s-databasen er låst (det kan vera eit anna program brukar han).
pl: %s baza danych zablokowana (jest używana przez inny program)
pt: base de dados %s trancada (já está a ser usada por outra aplicação)
pt_br: base de dados %s está bloqueada (sendo usada por outro programa)
ro: Baza de date %s este blocată (un alt program o utilizează deja)
ru: %s база заблокирована (возможно ее использует другая программа)
sl: Podatkovna zbirka %s je zaklenjena (uporablja jo že nek drug program)
sq: %s Baza e të dhënave është e mbyllur (një program tjetër tashmë është duke e përdorur)
sv: %s databas är låst (ett annat program använder den redan)
tr: %s veritabanı kilitli.(bir başka yazılım onu kullanıyor)
