Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: adding medium "%s" before remote medium "%s"
ast: amestando'l mediu "%s" enantes del remotu "%s"
cs: přidávám zdroj "%s" před vzdálený zdroj "%s"
cy: ychwanegu cyfrwng "%s", cyn cyfrwng pell "%s"
da: Tilføjer medie '%s' før det eksterne medie '%s'.
el: προσθήκη του μέσου «%s» πριν από το απομακρυσμένο μέσο «%s»
es: añadiendo soporte «%s» antes del soporte remoto «%s»
et: andmekandja "%s" lisamine enne võrguandmekandjat "%s"
eu: "%s" euskarria "%s" urruneko euskarriaren aurretik eransten
fi: Lisätään media "%s" etämedian "%s" eteen
fr: ajout du média « %s » avant le média distant « %s »
gl: engadindo o soporte "%s" antes do soporte remoto "%s"
he: מוסיף את המקור "%s" לפני המקור המרוחק "%s"
hu: "%s" adatforrás hozzáadása a(z) "%s" távoli adatforrás előtt
id: menambahkan media "%s" sebelum media remote "%s"
is: bæti við miðli "%s" á undan fjartengdum miðli "%s"
it: viene aggiunto il supporto "%s" prima del supporto remoto "%s"
nb: legger til «%s» før det eksterne mediet «%s»
nl: toevoegen medium "%s" voor medium op afstand "%s"
nn: Legg til mediet «%s» før fjernmediet «%s».
pl: dodawanie nośnika %s przed zdalnym nośnikiem %s
pt: a adicionar média "%s" antes da média remota "%s"
pt_br: adicionando mídia "%s" antes da mídia remota "%s"
ro: se adaugă mediul „%s” înaintea mediului distant „%s”
ru: добавляется источник «%s» (перед удалённым источником «%s»)
sl: dodajanje vira »%s« pred oddaljen vir »%s«
sv: lägger till media "%s" före fjärrmedia "%s"
tr: "%s" ortamı, "%s" uzak kaynağından önce ekleniyor

source: adding medium "%s"
ast: amestando'l mediu "%s"
ca: s'està afegint el suport "%s"
cs: přidávám zdroj "%s"
cy: ychwanegu cyfrwng "%s"
da: tilføjer medie "%s"
el: προσθήκη του μέσου «%s»
es: añadiendo soporte «%s»
et: andmekandja "%s" lisamine
eu: "%s" euskarria eransten
fi: Lisätään media "%s"
fr: ajout du média « %s »
gl: engadindo o soporte "%s"
he: מוסיף את המקור "%s"
hu: "%s" adatforrás hozzáadása
id: menambahkan media "%s"
is: bæti við miðli "%s"
it: viene aggiunto il supporto "%s"
nb: legger til mediet «%s»
nl: toevoegen van medium "%s"
nn: Legg til mediet «%s».
pl: dodawanie nośnika %s
pt: a adicionar média "%s"
pt_br: adicionando a mídia "%s"
ro: se adaugă mediul „%s”
ru: добавляется источник «%s»
sl: dodajanje vira »%s«
sq: shtim medium "%s"
sv: lägger till media "%s"
tr: "%s" ortamı ekleniyor.

source: failed to copy media.cfg to %s (%d)
ast: falló la copia media.cfg pa %s (%d)
cs: selhalo kopírování media.cfg na %s (%d)
cy: methu copïo media.cfg i %s (%d)
da: kinne ikke kopiere media.cfg til %s (%d)
el: απέτυχε η αντιγραφή του media.cfg στο %s (%d)
es: falló la copia de media.cfg para %s (%d)
et: media.cfg kopeerimine asukohta %s (%d) nurjus
eu: media.cfg %s-ra kopiatzeak huts egin du (%d)
fi: Media.cfg:n kopiointi epäonnistui kohteeseen %s (%d)
fr: échec de la copie de media.cfg vers %s (%d)
hu: hiba a media.cfg %s könyvtárba másolásakor (%d)
it: Errore copiando il file media.cfg in %s (%d)
nb: kopiering av media.cfg til %s (%d) feilet
nl: kopie van media.cfg naar %s (%d) is mislukt
nn: Klarte ikkje kopiera «media.cfg» til %s (%d).
pl: nie powiodło się kopiowanie pliku media.cfg do %s (%d)
pt: falha ao copiar média.cfg para %s (%d)
pt_br: falhou ao copiar media.cfg para %s (%d)
ro: copierea lui media.cfg pe %s (%d) a eșuat
ru: сбой при копировании media.cfg в %s (%d)
sl: kopiranje datoteke media.cfg v %s (%d) ni uspelo
sq: dështoj për të kopjuar media.cfg në %s (%d)
sv: misslyckades kopiera media.cfg till %s (%d)
tr: media.cfg, %s (%d) üzerine kopyalanamıyor.

source: directory %s does not exist
ast: el direutoriu %s nun esiste
ca: el directori %s no existeix
cs: adresář %s neexistuje
cy: nid yw cyfeiriadur %s yn bodoli
da: katalog %s eksisterer ikke
el: ο κατάλογος %s δεν υπάρχει
es: el directorio %s no existe
et: kataloogi %s ei ole olemas
eu: %s direktorioa ez da existitzen
fi: Kansiota %s ei ole olemassa
fr: le répertoire %s n'existe pas
gl: o directorio %s non existe
he: הספריה %s אינה קיימת
hu: %s könyvtár nem létezik
is: mappan %s er ekki til
it: La directory %s non esiste
nb: mappa %s finnes ikke
nl: map %s bestaat niet
nn: Mappa «%s» finst ikkje.
pl: katalog %s nie istnieje
pt: o directório %s não existe
pt_br: diretório %s não existe
ro: directorul %s nu există
ru: Каталог %s не существует
sl: Mapa %s ne obstaja
sq: dosja %s nuk ekziston
sv: sökväg %s existerar inte
tr: %s dizini mevcut değil

source: this location doesn't seem to contain any distribution
ast: esti allugamientu nun paez caltener una distribución
cs: toto umístění zdá se neobsahuje žádnou distribuci
cy: nid yw'r lleoliad i weld yn cynnwys unrhyw ddosbarthiad
da: denne adresse ser ikke ud til at indeholde nogen distribution
el: αυτή η τοποθεσία δεν φαίνεται να περιέχει καμία διανομή
es: esta ubicación no parece contener una distribución
et: see asukoht ei paista sisaldavat ühtegi distributsiooni
eu: kokapen honek ez dirudi banaketarik daukanik
fi: Sijainti ei vaikuta sisältävän jakelua
fr: cet emplacement ne semble pas contenir de distribution
gl: parece que esta localización non contén ningunha distribución
hu: úgy tűnik, ez a hely nem tartalmaz disztribúciót
id: lokasi ini tampaknya tidak mengandung sembarang distribusi
is: þessi staðsetning virðist ekki innihalda neina dreifingu
it: questo indirizzo non sembra contenere alcuna distribuzione
nb: denne adressen ser ikke ut til å inneholde en distribusjon
nl: deze locatie lijkt geen distributie te bevatten
nn: Denne adressa ser ikkje ut til å innehelda ein distribusjon.
pl: wygląda na to, że we wskazanej lokalizacji nie ma dystrybucji
pt: esta localização não parece conter uma distribuição
pt_br: não foi encontrada uma distribuinão nesta localização
ro: această locație nu pare să conțină nici o distribuție
ru: не удаётся найти дистрибутив по указанному адресу
sl: izgleda, da ta lokacija ne vsebuje nobene distribucije
sq: ky vend nuk duket se përmban ndonjë shpërndarje
sv: denna sökväg verkar inte innehålla någon distribution
tr: bu konum herhangi bir dağıtım içermiyor

source: unable to parse media.cfg
ast: nun pue analizase media.cfg
cs: nelze zpracovat media.cfg
cy: methu didoli media.cfg
da: kunne ikke læse media.cfg
el: αδυναμία ανάλυσης του media.cfg
es: no se puede interpretar media.cfg
et: faili media.cfg parsimine nurjus
eu: ezin izan da media.cfg sintaktikoki egiaztatu
fi: media.cfg-tiedostoa ei voida jäsentää
fr: impossible d'analyser media.cfg
gl: non foi posible analizar media.cfg
hu: a media.cfg elemzése nem sikerült
id: tidak dapat mengolah media.cfg
is: get ekki unnið úr media.cfg
it: impossibile esaminare media.cfg
nb: klarte ikke å tolke media.cfg
nl: kon media.cfg niet analyseren
nn: Klarte ikkje tolka «media.cfg».
pl: nie można przetworzyć media.cfg
pt: não é possível analisar o ficheiro media.cfg
pt_br: incapaz de analisar media.cfg
ro: nu se poate analiza media.cfg
ru: не удаётся обработать файл media.cfg
sl: datoteke media.cfg ni mogoče razčleniti
sq: i pamundur analizimi i media.cfg
sv: kan inte tyda media.cfg
tr: media.cfg dosyasının sözdizimsel analizi yapılamıyor.

source: unable to access the distribution medium (no media.cfg file found)
ast: nun puede accedese al mediu de la distribución (non alcontráu'l ficheru media.cfg)
cs: nelze přistupovat k distribučnímu zdroji (chybí soubor media.cfg)
cy: methu cael mynediad at gyfrwng y dosbarthiad (heb ganfod ffeil media.cfg)
da: kunne ikke få fat på distributionsmedie (ingen media.cfg fil fundet)
el: αδυναμία πρόσβασης στο μέσο διανομής (δεν βρέθηκε αρχείο media.cfg)
es: no se puede acceder al soporte de la distribución (no se encontró el archivo media.cfg)
et: ligipääs distributsiooniandmekandjale nurjus (ei leitud faili media.cfg)
eu: ezin da banaketa menua atzitu (ez da media.cfg fitxategirik aurkitu)
fi: Jakelumediaa ei voida käyttää (tiedostoa media.cfg ei löytynyt)
fr: impossible d'accéder au média de distribution (pas de fichier media.cfg trouvé)
gl: non foi posible acceder ó soporte de distribución (non se atopou o ficheiro media.cfg)
hu: a disztribúciós adatforrás nem elérhető (media.cfg fájl nem található)
id: tidak dapat mengakses media distribusi (tidak ada file media.cfg yang ditemukan)
is: fann ekki dreifingarmiðil (engin media.cfg skrá fannst)
it: impossibile accedere al supporto di installazione (manca il file media.cfg)
nb: klarte ikke lese fra distribusjonsmediet (fant ingen fil kalt media.cfg).
nl: kon het installatiemedium niet vinden (geen media.cfg bestand gevonden)
nn: Klarte ikkje lesa frå distribusjonsmediet (fann inga «media.cfg»-fil).
pl: uzyskanie dostępu do nośnika dystrybucji było niemożliwe (nie odnaleziono pliku media.cfg)
pt: não é possível aceder à média de distribuição (nenhum ficheiro media.cfg encontrado)
pt_br: incapaz de acessar as mídias da distribuição (media.cfg não encontrado)
ro: nu se poate accesa mediul de instalare (nu s-a găsit fișierul media.cfg)
ru: нет доступа к источнику с дистрибутивом (не найден файл media.cfg)
sl: do vira distribucije ni mogoče dostopati (datoteke media.cfg ni mogoče najti)
sq: e pamundur hyrja në mediumin e shpërndarjes (skedari media.cfg mungon)
sv: kan inte läsa distributionsmediat (hittade ingen media.cfg fil)
tr: dağıtım ortamına ulaşılamıyor. (media.cfg dosyası bulunamadı.)

source: skipping non compatible media `%s' (for %s)
ast: saltando preséu non compatible `%s' (pa %s)
cs: vynechávám nekompatibilní zdroje `%s' (pro %s)
cy: hepgor cyfrwng anghymarus '%s' (ar gyfer %s)
da: overspringer ikke-kompatibelt medie '%s' (for %s)
el: παράληψη του μη συμβατού μέσου `%s' (για %s)
es: omitiendo soporte no compatible «%s» (para %s)
et: jäetakse vahele mitteühilduv andmekandja '%s' (%s)
eu: alboratu '%s' euskarri ez bateragarria (%s-rentzako)
fi: Ohitetaan yhteensopimaton media "%s" (%s)
fr: média « %s » ignoré car incompatible (pour %s)
hu: "%s" nevű nem kompatibilis adatforrás kihagyása (architektúra: %s)
is: sleppi ósamhæfðum miðli `%s' (fyrir %s)
it: ignoro il supporto non compatibile "%s" (per %s)
nb: overser inkompatibelt medie «%s» (for %s)
nl: overslaan incompatibele media '%s' (voor %s)
nn: Hoppar over ikkje-kompatibelt medium «%s» (for %s)
pl: pomijanie nie zgodnych nośników '%s' (dla %s)
pt: ignorar média não compatível `%s' (para %s)
pt_br: ignorando mídias não compatívieis `%s' (para %s)
ro: se omite mediul incompatibil „%s” (pentru %s)
ru: пропускается несовместимый источник `%s' (для %s)
sl: spuščam nezdružljivi vir »%s« (za %s)
sq: kapërcimi mediave jo të pajtueshme `%s' (për %s)
sv: ignorerar icke-kompatibelt media '%s' (för %s)
tr: desteklenmeyen ortam atlanıyor `%s' (for %s)

source: ignoring non-free medium `%s'
ast: inorando mediu non-free `%s'
ca: el suport no-lliure `%s' s'ignorarà
cs: ignorování nesvobodného zdroje '%s'
el: παράβλεψη του non-free μέσου «%s»
es: Ignorando soporte non-free `%s'
et: mittevaba andmekandja %s ignoreerimine
fr: média non libre %s ignoré
it: ignoro il supporto non-free `%s'
nl: negeren van non-free medium "%s"
pt: a ignorar a média non-free `%s'
pt_br: ignorando mídia non-free `%s'
ro: se ignoră mediul non-free „%s”
ru: игнорируется non-free источник «%s»
sl: onemogočanje vira z zaprto-kodnimi programi/gonilniki »%s«
sq: injorim i non-free medium `%s'
tr: `%s' non-free ortamı yoksayılıyor.

source: retrieving media.cfg file...
ast: recuperando ficheru media.cfg...
ca: s'està recuperant el fitxer media.cfg...
cs: načítám soubor media.cfg...
cy: estyn ffeil media.cfg...
da: modtager media.cfg-fil...
el: ανάκτηση του αρχείου media.cfg...
es: recuperando archivo media.cfg...
et: faili media.cfg tõmbamine...
eu: media.cfg fitxategia berreskuratzen...
fi: Noudetaan tiedostoa media.cfg...
fr: récupération du fichier media.cfg...
gl: obtendo o ficheiro media.cfg...
he: מאחזר את הקובץ media.cfg...
hu: media.cfg fájl behozatala...
id: menerima file media.cfg...
is: sæki media.cfg skrá...
it: recupero il file media.cfg...
nb: henter fila media.cfg …
nl: ontvangen van media.cfg-bestand...
nn: Lastar ned «media.cfg»-fil ...
pl: pobieranie pliku media.cfg...
pt: a transferir o ficheiro media.cfg...
pt_br: recuperando o arquivo media.cfg...
ro: se preia fișierul media.cfg...
ru: загружается файл media.cfg...
sl: prenos datoteke media.cfg …
sq: rikthim skedari media.cfg...
sv: hämtar media.cfg fil...
tr: media.cfg dosyası alınıyor...

source: trying to select nonexistent medium "%s"
ast: intentando seleicionar mediu inesistente "%s"
ca: s'ha intentant seleccionar una font inexistent "%s"
cs: pokouším se vybrat neexistující zdroj "%s"
cy: ceisio dewis y cyfrwng nad yw'n bod "%s"
da: prøver at vælge ikke-eksisterende medie "%s"
el: προσπάθεια επιλογής του ανύπαρκτου μέσου «%s»
es: intentando seleccionar soporte inexistente "%s"
et: püüti valida olematut andmekandjat "%s"
eu: existitzen ez den "%s" euskarria hautatu nahian zabiltza
fi: Yritettiin valita media "%s", jota ei ole olemassa
fr: essai de sélection du média inexistant « %s »
gl: intentando seleccionar o soporte inexistente "%s"
he: ניסיון לבחור במאגר שאינו קיים "%s"
hu: kísérlet történt nem létező adatforrás ("%s") kiválasztására
id: mencoba memilih media tak eksis "%s"
is: reynt að velja miðil sem er ekki til "%s"
it: tentativo di selezionare un supporto inesistente "%s"
nb: prøver å velge det ikke-eksisterende mediet «%s»
nl: probeert een niet-bestaand medium "%s" te selecteren
nn: Prøver å velja mediet «%s», som ikkje finst.
pl: próba wyboru nieistniejącego nośnika "%s"
pt: a tentar seleccionar uma média "%s" não existente
pt_br: tentando selecionar mídia inexistente "%s"
ro: se încearcă selectarea mediului inexistent „%s”
ru: был выбран несуществующий источник «%s»
sl: poskušanje izbire neobstoječega vira »%s«
sq: tento zgjedhjen e një burimi jo ekzistues "%s"
sv: försöker välja media som inte finns "%s"
tr: var olmayan "%s" ortamı seçilmeye çalışılıyor

source: selecting multiple media: %s
ast: seleicionando preseos múltiples: %s
ca: s'està seleccionant múltiples fonts: %s
cs: vybírám více zdrojů: %s
cy: dewis aml-gyfrwng: %s
da: vælger flere medier: %s
el: επιλογή πολλαπλών μέσων: %s
es: seleccionando soportes múltiples: %s
et: mitme andmekandja valik: %s
eu: hainbat euskarri hautatzen: %s
fi: Valitaan useampi media: %s
fr: sélection de plusieurs médias : %s
gl: seleccionando varios soportes: %s
he: בוחר הרבה מדיה:%s
hu: több adatforrás kijelölése: "%s"
id: memilih banyak media: %s
is: vel marga miðla: %s
it: sto selezionando più supporti: %s
nb: velger flere medier: %s
nl: selecteren van meerdere media: %s
nn: Vel fleire medium: %s.
pl: wybieranie wielu nośników: %s
pt: seleccionar várias médias: %s
pt_br: selecionando múltiplas mídias: %s
ro: selectare de medii multiple: %s
ru: выбирается составной источник: %s
sl: izbiranje več virov: %s
sq: zgjedhje të shumta burimesh: %s
sv: väljer flera media: %s
tr: çoklu kurulum kaynağı seçiliyor: %s

source: removing medium "%s"
ast: desaniciando'l mediu "%s"
ca: s'està esborrant la font "%s"
cs: odebírám zdroj "%s"
cy: dewis cyfrwng "%s":
da: fjerner medium "%s"
el: αφαίρεση του μέσου «%s»
es: quitando el soporte «%s»
et: andmekandja "%s" eemaldamine
eu: "%s" euskarria kentzen
fi: Poistetaan media "%s"
fr: suppression du média « %s »
gl: eliminando o soporte "%s"
he: מסיר מאגר "%s"
hu: "%s" adatforrás eltávolítása
id: menghapus media "%s"
is: fjarlægi miðil "%s"
it: rimuovo il supporto "%s"
nb: fjerner mediet «%s»
nl: bezig met verwijderen van medium "%s"
nn: Fjernar mediet «%s».
pl: usuwanie nośnika "%s"
pt: a remover a média "%s"
pt_br: removendo a mídia "%s"
ro: se înlătură mediul „%s”
ru: удаляется источник «%s»
sl: odstranjevanje vira »%s«
sq: heqje medium "%s"
sv: tar bort media "%s"
tr: "%s" ortamı kaldırılıyor.

source: reconfiguring urpmi for media "%s"
ast: reconfigurando urpmi pal preséu "%s"
ca: s'està reconfigurant l'urpmi per la font "%s"
cs: přenastavuji urpmi pro zdroj "%s"
cy: ail-ffurfweddu urpmi ar gyfer cyfrwng "%s"
da: omkonfigurerer urpmi for medie "%s"
el: επαναρύθμιση της urpmi για το μέσο «%s»
es: reconfigurando urpmi para el soporte «%s»
et: urpmi ümberseadistamine andmekandja "%s" tarbeks
eu: "%s" euskarriarentzako urpmi birkonfiguratzen
fi: Asetetaan urpmi uudelleen medialle "%s"
fr: reconfiguration de urpmi pour le média « %s »...
gl: reconfigurando urpmi para o soporte "%s"
he: מגדיר מחדש את urpmi למקור "%s"
hu: az urpmi beállításainak módosítása a(z) "%s" adatforráshoz
id: konfigurasi ulang urpmi untuk media "%s"
is: endurstilli urpmi fyrir miðil "%s"
it: riconfiguro urpmi per il supporto "%s"
nb: endrer oppsett for mediet «%s»
nl: herconfigureren van urpmi voor medium "%s"...
nn: Endrar oppsett for mediet «%s».
pl: zmiana konfiguracji urpmi dla nośnika "%s"
pt: a reconfigurar urpmi para a média "%s"
pt_br: reconfigurando o urpmi para as mídias "%s"
ro: se reconfigurează urpmi pentru mediul „%s”
ru: перенастраивается urpmi для источника «%s»
sl: ponovno nastavljanje urpmi za vir »%s«
sv: omkonfigurerar urpmi för media "%s"
tr: "%s" ortamı için urpmi yeniden ayarlanıyor.

source: ...reconfiguration failed
ast: ...falló la reconfiguración
ca: ..la reconfiguració ha fallat
cs: ...přenastavení selhalo
cy: ...methodd ail-ffurfweddu
da: ...omkonfigurering mislykkedes
el: ...η επαναρρύθμιση απέτυχε
es: ...falló la reconfiguración
et: ...ümberseadistamine nurjus
eu: ...birkonfiguraketak hutsegin du
fi: ...uudelleenasetus epäonnistui
fr: ... la reconfiguration a échoué
gl: ...fallo ó reconfigurar
he: ...ההגדרה מחדש נכשלה
hu: ...a beállítások módosítása sikertelen
id: ...konfigurasi ulang gagal
is: ...endurstilling mistókst
it: ...riconfigurazione fallita
nb: … klarte ikke å endre oppsettet
nl: ...herconfiguratie mislukt
nn: ... klarte ikkje endra oppsett.
pl: ...zmiana konfiguracji zakończone niepowodzeniem
pt: ...reconfiguração falhada
pt_br: ...falha na reconfiguração
ro: ...reconfigurare eșuată
ru: ...перенастройка не удалась
sl: … ponovno nastavljanje je spodletelo
sv: ...omkonfigurering misslyckades
tr: yeniden ayarlama başarısız oldu.

source: reconfiguration done
ast: reconfiguración fecha
ca: reconfiguració acabada
cs: přenastaveno
cy: cwblhau ail-ffurfweddu
da: omkonfigurering færdig
el: η επαναρρύθμιση πέτυχε
es: reconfiguración terminada
et: ümberseadistamine tehtud
eu: birkonfiguraketa amaituta
fi: Uudelleenasetus suoritettu
fr: reconfiguration effectuée
he: ההגדרה מחדש הושלמה
hu: a beállítások módosítása megtörtént
id: konfigurasi ulang selesai
is: endurstillingu lokið
it: riconfigurazione eseguita
nb: endring av oppsettet fullført
nl: herconfiguratie voltooid
nn: Fullført endring av oppsett.
pl: zmiana konfiguracji zakończona
pt: reconfiguração terminada
pt_br: reconfiguração terminada
ro: reconfigurare încheiată
ru: перенастройка выполнена
sl: ponovno nastavljanje je zaključeno
sv: omkonfigurering utförd
tr: yeniden ayarlama tamamlandı.

source: Error generating names file: dependency %d not found
ast: Fallu xenerando'l ficheru de nomes: non alcontrada la dependencia %d
cs: Chyba při generování souboru s názvy: závislost %d nebyla nalezena
cy: Gwall wrth gynhyrchu ffeil enwau: heb ganfod dibyniaeth %d
da: Fejl ved generering af navne-fil: afhængighed %d ikke fundet
el: Σφάλμα στη δημιουργία του αρχείου ονομάτων: η εξάρτηση %d δεν βρέθηκε
es: Error generando el archivo de nombres: no se encontró la dependencia %d
et: Viga nimedefaili loomisel: sõltuvust %d ei leitud
eu: Akatsa izen fitxategia sortzerakoan: %d menpekotasuna ez da aurkitu
fi: Virhe luotaessa names-tiedostoa: riippuvuutta %d ei löytynyt
fr: Erreur de génération du fichier names : dépendance %d non trouvée
gl: Erro ó xerar o ficheiro de nomes: non se atopou a dependencia %d
hu: Nem sikerült elkészíteni a névfájlt - nem található a következő függőség: %d
id: Kesalahan dalam menghasilkan nama file : ketergantungan %d tidak ditemukan
is: Villa við myndun nafnaskrár: er háð %d sem finnst ekki
it: Errore generando i nomi dei file: non esiste la dipendenza %d
nb: Feil ved opprettelse av navnefil, fant ikke avhengigheten %d
nl: Fout bij het genereren van namenbestand: afhankelijkheid %d niet gevonden
nn: Feil ved generering av namnefil. Fann ikkje avhengnaden %d.
pl: Błąd podczas generowania pliku z nazwami: nie odnaleziono zależności %d
pt: Erro ao gerar ficheiro de nomes: dependência %d não encontrada
pt_br: Erro gerando arquivo de nomes: dependência %d não encontrada
ro: Eroare la generarea fișierului names: lipsește dependența %d
ru: Ошибка создания файла имён: не найдена зависимость %d
sl: Napaka pri ustvarjanju imenske datoteke: odvisnosti %d ni mogoče najti
sv: Fel vid generering av names fil: behövlig %d hittades inte
tr: Adlar dosyasının üretiminde hata: %d bağımlılığı bulunamadı.

source: medium "%s" is up-to-date
ast: el mediu "%s" ta anováu
ca: el suport "%s" està actualitzat
cs: zdroj "%s" je aktuální
cy: cyfrwng "%s" wedi ei ddiweddaru
da: medie "%s" er tidssvarende
el: το μέσο «%s» είναι ενημερωμένο
es: el soporte «%s» está al día
et: andmekandja "%s" on täiesti värske
eu: "%s" euskarria egunean dago
fi: Media "%s" on ajantasalla
fr: le média « %s » est à jour
gl: o soporte "%s" está actualizado
he: המקור "%s" עדכני
hu: a(z) "%s" adatforrás naprakész
id: media "%s" sudah terbaru
is: miðill "%s" er uppfærð
it: il supporto "%s" risulta già aggiornato
nb: mediet «%s» er oppdatert
nl: medium "%s" is bijgewerkt
nn: Mediet «%s» er i nyaste versjon.
pl: nośnik %s jest aktualny
pt: a média "%s" está actualizada
pt_br: mídia "%s" já está atualizada
ro: mediul „%s” este la zi
ru: источник «%s» уже обновлён
sl: vir »%s« je posodobljen
sv: mediat "%s" är uppdaterat
tr: "%s" ortamı güncel.

source: examining synthesis file [%s]
ast: restolando'l ficheru de síntesis [%s]
ca: s'està examinant el fitxer de síntesi [%s]
cs: zpracovávám soubor syntézy [%s]
cy: archwilio ffeil synthesis [%s]
da: undersøger syntese-fil [%s]
el: εξέταση του αρχείου σύνθεσης [%s]
es: examinando el archivo de síntesis [%s]
et: sünteesifaili [%s] uurimine
eu: [%s] laburpen-fitxategia aztertzen
fi: Tutkitaan synthesis-tiedostoa [%s]
fr: examen de la liste de synthèse [%s]
gl: examinando o ficheiro synthesis [%s]
he: בודק את קובץ הsynthesis [%s]
hu: kiterjesztett függőséglista vizsgálata: "%s"
id: memeriksa file sintesa [%s]
is: athuga samantektar-skrá [%s]
it: esamino il file synthesis [%s]
nb: undersøker syntesefil [%s].
nl: onderzoeken van het synthesis-bestand [%s]
nn: Les syntesefila [%s].
pl: sprawdzanie pliku syntezy [%s]
pt: a examinar o ficheiro synthesis [%s]
pt_br: examinando arquivo synthesis [%s]
ro: se examinează fișierul synthesis [%s]
ru: изучается файл synthesis [%s]
sl: preverjanje datoteke synthesis [%s]
sq: kontrollimi i skedares sintezë [%s]
sv: undersöker synthesis-fil [%s]
tr: sentez dosyası [%s] inceleniyor
