Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: No orphans to remove
ast: Nun hai güérfanos pa desaniciar
cs: Nejsou sirotci k odebrání
cy: Dim amddifad i'w tynnu
da: Ingen forældreløse at fjerne
el: Δεν υπάρχουν ορφανά προς αφαίρεση
es: No hay huérfanos para quitar
et: Pole ühtegi orbu eemaldada
eu: Ez dago ezabatu beharreko umezurtzik
fi: Ei tarpeettomia paketteja (orphans)
fr: Aucun orphelin à supprimer
hu: Nincs árva csomag.
is: Enga munaðarleysingja er hægt fjarlægja
it: Nessun orfano da rimuovere
nb: Ingen foreldreløse pakker å fjerne
nl: Geen wezen te verwijderen
nn: Ingen foreldrelause pakkar å fjerna
pl: Brak osieroconych pakietów do usunięcia
pt: Sem órfãos para remover
pt_br: Nenhum pacote órfão para ser removido
ro: Nu sînt pachete orfane de înlăturat
ru: Нет осиротевших пакетов для удаления
sl: Ni osirotelih paketov za odstranitev
sv: Inga obehövliga paket att ta bort
tr: Kaldırılacak gereksiz paket yok

source: To satisfy dependencies, the following package will be removed
ast: Pa satisfacer les dependencies, desaniciaráse'l paquete siguiente
ca: Per a complir les dependències, s'eliminara el següent paquet
cs: Aby byly splněny závislosti, bude odebrán %d balíček
cy: I fodloni dibyniaethau, bydd y %d pecyn canlynol yn cael eu tynnu
da: For at tilfredsstille afhængigheder vil den følgende pakke blive fjernet
el: Για να ικανοποιηθούν οι εξαρτήσεις, θα αφαιρεθεί το παρακάτω πακέτο
es: Para satisfacer las dependencias, se quitará el paquete siguiente
et: Sõltuvuste lahendamiseks tuleb eemaldada järgmine pakett
eu: Mendekotasunak asetzeko, ondoko paketea ezabatuko da
fi: Riippuvuuksien täyttämiseksi seuraava paketti poistetaan
fr: Pour satisfaire les dépendances, le paquetages suivant va être désinstallé
he: בכדי לענות על התלויות החבילה הבאה תוסר
hu: A függőségek feloldásához a következő csomag el lesz távolítva
id: Untuk memenuhi ketergantungan, paket berikut akan dihapus
is: Til að viðhalda samræmi, verður eftirfarandi pakki fjarlægður
it: Per soddisfare le dipendenze, sarà rimosso il seguente pacchetto
nb: For å oppfylle avhengigheter vil den følgende pakka bli fjernet
nl: Om aan de afhankelijkheden te voldoen, wordt het volgende pakket verwijderd
nn: På grunn av avhengnader vert denne pakken fjerna
pl: W celu spełnienia zależności zostanie usunięty następujący pakiet
pt: Para satisfazer as dependências, o seguinte pacote será removido
pt_br: Para satisfazer as dependências, o seguinte pacote será removido
ro: Pentru satisfacerea dependențelor, pachetul următor va fi înlăturat
ru: Для удовлетворения зависимостей, следующий пакет будет удалён
sl: Za zadovoljitev odvisnosti bo odstranjen %d paket
sv: För att tillfredsställa beroenden kommer följande paket att tas bort
tr: Bağımlılık sorununu aşabilmek için, aşağıdaki paketin kurulması gerekiyor:

source: (orphan package)
ast: (paquete güérfanu)
cs: (osiřelý balíček)
cy: pecyn amddifad
da: (forældreløs pakke)
el: (ορφανό πακέτο)
es: (paquete huérfano)
et: (orvust pakett)
eu: (pakete umezurtza)
fi: (tarpeeton paketti)
fr: (paquetage orphelin)
hu: (árva csomag)
is: (munaðarlaus pakki)
it: (pacchetto orfano)
nb: (foreldreløs pakke)
nl: (weespakket)
nn: (foreldrelaus pakke)
pl: (osierocony pakiet)
pt: (pacote órfão)
pt_br: (pacote órfão)
ro: (pachet orfan)
ru: (осиротевший пакет)
sl: (osiroteli paket)
sv: (obehövligt paket)(obehövligt paket)
tr: (gereksiz paketler)

source: Remove %d package?
ast: ¿Desaniciar %d paquete?
ca: Elimina %d paquet?
cs: Odstranit %d balíček?
cy: Tynnu pecynnau %d?
da: Skal %d pakke fjernes?
el: Αφαίρεση %d πακέτου;
es: ¿Quitar %d paquete?
et: Kas eemaldada %d pakett?
eu: %d paketea ezabatu?
fi: Poista %d paketti?
fr: Supprimer %d paquetage ?
gl: Desexa eliminar %d paquete?
he: להסיר חבילה %d?
hu: %d csomag eltávolítása?
id: Hapus %d paket?
is: Fjarlæga %d pakka?
it: Rimuovo %d pacchetto?
nb: Vil du fjerne pakke %d?
nl: Eén pakket verwijderen?
nn: Vil du fjerna %d pakke?
pl: Usunąć pakiet %d?
pt: Remover o pacote %d?
pt_br: Remover %d pacote?
ro: Se înlătură pachetul %d?
sl: Ali odstranim %d paket?
sv: Ta bort %d paket?
tr: %d adet paket kaldırılsın mı?

source: testing removal of %s
ast: prebando'l desaniciáu de %s
cs: testuji odstranění %s
cy: profi tynnu %s
da: afprøver fjernelse af %s
el: δοκιμαστική αφαίρεση του %s
es: probando la desinstalación de %s
et: %s eemaldamise test
eu: %s ezabatzea probatzen
fi: Testataan paketin %s poistamista
fr: test de suppression de %s
hu: %s eltávolításának tesztelése
is: prófa að fjarlægja %s
it: test di rimozione per %s
nb: tester fjerning av %s
nl: verwijdering van %s testen
nn: Testar fjerning av «%s»
pl: testowanie usunięcia %s
pt: a testar remoção de %s
pt_br: testando a remoção de %s
ro: se testează înlăturarea lui %s
ru: тестрование удаления из %s
sl: preverjanje možnosti odstranitve %s
sv: testar borttagning av %s
tr: %s kaldırılma işlemi deneniyor

source: Removal failed
ast: Falló la desinstalación
ca: L'eliminació ha fallat
cs: Odebírání selhalo
cy: Methodd y tynnu
da: Fjernelse mislykkedes
el: Η αφαίρεση απέτυχε
es: Falló la desinstalación
et: Eemaldamine nurjus
eu: Kentzean huts egin du
fi: Poistaminen epäonnistui
fr: Échec de la désinstallation
gl: Fallo ó eliminar
he: ההסרה נכשלה
hu: Az eltávolítás sikertelen
id: Penghapusan gagal
is: Mistókst að fjarlægja
it: Rimozione non riuscita
nb: Klarte ikke å fjerne
nl: Verwijderen is mislukt
nn: Klarte ikkje fjerna.
pl: Usuwanie zakończone niepowodzeniem
pt: Remoção falhada
pt_br: A remoção falhou
ro: Înlăturare eșuată
ru: Удаление не удалось
sl: Odstranjevanje je spodletelo
sq: Zhdukja dështoi
sv: Borttagning misslyckades
tr: Kaldırma başarısız

source: Removal is possible
ast: Ye posible desaniciar
cs: Odstranění je možné
cy: Mae tynnu yn bosibl
da: Fjernelse er mulig
el: Η αφαίρεση είναι δυνατή
es: Se puede desinstalar
et: Eemaldamine on võimalik
eu: Ezabatzea posible da
fi: Poistaminen on mahdollista
fr: La suppression est possible
hu: Az eltávolítás elvégezhető
is: Mögulegt er að fjarlægja
it: La rimozione è possibile
nb: Fjerning er mulig
nl: Verwijderen is mogelijk
nn: Fjerning er mogleg.
pl: Usunięcie jest możliwe
pt: A remoção é possível
pt_br: A remoção é possível
ro: Înlăturarea este posibilă
ru: Удаление возможно
sl: Odstranitev je mogoča
sv: Borttagning är möjlig
tr: Kaldırma uygulanabilir

source: --version - print this tool's version number.
ast: --version - amosar el númberu de versión d'esta ferramienta.
ca: --help - mostra la informació de la versió.
cs: --version - vypíše číslo verze tohoto nástroje
cy: --version - argraffu rhif fersiwn yr offeryn.
da: --version - udskriv dette værktøjs versionsnummer.
el: --version - εμφανίζει τον αριθμό έκδοσης αυτού του εργαλείου
es: --version - mostrar el número de versión de esta herramienta.
et: --version - näitab programmi versiooni.
eu: --version - inprimatu tresna honen bertsio zenbakia.
fi: --version - tulosta versionumero.
fr: --version - afficher la version de cet utilitaire
gl: --version - amosa o número de versión desta ferramenta.
he: --version - הדפסת מספר הגרסה של כלי זה.
hu: --version - jelen program verziószámának megjelenítése
id: --version - cetak nomor versi perkakas ini.
is: --version - prenta útgáfunúmer þessa tóls.
it: --version - stampa la versione di questo tool.
nb: --version – vis versjonsnummeret til dette verktøyet.
nl: --version - geeft het versienummer van dit programma weer.
nn: --version – Vis versjonsnummeret til dette verktøyet.
pl: --version - wyświetla numer wersji tego programu.
pt: --version - mostra o número da versão desta ferramenta.
pt_br: --version - imprime o número da versão desta ferramenta.
ro: --version - afișează versiunea acestui utilitar.
ru: --version - показать номер версии программы
sl: --version - prikaži različico urpmf.
sv: --version - visa detta verktygs versionsnummer.
tr: --version - bu aracın sürüm numarasını yazdır.

source: --env - use specific environment (typically a bug report).
ast: --env - usar entornu específicu (típicamente pa informar bugs).
ca: --env - utilitza un entorn concret (normalment un informe d'errors).
cs: --env - použij specifické prostředí (většinou hlášení o chybě)
cy: --env - defnyddio amgylchedd penodol (adroddiad gwall fel rheol).
da: --env - brug specifikt miljø (typisk ved en fejlrapport).
el: --env - χρήση συγκεκριμένου περιβάλλοντος (συνήθως από μία αρχειοθήκη αναφοράς σφάλματος).
es: --env - usar entorno específico (típicamente para reportar bugs).
et: --env - kasutatakse spetsiifilist keskkonda (tavaliselt vearaportideks).
eu: --env - ingurune espezifikoa erabiltzen du (normalean errorearen berri ematea).
fi: --env - käytä määrättyä ympäristöä (yleensä virheraportti).
fr: --env - utiliser un environment spécifique (en général un rapport d'anomalie).
gl: --env - usar un ambiente específico (normalmente un informe de erro).
he: --env - שימוש בסביבה מסויימת (בדרך כלל דיווח על בעיה).
hu: --env - megadott környezet használata (általában hibajelentés esetén használatos)
id: --env - gunakan lingkungan khusus (umumnya laporan kecacatan).
is: --env - nota tiltekið umhverfi (yfirleitt vegna villutilkynninga).
it: --env - usa un ambiente specifico (tipicamente un bug report).
nb: --env – bruk selvvalgt miljø (vanligvis ved en feilrapport).
nl: --env - specifieke omgeving gebruiken (meestal een foutrapport).
nn: --env – Bruk tilpassa miljø (vanlegvis ein feilrapport).
pl: --env - używa określonego środowiska (typowo raport błędów).
pt: --env - usa um ambiente especifico (geralmente um relatório de erro).
pt_br: --env - usa um ambiente específico (tipicamente para bug report).
ro: --env - utilizează un mediu specificat (de obicei un raport de erori).
ru: --env - использовать особое окружение (обычно отчёт об ошибке)
sl: --env - uporabi specifično okolje (ponavadi poročilo o napaki).
sq: --env - përdore mjedisin e veçantë (veçënarishtë një raport bugi).
sv: --env - använd specifik miljö (vanligen en felrapport).
tr: --env - belirli bir çevre kullan (genellikle bir hata raporu).

source: --excludemedia - do not use the given media, separated by comma.
ast: --excludemedia - non usar preseos daos, dixebraos por coma.
ca: --excludemedia - no usis les fonts donades, separades per comes.
cs: --excludemedia - nepoužít zadané zdroje, oddělené čárkami
cy: --excludemedia - peidio defnyddio'r cyfrwng hwn, rhannwyd gyda choma.
da: --excludemedia - brug ikke de opgivne medier, adskilt med komma.
el: --excludemedia - αποκλεισμός των δεδομένων μέσων, διαχωρισμένων με κόμμα.
es: --excludemedia - no usar soportes dados, separados por coma.
et: --excludemedia - ei kasutata määratud andmekandjaid (eraldajaks koma).
eu: --excludemedia - ez erabili adierazitako euskarria, komaz bereizita.
fi: --excludemedia - älä käytä seuraavia pilkuilla erotettuja medioita.
fr: --excludemedia - ne pas utiliser les médias spécifiés (séparés par des virgules).
gl: --excludemedia - non usar os soportes dados, separados por comas.
hu: --excludemedia - a felsorolt (elválasztás: vessző) adatforrások feldolgozásának mellőzése
id: --excludemedia - jangan pakai media yang diberikan, dipisahkan dengan koma.
is: --excludemedia - nota ekki uppgefna miðla, aðskildir með kommum.
it: --excludemedia - non usa i supporti elencati, separati da virgole.
nb: --excludemedia – ikke bruk spesifiserte medier (kommaseparert liste).
nl: --excludemedia - gebruik de gegeven media niet, kommagescheiden.
nn: --excludemedia – Ikkje bruk valt medium (kommadelt liste).
pl: --excludemedia - bez używania podanych nośników, rozdzielonych przecinkami.
pt: --excludemedia - não usa a média indicada, separada por vírgula.
pt_br: --excludemedia - não usa as mídias fornecidas (separadas por vírgula).
ro: --excludemedia - nu utilizează mediile date, separate prin virgulă.
ru: --excludemedia - не использовать указанные источники, перечисленные через запятую
sl: --excludemedia - ne uporabi podanih virov, ločenih z vejico.
sq: --excludemedia - mos i përdor vetëm burimet e dhëna, të ndara me presje.
sv: --excludemedia - använd inte givet media, separerat med komma.
tr: --excludemedia - virgülle ayrılmış olan verilen kurulum kaynağını kullanma.

source: --literal, -l - don't match patterns, use argument as a literal string.
ast: --literal, -l - non concasar con patrones, usar argumentu de manera lliteral.
cs: --literal, -l - neporovnávat vzory, použije se parametr jako prostý řetězec
cy: --literal, -l - peidio cydweddu patrymau, defnyddio ymresymiad fel llinyn llythrennedd.
da: --literal, -l - kontrollér ikke søgestrenge, brug argumenter som bogstavelige strenge.
el: --literal, -l - δεν αντικαθιστά τους μπαλαντέρ, εφαρμογή του ορίσματος ως έχει.
es: --literal, -l - no coincidir con patrones, usar argumento de manera literal.
et: --literal, -l - mustrina tõlgendamise asemel kasutatakse argumenti täpselt esitatud kujul.
eu: --literal, -l - ez parekatu patroi gisa, erabili argumentua hitzez hitz testu ilara gisa.
fi: --literal, -l - käytä argumenttia pelkkänä hakusanana säännöllisen lausekkeen sijaan.
fr: --literal, -l - ne remplace pas les jokers, applique l'argument tel quel.
gl: --literal, -l - non usar patróns, usar o argumento coma unha cadea literal.
hu: --literal, -l - mintaillesztés mellőzése, az argumentum normál szövegként való kezelése
id: --literal, -l - jangan melakukan pencocokan pola, gunakan argumen sebagai string literal.
is: --literal, -l - ekki leita að mynstrum, nota viðfang sem uppgefinn ákveðinn texta.
it: --literal, -l - non considerare i caratteri speciali, usa l'argomento come è.
nb: --literal, -l – ikke samsvar mønstre, bruk argument som en ordrett streng.
nl: --literal, -l - geen patronen vergelijken, argument als letterlijke reeks.
nn: --literal, -l – Ingen treff på mønster; bruk berre argument som tekst.
pl: --literal, -l - nie porównuj wzorców, użyj argumentu ciągu dosłownie.
pt: --literal, -l - não combina médias padrões, usa o argumento como uma string literal.
pt_br: --literal, -l - não combina regulares, use argumento como string literal.
ro: --literal, -l - nu se potrivesc modelele, se utilizează argumentul ca șir literal.
ru: --literal, -l - не искать соответствия шаблону, использовать аргумент как буквенную строку
sl: --literal, -l - vzemi argument kot dobeseden niz, ne regularni izraz.
sv: --literal, -l - sök inte mönster, använd argument som söksträng.
tr: --literal, -l - örnekleri eşleştirme, argümanı bri tam satır olarak kullan.

source: --sortmedia - sort media according to substrings separated by comma.
ast: --sortmedia - clasificar preseos d'alcuerdu a subcadenes dixebraes por coma.
ca: --sortmedia - ordena les fonts segons les cadenes donades, s'han de separar amb comes.
cs: --sortmedia - třídit zdroje podle podřetězců oddělených čárkami
cy: --sortmedia - didoli'r cyfrwng yn ôl llinynnau wedi eu rhannu gyda choma.
da: --sortmedia - sortér medier ifølge delstrenge, adskilt med komma.
el: --sortmedia - ταξινόμηση των μέσων βάσει των υποσυμβολοσειρών διαχωρισμένων με κόμμα.
es: --sortmedia - clasificar soportes de acuerdo a subcadenas separadas por coma.
et: --sortmedia - sorteerib andmekandjad alamstringide põhjal (eraldajaks koma).
eu: --sortmedia - euskarriak komaz bereizitako azpikateen arabera ordenatzen ditu.
fi: --sortmedia - lajittele mediat pilkuilla erotettujen alimerkkijonojen mukaan.
fr: --sortmedia - trier les médias selon des sous-chaînes (séparées par des virgules).
gl: --sortmedia - ordenar os soportes de acordo cas cadeas separadas por comas.
he: --sortmedia - מיון מדיה בהתאם לכותרות משנה המופרדים ע"י פסיק.
hu: --sortmedia - az adatforrások sorbarendezése vesszővel elválasztott sztringek alapján
id: --sortmedia - urutkan media menurut substring yang dipisahkan dengan koma.
is: --sortmedia - raða miðlum eftir undirstrengjum, aðskildir með kommum.
it: --sortmedia - ordina i supporti in base alle sotto-stringhe separate da virgole
nb: --sortmedia – sorter medier etter delstrenger (kommaseparert liste).
nl: --sortmedia - media sorteren uitgaand van kommagescheiden subreeksen.
nn: --sortmedia – Sorter medium etter delstrengar (kommadelt liste).
pl: --sortmedia - sortuje nośniki w zależności od podciągów rozdzielonych przecinkami.
pt: --sortmedia - organiza as médias de acordo com as substrings separadas por vírgula.
pt_br: --sortmedia - ordena as mídias (separadas por vírgulas).
ro: --sortmedia - sortează mediile conform subșirurilor separate prin virgulă.
ru: --sortmedia - сортировать источники по подстрокам, перечисленным через запятую.
sl: --sortmedia - vire razvrsti glede na podnize, ločene z vejico.
sq: --sortmedia - radhitja e burimit akordohet me ndër-rreshtat e ndarë me presje.
sv: --sortmedia - sorterar media enligt kommaseparerade delsträngar.
tr: --sortmedia - virgülle ayrılan alt satırlara göre kurulum kaynağı sırala.

source: --use-distrib - use the given path to access media
ast: --use-distrib - usar el camín dau p'acceder a los preseos
cs: --use-distrib - použít zadanou cestu pro přístup ke zdroji
cy: --use-distrib - defnyddio'r llwybr yma i gael mynediad ar y cyfrwng.
da: --use-distrib - Brug denne sti for adgang til media.
el: --use-distrib - χρήση της δεδομένης διαδρομής για πρόσβαση στο μέσο
es: --use-distrib - usar la ruta dada para acceder a los soportes
et: --use-distrib - andmekandja kasutamiseks kasutatakse määratud asukohta.
eu: --use-distrib - erabili emandako bidea euskarria atzitzeko
fi: --use-distrib - käytä annettua polkua jakelun hakuun.
fr: --use-distrib - utiliser le chemin spécifié pour accéder au média
gl: --use-distrib - usar a ruta dada para acceder ó soporte
he: --use-distrib - השתמש בנתיב שהוגדר כדי לגשת למקור
hu: --use-distrib - a megadott útvonal használata az adatforrások eléréséhez
is: --use-distrib - nota gefna slóð fyrir aðgang að miðli
it: --use-distrib - utilizza questo percorso per accedere al supporto
nb: --use-distrib – bruk den oppgitte stien for tilgang til medier
nl: --use-distrib - opgegeven pad gebruiken voor mediatoegang.
nn: --use-distrib – Bruk denne stigen for tilgang til medium.
pl: --use-distrib - użyj podanej ścieżki do nośnika
pt: --use-distrib - usa a localização dada para aceder à média
pt_br: --use-distrib - usa o caminho dado para acessar mídias
ro: --use-distrib - se utilizează calea indicată către mediu
ru: --use-distrib - использовать указанный путь к источнику
sl: --use-distrib - za dostop do vira uporabi podano pot
sv: --use-distrib - använd angiven sökväg för att nå media
tr: --use-distrib - kurulum kaynağına erişim için verilen yolu kullan.

source: --synthesis - use the given synthesis instead of urpmi db.
ast: --synthesis - usar síntesis provista en llugar de base de datos d'urpmi.
ca: --synthesis - utilitza la síntesi donada en comptes de la bd de urpmi.
cs: --synthesis - použít daný soubor se syntézou místo databáze urpmi
cy: --synthesis - defnyddio'r synthesis yn lle urpmi db.
da: --synthesis - brug synthesis angivet i stedet for urpmi-db.
el: --synthesis - χρήση του synthesis που δίδεται αντί του urpmi db.
es: --synthesis - usar síntesis provista en lugar de base de datos de urpmi.
et: --synthesis - kasutatakse sünteesi urpmi andmebaasi asemel.
eu: --synthesis - emandako laburpena erabiltzen du urpmi db-ren ordez.
fi: --synthesis - käytä annettua synthesis-tiedostoa urpmi- tietokannan sijaan.
fr: --synthesis - utiliser le fichier de synthèse donné plutôt que la base de données urpmi.
gl: --synthesis - usar o ficheiro synthesis proporcionado no canto da base de datos de urpmi.
he: --synthesis - השתמש בקובץ synthesis המוגדר במקום בסיס הנתונים של urpmi.
hu: --synthesis - a megadott kiterjesztett függőséglista használata az urpmi-adatbázis helyett
id: --synthesis - gunakan sintesa yang diberikan, bukan db urpmi.
is: --synthesis - nota gefna samantektar-skrá í stað urpmi gagnagrunns.
it: --synthesis - utilizza il file synthesis specificato invece del db urpmi.
nb: --synthesis – bruk syntese i stedet for hele databasen.
nl: --synthesis - opgegeven synthesis gebruiken in plaats van urpmi db.
nn: --synthesis – Bruk syntese i staden for heile databasen.
pl: --synthesis - używa podanego pliku syntezy zamiast bazy urpmi.
pt: --synthesis - usa o ficheiro synthesis dado em vez da base de dados urpmi.
pt_br: --synthesis - usa synthesis invés da database do urpmi.
ro: --synthesis - utilizează fișierul synthesis dat în loc de urpmi db.
ru: --synthesis - использовать указанный synthesis вместо БД urpmi
sl: --synthesis - uporabi podan synthesis namesto baze urpmi.
sq: --synthesis - përdori skedaret e dhëna sintezë në vend të db.
sv: --synthesis - använd given synthesis istället för urpmi db.
tr: --synthesis - urpmi veri tabanı yerine belirtilen sentezi kullan.

source: --uniq - do not print identical lines twice.
ast: --uniq - non imprenta llinies idéntiques.
ca: --uniq - no imprimeix línies idèntiques.
cs: --uniq - nevytiskne stejné řádky
cy: --uniq - peidio argraffu llinellau'r un fath.
da: --uniq - udskriv ikke identiske linjer.
el: --uniq - απόκρυψη των διπλότυπων γραμμών.
es: --uniq - no imprime líneas idénticas.
et: --uniq - ei näidata ühesuguseid ridu.
eu: --uniq - ez inprimatu lerro berdinak.
fi: --uniq - älä tulosta identtisiä rivejä uudestaan.
fr: --uniq - ne pas afficher les lignes identiques.
gl: --uniq - non amosa as liñas idénticas.
he: --uniq - אל תדפיס שורות זהות פעמיים.
hu: --uniq - az azonos sorok csak egyszer jelenjenek meg
id: --uniq - jangan cetak baris identik dua kali.
is: --uniq - ekki prenta tvíteknar línur.
it: --uniq - non stampa le linee uguali.
nb: --uniq – ikke vis identiske linjer.
nl: --uniq - geeft geen identieke regels weer.
nn: --uniq – Vis ikkje identiske linjer.
pl: --uniq - bez wyświetlania identycznych wierszy.
pt: --uniq - não mostra linhas idênticas.
pt_br: --uniq - não lista linhas idênticas.
ro: --uniq - nu afișează liniile identice de două ori.
ru: --uniq - не выводить идентичные строки
sl: --uniq - brez izpisa podvojenih vrstic.
sq: --uniq - mos i çfaqë rreshtat e njëjtë.
sv: --uniq - visa inte identiska rader.
tr: --uniq - açıklayıcı satırları ikinci kez yadırma.

source: --update - use only update media.
ast: --update - usa namái preséu d'anovamientu.
ca: --update - utilitza només les fonts d'actualització.
cs: --update - použít pouze aktualizační zdroje
cy: --update - defnyddio cyfrwng diweddaru'n unig.
da: --update - brug kun opdateringsmedie.
el: --update - χρήση μόνο των μέσων αναβάθμισης.
es: --update - usa sólo soporte de actualización.
et: --update - kasutatakse ainult uuendus-andmekandjat.
eu: --update - eguneratze-euskarria bakarrik erabiltzen du.
fi: --update - käytä ainoastaan päivitysmediaa.
fr: --update - n'utiliser que les médias de mise à jour.
gl: --update - usar só soportes de actualización.
he: --update -שימוש במאגר העדכונים בלבד.
hu: --update - csak frissítési adatforrás legyen használva
id: --update - hanya pakai media update.
is: --update - nota aðeins uppfærslu-miðil.
it: --update - usa solo supporti di aggiornamento.
nb: --update – bruk kun oppdateringsmedier.
nl: --update - gebruik alleen bijwerkmedia.
nn: --update – Bruk berre oppdateringsmedium.
pl: --update - używa tylko nośników aktualizacyjnych.
pt: --update - usa apenas a média de actualização.
pt_br: --update - use somente mídias de atualização.
ro: --update - utilizează numai mediile de actualizare.
ru: --update - использовать только источник обновления
sl: --update - uporabi samo vire za posodobitev.
sq: --update - përdori vetëm burimet përditësimi.
sv: --update - använd endast uppdateringsmedia.
tr: --update - sadece güncelleme ortamını kullan.
