Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --prozilla - use prozilla to retrieve distant files.
ast: --prozilla - usa curl pa recuperar ficheros remotos.
ca: --prozilla - usa prozilla per a recuperar fitxers llunyans.
cs: --prozilla - použije program prozilla pro načtení souborů
cy: --prozilla - defnyddio prozilla i estyn ffeiliau pell.
da: --prozilla - brug 'prozilla' til at hente retrieve eksterne filer.
el: --prozilla - χρήση του prozilla για την ανάκτηση απομακρυσμένων αρχείων.
es: --prozilla - usa curl para recuperar archivos remotos.
et: --prozilla - prozilla kasutamine kaugfailide tõmbamiseks.
eu: --prozilla - prozilla erabiltzen du urruneko fitxategiak eskuratzeko.
fi: --prozilla - käytä etätiedostojen noutamiseen ohjelmaa prozilla.
fr: --prozilla - utiliser prozilla pour récupérer les fichiers distants.
gl: --prozilla - usar prozilla para descargar ficheiros distantes.
hu: --prozilla - a Prozilla használata távoli fájlok letöltésére
id: --prozilla - gunakan prozilla untuk mengambil file jauh.
is: --prozilla - nota prozilla til að ná í fjarlægar skrár.
it: --prozilla - usa prozilla per scaricare file remoti.
nb: --prozilla – bruk prozilla for hente fjerntliggende filer.
nl: --prozilla - prozilla gebruiken om bestanden op afstand te ontvangen.
nn: --prozilla – Bruk prozilla til å henta fjerntliggjande filer.
pl: --prozilla - użycie prozilli do odebrania plików ze zdalnej lokalizacji.
pt: --prozilla - usa o prozilla para transferir ficheiros distantes.
pt_br: --prozilla - use prozilla para baixar os dados.
ro: --prozilla - utilizează prozilla pentru preluarea fișierelor distante.
ru: --prozilla - использовать prozilla для загрузки удалённых файлов
sl: --prozilla - uporabi prozilla za prenos datotek.
sv: --prozilla - använd prozilla för att hämta fjärr-filer.
tr: --prozilla - uzak dosyaları almak için prozilla kullan.

source: --aria2 - use aria2 to retrieve distant files.
ast: --aria2 - usa aria2 pa recuperar ficheros remotos.
cs: --aria2 - použije pro získání vzdálených souborů aria2
cy: --aria2 - - defnyddio aria2 i estyn ffeiliau pell.
da: --aria2 - brug aria2 til at hente filer på nettet.
el: --aria2 - χρήση του aria2, για την ανάκτηση απομακρυσμένων αρχείων.
es: --aria2 - usa aria2 para recuperar archivos remotos.
et: --aria2 - aria2 kasutamine kaugfailide tõmbamiseks.
eu: --aria2 - erabili aria2 urruneko fitxategiak eskuratzeko.
fi: --aria2 - käytä etätiedostojen noutamiseen ohjelmaa aria2.
fr: --aria2 - utiliser aria2 pour récupérer les fichiers distants.
hu: --aria2 - az Aria2 használata távoli fájlok letöltésére
is: --aria2 - nota aria2 til að ná í fjarlægar skrár.
it: --aria2 - usa aria2 per scaricare file remoti.
nb: --aria2 – bruk aria2 for å hente fjerntliggende filer.
nl: --aria2 - aria2 gebruiken om bestanden op afstand te ontvangen.
nn: --aria2 – Bruk aria2 for å henta fjerntliggjande filer.
pl: --aria2 - użyj aria, aby odebrać zdalne pliki.
pt: --aria2 - usa aria2 para obter ficheiros distantes.
pt_br: --aria2 - use o aria2 para baixar os dados.
ro: --aria2 - utilizează aria2 pentru preluarea fișierelor distante.
ru: --aria2 - использовать aria2 для загрузки удалённых файлов
sl: --aria2 - uporabi aria2 za prenos datotek.
sv: --curl - använd aria2 för att hämta fjärrfiler.
tr: --aria2 - uzak dosyaları almak için aria2 kullan.

source: --update - create an update medium, or discard non-update media (when used with --distrib)
ast: --update - criar un mediu d'anovamientos, o descartar los preseos que nun son d'anovamientos (cuando s'usa con --distrib)
cs: --update - vytvoří zdroj pro aktualizaci nebo vyřadí neaktualizační zdroje (při použití s --distrib)
cy: --update - creu cyfrwng diweddaru, neu ddileu'r cyfrwng heb ei dddiweddaru (wrth gael ei ddefnyddio gyda --distrib)
da: --update - opret et opdateringsmedie, eller brug ikke ikke-opdateringsmedier (når brugt med --distrib)
el: --update - δημιουργία μέσου «ενημερώσεων» , ή εξαναγκασμός χρήσης των μέσων «ενημερώσεων» (αν γίνει χρήση με --distrib)
es: --update - crear un soporte de actualizaciones, o descartar los soportes que no son de actualizaciones (cuando se utiliza con --distrib)
et: --update - uuendusandmekandja loomine või mitte-uuendusandmekandjate tühistamine (koos võtmega --distrib)
eu: --update - sortu eguneratzeko euskarri bat, edo baztertu eguneratzeko ez diren euskarriak (--distrib erabiltzen denean)
fi: --update - luo päivitysmedia tai hylkää ei-päivitysmedia (käytettäessä valitsinta --distrib).
fr: --update - créer une source «mise à jour» ou forcer l'utilisation, des sources type «mise à jour» (si utilisé avec --distrib)
hu: --update - létrehoz egy frissítési adatforrást, vagy visszautasítja a nem-frissítési adatforrást (pl. a --distrib kapcsolóval)
is: --update - búa til uppfærslumiðil, eða sleppa ekki-uppfærslumiðlum (þegar notað með --distrib)
it: --update - crea un supporto di aggiornamento, o ignora i supporti non di aggiornamento (se usato con --distrib)
nb: --update – opprett et oppdateringsmedia, eller forkast andre media (når brukt med --distrib)
nl: --update - een bijwerkmedium aanmaken, of niet-bijwerkmedia weggooien (als gebruikt met --distrib)
nn: --update – Lag eit oppdateringsmedium, eller forkast eit ikkje-oppdateringsmedium (når brukt med «--distrib»).
pl: --update - utwórz nośnik aktualizacji, lub zrezygnuj z nośnika innego typu (użycie z opcją --distrib)
pt: --update - cria uma média de actualização, ou descarta médias não actualizaveis (quando usado com --distrib)
pt_br: --update - cria uma mídia de atualização, ou descarta mídias que não sejam de atualização (quando usado com a opção --distrib)
ro: --update - creează un mediu de actualizare, sau anulează un mediu non-actualizare (cînd este utilizat cu --distrib)
ru: --update - создать источник обновления или отбросить источники без обновлений (при использовании с --distrib)
sl: --update - ustvari posodobitveni vir, ali zavrzi neposodobitvene vire (ko uporabite še --distrib)
sv: --update - skapa ett uppdateringsmedium, eller ignorera media som inte har uppdateringar (med flaggan --distrib)
tr: --update - bir güncelleme kaynağı oluştur, veya güncellem-olmayan kaynağı görmezden gel (--distrib ile kullanıldığında)

source: --xml-info - use the specific policy for downloading xml info files one of: never, on-demand, update-only, always. cf urpmi.cfg(5)
ast: --xml-info - usar la política específica pa baxar ficheros xml info una de: never, on-demand, update-only, always. ver urpmi.cfg(5)
cs: --xml-info - použít specifickou politiku pro stažení souborů s xml info jedna z: never, on-demand, update-only, always. viz urpmi.cfg(5)
cy: --xml-info - defnyddio'r polisi penodol o lwytho ffeiliau gwybodaeth xml un o: byth, ar alw, diweddaru'n unig, bob tro. cf urpmi.cfg(5)
da: --xml-info - brug den specifikke strategi for hentning af xml-info filer én af: never, on-demand, update-only, always. cf urpmi.cfg(5)
el: --xml-info - λήψη των αρχείων xml info με την καθορισμένη πολιτική απο τις εξής: never, on-demand, update-only, always. cf urpmi.cfg(5)
es: --xml-info - usar la política específica para descargar archivos xml info una de: never, on-demand, update-only, always. ver urpmi.cfg(5)
et: --xml-info - konkreetse reegli kasutamine XML-info failide allalaadimisel reegel on üks järgmistest: never, on-demand, update-only, always. Vt urpmi.cfg(5)
eu: --xml-info - erabili xml info fitxategiak jaisteko politika zehatza hauetako bat: never, on-demand, update-only, always. cf urpmi.cfg(5)
fi: --xml-info - määrittele toimintatapa xml-info -tiedostojen hakemiselle: never, on-demand, update-only, always. (Katso "man urpmi.cfg").
fr: --xml-info - télécharger les fichiers xml-info avec la politique donnée parmi : never, on-demand, update-only, always. cf urpmi.cfg(5)
hu: --xml-info - egyedi irányelv a listafájlok letöltéséhez: never, on-demand, update-only, always. Lásd: urpmi.cfg(5)
is: --xml-info - nota tilgreinda stefnu til að sækja XML-info skrár eitt af: never, on-demand, update-only, always. cf urpmi.cfg(5)
it: --xml-info - segui una politica assegnata per recuperare i file xml-info scelta tra: never(mai), on-demand(su richiesta), update-only(solo aggiornamenti), always(sempre). cf urpmi.cfg(5)
nb: --xml-info – bruk den spesifiserte praksisen for å laste ned xml-infofiler en av: never, on-demand, update-only, always. cf urpmi. cfg(5)
nl: --xml-info - dit beleid aanhouden voor downloaden van xml-infobestanden een van: never, on-demand, update-only, always. cf urpmi.cfg(5)
nn: --xml-info – Bruk vald praksis for nedlasting av xml-infofiler. Éin av: never, on-demand, update-only, always. Sjå urpmi.cfg(5).
pl: --xml-info - użyj jedną z zasad pobierania plików informacyjnych xml. Do wyboru są opcje: never, on-demand, update-only, always. cf urpmi.cfg(5)
pt: --xml-info - usa a política indicada para transferir ficheiros xml de informação um de: never, on-demand, update-only, always. cf urpmi.cfg(5)
pt_br: --xml-info - usar uma política específica para transferir arquivos xmlinfo uma de: never, on-demand, update-only, always.cf urpmi.cfg(5)
ro: --xml-info - alegeți metoda pentru descărcarea fișierelor xml una din: niciodată, la cerere, numai la actualizări, întotdeauna. cf urpmi.cfg(5)
ru: --xml-info - использовать особую политику для загрузки xml-файлов варианты: never, on-demand, update-only, always. cf urpmi.cfg(5)
sl: --xml-info - uporabi specifični način za prenos datotek XML s podatki eno izmed: never (nikoli), on-demand (na zahtevo), update-only (samo posodobitev), always (vedno). Nastavitvena datoteka urpmi.cfg(5)
sv: --xml-info - använd specifik policy för hämtning av xml info-filer en av: never, on-demand, update-only, always. se urpmi.cfg(5)
tr: --xml-info - xml bilgi dosyalarını indirmek için belirli bir kuralı kullan. şunlardan birini: hiç bir zaman, gerektiğinde,sadece-güncellemede, herzaman. cf urpmi. cfg (5)

source: --probe-synthesis - use synthesis file.
ast: --probe-synthesis - usar ficheru synthesis.
ca: --probe-synthesis - usa el fitxer de síntesi.
cs: --probe-synthesis - použije soubor se syntézou
cy: --probe-synthesis - defnyddio ffeil synthesis.
da: --probe-synthesis - brug syntese-fil.
el: --probe-synthesis - χρήση ενός αρχείου synthesis.
es: --probe-synthesis - usar archivo synthesis.
et: --probe-synthesis - kasutatakse sünteesifaili.
eu: --probe-synthesis - synthesis fitxategia erabili.
fi: --probe-synthesis - käytä synthesis-tiedostoa.
fr: --probe-synthesis - utiliser un fichier de synthèse.
gl: --probe-synthesis - usar o ficheiro synthesis.
he: --probe-synthesis - השתמש בקובץ synthesis.
hu: --probe-synthesis - kiterjesztett függőséglista felhasználása
id: --probe-synthesis - gunakan file sintesa.
is: --probe-synthesis - nota samantektar-skrá.
it: --probe-synthesis - usa il file synthesis.
nb: --probe-synthesis – bruk syntesefil.
nl: --probe-synthesis - gebruik synthesis bestand.
nn: --probe-synthesis – Bruk syntesefil.
pl: --probe-synthesis - użycie pliku syntezy.
pt: --probe-synthesis - usa o ficheiro synthesis.
pt_br: --probe-synthesis - use o arquivo synthesis.
ro: --probe-synthesis - utilizează fișierul synthesis.
ru: --probe-synthesis - использовать файл synthesis
sl: --probe-synthesis - uporabi datoteko synthesis.
sv: --probe-synthesis - använd synthesis fil.
tr: --probe-synthesis - sentez dosyası kullan.

source: --probe-rpms - use rpm files (instead of synthesis).
ast: --probe-rpms - usar ficheros rpm (en llugar de synthesis).
cs: --probe-rpms - použije RPM soubory (místo souborů syntézy)
cy: --probe-rpms -defnyddio ffeiliau rpm (yn lle synthesis).
da: --probe-rpms - brug rpm-filer (i stedet for syntese).
el: --probe-rpms - χρήση των αρχείων rpm (αντί των synthesis).
es: --probe-rpms - usar archivos rpm (en vez de synthesis).
et: --probe-rpms - kasutatakse RPM-faile (sünteesifaili asemel).
eu: --probe-rpms - erabili rpm fitxategiak (synthesis ordez).
fi: --probe-rpms - käytä rpm-tiedostoja synthesis-tiedoston sijaan.
fr: --probe-rpms - utiliser les fichiers rpm (au lieu des synthesis).
gl: --probe-rpms - usar ficheiros rpm (en vez de synthesis).
hu: --probe-rpms - RPM-fájlok használata (fejléclista helyett)
is: --probe-rpms - nota rpm skrár (í stað samantektar/hdlist-skráar).
it: --probe-rpms - usa i file rpm (invece di synthesis).
nb: --probe-rpms – bruk rpm-filer (i stedet for synthesis).
nl: --probe-rpms - rpm-bestanden gebruiken (i.p.v. synthesis).
nn: --probe-rpms – Bruk rpm-filer (i staden for syntese).
pl: --probe-rpms - wykorzystuje pliki rpm (zamiast syntezy).
pt: --probe-rpms - usa ficheiros rpm (em vez de synthesis).
pt_br: --probe-rpms - use arquivos rpm (ao invés de synthesis).
ro: --probe-rpms - utilizează fișiere rpm (în loc de synthesis).
ru: --probe-rpms - использовать rpm-файлы (вместо synthesis-файла)
sl: --probe-rpms - uporabi datoteke rpm (namesto datotek synthesis).
sv: --probe-rpms - använd rpm filer (i stället för synthesis).
tr: --probe-rpms - rpm dosyaları kullan.(sentez yerine)

source: --no-probe - do not try to find any synthesis file.
ast: --no-probe - non intentar atopar ficheros synthesis.
cs: --no-probe - nepokoušet se hledat žádný soubor se syntézou
cy: --no-probe - peidio ceisio canfod unrhyw ffeil synthesis.
da: --no-probe - forsøg ikke at finde nogen syntese-fil.
el: --no-probe - να μην γίνει αναζήτηση για αρχεία synthesis.
es: --no-probe - no intentar encontrar archivos synthesis.
et: --no-probe - ei püüta kasutada sünteesifaili.
eu: --no-probe - ez saiatu synthesis fitxategiak aurkitzen.
fi: --no-probe - älä yritä etsiä synthesis-tiedostoa.
fr: --no-probe - ne pas essayer de trouver de fichier synthesis.
gl: --no-probe - non tentar buscar ningún ficheiro synthesis.
he: --no-probe - אל תנסה למצוא כל קובץ synthesis.
hu: --no-probe - fejléclista keresésének mellőzése
is: --no-probe - ekki reyna að finna neina samantektar-skrá.
it: --no-probe - non cerca nessun file synthesis.
nb: --no-probe – ikke prøv å finne noen kildefil (synthesis).
nl: --no-probe - probeer geen synthesisbestand te vinden.
nn: --no-probe – Ikkje prøv å finna syntesefil.
pl: --no-probe - bez próby odnalezienia żadnego pliku syntezy.
pt: --no-probe - não tenta procurar qualquer ficheiro synthesis.
pt_br: --no-probe - não tentar procurar qualquer arquivo synthesis.
ro: -no-probe - nu se încearcă găsirea fișierului synthesis.
ru: --no-probe - не искать файл synthesis
sl: --no-probe - brez iskanja datotek synthesis.
sv: --no-probe - försök ej hitta någon synthesis-fil.
tr: --no-probe - herhangi bir sentez dosyası bulmaya çalışma.

source: --distrib - automatically create all media from an installation medium.
ast: --distrib - criar automáticamente tolos preseos dende un mediu d'instalación.
ca: --distrib - automàticament crea tots les fonts des d'una font d'instal·lació.
cs: --distrib - automaticky vytvoří všechny zdroje z instalačního média
cy: --distrib - creu yn awtomatig yr holl gyfrwng o gyfrwng gosod
da: --distrib - opret automatisk alle media fra et installationsmedium.
el: --distrib - αυτόματη δημιουργία όλων των μέσων (media) από ένα μέσο εγκατάστασης.
es: --distrib - crear automáticamente todos los soportes desde un soporte de instalación.
et: --distrib - luuakse automaatselt kõik andmekandjad paigalduskohalt.
eu: --distrib - instalazio-euskarri batetik euskarri guztiak sortzen ditu automatikoki.
fi: --distrib - luo automaattisesti kaikki mediat asennusmedioista.
fr: --distrib - créer automatiquement tous les médias à partir d'un média d'installation.
gl: --distrib - crea automáticamente tódolos soportes dende un soporte de instalación.
he: --distrib - יצירה אוטומטית של כל המקורות מתקליטורי ההתקנה
hu: --distrib - az összes adatforrás létrehozása telepítési adatforrásból
id: --distrib - buat semua media dari media instalasi secara otomatis.
is: --distrib - sjálfvirkt búa til alla miðla frá dreifingarmiðli.
it: --distrib - crea automaticamente tutti i supporti da quello di installazione.
nb: --distrib – opprett automatisk alle medier fra et installasjons- medie.
nl: --distrib - maakt automatisch alle media van een installatiemedium aan.
nn: --distrib – Lag automatisk alle medium frå eit installasjonsmedium.
pl: --distrib - automatycznie tworzy wszystkie nośniki z nośnika instalacyjnego.
pt: --distrib - automaticamente cria todas as médias a partir de uma média de instalação.
pt_br: --distrib - automaticamente cria todas as mídias a partir de uma mídia de instalação.
ro: --distrib - creează automat toate mediile de pe un mediu de instalare.
ru: --distrib - автоматически создать все источники из источника установки
sl: --distrib - samodejno ustvari vse vire iz namestitvenega vira.
sq: --distrib - krijo automatikisht të gjitha burimet nga një burim instalues.
sv: --distrib - skapa automatiskt all media från ett installationsmedia.
tr: --distrib - tüm kurulum kaynaklarını otomatik olarak bir kurulum ortamından oluştur.

source: --interactive - with --distrib, ask confirmation for each media
ast: --interactive - con --distrib, pedir confirmación pa cada preséu
cs: --interactive - spolu s --distrib se zeptá na potvrzení u každého zdroje
cy: --rhyngweithiol - gyda --distrib, gofyn cadarnhad gyda phob cyfrwng
da: --interactive - med --distrib, spøger om bekræftelse for hvert medie
el: --interactive - με --distrib, ρωτά επιβεβαίωση για κάθε μέσο (media)
es: --interactive - con --distrib, pedir confirmación para cada soporte
et: --interactive - koos võtmega --distrib küsitakse kinnitust iga andmekandja puhul
eu: --interactive - , --distrib aukerarekin, eskatu berrespena euskarri bakoitzarentzako
fi: --interactive - kysy varmistusta jokaiselle medialle käytettäessä valitsinta --distrib.
fr: --interactive - avec --distrib, demande confirmation pour chaque média
gl: --interactive - con --distrib, solicita confirmación para cada soporte
hu: --interactive - --distrib esetén: megerősítés kérése minden adatforráshoz
id: --interactive - dengan --distrib, menanyakan konfirmasi untuk setiap media
is: --interactive - með --distrib, biðja um staðfestingu fyrir hvern miðil
it: --interactive - con --distrib, chiede conferma per ogni supporto
nb: --interactive – med --distrib, spør om bekreftelse for hvert medium
nl: --interactive - with --distrib, om bevestiging vragen voor elke media
nn: --interactive – med «--distrib»: Spør om stadfesting for kvart medium.
pl: --interactive - z --distrib, prośba o potwierdzenie dla każdego nośnika
pt: --interactive - com --distrib, pede confirmação para cada média
pt_br: --interactive - com --distrib, pede a confirmação para cada mídia
ro: --interactive - cu --distrib, se cere confirmarea pentru fiecare mediu
ru: --interactive - (вместе с --distrib) ожидать подтверждения для каждого из источников
sl: --interactive - potrjevanje vsakega vira posebej pri uporabi z --distrib
sv: --interactive - med --distrib, begär bekräftelse för varje källa
tr: --interactive - --distirb ile, her kaynak için onaylama sorar.

source: --all-media - with --distrib, add every listed media
ast: --all-media - con --distrib, amestar cada preséu llistáu
cs: --all-media - spolu s --distrib přidá všechny zdroje ze seznamu
cy: --all-media - gyda --distrib, rhestri'r holl gyfrwng ar gael.
da: --all-media - med --distrib, tilføj hvert listede medie
el: --list-media - εμφανίζει τα διαθέσιμα μέσα.
es: --all-media - con --distrib, añadir cada soporte listado
et: --all-media - koos võtmega --distrib lisatakse kõik loetletud andmekandjad.
eu: --all-media - , --distrib aukerarekin, erantsi zerrendatutako euskarri bakoitza
fi: --all-media - lisää kaikki mediat käytettäessä valitsinta --distrib.
fr: --all-media - avec --distrib, ajoute tous les médias listés
gl: --all-media - con --distrib, engade tódolos soportes listados
hu: --all-media - --distrib esetén: minden listázott adatforrás felvétele
id: --all-media - dengan --distrib, menambahkan semua media yang terdaftar
is: --all-media - með --distrib, bæta við öllum listuðum miðlum.
it: --all-media - with --distrib, aggiunge tutti supporti disponibili.
nb: --all-media – med --distrib, legg til alle viste medier
nl: --all-media - met --distrib, elke media in de lijst toevoegen.
nn: --all-media – Med «--distrib»: Legg til alle media.
pl: --all-media - z --distrib, dodaje wszystkie wymienione nośniki
pt: --all-media - com --distrib, adiciona todas as médias listadas
pt_br: --all-media - com --distrib, adiciona todas as mídias listadas
ro: --all-media - cu --distrib, se adaugă toate mediile listate
ru: --all-media - (вместе с --distrib) добавить все перечисленные источники
sl: --all-media - dodaj vse naštete vire pri uporabi z --distrib
sv: --all-media - med --distrib, lägg till alla listade källor
tr: --all-media - --distirb ile, listelenen her kaynağı ekler.

source: --virtual - create virtual media wich are always up-to-date.
ast: --virtual - criar preseos virtuales que siempre tan anovaos.
cs: --virtual - vytvoří virtuální zdroje, které jsou vždy aktuální
cy: --virtual - creu cyfrwng rhithiol sydd wedi ei ddiweddaru,
da: --virtual - opret virtuelt medie som altid er opdateret.
el: --virtual - δημιουργία εικονικών μέσων (media) τα οποία είναι πάντα ενημερωμένα.
es: --virtual - crear soportes virtuales que siempre están actualizados.
et: --virtual - luuakse virtuaalne andmekandja, mis on alati värske.
eu: --virtual - beti eguneratuta dauden euskarri birtualak sortu.
fi: --virtual - luo virtuaalinen media, joka on aina ajantasalla.
fr: --virtual - créer un média virtuel qui est toujours à jour,
gl: --virtual - crear un soporte virtual que sempre está actualizado.
he: --virtual - יצירת מקור וירטואלי שתמיד יהיה עדכני,
hu: --virtual - virtuális, mindig naprakész adatforrás létrehozása.
is: --virtual - búa til sýndarmiðil sem þarf aldrei að uppfæra.
it: --virtual - crea supporti virtuali che sono sempre aggiornati.
nb: --virtual – opprett et virtuelt medie som alltid er oppdatert.
nl: --virtual - maakt virtueel medium aan dat altijd bijgewerkt is.
nn: --virtual – Lag virtuelt medium som alltid er oppdatert.
pl: --virtual - tworzy nośniki, które są zawsze aktualne,
pt: --virtual - cria uma média virtual que está sempre actualizada.
pt_br: --virtual - cria mídias virtuais que estão sempre atualizadas.
ro: --virtual - creează un mediu virtual ce este actualizat permanent.
ru: --virtual - создать виртуальный источник, который всегда является самым актульным
sl: --virtual - ustvari vedno posodobljene navidezne vire.
sv: --virtual - skapa virtuellt media som alltid är uppdaterat
tr: --virtual -her zaman güncel olan sanal bir kaynak oluştur.
