Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: -c - complete output with package to be removed.
ast: -c - completar salida con paquete(s) a desaniciar.
cs: -c - doplnit výstup balíčkem k odebrání
cy: -c - allbwn cyfan a phecyn i'w dynnu
da: -c - færdiggør uddata med pakke der skal fjernes.
el: -c - έξοδος στη γραμμή εντολών με τα ονόματα των πακέτων προς απεγκατάσταση.
es: -c - completar salida con paquete(s) a quitar.
et: -c - täielik väljund eemaldatavate pakettidega.
eu: -c - osatu irteera kendu behar den paketearekin.
fi: -c - täydellinen tuloste poistettavasta paketista.
fr: -c - sortie sur la ligne de commande avec les noms des paquetages à désinstaller.
gl: -c - saída completa co paquete que se vai eliminar.
he: -a - בחירת כל החבילות עם ביטוי מתאים.
hu: -c - teljes információ, az eltávolítandó csomaggal együtt
id: -c - keluaran lengkap dengan paket yang akan dihapus.
is: -c - heildarúttak með pökkum sem á að fjarlægja.
it: -c - risultati completi con i pacchetti da rimuovere.
nb: -c – fullstendig oversikt med pakke som skal fjernes.
nl: -c - complete uitvoer met te verwijderen pakket.
nn: -c – Fullstendig oversikt over pakken som skal fjernast.
pl: -c - zapełnia wyjście pakietami do usunięcia.
pt: -c - listagem completa com os pacotes a ser removidos.
pt_br: -c - lista completa dos pacotes a remover.
ro: -c - afișare în linia de comandă a pachetelor ce vor fi înlăturate.
ru: -c - показать все данные для удаляемого пакета
sl: -c - celoten izpis s paketi za odstranitev.
sq: -c - dalje komplete me pakon që duhet të zhduket.
sv: -c - fullständig utmatning med paketet som ska tas bort.
tr: -c - kaldırılacak paketlerin toplu çıktısı.

source: -g - print groups with name also.
ast: -g - imprentar los grupos xunto colos nomes.
ca: -g - imprimeix grups amb el nom.
cs: -g - vypíše tag skupin společně se jménem
cy: -g - argraffu grwpiau gydag enw hefyd.
da: -g - udskriv også grupper med navn.
el: -g - εμφανίζει τις ομάδες καθώς και το όνομα.
es: -g - imprimir los grupos junto con los nombres.
et: -g - näitab koos nimega ka gruppi.
eu: -g - taldeak ere izenarekin inprimatzen ditu.
fi: -g - tulosta pakettien ryhmät nimien lisäksi.
fr: -g - afficher les groupes ainsi que les noms.
gl: -g - mostra os grupos co seu nome.
he: -g - הצג גם קבוצות עם שם זה.
hu: -g - a névvel együtt a csoportok is jelenjenek meg
id: -g - cetak grup dengan nama.
is: -g - prenta hópa með nafni líka.
it: -g - stampa i gruppi anche col nome.
nb: -g – vis òg grupper også med navn.
nl: -g - toont de groepen ook met namen.
nn: -g – Vis òg grupper med namnet.
pl: -g - wyświetla grupy wraz z ich nazwami.
pt: -g - mostra os grupos com o nome também.
pt_br: -g - imprime grupos, com nome também.
ro: -g - afișează grupurile și cu nume.
ru: -g - показать группы с названиями
sl: -g - izpis skupin skupaj z imenom.
sq: -g - çfaqi grupet njashtu dhe emrat.
sv: -g - visa grupper med namn.
tr: -g - isminin yanında grupları da yazar.

source: -i - print useful information in human readable form.
ast: -i - imprentar información útil en formatu llexible pa les persones.
ca: -i - mostra informació útil en un forma llegible pels humans.
cs: -i - tisk užitečných informací v člověkem čitelné podobě
cy: -i - argraffu gwybodaeth ddefnyddiol mewn ffordd ddarllenadwy i bobl.
da: -i - udskriv nyttig information på læsevenlig form.
el: -i - εμφανίζει χρήσιμες πληροφορίες πιο ευανάγνωστα.
es: -i - imprimir información útil en formato legible para las personas.
et: -i - näitab kasulikku infot ka inimesele arusaadaval kujul.
eu: -i - informazio erabilgarria pertsonek irakurtzeko moduan inprimatzen du.
fi: -i - tulosta hyödyllistä tietoa ihmisen luettavassa muodossa.
fr: -i - afficher les informations utiles de manière plus lisible.
gl: -i - amosa información útil en forma lexible.
he: -i - הדפס מידע שימושי באופן המובן לבני-אנוש.
hu: -i - hasznos információk kiírása könnyen olvasható formában
id: -i - cetak informasi dalam format yang mudah dibaca.
is: -i - prenta nytsamar upplýsingar á læsilegu sniði.
it: -i - mostra informazioni utili in forma leggibile.
nb: -i – vis verdigfull informasjon i lesbart format.
nl: -i - nuttige informatie afdrukken in leesbare vorm.
nn: -i – Vis nyttig informasjon i lettlesbart format.
pl: -i - wyświetla użyteczne informacje w czytelnej formie.
pt: -i - mostra as informações úteis de maneira legível.
pt_br: -i - imprime informações úteis em formato que pode ser lido
ro: -i - afișează informațiile utile într-un mod uman.
ru: -i - показать информацию в удобной для чтения форме
sl: -i - izpis uporabnih informacij v berljivem zapisu.
sv: -i - visa användbar information i en för människan läsbar form.
tr: -i - okunabilir biçimde yararlı bilgiyi yazdırır.

source: -l - list files in package.
ast: -l - llista los ficheros nel paquete.
ca: -l - llista els fitxers del paquet.
cs: -l - vypíše soubory v balíčku
cy: -l - rhestri'r ffeiliau mewn pecyn.
da: -l.. - udskriv filer i pakken.
el: -l - λίστα αρχείων στο πακέτο.
es: -l - lista los archivos en el paquete.
et: -l - näitab faile paketis.
eu: -l - paketeko fitxategiak zerrendatzen ditu.
fi: -l - listaa paketissa olevat tiedostot.
fr: -l - lister les fichiers d'un paquetage.
gl: -l - lista os ficheiros do paquete.
he: -l - הצגת רשימת הקבצים בחבילה.
hu: -l - a csomagban levő fájlok listázása
id: -l - daftar file pada paket.
is: -l - lista skrár í pakka.
it: -l - elenca i file presenti in un pacchetto.
nb: -l – vis oversikt over filer i pakke.
nl: -l - geeft alle bestanden in pakket weer
nn: -l – Vis oversikt over filer i pakken.
pl: -l - wypisuje pliki z pakietu.
pt: -l - lista os ficheiros do pacote.
pt_br: -l - lista os arquivos do pacote.
ro: -l - listează fișierele din pachet.
ru: -l - показать список файлов в пакете
sl: -l - izpis seznama datotek v paketu.
sv: -l - lista filerna i paketet.
tr: --l - paket içindeki dosyaları listeler.

source: -m - equivalent to -du
ast: -m - equivalente a -du.
cs: -m - stejné jako -du
cy: -m - yn cyfateb i -du.
da: -m - Det samme som '-du'.
el: -m - ισοδύναμο του -du
es: -m - equivalente a -du.
et: -m - sama mis -du.
eu: -m - '-du'-ren baliokidea
fi: -m - sama kuin valitsin -du.
fr: -m - équivalent à -du.
gl: -m - equivalente a -du
hu: -m - egyenértékű a -du opcióval
id: -m - ekuivalen dengan -du
is: -m - samsvarar -du
it: -m - equivalente a -du
nb: -m – det samme som -du
nl: -m - gelijkwaardig aan -du
nn: -m – Det same som «-du».
pl: -m - odpowiednik -du
pt: -m - equivalente a -du
pt_br: -m - equivalente a -du
ro: -m - echivalent cu -du
ru: -m - эквивалент -du
sl: -m - isto kot -du
sv: -m - samma som -du
tr: -m - du'nun eşiti.

source: -r - print version and release with name also.
ast: -r - imprentar versión y revisión xunto col nome.
ca: -r - mostra la versió i llançament juntament amb el nom.
cs: -r - společně se jménem vypíše verzi a vydání
cy: -r - argraffu fersiwn a rhyddhad gydag enw hefyd.
da: -r - udskriv også version og udgave med navn.
el: -r - αναλυτική εμφάνιση της έκδοσης και του ονόματος.
es: -r - imprimir versión y revisión junto con el nombre.
et: -r - näitab koos nimega ka versiooni ja väljalaset.
eu: -r - bertsioa eta argitalpena ere izenarekin inprimatzen ditu.
fi: -r - tulosta nimen lisäksi versio ja julkaisu.
fr: -r - afficher la version détaillée ainsi que le nom.
gl: -r - mostra a versión e a edición co seu nome.
hu: -r - a névvel együtt a verzió és a kiadásszám is jelenjen meg
id: -r - cetak versi dan rrilis dengan nama.
is: -r - prenta útgáfu og undirnúmer líka með nafni.
it: -r - mostra versione e release anche col nome.
nb: -r – vis versjonsinformasjon med navn.
nl: -r - geeft de versie en release samen met de naam.
nn: -r – Vis òg versjonsinformasjon med namnet.
pl: -r - wyświetla wersję i wydanie wraz z nazwą.
pt: -r - mostra a versão e o lançamento com o nome também.
pt_br: -r - imprime versão e 'release' com nome também.
ro: -r - afișează versiunea și ediția și cu nume.
ru: -r - показать версию и релиз с названием
sl: -r - izpis različice in izdaje skupaj z imenom.
sq: -r - çfaqe versionin me hollësi, njashtu dhe emrin.
sv: -r - visa version och utgåva med namn.
tr: -r - isminin yanıda sürüm numarasını ve dağıtımını da yazar.

source: -s - next package is a source package (same as --src).
ast: -s - prósimu paquete ye fonte (igual que --src).
ca: -s - el següent paquet és un paquet font (igual que --src).
cs: -s - další balíček je zdrojový (stejné jako --src)
cy: --s - pecyn nesaf yn becyn ffynhonnell (yr un peth â --src).
da: -s - næste pakke er en kildepakke (samme som --src).
el: -s - το επόμενο πακέτο είναι πηγαίο πακέτο (ίδιο με το --src).
es: -s - sig. paquete es paquete fuente (igual que --src).
et: -s - järgmine pakett on lähtetekstipakett (sama, mis --src).
eu: -s - hurrengo paketea iturburu-pakete bat da (--src bezala).
fi: -s - seuraava paketti on lähdekoodipaketti (sama kuin valitsin --src).
fr: -s - le prochain paquetage est un paquetage de sources (identique à --src).
gl: -s - o seguinte paquete é un paquete de fontes (igual ca --src).
he: -s - החבילה הבאה היא חבילת מקור (אותו הדבר כמו --src).
hu: -s - a következő csomag egy forráscsomag (--src opcióval azonos)
id: -s - paket berikut adalah paket sumber (sama dengan --src).
is: -s - næsti pakki er frumkóða-pakki (sama og --src).
it: -s - il prossimo pacchetto è un pacchetto sorgente (uguale a --src).
nb: -s – neste pakke er en kildepakke (samme som --src).
nl: -s - volgend pakket is een bronpakket (zelfde als --src).
nn: -s – Neste pakke er ein kjeldepakke (same som «--src»).
pl: -s - następny pakiet jest pakietem źródłowym (tak jak --src).
pt: -s - o próximo pacote é um pacote fonte (o mesmo que --src).
pt_br: -s - o próximo pacote é um pacote fonte (o mesmo que --src).
ro: -s - pachetul următor este un pachet sursă (identic cu -src).
ru: -s - следующий пакет содержит исходные коды (эквивалент --src)
sl: -s - naslednji paket je paket z izvorno kodo (isto kot --src).
sq: -s - pakoja tjetër është një pako burimi (njëjtë si --src).
sv: -s - nästa paket är ett källpaket (samma som --src).
tr: -s - bir sonraki paket bir kaynak paketidir(--src ile aynı).

source: -u - remove package if a more recent version is already installed.
ast: -u - desaniciar paquete si ya ta instalada una versión más reciente.
ca: -u - elimina el paquet si hi ha instal·lada una versió més nova.
cs: -u - odebere balíček, pokud je již instalována novější verze
cy: -u - tynnu pecyn os oes yna fersiwn mwy diweddar wedi ei osod.
da: -u - fjern pakke hvis en nyere version allerede er installeret.
el: -u - αφαίρεση του πακέτου εάν μια πιο πρόσφατη έκδοση είναι ήδη εγκατεστημένη.
es: -u - quitar paquete si ya está instalada una versión más reciente.
et: -u - eemaldab paketi, kui uuem versioon on juba paigaldatud.
eu: -u - paketea kentzen du bertsio berriagoa instalatuta badago.
fi: -u - poista paketti, jos uudempi versio on jo asennettu.
fr: -u - enlever le paquetage si une version plus récente est déjà installée.
gl: -u - elimina o paquete se xa está instalada unha versión máis nova.
he: -u - הסרת חבילה אם גרסה מאוחרת יותר כבר מותקנת.
hu: -u - csomag kihagyása, ha már van újabb verzió telepítve
id: -u - hapus paket jika versi yang lebih baru telah terinstal.
is: -u - fjarlægja pakka aðeins ef nýrri útgáfa er þegar uppsett.
it: -u - rimuove il pacchetto se una versione più recente è già installata.
nb: -u – fjern pakke hvis nyere versjon allerede er installert.
nl: -u - verwijder pakket als een recentere versie al is geïnstalleerd.
nn: -u – Fjern pakkar viss nyare versjonar allereie er installerte.
pl: -u - usuwa pakiet jeśli jest już zainstalowana lepsza wersja.
pt: -u - remove o pacote se uma versão mais recente já estiver instalada.
pt_br: -u - remove um pacote se uma versão mais atual já estiver instalada.
ro: -u - înlătură pachetul dacă o versiune mai recentă este deja instalată.
ru: -u - удалить пакет, если уже установлена более новая версия
sl: -u - odstrani paket, če je že nameščena novejša verzija.
sq: -u - zhduke pakon nëse një version më i ri është veçse i instaluar.
sv: -u - ta bort paket om en nyare version redan är installerad.
tr: -u - daha güncel bir sürümü yüklü ise paketi kaldır.

source: -y - impose fuzzy search (same as --fuzzy).
ast: -y - forciar gueta difusa (lo mesmu que --fuzzy).
ca: -y - força una cerca difusa (igual que --fuzzy).
cs: -y - vnutit fuzzy vyhledávání (stejné jako --fuzzy)
cy: -y - gosod chwilio fuzzy (fel --fuzzy).
da: -y - gennemfør upræcis søgning (samme som --fuzzy).
el: -y - επιβάλει την αναζήτηση κατά προσέγγιση (ίδιο με --fuzzy).
es: -y - forzar búsqueda difusa (lo mismo que --fuzzy).
et: -y - lubab ebatäpset otsingut (sama, mis --fuzzy).
eu: -y - inposatu hurbilketazko bilaketa (--fuzzy bezala).
fi: -y - käytä epätarkkaa hakua (sama kuin valitsin --fuzzy).
fr: -y - imposer la recherche floue (identique à --fuzzy).
gl: -y - impoñer a busca aproximada (o mesmo ca --fuzzy).
hu: -y - fuzzy keresés használata (--fuzzy opcióval azonos)
id: -y - lakukan pencarian fuzzy (sama dengan --fuzzy).
is: -y - framkvæma loðna leit (sama og --fuzzy).
it: -y - impone una ricerca fuzzy (uguale a --fuzzy).
nb: -y – bruk uklart søk (samme som --fuzzy).
nl: -y - onprecies zoeken gebruiken (zelfde als --fuzzy).
nn: -y – Bruk òg ikkje-ordrett søk (same som «-fuzzy»).
pl: -y - wymusza wyszukiwanie niespójności (tak jak --fuzzy).
pt: -y - impõe uma procura aproximada (o mesmo que --fuzzy).
pt_br: -y - impõe uma busca aproximada (igual a --fuzzy).
ro: -y - impune căutarea aproximativă (identic cu --fuzzy).
ru: -y - поиск на основе нечёткой логики (эквивалент --fuzzy)
sl: -y - uporabi ohlapno iskanje (isto kot --fuzzy).
sq: -y - imponoje një hulumtim të paqartë (njëjtë si --fuzzy).
sv: -y - kräv luddig sökning (samma som --fuzzy).
tr: -y - hatalı aramayı uygulamaya koy ( --fuzzy ile aynı)

source: -Y - like -y, but forces to match case-insensitively.
ast: -Y - como -y, pero fuerza la non distinción ente mayúscules y minúscules.
cs: -Y - jako -y, ale ignoruje velká a malá písmena
cy: -Y - fel -y, ond yn gorfodi cydweddu diffyg cydweddiad maint llythrennau.
da: -Y - som -y, men tvinger matchning uden forske på små og store bogstaver.
el: -Y - όπως το -y, αλλά δεν λαμβάνει υπόψη τον τύπο των χαρακτήρων (κεφαλαία/πεζά).
es: -Y - como -y, pero fuerza la no distinción entre mayúsculas y minúsculas.
et: -Y - nagu -y, aga sunnib sobivusi leidma tõstutundetult.
eu: -Y - -y bezala, baino ez ditu hizki larri/xeheak desberdinduko.
fi: -Y - kuten valinta -y, mutta haku ei ole riippuvainen kirjainten koosta.
fr: -Y - comme -y mais n'est pas sensible à la casse
gl: -Y - coma -y, pero forza que non teña en conta maiúsculas-minúsculas.
he: -Y - כמו -y, אבל מאלץ בדיקה תלויית רישיות.
hu: -Y - mint -y, de a kis- és nagybetűket nem különbözteti meg
id: -Y - seperti -y, tetapi memaksa untuk mencocokan case-insensitif.
is: -Y - eins og -y, en þvingar leit óháð stafastærð.
it: -Y - come -y, ma non distingue maiuscole da minuscole.
nb: -Y – som -y, men ikke skill mellom store og små bokstaver.
nl: -Y - als -y maar let niet op hoofd-/kleine letters.
nn: -Y – som «-y», men ikkje skil mellom store og små bokstavar.
pl: -Y - jak opcja -y, lecz wymusza rozróżnianie wielkości liter.
pt: -Y - como -y, mas força para corresponder sem capitalização.
pt_br: -Y - como -y, ignorando a distinção de maiúscula/minúscula.
ro: -Y - ca și -y, dar insensibil la majuscule.
ru: -Y - эквивалент -y, но без учёта регистра
sl: -Y - kot -y, a ujemanje ne razlikuje med velikimi in malimi črkami.
sv: -Y - som -y, fast tvingar matchning av stora och små bokstäver.
tr: -Y - y'ye benzer; fakat büyük/küçük harf duyarsız olanları eşleştirmeye zorlar.

source: names or rpm files given on command line are queried.
ast: los nomes o ficheros rpm daos en llínia de comandos consultense.
ca: noms o fitxers rpm subministrats en la línia d'ordres seran demanats.
cs: jméno nebo RPM soubory zadané na příkazové řádce, které jsou dotazovány.
cy: bydd enwau neu ffeiliau rpm sy'n cael eu rhoi ar y llinell orchymyn yn cael eu holi.
da: navne eller rpm-filer givne på kommandolinjen bliver forespurgt.
el: εξετάζονται τα ονόματα ή τα αρχεία rpm που δίνονται στη γραμμή εντολών.
es: los nombres o archivos rpm dados en línea de comandos se consultan.
et: päringu esitamine käsureal antud nimede või RPM-failide kohta.
eu: komando-lerroan idatzitako izenak edo rpm fitxategiak kontsultatu dira.
fi: Etsitään komentoriviltä syötetyt nimet tai rpm-paketit.
fr: les noms ou fichiers rpm indiqués sur la ligne de commande sont interrogés.
gl: consúltanse os nomes ou ficheiros rpm dados na liña de comandos.
he: שמות או קובצי RPM שניתנו בשורת הפקודה נמצאים בסימן שאלה.
hu: a parancssorban megadott csomagok illetve RPM-fájlok lesznek lekérdezve
id: nama atau file rpm yang diberikan pada perintah baris dikirimkan.
is: leitað er að nöfnum eða rpm skrám sem skrifaðar eru á skipanalínu.
it: i nomi o i file rpm passati da riga di comando vengono interrogati.
nb: navn eller rpm-filer gitt på kommandolinjem er forespurt.
nl: namen van rpm bestanden opgegeven via console zijn in de wachtrij geplaatst
nn: namn og rpm-filer gjevne på kommandolinja vert førespurd.
pl: żądanie dotyczące nazw lub plików podanych w wierszu poleceń.
pt: são consultados os nomes ou os ficheiros rpm dados na linha de comando.
pt_br: nomes ou arquivos rpm dados na linha de comando são consultados
ro: numele sau fișierele rpm date în linia de comandă sînt interogate.
ru: запрошены имена или rpm-файлы, указанные в командной строке.
sl: iščejo se imena ali datoteke rpm podane preko ukazne vrstice.
sq: emrat apo skedaret rpm të marra në linjën komanduese janë nën hetim.
sv: namn eller rpm-filer som anges på kommandoraden förfrågas.
tr: komut satırından isimleri veya rpm dosyaları verilenler sorgulandı.

source: usage: "urpmq --auto-orphans" with no argument
ast: usu: "urpmq --auto-orphans" ensin argumentos
cs: použití: "urpmq --auto-orphans" bez parametrů
cy: defnydd: "urpmq --auto-orphans" heb ymresymiad
da: brug: "urpmq --auto-orphans" uden argument
el: χρήση: "urpmq --auto-orphans" χωρίς πρόσθετες επιλογές
es: uso: "urpmq --auto-orphans" sin argumentos
et: kasutamine: "urpmq --auto-orphans" ilma argumentideta
eu: erabilera: "urpmq --auto-orphans" argumenturik gabe
fi: Käyttö: "urpmq --auto-orphans" ilman parametreja.
fr: utilisation : "urpmq --auto-orphans" sans argument
hu: használat: "urpmq --auto-orphans" argumentum nélkül
is: notkun: "urpmq --auto-orphans" með engu viðfangi
it: uso: "urpmq --auto-orphans" senza argomenti
nb: bruk: «urpmq --auto-orphans« uten argumenter
nl: gebruik: "urpmq --auto-orphans" zonder argumenten
nn: Bruk: «urpmq --auto-orphans» utan nokon argument
pl: użycie: : "urpmq --auto-orphans" bez argumentów
pt: uso: "urpmq --auto-orphans" sem argumento
pt_br: uso: "urpmq --auto-orphans" sem argumentos
ro: utilizare: „urpmq --auto-orphans” fără argumente
ru: использование: «urpmq --auto-orphans» без аргументов
sl: uporaba: »urpmq --auto-orphans« brez argumentov
sv: användning: "urpmq --auto-orphans" utan några argument
tr: kullanım: "urpmq --auto-orphans" argümansız

source: --list-nodes can only be used with --parallel
ast: --list-nodes namái pueden usase con --parallel
ca: --list-nodes només es pot usar amb --parallel
cs: volbu --list-nodes lze použít pouze s volbou --parallel
cy: dim ond gyda --paralel mae modd defnyddio --list-nodes
da: --list-nodes kan kun bruges med --parallel
el: --list-nodes μπορούν να χρησιμοποιηθούν μόνο με --parallel
es: --list-nodes sólo se puede utilizar con --parallel
et: võtit --list-nodes saab kasutada ainult koos võtmega --parallel
eu: --nodo-zerrendak honekin bakarrik erabil daitezke: --parallel
fi: Valitsinta --list-nodes voidaan käyttää vain valitsimen --parallel kanssa
fr: --list-nodes peut seulement être utilisé avec --parallel
gl: --list-nodes só se pode usar con --parallel
he: --list-nodes ניתן לשימוש רק עם --parallel
hu: a --list-nodes csak a --parallel opcióval használható
id: --list-nodes hanya dapat dipakai dengan --parallel
is: --list-nodes er aðeins hægt að nota með --parallel
it: --list-nodes può essere usato solo con --parallel
nb: Kan bare bruke --list-nodes med --parallel
nl: --list-nodes kan alleen worden gebruikt met --parallel
nn: Kan berre bruka «--list-nodes« saman med «--parallel».
pl: --list-nodes może być użyta tylko z opcją --parallel
pt: --list-nodes pode apenas ser usada com a opção --parallel
pt_br: --list-nodes só pode ser usado com --parallel
ro: --list-nodes poate fi folosit numai cu --parallel
ru: --list-nodes может использоваться только с --parallel
sl: --list-nodes je lahko uporabljeno samo s --parallel
sq: --liste-nodes mund të përdoret vetëm me --parallel
sv: --list-nodes kan endast användas med --parallel
tr: --list-nodes sadece --parallel ile kullanılabilir

source: use -l to list files
ast: usa -l pa llistar los ficheros
cs: použijte -l pro seznam souborů
cy: defnyddiwch -l i restru'r ffeiliau
da: brug -l for at liste filer
el: χρησιμοποίησε το -l για να δεις μια λίστα με τα αρχεία
es: use -l para listar los archivos
et: faililoendi nägemiseks kasutage võtit -l
eu: erabili -l fitxategiak zerrendatzeko
fi: Valitsin -l listaa paketin tiedostot
fr: utilisez -l pour lister les fichiers
gl: use -l para listar os ficheiros
hu: használja a -l opciót a fájllistához
is: nota -l til a að lista skrár
it: utilizza -l per elencare i file
nb: bruk -l for å vise filer
nl: gebruik -l om bestanden op te sommen
nn: Bruk «-l» for å visa filer.
pl: użyj opcji -l aby wyświetlić listę plików
pt: use -l para listar ficheiros
pt_br: use -l para listar arquivos
ro: utilizați -l pentru afișarea fișierelor
ru: используйте -l для вывода списка файлов
sl: uporabite -l za izpis seznama datotek
sv: använd -l för att lista filer
tr: dosyaları listelemek için -l kullanın
