Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --debug - very verbose mode.
ast: --debug - mou informativu.
cs: --debug - velmi užvaněný režim
cy: - --debug - modd llafar iawn.
da: --debug - meget udførlig tilstand.
el: --debug - περισσότερο αναλυτική λειτουργία.
es: --debug - modo muy informativo.
et: --debug - väga jutukas režiim.
eu: --debug - oso modu berritsua.
fi: --debug - erittäin yksityiskohtainen tyyli.
fr: --debug - mode de déboguage.
gl: --debug - modo moi detallado.
he: --debug - מצב עם פלט רב.
hu: --debug - nagyon részletes információ.
is: --debug - mjög mikið ítarlegri hamur
it: --debug - modalità molto prolissa.
nb: --debug – veldig utfyllende tilbakemeldinger.
nl: --debug - 'zeer uitgebreid verslag'-modus.
nn: --debug – Veldig mange utvida meldingar.
pl: --debug - tryb bardzo komunikatywny..
pt: --debug - modo muito detalhado.
pt_br: --debug - modo muito detalhado.
ro: --debug - mod detaliat.
ru: --debug - очень подробный режим
sl: --debug - zelo zgovoren način.
sv: --debug - väldigt utförligt läge.
tr: --debug - oldukça kalabalık kip.

source: names or rpm files given on command line will be installed.
ast: instalaránse los nomes o ficheros rpm daos en llínia de comandos.
ca: els noms o fitxers rpm subministrats en la línia d'ordres seran instal·lats.
cs: názvy nebo RPM soubory zadané na příkazové řádce budou instalovány
cy: bydd enwau neu ffeiliau rpm sy'n cael eu rhoi ar y llinell orchymyn yn cael eu gosod.
da: navne eller rpm-filer givne på kommandolinjen vil blive installeret.
el: τα ονόματα ή τα αρχεία rpm που δόθηκαν στην γραμμή εντολών θα εγκατασταθούν.
es: se instalan los nombres o archivos rpm dados en línea de comandos.
et: paigaldatakse käsureal antud nimed või RPM-failid.
eu: komando-lerroan idatzitako izenak edo rpm fitxategiak instalatuko dira.
fi: komentoriviltä syötetyt nimet tai rpm-tiedostot asennetaan.
fr: les noms ou les fichiers rpm donnés en ligne de commande seront installés.
gl: nomes ou ficheiros rpm dados na liña de comandos instalaranse.
he: שמות או קובצי RPM שניתנו בשורת הפקודה יותקנו.
hu: a parancssorban megadott csomagok illetve RPM-fájlok lesznek telepítve
id: nama atau file rpm yang tertera pada perintah baris akan diinstal.
is: nöfn eða rpm skrár sem eru tilgreindar á skipanalínunni verða sett inn.
it: i nomi o file rpm passati da riga di comando verranno installati.
nb: navn eller rpm-filer angitt på kommandolinja vil bli installert.
nl: namen of rpm bestanden gegeven via opdrachtregel worden geïnstalleerd.
nn: Namn og rpm-filer valt på kommandolinja vert installerte.
pl: nazwy lub pliki rpm podane w wierszu poleceń zostaną zainstalowane.
pt: os nomes ou os ficheiros rpm dados na linha de comando irão ser instalados.
pt_br: nomes ou arquivos rpm dados na linha de comando serão instalados.
ro: numele sau fișierele rpm date în linia de comandă vor fi instalate.
ru: будут установлены имена или rpm-файлы, указанные в командной строке
sl: imena ali datoteke rpm podane v ukazni vrstici bodo nameščene.
sq: emrat apo skedaret rpm në linjën komanduese do të instalohen.
sv: namn eller rpm-filer som anges på kommandoraden installeras.
tr: komut satırından isimleri veya rpm dosyaları verilenler yüklenecek.

source: Error: can't use --auto-select along with package list.
ast: Fallu: nun puede usase --auto-select xunto cola llista de paquetes.
cs: Chyba: nelze použít --auto-select spolu se seznamem balíčků.
cy: Gwall: methu defnyddio --auto-select ynghyd â'r rhestr pecynnau.
da: Fejl: Kan ikke bruge 'auto-select' sammen med pakkeliste.
el: Σφάλμα: αδύνατη η χρήση του --auto-select παράλληλα με τη λίστα πακέτων.
es: Error: no se puede usar --auto-select junto con la lista de paquetes.
et: Viga: võtit --auto-select ei saa kasutada koos pakettide loendiga.
eu: Akatsa: ezin da erabili -auto-select pakete zerrendarekin.
fi: Virhe: valitsinta --auto-select ei voi käyttää pakettilistan kanssa.
fr: Erreur : options --auto-select et la liste de paquetages incompatibles.
gl: Erro: non se pode usar --auto-select cunha lista de paquetes.
hu: Hiba: --auto-select csomaglistával együtt nem használható.
id: Kesalahan: Tidak bisa menggunakan --auto-select bersama dengan daftar paket.
is: Villa: get ekki notað --auto-select með pakkalista.
it: Errore : non si può usare l'opzione --auto-select e fornire la lista dei pacchetti.
nb: Feil: kan ikke bruka auto-select sammen med pakkeliste.
nl: Fout: kan --auto-select niet gebruiken samen met pakketlijst.
nn: Feil: Kan ikkje bruka «auto-select» saman med pakkeliste.
pl: Błąd: nie można użyć opcji --auto-select z listą pakietów.
pt: Erro: não é possível usar --auto-select com a lista de pacotes.
pt_br: Erro: não se pode usar --auto-select com uma lista de pacotes.
ro: Eroare: nu se poate utiliza --auto-select împreună cu lista de pachete.
ru: Ошибка: параметр --auto-select нельзя использовать вместе со списком пакетов.
sl: Napaka: uporaba --auto-select skupaj s seznamom paketov ni možna.
sv: Fel: kan inte använda --auto-select samtidigt som en fil-lista.
tr: Hata: Paket listesi boyunca --auto-select parametresi kullanılamaz.

source: Error: To generate a bug report, specify the usual command-line arguments along with --bug.
ast: Fallu: pa xenerar un informe de fallos, especifica los argumentos usuales de la llínia de comandos, xunto con --bug.
cs: Chyba: Chcete-li vygenerovat hlášení o chybě, zadejte obvyklé parametry na příkazovém řádku a přidejte parametr --bug.
cy: Gwall: I gynhyrchu adroddiad gwall, nodwch yr ymresymiad llinell orchymyn arferol ynghyd a --bug.
da: Fejl: For at generere en fejlrapport skal du specificere de almindelige kommandolinjeargumenter med --bug.
el: Σφάλμα: Για την δημιουργία αναφοράς bug, καθορίστε τους ορισμούς της γραμμής εντολών με το --bug.
es: Error: para generar un reporte de errores, especifique los argumentos usuales de la línea de comandos, junto con --bug.
et: Viga: vearaporti loomiseks kasutage koos võtmega --bug tavalisi käsureaargumente.
eu: Akatsa: akats txosten bat sortzeko, zehaztu komando-lerroko ohiko argumentuak --bug argumentuarekin batera.
fi: Virhe: Virheraportin luomiseksi suorita sama komento uudelleen valitsimen --bug kanssa.
fr: Erreur : pour générer un rapport d'anomalie, précisez les arguments de la ligne de commande accompagnés de --bug.
gl: Erro: Para xerar un informe de erro, especifique os argumentos de liña de comandos normais xunta con --bug.
hu: Hiba: hibajelentés készítéséhez adja meg a szokásos parancssori argumentumokat a --bug opcióval együtt.
id: Kesalahan: Untuk menghasilkan laporan kesalahan, tentukan argumen perintah baris bersamaan dengan --bug.
is: Villa: Til að búa til villutilkynningu, tilgreindu venjuleg viðföng skipanalínu ásamt --bug.
it: Errore, per generare un bug report devi aggiungere all'inizio della riga di commando --bug.
nb: Feil: For å lage en feilrapport, angi de vanlige kommandolinjeargumentene med --bug.
nl: Fout: Om een programmafoutrapport te genereren, geeft u de gebruikelijke opdrachtregel-argumenten samen met --bug.
nn: Feil: For å laga ein feilrapport kan du bruka dei vanlege kommandolinjeargumenta, og så leggja til «--bug».
pl: Błąd: aby wygenerować raport o błędzie, określ argumenty linii poleceń i dodaj opcję --bug.
pt: Erro: para gerar um relatório de erros, indique os argumentos de linha de comando usuais com --bug.
pt_br: Erro: Para gerar um bugreport, especifique a linha de comando com os parâmetros usuais e acrescente --bug.
ro: Eroare: Pentru raportarea unei erori, specificați argumentele uzuale din consolă împreună cu --bug.
ru: Ошибка: чтобы создать отчёт об ошибке, нужно указать обычные аргументы командной строки вместе с параметром --bug.
sl: Napaka: Za ustvarjanje poročila o hrošču uporabite iste argumente ukazne vrstice kot ponavadi skupaj z --bug.
sv: Fel: För att skapa felrapport, använd samma argument som tidigare och lägg till --bug.
tr: Hata: Hata raporu oluşturmak için, kullanılan parametleri --bug parametresiyle çalıştırın.

source: You can't install binary rpm files when using --install-src
ast: Nun puen instalase ficheros rpm binarios cuando s'usa --install-src
cs: Při použití --install-src nelze instalovat binární RPM balíčky
cy: Methu gosod ffeiliau deuaidd rpm wrth ddefnyddio --install-src
da: Du kan ikke installere binære rpm-filer ved brug af --install-src
el: Δεν μπορείτε να εγκαταστήσετε δυαδικά αρχεία rpm όταν χρησιμοποιείτε --install-src
es: No puede instalar archivos rpm binarios utilizando --install-src
et: Binaarseid RPM-faile ei saa paigaldada võtme --install-src kasutamisel
eu: Ezin dituzu rpm fitxategi bitarrak instalatu --install-src erabilita
fi: Binääripaketteja ei voida asentaa käytettäessä valitsinta --install-src
fr: Installation de paquetages binaires impossible avec l'option --install-src
gl: Non pode instalar ficheiros rpm de binarios cando usa --install-src
hu: Nem telepíthet bináris RPM-fájlokat, ha --install-src van megadva
id: Anda tidak bisa menginstall file rpm biner ketika menggunakan --install-src
is: Þú getur ekki sett inn vélamáls-rpm pakka þegar notað er --install-src
it: Non puoi installare rpm binari quando si usa --install-src
nb: Du kan ikke installere binære rpm-filer når --install-src brukes
nl: U kunt geen binaire rpm-bestanden installeren wanneer u --install-src gebruikt
nn: Du kan ikkje installera binærpakkar med «--install-src».
pl: Nie można instalować pakietów binarnych przy włączonej opcji --install-src
pt: Não pode instalar ficheiros rpm binários quando usar --install-src
pt_br: Você não pode instalar arquivos rpm binários ao usar --install-src
ro: Nu se pot instala fișierele rpm binare cînd se folosește --install-src
ru: При использовании параметра --install-src нельзя устанавливать бинарные rpm-файлы
sl: Ob uporabi --install-src ne morete nameščati binarnih paketov rpm.
sv: Du kan inte installerabinära RPM-filer när -install-src används
tr: --install-src parametresi kulanılırken ikili rpm dosyalarını kuramazsınız.

source: You can't install spec files
ast: Nun pueden instalase ficheros spec
cs: Nelze instalovat spec soubory
cy: Nid oes modd gosod ffeiliau spec
da: Du kan ikke installere spec-filer
el: Δεν μπορείς να εγκαταστήσεις αρχεία προδιαγραφών (spec)
es: No puede instalar archivos spec
et: Spetsifikatsioonifaile ei saa paigaldada
eu: Zuk ezin dituzu 'spec' fitxategiak instalatu
fi: Spec-tiedostoja ei voi asentaa
fr: Vous ne pouvez pas installer des fichiers spec
gl: Non pode instalar ficheiros spec
hu: Nem telepíthet spec-fájlokat
is: Þú getur ekki sett inn spec skrár
it: Non puoi installare i file spec
nb: Du kan ikke installere spec-filer
nl: U kunt geen spec-bestanden installeren
nn: Du kan ikkje installera spec-filer.
pl: Instalacja plików spec była niemożliwa
pt: Não pode instalar ficheiros spec
pt_br: Você não pode instalar arquivos spec
ro: Nu puteți instala fișierele spec
ru: Вы не можете установить файл spec
sl: Namestitev datotek spec ni možna
sv: Du kan inte installera spec-filer
tr: spec dosyalarını kuramazsınız.

source: defaulting to --buildrequires
ast: asumiendo --buildrequires
cs: použije se --buildrequires
cy: rhagosod --buildrequires
da: Normalt er dette --buildrequires
el: αντιστοίχηση στο --buildrequires
es: asumiendo --buildrequires
et: vaikimisi rakendatakse võtit --buildrequires
eu: lehenetsia --buildrequires
fi: Oletetaan, että tarkoitus on käyttää valitsinta --buildrequires
fr: repli vers --buildrequires
hu: alapértelmezésben --buildrequires
is: fell sjálfkrafa í "--buildrequires"
it: impostata --buildrequires come opzione predefinita
nb: faller tilbake til --buildrequires
nl: terugvallen op --buildrequires
nn: Brukar standardvalet --buildrequires
pl: domyślnie z opcją --buildrequires
pt: a predefinir para --buildrequires
pt_br: padrão para --buildrequires
ro: revenire implicită la --buildrequires
ru: умолчания для --buildrequires
sl: Uporabljanje privzetega --buildrequires
sv: använder --buildrequires
tr: --buildrequires parametresine varsayılan

source: please use --buildrequires or --install-src, defaulting to --buildrequires
ast: por favor, usa --buildrequires o --install-src, asumiendo --buildrequires
cs: použijte prosím --buildrequires nebo --install-src, použije se --buildrequires
cy: defnyddiwch --buildrequires neu --install-src, yn rhagosod i --buildrequires
da: brug --buildrequires eller --install-src, forvalgt er --buildrequires
el: παρακαλώ χρησιμοποιήστε --buildrequires ή --install-src, από προεπιλογή --buildrequires
es: por favor, use --buildrequires o --install-src, asumiendo --buildrequires
et: palun kasutage võtit --buildrequires või --install-src, vaikimisi rakendatakse võtit --buildrequires
eu: mesedez erabili --buildrequires edo --install-src, lehenetsia --buildrequires
fi: Käytä valitsimia --buildrequires tai --install-src. Oletetaan, että tarkoitus on käyttää valitsinta --buildrequires
fr: merci d'utiliser --buildrequires ou --install-src, par défaut --buildrequires
hu: használja a --buildrequires vagy --install-src opciót, alapértelmezés: --buildrequires
is: notið --buildrequires eða --install-src, sjálfgefið --buildrequires
it: bisogna usare --buildrequires (predefinito) o --install-src
nb: vær vennlig å bruke --buildrequires eller --install-src, faller tilbake til --buildrequires
nl: gebruik a.u.b. --buildrequires of --install-src, gaat uit van --buildrequires
nn: Bruk «--buildrequires» eller «--install-src». Standard er «--buildrequires».
pl: użyj opcji --buildrequires lub --install-src, domyślna opcja to --buildrequires
pt: por favor use --buildrequires ou --install-src, predefinição para --buildrequires
pt_br: favor usar --buildrequires ou --install-src, preferencialmente --buildrequires
ro: utilizați --buildrequires sau --install-src, revenire implicită la --buildrequires
ru: используйте параметр --buildrequires или --install-src (по умолчанию используется --buildrequires)
sl: uporabite --buildrequires ali --install-src, ki privzema --buildrequires
sv: vänligen använd --buildrequires eller --install-src, använder --buildrequires som standard
tr: Lütfen, --buildrequires parametresine varsayılan olması için, --buildrequires veya --install-src parametrelerini kullanın.

source: Directory [%s] already exists, please use another directory for bug report or delete it
ast: El direutoriu [%s] ya esiste, por favor usa otru direutoriu pa informar fallos o esbórralu
ca: El directori [%s] ja existeix, si us plau usa un altre directori per l'informe d'error o esborra'l
cs: Adresář [%s] již existuje, použijte prosím pro hlášení o chybě jiný adresář nebo jej odstraňte
cy: Mae cyfeiriadur (%s) yn bodoli eisoes, defnyddiwch gyfeiriadur arall am adroddiad gwall neu ei ddileu.
da: Kataloget [%s] eksisterer allerede, brug venligst et andet katalog til fejlrapporten, eller slet det
el: Ο κατάλογος [%s] υπάρχει ήδη, παρακαλώ χρησιμοποιήστε ένα διαφορετικό κατάλογο για να αναφορά σφάλματος ή διαγράψτε το
es: El directorio [%s] ya existe, por favor use otro directorio para reportar errores o bórrelo
et: Kataloog [%s] on juba olemas, palun kasutage vearaportideks muud kataloogi või kustutage see
eu: [%s] direktorioa badago lehendik, erabili beste direktorio bat akatsen berri emateko edo ezabatu
fi: Hakemisto [%s] on jo olemassa. Valitse toinen hakemisto virheraportille tai poista se
fr: Le répertoire [%s] existe déjà, merci d'en utiliser un autre pour le rapport d'anomalie, ou de l'effacer.
gl: O directorio [%s] xa existe, use outro directorio para a comunicación de erros ou elimíneo
he: הספרייה [%s] כבר קיימת, עליך לבחור ספרייה אחרת לדיווח על תקלה או למחוק אותה
hu: "%s" nevű könyvtár már létezik. Használjon más könyvtárt a hibajelentéshez, vagy pedig törölje.
id: Direktori [%s] sudah ada, silahkan gunakan direktori lain untuk laporan bug atau hapus
is: Mappan [%s] er þegar til, vinsamlega notið aðra möppu fyrir villutilkynningu eða eyðið möppunni
it: La directory [%s] esiste già. Usa un'altra directory per i bug report o cancellala
nb: Mappa [%s] finnes allerede, bruk en annen mappe for feilrapportering, eller slett den
nl: De map [%s] bestaat reeds, gebruik een andere map voor het foutrapport of verwijder hem
nn: Mappa [%s] finst allerie. Bruk ei anna mappe for feilrapport, eller slett denne.
pl: Katalog [%s] już istnieje, użyj innego katalogu do zgłoszenia błędu lub go usuń
pt: O directório [%s] já existe, por favor use outro para reportar erros ou apague-o
pt_br: Diretório [%s] já existe, favor usar outro diretório para reportar o problema ou apague-o
ro: Directorul [%s] există deja, utilizați un alt director pentru raportarea erorilor sau ștergeți-l
ru: Каталог [%s] уже существует, используйте другой каталог для отчёта об ошибке или удалите его
sl: Mapa [%s] že obstaja. Uporabite drugo mapo za poročilo o napaki ali pa jo zbrišite
sv: Katalogen [%s] finns redan, välj en annan katalog för felrapport eller radera den
tr: [%s] dizini zaten var. Lütfen hata raporlaması için bir başka dizin kullanın ya da bunu silin.

source: Unable to create directory [%s] for bug report
ast: Nun puede criase'l direutoriu [%s] pa informar de fallos
ca: No s'ha pogut crear el directori [%s] per a l'informe d'errors
cs: Nelze vytvořit adresář [%s] pro uložení hlášení o chybě
cy: Methu creu cyfeiriadur (%s) ar gyfer adroddiad gwall
da: kunne ikke oprette katalog [%s] til fejlrapport
el: αδυναμία δημιουργίας καταλόγου [%s] για την αναφορά σφάλματος
es: No se puede crear el directorio [%s] para reporte de bugs
et: Kataloogi [%s] loomine vearaportideks nurjus
eu: Ezin da erroreen berri emateko [%s] direktorioa sortu
fi: Virheraportille tarkoitettua hakemistoa [%s] ei voida luoda
fr: Impossible de créer le répertoire [%s] pour le rapport d'anomalie
gl: Non foi posible crear o directorio [%s] para a comunicación de erros
he: יצירת הספרייה. [%s] עבור דיווחי תקלות נכשלה
hu: A következő könyvtárnak a hibajelentés céljából való létrehozása sikertelen: "%s"
id: gagal membuat direktori [%s] untuk laporan bug
is: Get ekki búið til möppu [%s] fyrir villu-tilkynningu
it: Impossibile creare una directory [%s] per un bug report
nb: Kan ikke opprette mappa [%s] for feilrapport
nl: Kon directory [%s] niet aanmaken voor programmafoutrapport
nn: Klarte ikkje laga mappe [%s] for feilrapport.
pl: nie można utworzyć katalogu [%s] dla raportu o błędach
pt: Não é possível criar o directório [%s] para reportar erros
pt_br: Incapaz de criar o diretório [%s] para relatório de falhas
ro: Nu se poate crea directorul [%s] pentru raportul de erori
ru: Не удаётся создать каталог [%s] для отчёта об ошибке
sl: Ustvarjanje mape [%s] za poročilo o napaki ni možno
sq: I pa mundur krijimi i repertorit [%s] për raport të bug(it)
sv: Kunde inte skapa katalog [%s] för felrapport
tr: [%s] dizini hata raporu için oluşturulamıyor

source: Error: %s appears to be mounted read-only. Use --allow-force to force operation.
ast: Fallu: %s paez tar montáu como namái llectura. Usa --allow-force pa forciar la operación
cs: Chyba: %s vypadá, že je připojen pouze ke čtení. Použijte --allow-force, chcete-li operaci provést.
cy: Gwall: %s i weld wedi ei osod fel darllen yn unig. Defnydd --allow-force gorfodaeth i orfodi gweithred.
da: Fejl: %s ser ud til at være monteret kun læsbart. Brug --allow-force for at gennemtvinge handlingen.
el: Σφάλμα: το %s φαίνεται να είναι προσαρτημένο μόνο για ανάγνωση. Χρησιμοποίησε το --allow-force για να εξαναγκάσεις τη λειτουργία.
es: Error: %s parece estar montado como sólo lectura. Use --allow-force para forzar la operación
et: Viga: %s paistab olevat haagitud ainult loetavana. Kasutage operatsiooni pealesundimiseks võtit --allow-force.
eu: Akatsa: %s irakurri-soilik muntatu dela dirudi. Erabili --allow-force eragiketa behartzeko.
fi: Virhe: %s näyttää olevan liitettynä ainoastaan lukuoikeuksin. Käytä valitsinta --allow-force pakottaaksesi toiminnon.
fr: Erreur : %s semble être monté en lecture seule. Utilisez --allow-force afin de forcer l'opération.
gl: Erro: semella que %s se montou coma de só lectura. Use --allow-force para forzar a operación.
he: שגיאה: נראה ו-%s עוגן לקריאה בלבד. עליך להשתמש ב --allow-force לאלץ פעולה זו.
hu: Hiba: úgy tűnik, hogy "%s" csak olvasható módon lett csatolva. Ha mégis végre kívánja hajtani a műveletet, használja a --allow-force opciót.
id: Kesalahan: %s tampaknya di-mount sebagai read-only. Gunakan --allow-force untuk memaksa operasi.
is: Villa: %s virðist vera tengt aðeins til lestrar. Notaðu --allow-force til að þvinga aðgerð.
it: Errore: %s sembra montato in sola lettura. Usa --allow-force per forzare l'operazione.
nb: Feil: %s ser ut til å være montert skrivebeskyttet. Bruk --allow-force for å tvinge operasjonen.
nl: Fout: %s lijkt als alleen-lezen gekoppeld te zijn. Gebruik --allow-force om de opdracht te forceren.
nn: Feil: %s ser ut til å vera montert som skriveverna. Bruk «--allow-force» for å tvinga gjennom operasjonen.
pl: Błąd: wygląda na to, że %s został zamontowany tylko w trybie do odczytu. Użyj opcji --allow-force aby wymusić działanie.
pt: Erro: %s parece estar montado apenas como leitura. Use --allow-force para forçar a operação.
pt_br: Erro: %s parece estar montado apenas como leitura. Usar --allow-force para forçar a operação.
ro: Eroare: %s pare să nu permită scrierea. Utilizați --allow-force pentru forțarea operației.
ru: Ошибка: похоже, что %s примонтирован только для чтения. Используйте --allow-force для принудительного выполнения операции.
sl: Napaka: izgleda, da je %s priklopljen v (samo) bralnem načinu. Uporabite --allow-force, da prisilite izvedbo operacije.
sv: Fel: %s verkar vara monterad som read-only. Använd --allow-force för att tvinga operationen.
tr: Hata: %s salt okunur bağlanmış gözüküyor. İşlemi zorlamak için --allow-force parametresini kullanın.

source: %s: %s (to upgrade)
ast: %s: %s (p'anovar)
ca: %s: %s (a actualitzar)
cs: %s: %s (k aktualizaci)
cy: %s: %s (uwchraddio)
da: %s: %s (skal opgraderes)
el: %s: %s (προς αναβάθμιση)
es: %s: %s (para actualizar)
et: %s: %s (uuendus)
eu: %s: %s (eguneratu)
fi: %s: %s (päivitettävä)
fr: %s : %s (à mettre à jour)
gl: %s: %s (para actualizar)
he: %s: %s (לשדרג)
hu: %s: %s (frissítés)
id: %s: %s (untuk upgrade)
is: %s: %s (til að uppfæra)
it: %s: %s (da aggiornare)
nb: %s: %s (å oppgradere)
nl: %s: %s (op te waarderen)
nn: %s: %s (oppgradering)
pl: %s: %s (do aktualizacji)
pt: %s: %s (para actualizar)
pt_br: %s: %s (para atualizar)
ro: %s: %s (de actualizat)
ru: %s: %s (для обновления)
sl: %s: %s (za nadgradnjo)
sv: %s: %s (för att uppdatera)
tr: %s: %s (yükseltme için)

source: %s (to upgrade)
ast: %s (p'anovar)
ca: %s (a actualitzar)
cs: %s (k aktualizaci)
cy: %s (uwchraddio)
da: %s (skal opgraderes)
el: %s (προς αναβάθμιση)
es: %s (para actualizar)
et: %s (uuendus)
eu: %s (eguneratu)
fi: %s (päivitettävä)
fr: %s (à mettre à jour)
gl: %s (para actualizar)
he: %s (לשדרג)
hu: %s (frissítés)
id: %s (untuk upgrade)
is: %s (til að uppfæra)
it: %s (da aggiornare)
nb: %s (å oppgradere)
nl: %s (op te waarderen)
nn: %s (oppgradering)
pl: %s (do aktualizacji)
pt: %s (para actualizar)
pt_br: %s (para atualizar)
ro: %s (de actualizat)
ru: %s (для обновления)
sl: %s (za nadgradnjo)
sv: %s (för att uppdatera)
tr: %s (yükseltme için)
