Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --force - force invocation even if some packages do not exist.
ast: --force - fuerza invocación anque nun heba dellos paquetes.
ca: --force - força l'execució tot i que hi hagi paquets que no existeixen.
cs: --force - spustí program i v případě, že některé balíčky chybí
cy: --force - gorfodi galwad hyd yn oed os na yw rhai pecynnau'n bodoli.
da: --force - gennemfør kald selv om nogen pakker ikke eksisterer.
el: --force - εξαναγκασμός επίκλησης ακόμα και εάν μερικά πακέτα δεν υπάρχουν.
es: --force - forzar invocación aunque no existan algunos paquetes.
et: --force - käivitatakse ka siis, kui mõnda nõutud paketti ei ole olemas.
eu: --force - deitzea behartzen du, nahiz eta pakete batzuk ez egon.
fi: --force - pakota asennus, vaikka joitakin paketteja puuttuu.
fr: --force - forcer l'invocation même si certains paquetages n'existent pas.
gl: --force - forzar a invocación incluso se algún paquete non existe.
he: --force - אלץ הפעלה גם אם חלק מהחבילות חסרות.
hu: --force - végrehajtás akkor is, ha néhány csomag nem elérhető
id: --force - paksa instal meski beberapa paket tidak ada.
is: --force - þvinga uppsetningu þó sumir pakkar séu ekki til.
it: --force - forza l'esecuzione anche se alcuni pacchetti non esistono.
nb: --force – tving gjennomføring selv om noen pakker ikke finnes.
nl: --force - aanroep forceren zelfs als sommige pakketten niet bestaan.
nn: --force – Tving gjennomføring sjølv om ikkje alle pakkar finst.
pl: --force - wymusza wywoływanie nawet przy braku niektórych pakietów.
pt: --force - força a execução mesmo que alguns pacotes não existam.
pt_br: --force - força mesmo se alguns pacotes não existem.
ro: --force - forțează invocarea chiar dacă unele pachete nu există.
ru: --force - принудительно выполнить, даже если некоторые пакеты не существуют
sl: --force - prisili akcijo celo, če nekateri paketi ne obstajajo.
sq: --force - kërkim i forcuar edhe pse disa pako nuk ekzistojnë.
sv: --force - tvinga användning även om vissa paket inte finns.
tr: --force - bazı paketlerin bulunamama durumda bile işlemin devamına zorla.

source: --verify-rpm - verify rpm signature before installation (--no-verify-rpm disables it, default is enabled).
ast: --verify-rpm - verifica la robla del rpm enantes de la instalación (--no-verify-rpm desactívalu, activáu ye lo predeterminao).
ca: --verify-rpm - verifica la signatura rpm abans de la instal·lació (--no-verify-rpm la deshabilita, per defecte està habilitat)
cs: --verify-rpm - zkontroluje před instalací podpis balíčku RPM (volba --no-verify-rpm toto vypne, jinak povoleno)
cy: --verify-rpm - gwirio llofnod rpm cyn gosod (--no-verify-rpm analluogi, galluogi yw'r rhagosodedig).
da: --verify-rpm - kontrollér rpm-signatur før installation. (--no-verify-rpm deaktiverer det, standard er aktiveret).
el: --verify-rpm - έλεγχος της υπογραφής του rpm πριν την εγκατάσταση (--no-verify-rpm για απενεργοποίηση, ενεργοποιημένο από προεπιλογή).
es: --verify-rpm - verifica la firma del rpm antes de la instalación. (--no-verify-rpm lo deshabilita, habilitado por defecto.).
et: --verify-rpm - kontrollib RPM-i signatuuri enne paigaldust (--no-verify-rpm tühistab selle, vaikimisi on sees).
eu: --verify-rpm - egiaztatu rpm sinadura instalatu aurretik (--no-verify-rpm ezgaitzeko, era lehenetsian gaituta dago).
fi: --verify-rpm - varmista paketin allekirjoitus ennen asennusta (oletuksena käytössä, --no-verify-rpm poistaa käytöstä).
fr: --verify-rpm - vérifier la signature du rpm avant l'installation (--no-verify-rpm le désactive, activé par défaut).
gl: --verify-rpm - verificar a sinatura do rpm antes de instalalo (--no-verify-rpm desactívaa, por defecto está activada).
he: --verify-rpm - בדוק את חתימת החבילה לפני ההתקנה (--no-verify-rpm מבטל זאת, ברירת המחדל היא להפעיל").
hu: --verify-rpm - RPM-aláírás ellenőrzése telepítés előtt (kikapcsolás: --no-verify-rpm; alapértelmezés: bekapcsolt állapot)
id: --verify-rpm - verifikasi tandatangan rpm sebelum installasi (--no-verify-rpm menonaktifkannya, defaultnya aktif).
is: --verify-rpm - staðfesta rpm undirskriftir áður en pakkar eru uppsettir (--no-verify-rpm aftengir, sjálfgefið er að athuga pakka).
it: --verify-rpm - verifica la firma del pacchetto prima dell'installazione (--no-verify-rpm la disabilita, solitamente è abilitata).
nb: --verify-rpm – kontroller rpm-signatur før installering (--no-verify-rpm for å ikke kontrollere, standardvalget er påslått.
nl: --verify-rpm - rpm-handtekening verifiëren vóór installatie. (--no-verify-rpm schakelt dit uit, standaard ingeschakeld).
nn: --verify-rpm – Kontroller rpm-signatur før installering. (Bruk «--no-verify-rpm» til ikkje å kontrollera. Standard er å kontrollera.)
pl: --verify-rpm - bada podpis cyfrowy pakietu przed instalacją. (--no-verify-rpm wyłącza, domyślnie włączone).
pt: --verify-rpm - verifica a assinatura do rpm antes de instalar. (--no-verify-rpm desactiva, activo por predefinição).
pt_br: --verify-rpm - verifica a assinatura do rpm antes da instalação. (--no-verify-rpm desabilita, por padrão é habilitado).
ro: --verify-rpm - verifică semnătura rpm înainte de instalare (--no-verify-rpm o dezactivează, implicit este activată).
ru: --verify-rpm - проверять подписи rpm перед установкой (--no-verify-rpm отключает её; по умолчанию включена)
sl: --verify-rpm - preveri podpis paketa rpm pred namestitvijo (privzeto je omogočeno, --no-verify-rpm to onemogoči).
sq: --verify-rpm - verifiko nënshkrimin e rpm para instalimit (--no-verify-rpm pamundëson atë, parazgjedhja është aktivizuar).
sv: --verify-rpm - verifiera rpm-signatur före installation (standard) (--no-verify-rpm inaktiverar det).
tr: --verify-rpm - kurulumdan önce rpm imzasını doğrula (--no-verify-rpm bunu iptal eder, öntanımlı etkindir).

source: --media - use only the given media, separated by comma.
ast: --media - usar namái preseos daos, dixebraos por comes.
ca: --media - utilitza només les fonts donades, s'han de separar amb comes.
cs: --media - použít pouze uvedené zdroje, oddělené čárkou
cy: --media - defnyddio'r cyfrwng, wedi ei ran gan gollnod.
da: --media - brug kun de opgivne medier, adskilt med komma.
el: --media - χρήση μόνο των δεδομένων μέσων, διαχωρισμένων με κόμμα.
es: --media - usar sólo los soportes dados, separados por comas.
et: --media - kasutatakse ainult määratud andmekandjaid (eraldajaks koma).
eu: --media - emandako euskarria bakarrik erabiltzen du, komaz bereizita.
fi: --media - käytä ainoastaan annettuja pilkuilla eroteltuja medioita.
fr: --media - utiliser seulement les médias listés (séparés par des virgules).
gl: --media - usar só os soportes dados, separados por comas.
he: --media - שימוש רק במקורות המסופקים, מופרדים ע"י פסיק
hu: --media - csak a felsorolt (elválasztás: vessző) adatforrások használata
id: --media - hanya pakai hanya media yang diberikan, dipisahkan koma.
is: --media - nota aðeins uppgefna miðla, aðskildir með kommum.
it: --media - usa solo i supporti nella lista, separati da virgole.
nb: --media – bruk bare de angitte mediene (kommaseparert liste).
nl: --media - alleen de aangegeven media, kommagescheiden.
nn: --media – Bruk berre valt medium (kommadelt liste).
pl: --media - używa tylko podanych nośników, rozdzielonych przecinkami.
pt: --media - usa apenas a(s) média(s) indicada(s), separada(s) por vírgula.
pt_br: --media - use somente as mídias listadas (separadas por vírgula).
ro: --media - utilizează numai mediile date, separate prin virgulă.
ru: --media - использовать только указанные источники, перечисленные через запятую
sl: --media - uporabi samo podane vire, ločene z vejico.
sq: --media - përdori vetëm burimet e dhëna, të ndara me presje.
sv: --media - använd endast givet media, separerat med komma.
tr: --media - sadece belirtilen ortamları kullan (virgülle ayırın).

source: -p - allow search in provides to find package.
ast: -p - permite guetar en «provides» p'atopar paquete.
ca: -p - permet la cerca en allò que proporcionen els paquets per a trobar-los.
cs: -p - pokusí se najít balíček v položkách provides
cy: -p - caniatáu i chwilio canfod pecyn.
da: -p - tillad søgning i 'provides' for at finde pakke.
el: -p - να επιτρέπεται η αναζήτηση εντός των πακέτων, για να βρεθεί το κατάλληλο πακέτο.
es: -p - permite buscar paquete en base a lo que provee.
et: -p - lubab pakette otsida pakutavate seas.
eu: -p - paketeak aurkitzeko bilaketa 'provides'en egitea baimentzen du.
fi: -p - salli etsiminen "Tarjoaa"-tiedoista paketin löytämiseksi ("Provides").
fr: -p - chercher dans les apports pour trouver le paquetage.
gl: -p - permite buscar en proporciona para atopar o paquete.
hu: -p - csomag keresése a szolgáltatásjegyzékben
id: -p - izinkan pencarian pada provides untuk mencari paket.
is: -p - leyfa leit í 'skaffar' (provides) til að finna pakka.
it: -p - abilita la ricerca tra gli elementi forniti dal pacchetto.
nb: -p – tillat søk i tilbud for å finne pakke.
nl: -p - staat zoeken toe in 'provides' om een pakket te vinden.
nn: -p – Tillat søk i tilbod for å finna pakkar.
pl: -p - umożliwia wyszukiwanie serwerów przy szukaniu pakietów.
pt: -p - permite a procura nos fornecimentos (provides) para encontrar um pacote.
pt_br: -p - permite a busca em 'provides' para achar o pacote.
ro: -p - permite căutarea în furnizori pentru găsirea pachetelor.
ru: -p - разрешить искать пакеты в provides
sl: -p - dovoli iskanje v polju za najdbo paketa.
sq: -p - lejon hulumtimet në pajisjetë për ta gjetur pakon.
sv: -p - tillåt sökning i "provides" för att hitta paket.
tr: -p - paketi bulmak için aramaya izin ver.

source: -P - do not search in provides to find package.
ast: -p - nun guetar en «provides» p'atopar paquete.
ca: -P - no busquis en 'provides' per a trobar paquets.
cs: -P - nehledá balíček v položkách provides
cy: -P - peidio chwilio yn provides i ganfod pecyn.
da: -P - søg ikke i 'provides' for at finde pakke.
el: -P - να μην επιτρέπεται η αναζήτηση εντός των πακέτων, για να βρεθεί το κατάλληλο πακέτο.
es: -p - no buscar paquete en base a lo que provee.
et: -P - ei luba pakettide otsimist pakutavate seas.
eu: -p - paketeak aurkitzeko bilaketa ez du 'provides'en egiten.
fi: -P - älä etsi "Tarjoaa"-tiedoista paketin löytämiseksi ("Provides").
fr: -P - ne pas chercher dans les apports pour trouver un paquetage.
gl: -P - non buscar en proporciona para atopar o paquete.
hu: -P - a csomag ne legyen keresve a szolgáltatásjegyzékben
id: -P - jangan cari pada provides untuk mencari paket.
is: -P - ekki leita í 'skaffar (provides) til að finna pakka.
it: -P - non cercare tra gli elementi forniti per trovare il pacchetto.
nb: -P – ikke søk i tilbud for å finne pakke.
nl: -P - niet in 'provides' zoeken om een pakket te vinden.
nn: -P – Ikkje søk i tilbod for å finna pakkar.
pl: -P - nie przeszukuje serwerów przy wyszukiwaniu pakietów.
pt: -P - não procura nos fornecimentos (provides) para encontrar um pacote.
pt_br: -P - não procure em 'provides' para encontrar o pacote.
ro: -P - nu se căuta în furnizori pentru găsirea pachetelor.
ru: -P - не искать пакеты в provides
sl: -P - ne išči v polju za najdbo paketa.
sq: -P - mos hulumto në këto pajisje për ta gjetur pakon.
sv: -P - sök inte i "provides" för att hitta paket.
tr: -P - sağlanan paketlerin arasında paketi bulmak için arama yapma.

source: --root - use another root for rpm installation.
ast: --root - usar otru raigañu pa la instalación de rpm.
ca: --root - usa una altre arrel per la instal·lació de rpm.
cs: --root - použít pro instalaci balíčků jiný kořenový adresář
cy: --root - defnyddio root arall ar gyfer gosod rpm.
da: --root - brug en anden root for rpm-installation.
el: --root - χρησιμοποίησε μία άλλη διαδρομή root για την εγκατάσταση του rpm.
es: --root - usar otro directorio raíz para la instalación de rpm.
et: --root - muu baasi kasutamine RPM-ide paigaldamisel.
eu: --root - beste root bat erabiltzen du rpm instalatzeko.
fi: --root - käytä määriteltyä juurta pakettien asentamiseen.
fr: --root - utiliser un autre répertoire racine pour l'installation.
gl: --root - usar outra raíz para a instalación de rpms.
he: --root - השתמש בשורש מערכת קבצים אחר להתקנת חבילות.
hu: --root - másik gyökér használata az RPM-csomagtelepítéshez
id: --root - gunakan root lain untuk installasi rpm.
is: --root - Nota aðra rót fyrir rpm uppsetningu.
it: --root - cambia la directory di root per installare i file rpm "chrooted".
nb: --root – bruk en annen rot for rpm-installering.
nl: --root - gebruik andere hoofdmap (root) voor rpm-installatie.
nn: --root – Bruk anna rot for rpm-installering.
pl: --root - używa innego katalogu głównego do instalacji rpm.
pt: --root - usa outra raíz para a instalação rpm.
pt_br: --root - use outro root para instalação rpm.
ro: --root - utilizează alt administrator pentru instalarea pachetelor.
ru: --root - использовать другой корень для установки rpm-файла
sl: --root - uporabi drugo korensko mapo za namestitev paketov rpm.
sq: --root - përdorni një root tjetër për instalimin e rpm.
sv: --root - använd en annan root för rpm installation.
tr: --root - rpm kurulmu için bir başka kök kullan.

source: --test - only verify if the installation can be achieved correctly.
ast: --test - namái verificar si puede instalase ensin problemes.
ca: --test - només verifica si es pot instal·lar correctament.
cs: --test - pouze zkontrolovat, zda lze provést instalaci správně
cy: --test - gwirio os oes modd gosod yn iawn.
da: --test - afprøv kun om installationen kan udføres korrekt.
el: --test - έλεγξε μόνο αν η εγκατάσταση μπορεί να γίνει σωστά.
es: --test - sólo verificar si se puede instalar sin problemas.
et: --test - kontrollitakse, kas paigaldus on korrektselt võimalik.
eu: --test - instalazioa zuzen gauzatu daitekeen egiaztatzen du.
fi: --test - suorita vain asennuksen onnistumisen tarkistus.
fr: --test - vérifier si l'installation peut se dérouler correctement.
gl: --test - só verifica se se pode conseguir instalar de maneira correcta.
he: --test - רק וידוא שהתקנת החבילה יכולה להסתיים בהצלחה.
hu: --test - csak ellenőrzés, hogy a telepítés végrehajtható-e
id: --test - hanya verifikasi apakah installasi dapat dilaksanakan dengan benar.
is: --test - aðeins athuga hvort uppsetning muni takast.
it: --test - verifica solo che l'installazione possa avvenire correttamente.
nb: --test – bare bekreft at installeringen vil fungere korrekt.
nl: --test - verifiëren dat de installatie correct uitgevoerd kan worden.
nn: --test – Berre kontroller at installeringa kan fungera.
pl: --test - sprawdza, czy instalacja zostanie przeprowadzona prawidłowo.
pt: --test - verifica apenas se a instalação pode ser conseguida correctamente.
pt_br: --test - apenas verifica se a instalação pode ser efetuada corretamente.
ro: --test - verifică dacă instalarea poate fi îndeplinită corect.
ru: --test - проверить возможность корректной установки
sl: --test - samo preveri, če je namestitev lahko pravilno izvedena.
sq: --test - vetëm verifikoni nëse instalimi mund të arrihet në mënyrë korrekte.
sv: --test - verifiera endast om installationen kan utföras korrekt.
tr: --test - kurulumun başarılı olup olmayacağını doğrula.

source: --searchmedia - use only the given media to search requested packages.
ast: --searchmedia - usa namái los medios daos pa guetar paquetes solicitaos.
ca: --searchmedia - utilitza només les fonts donades per cercar paquets.
cs: --searchmedia - použít pro vyhledání požadovaných balíčků pouze zadané zdroje
cy: --searchmedia - defnyddio'r cyfrwng darparwyd i chwilio'r pecynnau gofynnwyd.
da: --searchmedia - brug kun det opgivne medie for at søge efter de ønskede pakker.
el: --searchmedia - χρήση μόνο των δοσμένων μέσων για την αναζήτηση των ζητούμενων πακέτων.
es: --searchmedia - usar sólo soportes dados para la búsqueda de los paquetes pedidos.
et: --searchmedia - soovitud pakettide otsinguks kasutatakse ainult määratud andmekandjaid.
eu: --searchmedia - soilik adierazitako euskarria erabiltzen du eskatutako paketeak bilatzeko.
fi: --searchmedia - käytä ainoastaan annettuja medioita pyydetyn paketin etsimiseen.
fr: --searchmedia - utiliser seulement le média spécifié pour rechercher les paquetages.
gl: --searchmedia - usar só o soporte dado para buscar os paquetes solicitados.
he: --searchmedia - השתמש רק במקור הנתון לחיפוש החבילות המבוקשות.
hu: --searchmedia - csak a megadott adatforrások használata a kért csomagok kereséséhez
id: --searchmedia - hanya gunakan media yang diberikan untuk mencari paket yang dicari.
is: --searchmedia - nota aðeins uppgefinn miðil til að leita að umbeðnum pökkum.
it: --searchmedia - usa solo i supporti indicati per cercare i pacchetti richiesti
nb: --searchmedia – bare se etter pakker i dette mediet.
nl: --searchmedia - alleen de aangegeven media gebruiken om gewenste pakketten te zoeken.
nn: --searchmedia – Berre sjå etter pakkar i dette mediet.
pl: --searchmedia - używa tylko podanych nośników podczas wyszukiwania wymaganych pakietów.
pt: --searchmedia - usa apenas a média indicada para procurar os pacotes pedidos.
pt_br: --searchmedia - usa apenas a mídia fornecida para buscar pacotes.
ro: --searchmedia - utilizează numai mediile indicate pentru căutarea pachetelor cerute.
ru: --searchmedia - использование только указанных источников для поиска запрошенных пакетов
sl: --searchmedia - uporabi samo podane vire za iskanje zahtevanih paketov.
sq: --searchmedia - përdorni vetëm mënyrat e dhëna për të kërkuar programe.
sv: --searchmedia - använd endast givet media för att söka efter valda paket.
tr: --searchmedia - istenen paketleri sadece verilen kurulum kaynaklarında ara.

source: No packages specified
ast: Dengún paquete especificáu
ca: No s'ha especificat cap paquet
cs: Nebyly zadány žádné balíčky
cy: Heb enwi pecyn
da: Ingen pakker angivet
el: Δεν ορίστηκαν πακέτα
es: Ningún paquete especificado
et: Pakette pole valitud
eu: Ez da paketerik zehaztu
fi: Paketteja ei määritelty
fr: Pas de paquetage spécifié
gl: Non especificou ningún paquete
he: לא צוינו חבילות
hu: Nincs megadva csomag
id: Tidak ada paket yang ditentukan
is: Engir pakkar tilgreindir
it: Nessun pacchetto specificato
nb: Ingen pakker angitt
nl: Geen pakketten gespecificeerd
nn: Ingen pakkar valde
pl: Nie wybrano pakietów
pt: Nenhum pacote escolhido
pt_br: Nenhum pacote especificado
ro: Nu a fost specificat nici un pachet
ru: Пакеты не указаны
sl: Noben paket ni bil določen
sq: Asnjë paketë e specifikuar
sv: Inga paket specifierade
tr: Herhangi bir paket belirtilmemiş.

source: Please wait...
ast: Por favor, espera...
ca: Espereu...
cs: Čekejte prosím...
cy: Arhoswch...
da: Vent venligst...
el: Παρακαλώ περιμένετε...
es: Por favor, espere...
et: Palun oodake...
eu: Itxaron mesedez...
fi: Odota hetki...
fr: Veuillez patienter...
gl: Agarde...
he: נא להמתין...
hu: Kis türelmet...
id: Silahkan menunggu...
is: Vinsamlega bíðið...
it: Per favore attendi...
nb: Vent litt …
nl: Even geduld...
nn: Vent litt ...
pl: Proszę czekać...
pt: Por favor aguarde...
pt_br: Aguarde...
ro: Așteptați vă rog...
ru: Подождите, пожалуйста...
sl: Počakajte …
sq: Ju lutemi prisni...
sv: Var god vänta...
tr: Lütfen bekleyiniz...

source: Must be root
ast: Tienes de ser root
ca: Cal ser root
cs: Musíte být root
cy: Rhaid bod yn root
da: Skal være root
el: Πρέπει να είστε διαχειριστής
es: Debe ser root
et: Vajalikud on administraatori õigused
eu: Root izan behar da
fi: On oltava pääkäyttäjän oikeudet
fr: Vous devez être administrateur
gl: Debe ser root
he: עליך להיות בעל הרשאות מנהל מערכת
hu: Rendszergazdai jogosultság szükséges
id: Harus sebagai root
is: Verður að vera root
it: Devi essere root
nb: Må være root
nl: Dient 'root' te zijn
nn: Må vera root
pl: Tylko root ma prawo do tego działania
pt: Tem que ser administrador
pt_br: Tem que ser root
ro: Trebuie să fiți root
ru: Необходимы права пользователя «root»
sl: Za to morate biti skrbnik
sq: Duhet të jetë root
sv: Måste vara root
tr: Yetkili kullanıcı olunmalı

source: Distribution Upgrade
ast: Anovamientu de la Distribución
ca: Actualització de la distribució
cs: Povýšení distribuce
cy: Diweddaru'r Dosbarthiad
da: Opgradering af distribution
el: Αναβάθμιση της διανομής
es: Actualización de la Distribución
et: Distributsiooni uuendamine
eu: Banaketaren Bertsio berritzea
fi: Jakelun päivitys
fr: Mise à jour de la distribution
hu: Disztribúció frissítése
is: Uppfærsla dreifingar
it: Aggiornamento della distribuzione
nb: Oppgradering av distribusjon
nl: Distributie-opwaardering
nn: Distribusjonsoppgradering
pl: Aktualizacja dystrybucji
pt: Actualização da Distribuição
pt_br: Atualização da Distribuição
ro: Actualizare majoră de distribuție
ru: Обновление дистрибутива
sl: Nadgradnja distribucije
sq: Përmirësimi Shpërndarjes
sv: Uppgradera distribution
tr: Dağıtım Yükseltmesi

source: Packages installation
ast: Instalación de paquete
ca: Instal·lació de paquets
cs: Instalace balíčků
cy: Gosod pecynnau
da: Pakkeinstallation
el: Εγκατάσταση πακέτων
es: Instalación de paquetes
et: Pakettide paigaldamine
eu: Paketeen instalaketa
fi: Pakettien asennus
fr: Installation des paquetages
hu: Csomagok telepítése
is: Pakka innsetning
it: Installazione dei pacchetti
nb: Pakkeinstallasjon
nl: Pakketinstallatie
nn: Pakkeinstallering
pl: Instalacja pakietów
pt: Instalação de pacotes
pt_br: Instalação de pacotes
ro: Instalare de pachete
ru: Установка пакетов
sl: Namestitev paketov
sq: Instalimi paketave
sv: Paketinstallation
tr: Paket kurulumu

source: Preparing packages installation...
ast: Tresnando instalación de paquetes...
ca: S'estan preparant els paquets per a la instal·lació...
cs: Připravuji instalaci balíčků...
cy: Paratoi pecynnau i'w gosod...
da: Forbereder installation af pakker
el: Προετοιμασία των πακέτων για την εγκατάσταση...
es: Preparando instalación de paquetes...
et: Paigaldamiseks valmistumine...
eu: Paketeen instalazioa prestatzen...
fi: Valmistellaan ohjelmistopakettien asennusta...
fr: Préparation de l'installation des paquetages...
gl: Preparando a instalación dos paquetes...
he: מכין חבילות להתקנה...
hu: Csomagtelepítés előkészítése...
id: Persiapan installasi paket...
is: Undirbý innsetningu pakka...
it: Preparazione dei pacchetti per l'installazione...
nb: Forbereder pakkeinstallasjon …
nl: Voorbereiden van pakketinstallatie…
nn: Førebur pakkeinstallering ...
pl: Przygotowywanie instalacji pakietów...
pt: A preparar a instalação dos pacotes...
pt_br: Preparando programas para instalação...
ro: Se pregătesc pachetele pentru instalare...
ru: Подготовка к установке пакетов...
sl: Pripravljam namestitev paketov …
sq: Pregatitje për instalimin e pakove...
sv: Förbereder paketinstallation...
tr: Paket kurulumuna hazırlanılıyor...
