Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: %s: %s (to install)
ast: %s: %s (pa instalar)
ca: %s: %s (a instal·lar)
cs: %s: %s (k instalaci)
cy: %s: %s (gosod)
da: %s: %s (skal installeres)
el: %s: %s (προς εγκατάσταση)
es: %s: %s (para instalar)
et: %s: %s (paigaldus)
eu: %s: %s (instalatu)
fi: %s: %s (asennettava)
fr: %s : %s (à installer)
gl: %s: %s (para instalar)
he: %s: %s (להתקין)
hu: %s: %s (telepítés)
id: %s: %s (untuk menginstal)
is: %s: %s (til að setja inn)
it: %s: %s (da installare)
nb: %s: %s (å installere)
nl: %s: %s (te installeren)
nn: %s: %s (installering)
pl: %s: %s (do zainstalowania)
pt: %s: %s (para instalar)
pt_br: %s: %s (para instalar)
ro: %s: %s (de instalat)
ru: %s: %s (для установки)
sl: %s: %s (za namestitev)
sv: %s: %s (för att installera)
tr: %s: %s (kurulum için)

source: %s (to install)
ast: %s (pa instalar)
ca: %s (a instal·lar)
cs: %s (k instalaci)
cy: %s (gosod)
da: %s (skal installeres)
el: %s (προς εγκατάσταση)
es: %s (para instalar)
et: %s (paigaldus)
eu: %s (instalatu)
fi: %s (asennettava)
fr: %s (à installer)
gl: %s (para instalar)
he: %s (להתקין)
hu: %s (telepítés)
id: %s (untuk menginstal)
is: %s (til að setja inn)
it: %s (da installare)
nb: %s (å installere)
nl: %s (te installeren)
nn: %s (installering)
pl: %s (do zainstalowania)
pt: %s (para instalar)
pt_br: %s (para instalar)
ro: %s (de instalat)
ru: %s (для установки)
sl: %s (za namestitev)
sv: %s (för att installera)
tr: %s (kurulum için)

source: In order to satisfy the '%s' dependency, one of the following packages is needed:
ast: Pa satisfacer la dependencia «%s», necesitase un de los paquetes siguientes:
ca: Per a satisfer la dependència de '%s', cal un dels paquets següents:
cs: Aby byly splněna závislost '%s', je třeba jeden z následujících balíčků:
cy: I fodloni '%s' dibyniaeth, bydd angen un o'r pecynnau canlynol:
da: For at tilfredsstille afhængigheden af %s er én af de følgende pakker nødvendig:
el: Για να ικανοποιηθούν οι εξαρτήσεις του '%s', απαιτείται ένα από τα παρακάτω πακέτα:
es: Para satisfacer la dependencia «%s», se necesita uno de los paquetes siguientes:
et: Sõltuvuse '%s' lahendamiseks on vajalik üks järgmistest pakettidest:
eu: %s mendekotasuna asetzeko, ondoko paketeetako bat behar da:
fi: Riippuvuuden "%s" täyttämiseksi jokin seuraavista paketeista on asennettava:
fr: Afin de satisfaire les dépendances de « %s », un des paquetages suivants est nécessaire :
gl: Para satisfacer a dependencia de '%s', fai falta un dos seguintes paquetes:
he: בכדי לענות על התלות '%s' דרושה אחת החבילות הבאות:
hu: A(z) "%s" függőség feloldásához szükség van a következő csomagok egyikére:
is: Til að viðhalda samræmi við %s, er þörf á einum af eftirtöldum pökkum:
it: Per soddisfare le dipendenze di "%s" serve uno dei seguenti pacchetti:
nb: For å tilfredstille avhengigheten «%s» er en av de følgende pakkene nødvendige:
nl: Om aan de afhankelijkheid '%s' te voldoen, is één van de volgende pakketten nodig:
nn: På grunn av avhengnader til «%s» treng du éin av desse pakkane:
pl: W celu spełnienia zależności '%s' niezbędny jest jeden z poniższych pakietów:
pt: Para satisfazer as '%s' dependências, é necessário um dos seguintes pacotes:
pt_br: Para satisfazer a dependência '%s', um dos seguintes pacotes é necessário:
ro: Pentru satisfacerea dependențelor lui „%s”, unul din pachetele următoare este necesar:
ru: Для удовлетворения зависимости «%s» нужен один из следующих пакетов:
sl: Za zadovoljitev odvisnosti »%s« je potreben en izmed naslednjih paketov:
sv: För att tillfredsställa beroendet '%s', ett av följande paket behövs:
tr: '%s' bağımlılık sorununu aşabilmek için, aşağıdaki paketlerden biri gerekli:

source: What is your choice? (1-%d)
ast: ¿Qué escueyes? (1-%d)
ca: Quina és la vostra elecció? (1-%d)
cs: Jaká je vaše volba? (1-%d)
cy: Beth yw eich dewis? (1-%d)
da: Hvad er dit valg? (1-%d)
el: Ποια είναι η επιλογή σας; (1-%d)
es: ¿Qué elige? (1-%d)
et: Millise valite? (1-%d)
eu: Zein hautatzen duzu? (1-%d)
fi: Mikä on valintasi? (1-%d)
fr: Que choisissez-vous ? (1-%d)
gl: ¿Cal é a súa elección? (1-%d)
he: מה היא בחירתך? (1-%d)
hu: Melyiket választja? (1-%d)
id: Pilihan Anda? (1-%d)
is: Hvað velur þú? (1-%d)
it: Quale scegli? (1-%d)
nb: Hva er valget ditt? (1-%d)
nl: Wat is uw keuze? (1-%d)
nn: Kven av dei vil du ha? (1–%d)
pl: Jaki jest Twój wybór? (1-%d)
pt: Qual é a sua escolha? (1-%d)
pt_br: Qual é a sua escolha? (1-%d)
ro: Ce alegeți? (1-%d)
ru: Ваш выбор? (1-%d)
sl: Kakšna je vaša izbira? (1-%d)
sq: Cila është zgedhja e juaj? (1-%d)
sv: Vad är ditt val? ( 1-%d)
tr: Seçiminiz nedir? (1-%d)

source: The following package cannot be installed because it depends on packages that are older than the installed ones: %s
ast: El siguiente paquete nun puede instalase porque depende de paquetes más antiguos que los ya instalaos: %s
cs: Následující balíčky nelze instalovat, protože závisí na balíčcích, které jsou starší než instalovaná verze: %s
cy: Nid oes modd gosod y pecyn canlynol am ei fod yn dibynnu ar becynnau sy'n hyn na'r rhai sydd wedi eu gosod: %s
da: Den følgende pakke kan ikke installeres, fordi den afhænger af pakker, som er ældre end de installerede: %s
el: Το ακόλουθο πακέτο δεν μπορεί να εγκατασταθεί, γιατί εξαρτάται από πακέτα που είναι παλαιότερα από αυτά που είναι εγκατεστημένα: %s
es: El siguiente paquete no puede instalarse porque depende de paquetes más antiguos que los ya instalados: %s
et: Järgmist paketti ei saa paigaldada, sest see sõltub pakettidest, mis on vanemad kui paigaldatud paketid: %s
eu: Ondoko paketea ezin dira instalatu instalatuta daudenak baino zaharrago batzuekiko menpekotasuna dutelako: %s
fi: Seuraavaa pakettia ei voida asentaa, koska se riippuu paketeista, jotka ovat vanhempia kuin asennettavat paketit: %s
fr: Le paquetage suivant ne peut pas être installé, car il dépend de paquetage qui sont plus anciens que la version installée : %s
gl: Non se pode instalar o seguinte paquete porque depende de paquetes que son máis antigos cós instalados: %s
he: החבילה הבאה לא ניתנת להתקנה מאחר והיא תלויה בחבילות מגרסאות קודמות לאלו המותקנות: %s
hu: A következő csomag nem telepíthető, mivel olyan csomagokat igényel, amelyek régebbiek a telepítetteknél: %s
id: Paket berikut tidak bisa diinstal karena mereka bergantung pada paket-paket yang lebih lama dari yang terinstall: %s
is: Eftirfarandi pakka er ekki hægt að setja inn því hann er háður pökkum sem eru eldri en þeir sem eru uppsettir: %s
it: I seguenti pacchetti non possono essere installati perché dipendono da pacchetti più vecchi di quelli già installati: %s
nb: Denne pakka kan ikke installeres, da den er avhengig av pakker som er eldre enn de installerte pakkene: %s
nl: Het volgende pakket kan niet worden geïnstalleerd omdat het afhangt van pakketten die ouder zijn dan de reeds geïnstalleerde pakketten: %s
nn: Denne pakken kan ikkje installerast, då han avheng av pakkar som er eldre enn dei installerte pakkane: %s
pl: Poniższe pakiety nie mogą zostać zainstalowane ponieważ zawierają zależności z pakietami, które są starsze niż aktualnie zainstalowane w systemie: %s
pt: O seguinte pacote não pode ser instalado porque depende dos pacotes que são mais antigos do que os que estão instalados: %s
pt_br: O seguinte pacote não pode ser instalado porque depende de pacotes que são mais antigos que os atualmente instalados: %s
ro: Acest pachet nu s-a putut instala deoarece depinde de pachete mai vechi decît cele instalate: %s
ru: Не удаётся установить следующий пакет, т.к. он зависит от пакетов, более старых, чем установленные: %s
sl: Naslednjega paketa ni mogoče namestiti, ker je odvisen od paketov, ki so starejši od že nameščenih: %s
sv: Följande paket kan inte installeras eftersom det är beroende av paket som är äldre än de installerade paketen: %s
tr: Şu paket, kurulu olanlardan daha eski paketlere bağımlı olduğu için kurulamaz: %s

source: The following packages can't be installed because they depend on packages that are older than the installed ones: %s
ast: Los siguientes paquetes nun pueden instalase porque dependen de paquetes más antiguos que los ya instalaos: %s
cs: Následující balíčky nelze instalovat, protože závisí na balíčcích, které jsou starší než instalovaná verze: %s
cy: Nid oes modd gosod y pecynnau canlynol am eu bod yn dibynnu ar becynnau sy'n hyn na'r rhai sydd wedi eu gosod: %s
da: De følgende pakker kan ikke installeres, fordi de afhænger af pakker, som er ældre end de installerede: %s
el: Τα ακόλουθα πακέτα δεν μπορούν να εγκατασταθούν, γιατί εξαρτώνται από πακέτα που είναι παλαιότερα από αυτά που είναι εγκατεστημένα: %s
es: Los siguientes paquetes no pueden instalarse porque dependen de paquetes más antiguos que los ya instalados: %s
et: Järgmisi pakette ei saa paigaldada, sest nad sõltuvad pakettidest, mis on vanemad kui paigaldatud paketid: %s
eu: Ondoko paketeak ezin dira instalatu instalatuta daudenak baino zaharrago batzuekiko menpekotasuna dutelako: %s
fi: Seuraavia paketteja ei voida asentaa, koska ne riippuvat paketeista, jotka ovat vanhempia kuin asennettavat paketit: %s
fr: Les paquetages suivants ne peuvent pas être installés, car ils dépendent de paquetages qui sont plus anciens que les versions installées : %s
gl: Non se poden instalar os seguintes paquetes porque dependen de paquetes que son máis antigos cós instalados: %s
he: החבילות הבאות לא ניתנות להתקנה מאחר והן תלויות בחבילות מגרסאות קודמות מאלו המותקנות במחשבך: %s
hu: A következő csomagok nem telepíthetők, mivel olyan csomagokat igényelnek, amelyek régebbiek a telepítetteknél: %s
id: Paket berikut tidak bisa diinstal karena mereka bergantung pada paket yang lebih lama dari yang terinstall: %s
is: Eftirfarandi pakka er ekki hægt að setja upp því þeir eru háðir pökkum sem eru eldri en þeir sem eru uppsettir: %s
it: I seguenti pacchetti non possono essere installati perché dipendono da pacchetti più vecchi di quelli già installati: %s
nb: De følgende pakkene kan ikke bli installert fordi de er avhengige av pakker som er eldre enn de som er installert: %s
nl: De volgende pakketten kunnen niet worden geïnstalleerd omdat ze afhangen van pakketten die ouder zijn dan de reeds geïnstalleerde pakketten: %s
nn: Desse pakkane kan ikkje installerast, då dei avheng av pakkar som er eldre enn dei installerte pakkane: %s
pl: Poniższe pakiety nie mogą zostać zainstalowane ponieważ zawierają zależności z pakietami, które są starsze niż aktualnie zainstalowane w systemie:%s
pt: Os seguintes pacotes não podem ser instalados porque dependem dos pacotes que são mais antigos do que os instalados: %s
pt_br: Os seguintes pacotes não podem ser instalados porque dependem de pacotes que são mais antigos que os atualmente instalados: %s
ro: Aceste pachete nu s-au putut instala deoarece depind de pachete mai vechi decît cele instalate: %s
ru: Не удаётся установить следующие пакеты, т.к. они зависят от пакетов, более старых, чем установленные: %s
sl: Naslednjih paketov ni mogoče namestiti, ker so odvisni od paketov, ki so starejši od nameščenih. %s
sv: Följande paket kan inte installeras eftersom de är beroende av paket som är äldre än de installerade paketen: %s
tr: Şu paketler, kurulu olanlardan daha eski paketlere bağımlı oldukları için kurulamazlar: %s

source: Continue installation anyway?
ast: ¿Siguir adelante cola instalación?
cs: Přesto pokračovat v instalaci?
cy: Parhau i osod beth bynnag?
da: Fortsæt installationen alligevel?
el: Να συνεχίσω την εγκατάσταση ;
es: ¿Seguir adelante con la instalación?
et: Kas siiski paigaldamist jätkata?
eu: Instalazioarekin jarraitu hala ere?
fi: Jatka muiden pakettien asennusta?
fr: Désirez-vous tout de même continuer ?
gl: ¿Continuar a instalación de tódolos xeitos?
he: האם להמשיך בכל זאת?
hu: Kívánja folytatni a telepítést?
id: Lanjutkan installasi?
is: Halda samt áfram með uppsetningu?
it: Continuo comunque l'Installazione?
nb: Fortsett installasjon likevel?
nl: Toch doorgaan met de installatie?
nn: Vil du likevel halda fram?
pl: Czy kontynuować mimo to?
pt: Deseja Continuar a instalação?
pt_br: Prosseguir instalação mesmo assim?
ro: Continuați totuși instalarea?
ru: Продолжить установку?
sl: Ali naj vseeno nadaljujem z namestitvijo?
sv: Fortsätt installation ändå?
tr: Yine de devam edilsin mi?

source: (Y/n)
ast: (S/n)
ca: (S/n)
cs: (A/n)
da: (J/n)
es: (S/n)
et: (J/e)
eu: (B/e)
fi: (K/e)
fr: (O/n)
gl: (S/n)
he: אישור/ביטול (*כ/ל)
hu: (I/n)
id: (Y/t)
is: (J/n)
it: (S/n)
nb: (J/n)
nl: (J/n)
nn: (J/N)
pl: (T/n)
pt: (S/n)
pt_br: (S/n)
ro: (D/n)
sl: (D/n)
sq: (P/j)
sv: (J/n)
tr: (E/h)

source: A requested package cannot be installed: %s
ast: Nun pue instalase un paquete solicitáu: %s
ca: Un paquet demanat no es pot instal·lar: %s
cs: Požadovaný balíček nelze nainstalovat: %s
cy: Nid oes modd gosod pecyn gofynnwyd amdani: %s
da: En forespurgt pakke kan ikke installeres: %s
el: Ένα από τα πακέτα που ζητήθηκε δεν μπορεί να εγκατασταθεί: %s
es: No se puede instalar el paquete pedido: %s
et: Soovitud paketti ei õnnestu paigaldada: %s
eu: Eskatutako pakete bat ezin da instalatu: %s
fi: Haluttua pakettia ei voida asentaa: %s
fr: Le paquetage demandé ne peut pas être installé : %s
gl: Non se puido instalar un paquete solicitado: %s
he: לא ניתן להתקין חבילה מבוקשת: %s
hu: A következő kért csomagot nem lehet telepíteni: %s
id: Paket yang diminta tidak dapat diinstall: %s
is: Ekki er hægt að setja inn umbeðinn pakka: %s
it: Uno dei pacchetti richiesti non può essere installato: %s
nb: En av pakkene kan ikke installeres: %s
nl: Een verlangd pakket kan niet worden geïnstalleerd: %s
nn: Éin av pakkane kan ikkje installerast: %s
pl: Wybrany pakiet nie może zostać zainstalowany: %s
pt: Um pacote pedido não pode ser instalado: %s
pt_br: Um pacote não pôde ser instalado: %s
ro: Un pachet cerut nu poate fi instalat: %s
ru: Не удаётся установить запрошенный пакет: %s
sl: Zahtevanega paketa ni mogoče namestiti: %s
sv: Ett begärt paket kan inte installeras: %s
tr: İstenen paket kurulamaz: %s

source: removing package %s will break your system
ast: desaniciar el paquete %s frayará'l sistema
ca: eliminar el paquet %s trencarà el vostre sistema
cs: odebrání balíčku %s naruší funkčnost vašeho systému
cy: bydd tynnu pecynnau %s yn torri'r system
da: fjernelse af pakke %s vil skade dit system
el: η αφαίρεση του πακέτου %s θα καταστρέψει το σύστημά σας
es: quitar el paquete %s dañará su sistema
et: paketi %s eemaldamine halvab Teie süsteemi
eu: %s paketea kentzen baduzu, sistema apurtuko duzu
fi: Paketin %s poistaminen rikkoisi järjestelmän
fr: La désinstallation du paquetage %s rendra votre système instable
gl: Se se elimina o paquete %s o sistema estropearase
he: הסרת החבילה %s תגרום נזק למערכת
hu: a(z) "%s" csomag eltávolítása tönkreteheti a rendszert
id: menghapus paket %s akan merusak sistem Anda
is: ef pakki %s er fjarlægður raskast uppsetning kerfisins
it: la rimozione del pacchetto %s comprometterà il sistema
nb: fjerning av pakka %s vil ødelegge systemet ditt
nl: het verwijderen van %s zal uw systeem verstoren
nn: Du vil øydeleggja systemet viss du fjernar pakken «%s».
pl: usuwanie pakietu %s spowoduje uszkodzenie systemu
pt: a remoção do pacote %s irá danificar o seu sistema
pt_br: a remoção do pacote %s irá danificar seu sistema
ro: înlăturarea pachetului %s va corupe sistemul
ru: удаление пакета %s нарушит работу вашей системы
sl: odstranitev paketa %s bo pokvarila vaš sistem
sq: heqje paketës %s do të dëmtoj sistemin tuaj
sv: att ta bort paketet %s skulle förstöra systemet
tr: %s paketinin kaldırılması sisteminizi çökertecektir.

source: The installation cannot continue because the following package has to be removed for others to be upgraded: %s
ast: La instalación nun pue siguir porque tienen de desaniciase'l paquete siguiente pa poder anovar otros: %s
ca: La instal·lació no pot continuar ja que el següent paquet s'ha d'eliminar per poder actualitzar uns altres: %s
cs: Instalace nemůže pokračovat, protože následující balíček musí být odstraněn, aby bylo možné jiné aktualizovat: %s
cy: Nid oes modd i'r gosod parhau gan fo'n rhaid i'r pecyn canlynol gael ei dynnu i eraill gael eu diweddaru. %s
da: Installationen kan ikke fortsætte fordi den følgende pakke skal fjernes for at andre kan opgraderes: %s
el: Η εγκατάσταση δεν μπορεί να συνεχιστεί διότι το παρακάτω πακέτο πρέπει να αφαιρεθεί, για να αναβαθμιστούν κάποια άλλα: %s
es: La instalación no puede continuar porque se tienen que quitar el paquete siguiente para poder actualizar otros: %s
et: Paigaldamist ei saa jätkata, sest teiste uuendamiseks tuleb eemaldada järgmine pakett: %s
eu: Ezin da instalazioarekin jarraitu, honako paketea kendu egin behar direlako, beste batzuen bertsioa berritzeko: %s
fi: Asennusta ei voida jatkaa, koska seuraava paketti on poistettava, jotta toiset voidaan päivittää: %s
fr: La mise à jour ne peut pas continuer car le paquetage suivant doit être désinstallé : %s
gl: A instalación non pode continuar porque cómpre eliminar o seguinte paquete para para poder actualizar outros: %s
he: ההתקנה לא יכולה להמשיך בגלל שיש להסיר את החבילות הבאות כדי לשדרג אחרות: %s
hu: A telepítés nem folytatható, mert a következő csomagot el kell távolítani, hogy a szükséges csomagok frissíthetők legyenek: %s
id: Instalasi tidak dapat dilanjutkan sebab paket berikut harus dihapus agar yang lain dapat di-upgrade: %s
is: Uppsetningin getur ekki haldið áfram því að eftirfarandi pakka þarf að fjarlægja til að uppfæra aðra: %s
it: L'installazione non può proseguire perché questo pacchetto deve essere rimosso per poterne aggiornare altri: %s
nb: Kan ikke fortsette å installere, da denne pakken først må fjernes for at andre skal kunne oppgraderes: %s
nl: De installatie kan niet doorgaan omdat de volgende pakketten moeten worden verwijderd om andere te kunnen opwaarderen: %s
nn: Kan ikkje halda fram å installera, då denne pakken først må fjernast for at andre skal kunna oppgraderast: %s
pl: Instalacja nie może być kontynuowana ponieważ poniższy pakiet musi zostać usunięty aby zaktualizować inne: %s
pt: A instalação não pode continuar porque o seguinte pacote tem que ser removido para que outros sejam actualizados: %s
pt_br: A instalação não pode continuar porque o seguite pacote precisa ser removido para que os outros possam ser atualizados: %s
ro: Instalarea nu poate continua deoarece următorul pachet trebuie înlăturat pentru ca celelalte să fie actualizate: %s
ru: Установку невозможно продолжить, т.к. необходимо удалить следующий пакет для обновления остальных: %s
sl: Namestitev se ne more nadaljevati, ker je potrebno odstraniti naslednje pakete, da bodo drugi lahko nadgrajeni: %s
sv: Installationen kan inte fortsätta eftersom följande paket måste tas bort så att andra kan uppdateras: %s
tr: Kurulum devam edemez çünkü diğer paketlerin güncellenmesi için aşağıdaki paketlerin kaldırılması gerekiyor: %s

source: The installation cannot continue because the following packages have to be removed for others to be upgraded: %s
ast: La instalación nun pue siguir porque tienen de desaniciase los paquetes siguientes pa poder anovar otros: %s
ca: La instal·lació no pot continuar ja que els següents paquets s'han d'eliminar per poder actualitzar uns altres: %s
cs: Instalace nemůže pokračovat, protože následující balíčky musí být odstraněny, aby bylo možné jiné aktualizovat: %s
cy: Nid oes modd i'r gosod parhau gan fo'n rhaid i'r pecynnau canlynol gael eu tynnu i eraill gael eu diweddaru. %s
da: Installationen kan ikke fortsætte fordi de følgende pakker skal fjernes for at andre kan opgraderes: %s
el: Η εγκατάσταση δεν μπορεί να συνεχιστεί διότι τα παρακάτω πακέτα πρέπει να αφαιρεθούν για να αναβαθμιστούν κάποια άλλα: %s
es: La instalación no puede continuar porque se tienen que quitar los paquetes siguientes para poder actualizar otros: %s
et: Paigaldamist ei saa jätkata, sest teiste uuendamiseks tuleb eemaldada järgmised paketid: %s
eu: Ezin da instalazioarekin jarraitu, honako paketeak kendu egin behar direlako, beste batzuen bertsioa berritzeko: %s
fi: Asennusta ei voida jatkaa, koska seuraavat paketit on poistettava, jotta toiset voidaan päivittää: %s
fr: La mise à jour ne peut pas continuer car les paquetages suivants doivent être désinstallés : %s
gl: A instalación non pode continuar porque cómpre eliminar os seguintes paquetes para para poder actualizar outros: %s
he: ההתקנה לא יכולה להמשיך בגלל החבילות הבאות יש צורך להסיר אותן, בכדי לשדרג את האחרות: %s
hu: A telepítés nem folytatható, mert a következő csomagokat el kell távolítani, hogy a szükséges csomagok frissíthetők legyenek: %s
id: Instalasi tidak dapat dilanjutkan sebab paket berikut harus dihapus agar yang lain dapat di-upgrade: %s
is: Uppsetningin getur ekki haldið áfram því að eftirfarandi pakka þarf að fjarlægja til að uppfæra aðra: %s
it: L'installazione non può proseguire perché questi pacchetti devono essere rimossi per poterne aggiornare altri: %s
nb: Installasjonen kan ikke fortsette på grunn av at følgende pakker må fjernes for at andre skal bli oppgradert: %s
nl: De installatie kan niet doorgaan omdat de volgende pakketten moeten worden verwijderd om andere te kunnen opwaarderen: %s
nn: Kan ikkje halda fram å installera, då desse pakkane først må fjernast for at andre skal kunna oppgraderast: %s
pl: Instalacja nie może być kontynuowana ponieważ poniższe pakiety muszą zostać usunięte aby zaktualizować inne: %s
pt: A instalação não pode continuar porque os pacotes seguintes têm que ser removidos para que outros sejam actualizados: %s
pt_br: A instalação não pode continuar porque os seguitens pacotes precisam ser removidos para que os outros possam ser atualizados: %s
ro: Instalarea nu poate continua deoarece pachetele următoare trebuiesc înlăturate pentru ca celelalte să fie actualizate: %s
ru: Установку невозможно продолжить, т.к. необходимо удалить следующие пакеты для обновления остальных: %s
sl: Namestitev se ne more nadaljevati, ker je potrebno odstraniti naslednje pakete, da bodo drugi lahko nadgrajeni: %s
sq: Instalimin nuk mund të vazhdoj më tutje, sepse pakot a radhitura duhet të zhduken që të tjerat të azhurnohen: %s
sv: Installationen kan inte fortsätta eftersom följande paket måste tas bort så att andra kan uppdateras: %s
tr: Kurulum devam edemez çünkü diğer paketlerin güncellenmesi için aşağıdaki paketlerin kaldırılması gerekiyor: %s

source: (test only, removal will not be actually done)
ast: (namái preba, nun se llevará a cabo la desinstalación)
ca: (només de prova, la supressió no es farà)
cs: (pouze test, k odstranění ve skutečnosti nedojde)
cy: (prawf yn unig, ni fydd yn cael ei ddadosod)
da: (kun test, fjernelse vil egentlig ikke blive gennemført)
el: (μονάχα έλεγχος, η αφαίρεση δεν θα γίνει πραγματικά)
es: (sólo prueba, no se llevará a cabo la desinstalación)
et: (ainult test, tegelikult midagi ei eemaldata)
eu: (froga soilik, ezabaketa ez da egingo)
fi: (vain testi, paketteja ei poisteta oikeasti)
fr: (test uniquement, la suppression ne sera pas effectuée)
gl: (só probar, a eliminación non se fará agora mesmo)
he: (בדיקה בלבד, ההסרה לא תבוצע למעשה)
hu: (csak teszt; az eltávolítás nem lesz ténylegesen végrehajtva)
id: (hanya pengujian, penghapusan tidak akan dilakukan)
is: (aðeins prófun, ekkert verður í raun fjarlægt)
it: (è solo un test, la rimozione non verrà effettuata)
nb: (kun test, fjerning vil egentlig ikke bli gjennomført)
nl: (alleen test, verwijdering zal niet daadwerkelijk plaatsvinden)
nn: (Berre ein test. Pakkane vert ikkje fjerna.)
pl: (to tylko test, usunięcie nie zostanie przeprowadzone)
pt: (testa apenas, a remoção não é executada)
pt_br: (somente testar, remoções não serão efetivadas)
ro: (doar test, fără înlăturare de pachete)
ru: (только проверка; ничего удалено не будет)
sl: (samo test, brisanje se ne bo izvedlo)
sv: (endast test, ingenting kommer att bli borttaget)
tr: (sadece deneme, gerçekte kaldırma yapılmayacak.)
