Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: no xml info for medium "%s", only partial result for package %s
ast: nun esiste xml info pal sofitu "%s", namái resultaos parciales pal paquete %s
cs: pro zdroj "%s" neexistuje xml info, pouze částečný výsledek pro balíček %s
cy: dim xml info ar gyfer cyfrwng "%s", dim ond canlyniad rhannol ar gyfer pecyn %s
da: Ingen 'xml-info for medie '%s', kun delvist resultat for pakken '%s'
el: δεν βρέθηκαν πληροφορίες xml, για το μέσο "%s", μονάχα περιορισμένα αποτελέσματα για το πακέτο %s
es: no existe xml info para el soporte «%s», sólo resultados parciales para el paquete %s
et: andmekandjal "%s" puudub XML-info, paketil %s on ainult osaline tulemus
eu: ez dago "%s" euskarriarentzako xml info, %s paketearentzako emaitza partzialak soilik
fi: Medialla "%s" ei ole xml-tietoja, löytyi vain osittainen hakutulos paketille %s
fr: pas d'information xml pour le média « %s », uniquement un résultat partiel pour le paquetage %s
gl: non hai información xml do soporte "%s", só resultado parcial para o paquete %s
he: אין מידע ב-xml למקור "%s", תוצאה חלקית בלבד עבור החבילה %s
hu: nincs listafájlja a(z) "%s" adatforrásnak, ezért csak részleges eredmény van a(z) "%s" csomaghoz
is: engin XML-info skrá fyrir miðil "%s", aðeins takmarkaðar upplýsingar fyrir pakka %s
it: manca xml-info per il supporto "%s", solo risultati parziali per il pacchetto %s
nb: Ingen xml-info for medium «%s«, bare delvis resultat for pakke %s
nl: geen xml-info voor medium "%s", slechts een deelresultaat voor pakket %s
nn: Ingen xml-info for mediet «%s». Berre delvis resultat for pakken «%s».
pl: brak informacji xml dla nośnika "%s", uzyskano częściowe wyniki dla pakietu %s
pt: nenhuma informação xml da média "%s", apenas o resultado parcial do pacote %s
pt_br: sem xml info para a mídia "%s", resultado parcial para o pacote %s
ro: nu sînt informații XML pentru mediul „%s”, numai rezultate parțiale pentru pachetul %s
ru: для источника «%s» отсутствует xml-info; только частичный результат для пакета %s
sl: Ni podatkov v obliki XML o paketih za vir »%s«, na voljo so le delni rezultati za paket %s
sv: ingen xml-info för media "%s", endast ofullständigt resultat för paketet %s
tr: "%s" ortamı için xml bilgisi bulunamadı. %s paketi için herhangi bir kısmi sonuç döndürülemedi.

source: no xml info for medium "%s", only partial result for packages %s
ast: nun esiste xml info pal sofitu "%s", namái resultaos parciales pa los paquetes %s
cs: pro zdroj "%s" neexistuje soubor xml info, pouze částečný výsledek pro balíčky %s
cy: dimxml info ar gyfer cyfrwng "%s", dim ond canlyniad rhannol ar gyfer pecynnau %s
da: Ingen xml-info for medie'%s', kun delvist resultat for pakkerne '%s'
el: δεν βρέθηκαν πληροφορίες xml, για το μέσο "%s", μονάχα περιορισμένα αποτελέσματα για τα πακέτα %s
es: no existe xml info para el soporte «%s», sólo resultados parciales para los paquetes %s
et: andmekandjal "%s" puudub XML-info, pakettidel %s on ainult osaline tulemus
eu: ez dago "%s" euskarriarentzako xml info, %s paketeentzako emaitza partzialak soilik
fi: Medialla "%s" ei ole xml-tietoja, löytyi vain osittainen hakutulos paketeille %s
fr: pas d'information xml pour le média « %s », uniquement un résultat partiel pour les paquetages %s
gl: non hai información xml do soporte "%s", só resultado parcial para os paquetes %s
he: אין מידע ב-xml למקור "%s", תוצאה חלקית בלבד עבור החבילות %s
hu: nincs listafájlja a(z) "%s" adatforrásnak, ezért csak részleges eredmény van a(z) "%s" csomagokhoz
is: engin XML-info skrá fyrir miðil "%s", aðeins takmarkaðar upplýsingar fyrir pakka %s
it: manca xml-info per il supporto "%s", solo risultati parziali per i pacchetti %s
nb: Ingen xml-info for medium «%s«, bare delvis resultat for pakkene %s
nl: geen xml-info voor medium"%s", slechts een deelresultaat voor pakketten %s
nn: Ingen xml-info for mediet «%s». Berre delvis resultat for pakkane «%s».
pl: brak informacji xml dla nośnika "%s", uzyskano częściowe wyniki dla pakietów %s
pt: nenhuma informação xml da média "%s", apenas o resultado parcial dos pacotes %s
pt_br: sem xml info para a mídia "%s", resultado parcial para os pacotes %s
ro: nu sînt informații XML pentru mediul „%s”, numai rezultate parțiale pentru pachetele %s
ru: для источника «%s» отсутствует xml-info; только частичный результат для пакетов %s
sl: Ni podatkov v obliki XML o paketih za vir »%s«, na voljo so le delni rezultati za pakete %s
sv: ingen xml-info för media "%s", endast ofullständigt resultat för paketen %s
tr: "%s" ortamı için xml bilgisi bulunamadı. %s paketleri için herhangi bir kısmi sonuç döndürülemedi.

source: no xml info for medium "%s", unable to return any result for package %s
ast: nun esiste xml info pal sofitu "%s", nun se retornen resultaos pal paquete %s
cs: pro zdroj "%s" neexistuje soubor xml info, nelze vrátit žádný výsledek pro balíček %s
cy: dim xml info ar gyfer cyfrwng"%s", methu canfod unrhyw ganlyniad ar gyfer pecyn %s
da: Ingen 'xml-info for medie '%s', kan ikke vise noget resultat for pakken %s
el: δεν βρέθηκαν πληροφορίες xml, για το μέσο "%s", αδύνατη η λήψη αποτελεσμάτων για το πακέτο %s
es: no existe xml info para el soporte «%s», no se retornan resultados para el paquete %s
et: andmekandjal "%s" puudub XML-info, paketile %s ei ole mingit tulemust
eu: ez dago "%s" euskarriarentzako xml info, ezin da %s paketearentzako inolako emaitzarik itzuli
fi: Medialla "%s" ei ole xml-tietoja, paketille %s ei voida palauttaa hakutuloksia
fr: pas d'information xml pour le média « %s », impossible de retourner un résultat pour le paquetage %s
gl: non hai información xml do soporte "%s", non foi posible devolver ningún resultado para o paquete %s
he: אין מידע ב-xml למקור "%s", אין כל תוצאה עבור החבילה %s
hu: nincs listafájlja a(z) "%s" adatforrásnak, ezért nincs eredmény a(z) "%s" csomaghoz
is: engin XML-info skrá fyrir miðil "%s", fann engar upplýsingar um pakka %s
it: manca xml-info per il supporto "%s", impossibile fornire risultati per il pacchetto %s
nb: Ingen xml-info for medium «%s«, kan ikke vise resultat for pakken %s
nl: geen xml-info voor medium "%s", niet in staat resultaten te geven voor pakket %s
nn: Ingen xml-info for mediet «%s». Kan ikkje visa resultat for pakken «%s».
pl: brak informacji xml dla nośnika "%s", uzyskanie wyników dla pakietu %s było niemożliwe
pt: nenhuma informação xml da média "%s", incapaz de devolver qualquer resultado do pacote %s
pt_br: sem xml info para a mídia "%s", incapaz de retornar resultados para %s
ro: nu sînt informații XML pentru mediul „%s”, nu se poate întoarce nici un rezultat pentru pachetul %s
ru: для источника «%s» отсутствует xml-info; невозможно возвратить результат для пакета %s
sl: Ni podatkov v obliki XML za vir »%s«, ni bilo možno najti nobenega rezultata za paket %s
sv: ingen xml-info för media "%s", kan inte returnera resultat för paketet %s
tr: "%s" ortamı için xml bilgisi bulunamadı. %s paketi için herhangi bir sonuç döndürülemedi.

source: no xml info for medium "%s", unable to return any result for packages %s
ast: nun esiste xml info pal sofitu "%s", nun pueden retornase resultaos pa los paquetes %s
cs: pro zdroj "%s" neexistuje soubor xml info, nelze vrátit žádný výsledek pro balíčky %s
cy: dim xml info ar gyfer cyfrwng"%s", methu canfod unrhyw ganlyniad ar gyfer pecynnau %s
da: Ingen xml-info for medie '%s', kan ikke vise resultat for pakkerne %s
el: δεν βρέθηκαν πληροφορίες xml, για το μέσο "%s", αδύνατη η επιστροφή αποτελεσμάτων για τα πακέτα %s
es: no existe xml info para el soporte «%s», no se pueden retornar resultados para los paquetes %s
et: andmekandjal "%s" puudub XML-info, pakettidele %s ei ole mingit tulemust
eu: ez dago "%s" euskarriarentzako xml info, ezin da %s paketeentzako inolako emaitzarik itzuli
fi: Medialla "%s" ei ole xml-tietoja, paketeille %s ei voida palauttaa hakutuloksia
fr: pas d'information xml pour le média « %s », impossible de retourner un résultat pour les paquetages %s
gl: non hai información xml do soporte "%s", non foi posible devolver ningún resultado para os paquetes %s
he: אין מידע ב-xml למקור "%s", אין כל תוצאה עבור החבילות %s
hu: nincs listafájlja a(z) "%s" adatforrásnak, ezért nincs eredmény a(z) "%s" csomagokhoz
is: engin XML-info skrá fyrir miðil "%s", fann engar upplýsingar fyrir pakka %s
it: manca xml-info per il supporto "%s", impossibile fornire risultati per i pacchetti %s
nb: Ingen xml-info for medium «%s«, kan ikke vise resultat for pakkene %s
nl: geen xml-info voor medium "%s", niet in staat een resultaat te geven voor pakketten %s
nn: Ingen xml-info for mediet «%s». Kan ikkje visa resultat for pakkane «%s».
pl: brak informacji xml dla nośnika "%s", uzyskanie wyników dla pakietów %s było niemożliwe
pt: nenhuma informação xml da média "%s", incapaz de devolver qualquer resultado dos pacotes %s
pt_br: sem xml info para a mídia "%s", incapaz de retornar resultados para %s
ro: nu sînt informații XML pentru mediul „%s”, nu se poate întoarce nici un rezultat pentru pachetele %s
ru: для источника «%s» отсутствует xml-info; невозможно возвратить результат для пакетов %s
sl: Ni podatkov v obliki XML za vir »%s«, ni bilo možno najti nobenega rezultata za pakete %s
sv: ingen xml-info för media "%s", kan inte returnera resultat för paketen %s
tr: "%s" ortamı için xml bilgisi bulunamadı. %s paketleri için herhangi bir sonuç döndürülemedi.

source: No changelog found
ast: Nu s'atopó changelog
ca: No s'ha trobat la llista de canvis
cs: Nebyl nalezen záznam změn
cy: Heb ganfod changelog
da: Ingen ændringslog fundet
el: Δεν βρέθηκε αρχείο αλλαγών (changelog)
es: No se encontró changelog
et: Muutuste logi ei leitud
eu: Ez da changelog aurkitu
fi: Muutoslokia ei löytynyt
fr: Aucun Changelog trouvé
gl: Non se atopou o changelog
he: לא נמצאה רשימת שינויים
hu: Változási lista nem található
id: Changelog tidak ditemukan
is: Enginn breytilisti fannst
it: Nessun elenco delle modifiche trovato
nb: Fant ingen endringslogg
nl: Geen wijzigingslogboek gevonden
nn: Fann ikkje endringslogg.
pl: Nie znaleziono dziennika zmian
pt: Nenhum registo de mudanças (changelog) encontrado
pt_br: Arquivo com as alterações não foi encontrado
ro: Nu s-a gasit jurnalul de modificări
ru: Не найден журнал изменений
sl: Dnevnik sprememb ni bil najden
sv: Ingen ändringslogg hittades
tr: Değişiklik günlüğü bulunamadı!

source: Software Installer
ast: Instalador de software
ca: Instal·lador de programari
cs: Instalace software
cy: Gosodwr Meddalwedd
da: Programmel-installering
el: Εγκαταστάτης Λογισμικού
es: Instalador de software
et: Tarkvara paigaldaja
eu: Software Instalatzailea
fi: Ohjelmien asennin
fr: Installer des logiciels
gl: Instalador de Software
he: מתקין חבילות תוכנה
hu: Szoftvertelepítő
id: Penginstall perangkat lunak
is: Hugbúnaðar-uppsetning
it: Programma d'installazione
nb: Programvareinstallatør
nl: Software-installatie
nn: Programinstallering
pl: Instalator oprogramowania
pt: Instalador de Programas
pt_br: Instalador de Programas
ro: Instalator de programe
ru: Инсталлятор программ
sl: Program za nameščanje
sv: Programinstallerare
tr: Yazılım Yükleyici

source: Graphical front end to install RPM files
ast: Interface gráfica pa instalar ficheros RPM
ca: Frontal gràfic per instal·lar fitxers RPM
cs: Grafické rozhraní pro instalaci balíčků RPM
cy: Blaen graffigol ar gyfer gosod ffeiliau RPM
da: Grafisk frontend til installation af rpm-filer
el: Ένα γραφική πρόσοψη για την εγκατάσταση αρχείων RPM
es: Interfaz gráfica para instalar archivos RPM
et: Graafiline kasutajaliides pakettide paigaldamiseks
eu: RPM fitxategiak instalatzeko interfaze grafikoa
fi: Graafinen ohjelmien asennin
fr: Interface graphique pour l'installation de paquetages RPM
gl: Interface gráfica para instalar ficheiros RPM
he: ממשק גרפי להתקנת חבילות RPM
hu: Grafikus felület RPM csomagok telepítéséhez
id: Tampilan grafis untuk menginstall file RPM
is: Grrafískt viðmót til aðstoðar við innsetningu RPM skráa
it: Interrfaccia grafica per l'installazione dei pacchetti RPM
nb: Et grafisk grensesnitt for installering av RPM-filer
nl: Grafische schil voor het installeren van RPM bestanden
nn: Grafisk grensesnitt for installering av RPM-filer
pl: Graficzna nakładka dla instalatora plików RPM
pt: Interface gráfico para instalar ficheiros RPM
pt_br: Interface gráfica para instalar pacotes RPM
ro: Interfața grafică pentru instalarea fișierelor RPM
ru: Графический интерфейс для установки файлов RPM
sl: Grafični vmesnik za nameščanje datotek RPM
sq: Interfac grafike dhe për instalimin e skedareve RPM
sv: Grafiskt gränssnitt för RPM-installation
tr: RPM dosyaların kurulumu için bir grafik önyüz

source: Ok
ast: Aceutar
ca: D'acord
cy: Iawn
el: Εντάξει
es: Aceptar
et: Olgu
eu: Ados
gl: Aceptar
he: אישור
is: Í lagi
ru: ОК
sl: V redu
tr: Tamam

source: Nn
el: ΟοNn
et: EeNn
eu: eEnN
fi: EeNn
id: TtNn
ru: NnНн
tr: HhNn

source: --url - url
el: --url - αναζήτηση στο πεδίο «Url»
fr: --url - chercher dans le champ « Url »
is: --url - slóð.
it: --url - URL del pacchetto
nb: --url – adresse
nn: --url - Adresse.
pl: --URL - adres URL
sv: --url - visa url

source: _Ok
ast: _Val
ca: _D'acord
cy: _Iawn
el: _Εντάξει
et: _Olgu
eu: _Ados
gl: _Aceptar
he: _המשך
is: Í _lagi
ru: _ОК
sl: V _redu
tr: _Tamam

source: Verifying package signatures...
ast: Verificando les robles de los paquetes...
el: Επαλήθευση των υπογραφών των πακέτων...
et: Signatuuride kontrollimine...
fr: Vérification de la signature des paquetages…
nl: Controleren van pakket-ondertekeningen…
nn: Stadfestar pakkesignaturar …
pt_br: Verificando assinatura dos pacotes...
ru: Проверяются подписи пакетов...
sl: Preverjanje podpisov paketov …
sq: Verifikimi i nënshkrimeve paketës...

source: Removing package `%s' ...
ast: Desaniciando'l paquete `%s'...
el: Αφαίρεση του πακέτου «%s» ...
et: Paketi '%s' eemaldamine...
fr: Désinstallation du paquetage « %s »...
nl: Pakket `%s' verwijderen...
pt_br: Removendo pacote `%s' ...
ru: Удаляется пакет «%s»...
sl: Odstranjevanje paketa »%s« …
sq: Heqja paketave `%s'...

source: Cancel
ast: Encaboxar
el: Ακύρωση
et: Loobu
fr: Annuler
nl: Annuleren
nn: Avbryt
pt_br: Cancelar
ru: Отмена
sl: Prekliči
sq: Anulo

source: An error occurred:
ast: Asocedió un fallu:
el: Παρουσιάστηκε ένα σφάλμα :
et: Tekkis viga:
fr: Une erreur est survenue :
nl: Er is een fout opgetreden
pt_br: Um erro ocorreu:
ru: Произошла ошибка:
sl: Prišlo je do napake:
sq: Një gabim ndodhi:

source: You may want to update your urpmi database.
ast: Pues querer anovar la base de datos d'urpmi.
el: Μπορείτε να ενημερώσετε τη βάση δεδομένων urpmi.
et: Te võiksite ehk uuendada urpmi andmebaasi.
fr: Vous pouvez mettre à jour votre base de données urpmi.
nl: U kunt proberen de urpmi-database bij te werken.
nn: Du bør oppdatera urpmi-databasen.
pt_br: Você precisa atualizar a sua base de dados urpmi.
ru: Возможно, нужно обновить базу данных urpmi.
sl: Poskusite posodobiti podatkovno zbirko urpmi.
sq: Ju mund të dëshironi të përditësoni bazën e të dhënave tuaja urpmi.

source: un-ignoring non-free medium `%s' b/c nonfree packages are installed
el: συμπερίληψη του μέσου «non-free» `%s' υπάρχουν εγκατεστημένα «b/c non-free» πακέτα
et: mittevaba tarkvara andmekandja `%s' mitteeiramine sellise tarkvara paigaldamise tõttu
fr: Prise en compte des medium non-free `%s' car des paquetages nonfree sont installés
nl: inschakelen van non-free medium `%s' want nonfree pakketten zijn geïnstalleerd
pt_br: ignorando non-free médio `%s' b/c pacotes non-free sera instalados
ru: отмена игнорирования non-free источника пакетов `%s', так как установлены несвободные пакеты
sl: omogočanje vira z zaprto-kodnimi programi/gonilniki »%s«, saj je nekaj takih nameščenih
sq: jo-injorim i non-free medium `%s' b/c janë instaluar programe jo të lirë

source: un-ignoring tainted medium `%s' b/c tainted packages are installed
el: συμπερίληψη του μέσου «tainted» `%s' υπάρχουν εγκατεστημένα «b/c tainted» πακέτα
et: piirangutega tarkvara andmekandja `%s' mitteeiramine sellise tarkvara paigaldamise tõttu
fr: Prise en compte des medium tainted `%s' car des paquetages tainted sont installés
nl: inschakelen van tainted medium `%s' want tainted pakketten zijn geïnstalleerd
pt_br: ignorando tainted medio `%s' b/c pacotes tainted sera instalados
ru: отмена игнорирования tainted источника `%s', так как установлены пакеты с сомнительными условиями лицензирования
sl: omogočanje vira s patentno zaščitenimi programi/gonilniki z angleškim imenom tainted »%s«, saj je nekaj takih nameščenih

source: un-ignoring 32bit medium `%s' b/c 32-bit packages are installed or system is 32-bit EFI
el: συμπερίληψη του μέσου 32bit `%s' διότι υπάρχουν 32-bit πακέτα εγκατεστημένα ή το σύστημα είναι 32-bit EFI
et: 32-bitise andmekandja`%s' mitteeiramine, sest paigaldatud on 32-bitist tarkvara või on süsteem 32-bitine EFI
ru: отменяем игнорирование 32-битного источника пакетов «%s», поскольку устанавливаются 32-битные пакеты или система является 32-битной системой EFI
sl: omogočanje 32-bitnega vira »%s«, saj so nameščeni 32-bitni paketi ali pa je sistem 32-bitni EFI

source: (recommended)
el: (προτεινόμενο)
et: (soovitatav)
fr: (recommandé)
nl: (aanbevolen)
pt_br: (recomendado)
ru: (рекомендуется)
sl: (priporočeno)
sq: (rekomanduar)

source: SECURITY: The following package is _NOT_ signed (%s): %s
ast: SEGURIDÁ: El paquete siguiente _NUN_ ta robláu (%s): %s
el: ΑΣΦΑΛΕΙΑ: Το παρακάτω πακέτο _ΔΕΝ_ είναι υπογεγραμμένο (%s): %s
et: TURVALISUS: järgmisel paketil EI OLE allkirja (%s): %s
fr: SECURITÉ : Les paquetages suivants ne sont _PAS_ signés (%s) : %s
nl: VEILIGHEID: Het volgende pakket is _NIET_ ondertekent (%s): %s
pt_br: SEGURANÇA: O pacote seguinte NÃO_ESTÁ_ assinado (%s): %s
ru: БЕЗОПАСНОСТЬ: Следующий пакет не подписан (%s): %s
sl: VARNOST: Naslednji paket _NI_ podpisan (%s): %s

source: SECURITY: NOT checking package "%s" (due to configuration)
el: ΑΣΦΑΛΕΙΑ: ΧΩΡΙΣ έλεγχο του πακέτου «%s» (λόγω της διαμόρφωσης)
et: TURVALISUS: EI kontrollita paketti "%s" (seadistuse tõttu)
fr: SECURITÉ : PAS de vérification du paquet « %s » (à cause de la configuration)
nl: VEILIGHEID: Pakket "%s" wordt NIET gecontroleerd (ten gevolge van uw instellingen)
pt_br: SEGURANÇA: NÃO verificar pacote "%s" (devido à configuração)
ru: БЕЗОПАСНОСТЬ: НЕ проверяется пакет "%s" (см. данную конфигурацию)
sl: VARNOST: BREZ preverjanja paketa »%s« (zaradi nastavitev)

source: SECURITY: Medium "%s" has no key (%s)!
ast: SEGURIDÁ: ¡El mediu "%s" nun tien clave (%s)!
el: ΑΣΦΑΛΕΙΑ: Το μέσο «%s» δεν διαθέτει κλειδί (%s) !
et: TURVALISUS: andmekandjal "%s" ei ole võtit (%s)!
fr: SECURITÉ : Le média « %s » n'a pas de clé (%s) !
nl: VEILIGHEID: Het medium "%s" heeft geen sleutel (%s)!
pt_br: SEGURANÇA: Médio "%s" Não tem chave (%s)!
ru: БЕЗОПАСНОСТЬ: Средний "%s" не имеет ключа (%s)!
sl: VARNOST: Vir »%s« nima ključa (%s)!

source: Medium without key (%s)
ast: Mediu ensin clave (%s)
el: Μέσο χωρίς κλειδί (%s)
et: Andmekandja ilma võtmeta (%s)
fr: Media sans clé (%s)
nl: Medium zonder sleutel (%s)
pt_br: Médio, sem chave (%s)
ru: Средний без ключа (%s)
sl: Vir brez ključa (%s)

source: --recommends - recommends tags
el: --recommends - αναζήτηση στο πεδίο των προτεινόμενων
et: --recommends - soovitatavate pakettide sildid
fr: --recommends - chercher dans le champ «recommends»
nl: --recommends - recommends('beveelt aan')-tags
pt_br: --recommends - tags recomendadas
ru: --recommends - метки рекомендаций
sl: --recommends - oznake priporočenih paketov

source: --no-recommends - do not auto select "recommended" packages.
el: --no-recommends - να μην επιλεγούν αυτόματα τα «προτεινόμενα» πακέτα.
et: --no-recommends - \"soovitatud\" pakette ei valita automaatselt.
fr: --no-recommends - pas de sélection auto des paquetages "recommandés"
nl: --no-recommends - aanbevolen pakketten niet auto-selecteren.
pt_br: --no-recommends - para não auto selecionar pacotes "recomendados" .
ru: --no-recommends - не выбирать автоматически «рекомендованные» пакеты
sl: --no-recommends - brez samodejne izbire priporočenih paketov.

source: --downgrade - downgrade a package from the version currently installed to the previously highest version
el: --downgrade - υποβάθμιση ενός πακέτου από την εγκατεστημένη του έκδοση στην προηγούμενη τελευταία έκδοση
et: --downgrade - paketi versiooni alandamine viimasele saadaolevale versioonile
fr: --downgrade - désinstalle la version actuellement installée d'un paquetage et installe sa plus haute version précédente
nl: --downgrade - vervang de huidige geïnstalleerde versie van het pakket door de meest recente voorgaande versie ervan
pt_br: --downgrade - rebaixando um pacote da versão atualmente instalada Para a versão anterior
ru: --downgrade - заменить пакет текущей версии на пакет с наибольшим номером предыдущей версии
sl: --downgrade - podgradi paket s trenutne verzije na prejšnjo

source: --allow-recommends - auto select "recommended" packages.
el: --allow-recommends - αυτόματη επιλογή των «προτεινόμενων» πακέτων.
et: --allow-recommends - automaatne \"soovitatud\" pakettide valimine.
fr: --allow-recommends - sélection auto des paquetages "recommandés".
nl: --allow-recommends - aanbevolen pakketten autoselecteren.
pt_br: --allow-recommends - auto seleciona pacotes "recomendados".
ru: --allow-recommends - выбирать автоматически «рекомендованные» пакеты
sl: --allow-recommends - samodejno izbere »priporočene« pakete.

source: --recommends - print recommends.
el: --recommends - εμφάνιση των προτεινόμενων πακέτων.
et: --recommends - näitab soovitatavaid.
fr: --recommends - afficher le champ «recommends»
nl: --recommends - recommends ('beveelt aan') afdrukken.
pt_br: --recommends - imprime recomendados.
ru: --recommends - вывести список рекомендаций.
sl: --recommends - izpiše priporočeno.

source: Run Mageia Package Installer
ast: Executar instalador de paquete Mageia
el: Εκτέλεση του Εγκαταστάτη Πακέτων Mageia
et: Mageia tarkvara paigaldaja käivitamine
fr: Lancer l'installeur de paquetage Mageia
nl: Start de Mageia-pakketinstallatie
pt_br: Execultando Instalador de Pacotes Mageia
ru: Запуск программы установки пакетов Mageia
sl: Zagon programa za namestitev paketov Mageje

source: Authentication is required to run Mageia Package Installer
ast: Requierse l'autenticación pa executar l'instalador de paquete Mageia
el: Απαιτείται πιστοποίηση για την εκτέλεση του Εγκαταστάτη Πακέτων Mageia
et: Mageia tarkvara paigaldaja käivitamine nõuab autentimist
fr: Une authentification est nécessaire pour lancer l'installeur de paquetage Mageia.
nl: Authenticatie is nodig om de Mageia-pakketinstallatie te starten
pt_br: A autenticação é necessária para executar o Instalador de Pacotes Mageia
ru: Требуется аутентификация для запуска программы установки пакетов Mageia
sl: Za zagon nameščanja paketov Mageje je potrebno overjanje

source: No
el: Όχι

source: Yes
el: Ναι

source: un-ignoring 32bit medium `%s' b/c system is 32-bit EFI
fr: réactivation des dépôts `%s' 32 bits car le système a un EFI 32 bits
pt_br: Ignorando a mídia 32bit `%s' sistema b/c é 32-bit EFI
