Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: unable to open rpmdb
ast: nun puede abrise rpmdb
ca: no s'ha pogut obrir rpmdb
cs: nelze otevřít databázi rpmdb
cy: methu agor rpmdb
da: kunne ikke åbne rpmdb
el: αδυναμία ανοίγματος του rpmdb
es: no se puede abrir rpmdb
et: rpmdb avamine nurjus
eu: ezin da rpmdb ireki
fi: Rpm-tietokantaa ei voitu avata
fr: impossible d'ouvrir la base de donnée rpm
gl: non foi posible abrir rpmdb
he: אין אפשרות לפתוח את בסיס הנתונים של החבילות rpmdb
hu: az rpmdb megnyitása nem sikerült
id: gagal membuka rpmdb
is: gat ekki opnað rpmdb
it: impossibile aprire il database rpm
nb: kunne ikke åpne rpmdb
nl: kon rpmdb niet openen
nn: Klarte ikkje opna «rpmdb».
pl: nie można otworzyć bazy danych rpm
pt: não é possível abrir rpmdb
pt_br: incapaz de abrir rpmdb
ro: nu se poate deschide rpmdb
ru: не удаётся открыть базу данных RPM
sl: odpiranje rpmdb ni možno
sq: e pa mundur hapja e rpmdb
sv: kunde inte öppna RPM-db
tr: rpm veritabanı açılamıyor

source: invalid rpm file name [%s]
ast: nome de ficheru rpm non válidu [%s]
ca: el nom del fitxer rpm és incorrecte [%s]
cs: neplatný název RPM souboru [%s]
cy: enw ffeil rpm annilys [%s]
da: ugyldigt rpm-filnavn [%s]
el: μη έγκυρο όνομα αρχείου rpm [%s]
es: nombre de archivo rpm no válido [%s]
et: vigane RPM-faili nimi [%s]
eu: rpm fitxategi-izen baliogabea [%s]
fi: Virheellinen rpm-paketin nimi [%s]
fr: le nom du fichier rpm est invalide [%s]
gl: nome de ficheiro rpm incorrecto [%s]
he: שם החבילה [%s] אינו תקין
hu: érvénytelen csomagfájlnév: "%s"
id: nama file rpm [%s] tak valid
is: ógilt rpm skráarnafn [%s]
it: nome del file rpm non valido [%s]
nb: ugyldig filnavn [%s]
nl: ongeldige rpm-bestandsnaam [%s]
nn: Ugyldig rpm-filnamn [%s].
pl: niepoprawna nazwa pliku rpm [%s]
pt: nome de ficheiro rpm inválido [%s]
pt_br: nome rpm inválido [%s]
ro: nume invalid de fișier rpm [%s]
ru: недопустимое название rpm-файла [%s]
sl: napačno ime datoteke rpm [%s]
sq: emri i skedares rpm është invalid [%s]
sv: ogiltigt RPM-filnamn [%s]
tr: rpm dosya ismi [%s] geçersiz

source: retrieving rpm file [%s] ...
ast: obteniendo ficheru rpm [%s] ...
ca: s'està recuperant els fitxer rpm [%s] ...
cs: načítám RPM soubor [%s] ...
cy: adfer ffeil rpm (%s)...
da: henter rpm-fil [%s]...
el: ανάκτηση αρχείου rpm [%s] ...
es: obteniendo archivo rpm [%s] ...
et: RPM-faili [%s] tõmbamine...
eu: [%s] rpm fitxategia berreskuratzen...
fi: Noudetaan rpm-pakettia [%s]...
fr: récupération des fichiers rpm [%s]...
gl: obtendo o ficheiro rpm [%s] ...
he: מאחזר קובץ RPM [%s]...
hu: RPM-fájl behozatala: "%s"...
id: mengambil file rpm [%s] ...
is: sæki rpm skrá [%s] ...
it: recupero il file rpm [%s] ...
nb: henter filen [%s] …
nl: bezig met ontvangen van rpm bestand [%s] ...
nn: Lastar ned rpm-fil [%s] ...
pl: pobieranie pliku rpm [%s] ...
pt: a transferir o ficheiro rpm [%s] ...
pt_br: buscando o arquivo rpm [%s]....
ro: se preia fișierul rpm [%s] ...
ru: извлекается rpm-файл [%s] ...
sl: prenos datoteke rpm [%s] …
sq: rikuperimi i skedareve rpm [%s]...
sv: hämtar RPM-fil [%s]...
tr: Rpm dosyası [%s] getiriliyor...

source: ...retrieving done
ast: ...recuperación fecha
ca: ...recuperació feta
cs: ...načítání ukončeno
cy: .cwblhau adfer
da: ...hentning færdig
el: ...η ανάκτηση ολοκληρώθηκε
es: ...recuperación hecha
et: ...tõmbamine tehtud
eu: ...berreskuratu da
fi: ...noudettu
fr: ... récupération effectuée
gl: ...obtención rematada
he: ...האחזור הסתיים
hu: ...behozatal megtörtént
id: ...pengambilan selesai
is: ...niðurhali lokið
it: ...recupero terminato
nb: … ferdig
nl: ...klaar met ontvangst
nn: ... ferdig lasta ned.
pl: ...pobieranie zakończone
pt: ...transferência terminada
pt_br: ...busca completa
ro: ...copierea este terminată
ru: ...извлечение выполнено
sl: … prenos je opravljen
sq: ...rikuperim i bërë
sv: ...hämtning klar
tr: ...alma tamamlandı

source: unable to access rpm file [%s]
ast: nun puede accedese al ficheru rpm [%s]
ca: no s'ha pogut accedir al fitxer rpm [%s]
cs: nelze přistupovat k RPM souboru [%s]
cy: methu cael mynediad ffeil rpm (%s)
da: kunne ikke nå rpm fil [%s]
el: αδυναμία πρόσβασης στο αρχείο rpm [%s]
es: no se puede acceder al archivo rpm [%s]
et: ligipääs RPM-failile [%s] nurjus
eu: ezin izan da rpm fitxategia atzitu [%s]
fi: Rpm-pakettia [%s] ei voitu käsitellä
fr: impossible d'accéder au fichier rpm [%s]
gl: non foi posible acceder ó ficheiro rpm [%s]
he: הגישה לחבילה [%s] נכשלה
hu: a csomagfájl nem elérhető: "%s"
id: gagal mengakses file rpm [%s]
is: get ekki lesið rpm skrá [%s]
it: impossibile accedere al file rpm [%s]
nb: Klarte ikke lese fila [%s].
nl: kon rpm-bestand [%s] niet benaderen
nn: Klarte ikkje lesa rpm-fil [%s].
pl: nie można uzyskać dostępu do pliku rpm [%s]
pt: não é possível aceder ao ficheiro rpm [%s]
pt_br: incapaz de acessar o arquivo rpm [%s]
ro: nu se poate accesa fișierul rpm [%s]
ru: нет доступа к rpm-файлу [%s]
sl: do datoteke rpm [%s] ni mogoče dostopati
sq: e pa mundur hyrja në skedaren rpm [%s]
sv: kan inte läsa rpm-fil [%s]
tr: rpm dosyasına [%s] erişilemiyor

source: unable to parse spec file %s [%s]
cs: nelze zpracovat soubor SPEC %s [%s]
cy: methu didoli ffeil spec %s [%s]
da: kunne ikke fortolke spec-fil '%s [%s]
el: αδυναμία ανάλυσης του αρχείου spec %s [%s]
es: no se pudo interpretar el archivo spec %s [%s]
et: spetsifikatsioonifaili %s parsimine nurjus [%s]
eu: ezin da %s spec fitxategia sintaktikoki egiaztatu [%s]
fi: Spec-tiedostoa %s [%s] ei voitu tulkita
fr: impossible d'analyser le fichier spec %s [%s]
gl: non foi posible analizar o ficheiro spec %s [%s]
he: אין אפשרות לפענח את קובץ המפרט %s [%s]
hu: nem sikerült elemezni a(z) "%s" specifikációs fájlt [%s]
id: gagal mem-parse file spec %s [%s]
is: get ekki unnið úr spec skrá %s [%s]
it: impossibile analizzare il file spec %s [%s]
nb: Klarte ikke tolke spesifikasjonsfila %s [%s].
nl: niet in staat spec-bestand %s te analyseren [%s]
nn: Klarte ikkje tolka spec-fila «%s» [%s].
pl: nie można przetworzyć pliku konfiguracyjnego %s [%s]
pt: não é possível analisar o ficheiro spec %s [%s]
pt_br: incapaz de processar arquivo spec %s [%s]
ro: nu se poate analiza fișierul %s [%s]
ru: не удаётся разобрать spec-файл %s [%s]
sl: datoteke spec %s [%s] ni mogoče razčleniti
sq: i paaftë për të analizuar skedarin e spekulimit %s [%s]
sv: kan inte tyda spec-fil %s [%s]
tr: %s [%s] spec dosyası ayrıştırılamıyor

source: unable to register rpm file
ast: nun pudo rexistrase'l ficheru rpm
ca: no s'ha pogut registrar el fitxer rpm
cs: nelze registrovat RPM soubor
cy: methu cofrestr ffeil rpm
da: kunne ikke registrere rpm-fil
el: αδυναμία δήλωσης του αρχείου rpm
es: no se puede registrar el archivo rpm
et: RPM-faili registreerimine nurjus
eu: ezin da rpm fitxategia erregistratu
fi: Rpm-paketin rekisteröinti epäonnistui
fr: impossible de référencer le fichier rpm
gl: non foi posible rexistrar o ficheiro rpm
he: אין אפשרות לבצע רישום של החבילה
hu: az RPM-csomagfájl nem regisztrálható
id: gagal meregistrasi file rpm
is: gat ekki skráð rpm skrá
it: impossibile registrare il file rpm
nb: Klarte ikke registrere fil.
nl: kon rpm-bestand niet registreren
nn: Klarte ikkje registrera rpm-fil.
pl: nie można zarejestrować pliku rpm
pt: não é possível registar o ficheiro rpm
pt_br: incapaz de registrar arquivo rpm
ro: nu se poate înregistra fișierul rpm
ru: не удаётся зарегистрировать rpm-файл
sl: datoteke rpm ni mogoče registrirati
sq: i pa mundur regjistrimi i skedares rpm
sv: kan inte registrera RPM-fil
tr: rpm dosyası kayıt edilemiyor

source: Incompatible architecture for rpm [%s]
ast: Arquitectura incompatible pal rpm [%s]
ca: Arquitectura incompatible per rpm [%s]
cs: Nekompatibilní architektura pro RPM [%s]
cy: Saernïaeth anghydnaws ar gyfer rpm [%s]
da: Inkompatibel arkitektur for rpm [%s]
el: Ασύμβατη αρχιτεκτονική για τα rpm [%s]
es: Arquitectura incompatible para el rpm [%s]
et: Sobimatu arhitektuur RPM-ile [%s]
eu: rpm-rentzako arkitektura bateraezina [%s]
fi: Paketin [%s] laitteistoarkkitehtuuri ei ole yhteensopiva
fr: Architecture incompatible pour le paquetage [%s]
gl: Arquitectura incompatible para rpm [%s]
he: האריכטקטורה אינה תואמת את חבילת התוכנה [%s]
hu: Az RPM-mel nem kompatibilis architektúra [%s]
id: Arsitektur tidak kompatibel untuk rpm [%s]
is: ósamhæfður vélbúnaður fyrir rpm [%s]
it: Architettura incompatibile per il file rpm [%s]
nb: Ikke passende arkitektur for [%s]
nl: Niet-compatibele architectuur voor rpm [%s]
nn: Inkompatibel arkitektur for rpm [%s].
pl: Niezgodna architektura dla pakietu rpm [%s]
pt: Arquitectura incompatível para o rpm [%s]
pt_br: Arquitetura incompatível para o rpm [%s]
ro: Arhitectură incompatibilă pentru rpm [%s]
ru: Несовместимая архитектура для [%s]
sl: Arhitektura ni združljiva za rpm [%s]
sq: Arkitektura e papërshtatshme për rpm [%s]
sv: Inkompatibel arkitektur för rpm [%s]
tr: [%s] rpm paketi için uyumsuz mimari

source: error registering local packages
ast: fallu rexistrando paquetes llocales
ca: error registrant els paquets locals
cs: chyba při registraci lokálních balíčků
cy: gwall cofrestru pecynnau lleol
da: fejl ved registrering af lokale pakker
el: σφάλμα κατά την δήλωση των τοπικών πακέτων
es: error registrando paquetes locales
et: viga kohalike pakettide registreerimisel
eu: errorea pakete lokalak erregistratzean
fi: Virhe rekisteröitäessä paikallisia paketteja
fr: erreur lors de l'inscription des paquetages locaux
gl: erro ó rexistra-los paquetes locais
he: חלה שגיאה בעת רישום חבילות מקומיות
hu: hiba a helyi csomagok regisztrálásakor
id: kesalahan meregistrasi paket lokal
is: villa við að skrá staðbundna pakka
it: errore durante la registrazione dei pacchetti locali
nb: feil ved registrering av lokale pakker.
nl: registreren van lokale pakketten is mislukt
nn: Klarte ikkje registrera lokale pakkar.
pl: błąd w trakcie rejestrowania pakietów lokalnych
pt: erro ao registar os pacotes locais
pt_br: erro ao registrar pacotes locais
ro: eroare la înregistrarea pachetelor locale
ru: ошибка регистрации локальных пакетов
sl: napaka pri registraciji krajevnih paketov
sq: gabim gjatë regjistrimit të pakove lokale
sv: fel vid registrering av lokala paket
tr: yerel paketlerin sicil kaydı yapılırken hata

source: This operation is forbidden while running in restricted mode
ast: Esta operación ta torgada en mou restrinxíu
ca: L'operació no està permesa mentre s'executa en mode restringit
cs: Tato operace je zakázána při běhu v omezeném režimu
cy: Mae'r weithred yn waharddedig wrth redeg ym modd cyfyngedig
da: Denne handling er forbudt ved kørsel i begrænset tilstand
el: Αυτή η λειτουργία απαγορεύεται να εκτελεστεί, όταν ισχύει κατάσταση περιορισμένης λειτουργίας
es: Esta operación está prohibida en modo restringido
et: See operatsioon on piiratud režiimis keelatud
eu: Eragiketa hau debekatuta dago modu murriztuan exekutatzerakoan
fi: Toiminto on kielletty, koska ohjelmaa käytetään rajoitetussa tilassa
fr: Cette opération est interdite en mode restreint
gl: Esta operación está prohibida mentres se executa en modo restrinxido
he: פעולה זו אינה מותרת באופן עבודה מוגבל
hu: Korlátozott mód esetén ez a művelet nem végezhető el
id: Operasi ini dilarang ketika berjalan dalam mode terbatas
is: Þessi aðgerð er bönnuð þegar keyrt er í vernduðum ham
it: Quest'operazione non è consentita in modalità "restricted"
nb: Du kan ikke kjøre denne i begrenset modus.
nl: Deze operatie is verboden tijdens het uitvoeren in beperkte modus
nn: Du kan ikkje køyra denne operasjonen i avgrensa modus.
pl: Operacja niedozwolona podczas pracy w trybie restrykcyjnym
pt: Esta operação é proibida enquanto correr em modo restrito
pt_br: Esta operação não é permitida no modo restrito
ro: Această operație este interzisă cînd rulați în modul restricționat
ru: Эта операция запрещена при работе в ограниченном режиме
sl: Ta postopek ni dovoljen v omejenem načinu
sq: Ky operacion është i ndaluar gjatë lëshimit në regjimin e kufizuar
sv: Denna operation är inte tillåten i begränsat läge
tr: Sınırlı kipte çalışılırken bu işlem yasaklanmıştır.

source: bad proxy declaration on command line
ast: declaración incorreuta del proxy na llinia de comandos
ca: declaració errònia del proxy a la línia de comandes
cs: špatně zadaná proxy na příkazové řádce
cy: datganiad dirprwy gwallus ar y llinell orchymyn
da: Forkert proxy-erklæring på kommandolinje
el: μη ορθή διακήρυξη proxy στη γραμμή εντολών
es: declaración incorrecta del proxy en la línea de comandos
et: käsureal on määratud vigane puhverserver
eu: proxy-adierazpen okerra komando-lerroan
fi: Virheellinen välityspalvelinmääritys komentorivillä
fr: mauvaise déclaration de serveur mandataire en ligne de commande
gl: declaración errónea do proxy na liña de comandos
he: הכרזת proxy לא תקנית בשורת הפקודה
hu: helytelen proxy-megadás a parancssorban
id: deklarasi proxy buruk pada pada perintah baris
is: röng staðgengils-skilgreining á skipanalínu
it: errata dichiarazione di proxy usando la linea di comando
nb: ugyldig deklarasjon for mellomlager på kommandolinja.
nl: ongeldige proxy-aanduiding op opdrachtregel
nn: Ugyldig mellomtenardeklarasjon på kommandolinja.
pl: niepoprawna deklaracja serwera pośredniczącego w wierszu poleceń
pt: declaração 'proxy' inválida na linha de comando
pt_br: declaração de proxy errada na linha de comando
ro: declarație greșită de proxy în linia de comandă
ru: неверное объявление proxy в командной строке
sl: napačna deklaracija posredniškega strežnika v ukazni vrstici
sq: proxy që është deklaruar në linjën komanduese nuk është i saktë
sv: felaktig proxydeklaration på kommandorad
tr: komut satırından kötü vekil sunucu bildirimi

source: urpmq: cannot read rpm file "%s"
ast: urpmq: nun puede lleese'l ficheru rpm «%s»
ca: urpmq: no s'ha pogut llegir el fitxer rpm "%s"
cs: urpmq: nemohu přečíst rpm soubor "%s"
cy: urpmq: methu darllen ffeil rpm "%s"
da: urpmq: kan ikke læse rpm-fil "%s"
el: urpmq: αδυναμία ανάγνωσης αρχείου rpm "%s"
es: urpmq: no se puede leer el archivo rpm «%s»
et: urpmq: RPM-faili "%s" lugemine nurjus
eu: urpmq: ezin da "%s" rpm fitxategia irakurri
fi: urpmq: rpm-pakettia %s ei voida lukea
fr: urpmq : impossible de lire le fichier rpm « %s »
gl: urpmq: non se puido ler o ficheiro rpm "%s"
he: urpmq: לא יכול קובץ RPM "%s"
hu: urpmq: egy RPM-fájl nem olvasható: "%s"
id: urpmq: tidak dapat membaca file rpm "%s"
is: urpmq: get ekki lesið rpm skrá "%s"
it: urpmq: impossibile leggere il file rpm "%s"
nb: urpmq: Klarer ikke lese fila «%s»
nl: urpmq: kon rpm bestand "%s" niet lezen
nn: urpmq: Klarer ikkje lesa rpm-fila «%s».
pl: urpmq: nie można odczytać pliku rpm "%s"
pt: urpmq: não consegue ler o ficheiro rpm "%s"
pt_br: urpmq: não pode ler o arquivo rpm "%s"
ro: urpmq: nu se poate citi fișierul rpm „%s”
ru: urpmq: не удаётся прочитать rpm-файл «%s»
sl: urpmq: datoteke rpm »%s« ni mogoče brati
sq: urpmq: nuk mund ta lexojë skedaren rpm "%s"
sv: urpmq: kan inte läsa rpm-fil "%s"
tr: urpmq: "%s" rpm dosyası okunamıyor

source: unexpected expression %s
ast: espresión %s non esperada
ca: expressió inesperada %s
cs: neočekávaný výraz %s
cy: mynegiadau annisgwyl %s
da: Uventet udtryk %s
el: απρόσμενη έκφραση %s
es: expresión %s no esperada
et: ootamatu avaldis %s
eu: %s ezusteko adierazpena
fi: Odottamaton hakulauseke %s
fr: expression inattendue %s
hu: váratlan kifejezés: %s
is: óvænt segð %s
it: espressione inattesa %s
nb: uventet uttrykk %s
nl: onverwachte uitdrukking %s
nn: Uventa uttrykk: %s
pl: niespodziewane wyrażenie %s
pt: expressão inesperada %s
pt_br: expressão inesperada %s
ro: expresie neprevăzută %s
ru: неожиданное выражение %s
sl: nepričakovan izraz %s
sq: shprehja e papritur %s
sv: oväntat uttryck %s
tr: beklenmeyen ifade %s

source: missing expression before %s
ast: falta esxpresion enantes de %s
cs: chybí výraz před %s
cy: mynegiad coll cyn %s
da: manglende udtryk før %s
el: απουσία έκφρασης πριν το %s
es: falta expresíón antes de %s
et: avaldis puudub %s ees
eu: %s-ren aurretik adierazpena falta da
fi: Puuttuva hakulauseke ennen %s
fr: expression manquante avant %s
hu: a %s előtt hiányzik a kifejezés
is: Vantar segð á undan %s
it: manca un'espressione prima di %s
nb: manglende uttrykk før %s
nl: uitdrukking vóór %s ontbreekt
nn: Manglar uttrykk før «%s».
pl: brakujące wyrażenie przed %s
pt: falta uma expressão antes de %s
pt_br: expressão faltando antes %s
ro: lipsește expresia înaintea lui %s
ru: перед %s отсутствует выражение
sl: manjkajoč izraz pred %s
sq: mungon shprehja para %s
sv: uttryck saknas före %s
tr: %s 'den önce kayıp ifade

source: unexpected expression %s (suggestion: use -a or -o ?)
ast: espresión non esperada %s (suxerencia: usar -a o -o)
cs: neočekávaný výraz %s (návrh: použijte -a nebo -o ?)
cy: mynegiad annisgwyl %s (awgrym: defnyddio -a neu-0 ?)
da: uventet udtryk %s (forslag: brug -a eller -o ?)
el: απρόσμενη έκφραση %s (πρόταση: να χρησιμοποιήσεις -a ή -o ; )
es: expresión no esperada %s (sugerencia: usar -a o -o)
et: ootamatu avaldis %s (soovitus: kasutada võiks võtit -a või -o)
eu: %s ezusteko adierazpena (iradokizuna: erabili -a edo -o ?)
fi: Odottamaton hakulauseke %s (ehdotus: käytä valitsimia -a tai -o)
fr: expression inattendue %s (suggestion : utilisez -a ou -o ?)
hu: váratlan kifejezés: %s (javasolt a -a vagy -o használata)
is: óvænt segð %s (tillaga: notið -a eða -o ?)
it: espressione inattesa %s (forse dovresti usare -a o -o)
nb: uventet uttrykk %s (forslag: bruk -a or -o ?
nl: onverwachte uitdrukking %s (suggestie: gebruik -a of -o)
nn: Uventa uttrykk: %s (forslag: bruk «-a» eller «-o»).
pl: niespodziewane wyrażenie %s (sugestia: użyj -a lub -o ?)
pt: expressão inesperada %s (sugestão: use -a ou -o ?)
pt_br: expressão inesperada %s (sugestão: usar -a ou -o ?)
ro: expresie neprevăzută %s (sugestie: utilizați -a sau -o ?)
ru: неожиданное выражение %s (рекомендация: используйте параметр -a или -o)
sl: nepričakovan izraz %s (predlog: uporabite -a ali -o ?)
sq: shprehje e papritur %s (sugjerime: përdor -a ose -o ?)
sv: oväntat uttryck %s (förslag: använd -a eller -o)
tr: beklenmeyen ifade %s (öneri: -a or -o kullanın ?)

source: no expression to close
ast: nun hai espresión a zarrar
ca: no hi ha expressió per a tancar
cs: chybí výraz pro zavření
cy: dim mynegiad i'w gau
da: intet udtryk at lukke
el: δεν υπάρχει έκφραση για να τερματιστεί
es: no hay expresión a cerrar
et: pole ühtegi avaldist lõpetada
eu: ez dago itxi beharreko adierazpenik
fi: Ei suljettavaa hakulauseketta
fr: pas d'expression à fermer
hu: nincs a kifejezés lezárárva
is: engin segð sem ætti að loka
it: nessuna espressione da chiudere
nb: ingen uttrykk å lukke
nl: geen afsluitbare uitdrukking
nn: Ingen uttrykk å lukka.
pl: brak wyrażenia do zamknięcia
pt: nenhuma expressão para fechar
pt_br: sem expressão para fechar
ro: nici o expresie pentru închidere
ru: отсутствует выражения для закрытия
sl: ni izraza za zaprtje
sq: asnjë shprehje për t'u mbyllur
sv: inget uttryck att stänga
tr: kapatmak için ifade yok

source: by default urpmf awaits a regexp. you should use option "--literal"
ast: de manera predeterminada urpmf espera una regexp. Deberíes usar la opción «--literal»
cs: urpmf očekává implicitně regulární výraz, použijte volbu "--literal"
cy: drwy ragosodiad mae urmpf yn disgwyl regexp, dylech ddefnyddio dewis "--literal"
da: normalt venter urpmf en regexp. du bør bruge parameteren "--literal"
el: από προεπιλογή η urpmf αναμένει μια regexp. Θα πρέπει να χρησιμοποιήσετε την επιλογή "--literal"
es: de manera predeterminada, urpmf espera una expresión regular. Debería usar la opción "--literal"
et: vaikimisi ootab urpmf regulaaravaldist, peaksite kasutama võtit "--literal"
eu: era lehenetsian urpmf-k regexp bat espero du. "--literal" aukera erabili beharko zenuke
fi: urpmf odottaa oletuksena säännöllistä lauseketta. Käytä valitsinta "--literal"
fr: par défaut urpmf s'attend à une regexp, utilisez l'option « --literal »
gl: por defecto urpmf agarda unha expresión regular. Debería usar a opción "--literal"
hu: alapértelmezésben az urpmi egy regexpet vár, ezt megerősítheti a "--literal" opcióval
is: sjálfgefið væntir urpmf reglulegrar segðar (regexp) þú ættir að nota valkost "--literal"
it: urpmf si aspetta una regexp, se non usi l'opzione « --literal ».
nb: som standard forventer urpmf et regulært uttrykk. Du kan bruke «--literal»
nl: standaard verwacht urpmf een regexp, u dient de optie "--literal" te gebruiken
nn: Som standard ventar urpmf eit regulært uttrykk. Du bør bruka valet «--literal».
pl: w domyślnym ustawieniu urpmf oczekuje regexp. Użyj opcji "--literal"
pt: por predefinição o urpmf espera uma expressão regular. Deve usar a opção "--literal"
pt_br: por padrão urpmf espera uma regexp. você pode usar a opção "--literal"
ro: urpmf așteaptă implicit un regexp. ar trebui să utilizați opțiunea „--literal”
ru: по умолчанию urpmf ожидает регулярное выражение. Используйте параметр «--literal»
sl: Privzeto urpmf pričakuje regularni izraz. Uporabite argument »--literal«
sq: sipas parazgjedhjes urpmf pret një regexp. ju duhet të përdorni alternativë "--literal"
sv: som standard väntar urpmf på en regexp. du borde använda alternativet "--literal"
tr: varsayılan olarak upmf bir regexp bekler. "--literal" seçeneğini kullanmalısınız.

source: chroot directory doesn't exist
ast: el direutoriu chroot nun esiste
ca: el directori chroot no existeix
cs: adresář chroot neexistuje
cy: Nid yw cyfeiriadur chroot yn bodoli
da: chroot-katalog eksisterer ikke
el: ο κατάλογος chroot δεν υπάρχει
es: el directorio chroot no existe
et: chroot-kataloogi ei ole olemas
eu: chroot direktorioa ez da existitzen
fi: Chroot-kansiota ei ole olemassa
fr: le répertoire chroot n'existe pas
gl: o directorio de chroot non existe
he: ספרית ה-chroot אינה קיימת
hu: chroot-könyvtár nem létezik
id: Direktori chroot tidak ada
is: chroot mappa er ekki til
it: La directory chroot non esiste
nb: chroot-mappa finnes ikke
nl: chroot-map bestaat niet
nn: «chroot»-mappa finst ikkje.
pl: Katalog chroot nie istnieje
pt: o directório chroot não existe
pt_br: diretório chroot não existe
ro: directorul chroot nu există
ru: Каталог chroot не существует
sl: mapa za chroot ne obstaja
sq: skedari chroot nuk ekziston
sv: chroot katalog existerar inte
tr: chroot dizini geçerli değil

source: Can't use %s without %s
ast: Nun pue usase %s ensin %s
ca: Impossible utilitzar %s sense %s
cs: Nelze použít %s bez %s
cy: Methu defnyddio %s heb %s
da: Kan ikke bruge %s uden %s.
el: Αδύνατη η χρήση του %s χωρίς το %s
es: No se puede usar %s sin %s
et: %s kasutamine on võimalik ainult koos %s-ga
eu: Ezin da %s %s gabe erabili
fi: Valitsinta %s ei voida käyttää ilman valitsinta %s
fr: Impossible d'utiliser %s sans %s
gl: Non se pode usar %s sen %s
he: לא ניתן להשתמש ב-%s ללא %s
hu: %s nem használható %s nélkül
id: Tidak bisa menggunakan %s tanpa %s
is: Get ekki notað %s án %s
it: Impossibile utilizzare %s senza %s
nb: Kan ikke bruke %s uten «%s».
nl: Kan %s niet gebruiken zonder %s
nn: Kan ikkje bruka «%s» utan «%s».
pl: Nie można użyć %s bez %s
pt: Não pode usar %s sem %s
pt_br: Não é possível usar %s sem %s
ro: Nu se poate utiliza %s fără %s
ru: %s нельзя использовать без %s
sl: Ni mogoče uporabiti %s brez %s
sq: Nuk mund të përdorni %s pa %s
sv: Kan inte använda %s utan %s
tr: %s, %s olmadan kullanılamaz
