Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: no synthesis file found for medium "%s"
ast: non alcontráu'l ficheru synthesis pal mediu "%s"
cs: nebyl nalezen soubor se syntézou pro zdroj "%s"
cy: dim ffeil synthesis file ar gyfer cyfrwng "%s"
da: ingen syntese-fil fundet for medie "%s"
el: δεν βρέθηκε αρχείο synthesis για το μέσο "%s"
es: no se encuentra el archivo synthesis para el soporte «%s»
et: andmekandjale "%s" ei leitud sünteesifaili
eu: ez da "%s" euskarriaren synthesis fitxategirik aurkitu
fi: Medialle "%s" ei löytynyt synthesis-tiedostoa
fr: pas de fichier synthesis trouvé pour le média « %s »
gl: non se atopou un ficheiro synthesis para o soporte "%s"
he: לא נמצא קובץ synthesis עבור מאגר "%s"
hu: a(z) "%s" adatforráshoz nem található kiterjesztett függőséglista
is: engin samantektarskrá fannst fyrir miðil "%s"
it: non trovo il file synthesis per il supporto "%s"
nb: fant ingen kildefil for mediet «%s»
nl: geen synthesis-bestand gevonden voor medium "%s"
nn: Fann inga syntesefil for mediet «%s».
pl: nie znaleziono pliku syntezy dla nośnika "%s"
pt: nenhum ficheiro synthesis encontrado para a média "%s"
pt_br: nenhum arquivo synthesis encontrado para a mídia "%s"
ro: nu s-a găsit fișierul synthesis pentru mediul „%s”
ru: не найден synthesis-файл для источника «%s»
sl: ni bilo možno najti datoteke synthesis za vir »%s«
sv: ingen synthesis-fil hittad för media "%s"
tr: "%s" ortamı için sentez dosyası bulunamadı.

source: updated medium "%s"
ast: mediu "%s" anováu
ca: s'ha actualitzat el suport "%s"
cs: aktualizován zdroj "%s"
cy: cyfrwng "%s" wedi ei ddiweddaru
da: opdaterede medie %s
el: ενημερώθηκε το μέσο "%s"
es: soporte «%s» actualizado
et: uuendati andmekandjat "%s"
eu: "%s" euskarri eguneratua
fi: Media "%s" päivitetty
fr: média « %s » mis à jour
gl: actualizouse o soporte "%s"
he: המקור "%s" עודכן
hu: "%s" adatforrás frissítve
id: media "%s" sudah diupdate
is: uppfærði miðil "%s"
it: supporto "%s" aggiornato
nb: Oppdatert medie «%s»
nl: bijgewerkt medium "%s"
nn: Oppdaterte mediet «%s».
pl: zaktualizowany nośnik %s
pt: média "%s" actualizada
pt_br: atualizada a mídia "%s"
ro: mediul „%s” este actualizat
ru: обновлён источник «%s»
sl: vir »%s« je bil posodobljen
sv: uppdaterade media %s
tr: "%s" ortamı güncellendi.

source: retrieval of [%s] failed
ast: falló la baxada de [%s]
ca: la recuperació de [%s] ha fallat
cs: načtení [%s] selhalo
cy: methodd estyn [%s]
da: hentning af [%s] mislykkedes
el: αποτυχία ανάκτησης του [%s]
es: falló la descarga de [%s]
et: [%s] tõmbamine nurjus
eu: [%s] berreskurapenak huts egin du
fi: Paketin [%s] hakeminen epäonnistui
fr: échec de la récupération de [%s]
gl: fallou a obtención de [%s]
hu: [%s] megszerzése sikertelen
is: mistókst að sækja [%s]
it: recupero di [%s] non riuscito
nb: henting av [%s] feilet
nl: ophalen van [%s] mislukt
nn: Feil ved nedlasting av [%s].
pl: pobieranie [%s] nie powiodło się
pt: transferência de [%s] falhada
pt_br: busca de [%s] falhou
ro: preluarea lui [%s] a eșuat
ru: не удалось загрузить [%s]
sl: prenos [%s] je spodletel
sq: rikthimi i [%s] dështoj
sv: hämtning av [%s] misslyckades
tr: [%s] alımı başarısız oldu

source: trying again with mirror %s
ast: intentando de nueves col espeyu %s
ca: s'està intentant de nou amb la rèplica %s
cs: zkouším znovu se zrcadlem %s
cy: ceisio eto gyda drych %s
da: forsøger igen med spejl %s
el: γίνεται προσπάθεια ξανά με την εναλλακτική διεύθυνση %s
es: intentando otra vez con el sitio de réplica %s
et: püütakse uuesti peegliga %s
eu: %s ispiluarekin berriz saiatzen
fi: Yritetään uudelleen peilipalvelimelta %s
fr: nouvel essai avec le miroir %s
gl: intentando de novo co sitio espello %s
hu: Ismételt próbálkozás a %s tükörrel.
is: reyni aftur með spegli %s
it: nuovo tentativo con il mirror %s
nb: prøver igjen med speil %s
nl: opnieuw proberen met mirror %s
nn: Prøver på nytt med spegelen %s.
pl: ponowna próba połączenia z serwerem %s
pt: a tentar novamente no espelho %s
pt_br: tentando novamente com o espelho %s
ro: se reîncearcă cu serverul alternativ %s
ru: повторная попытка с зеркала %s
sl: ponovno poskušanje z zrcalnim strežnikom %s
sv: försöker igen med spegelserver %s
tr: %s yansısı ile tekrar deneniyor

source: Could not find a mirror from mirrorlist %s
ast: Nun pudo alcontrase un espeyu na llista d'espeyos %s
cs: Nelze nalézt zrcadlo ze seznamu zrcadel %s
cy: Methu canfod drych o restr drychau %s
da: Kunne ikke finde et spejl fra spejlliste %s
el: Αδυναμία εύρεσης μιας εναλλακτικής διεύθυνσης από τη λίστα των εναλλακτικών διευθύνσεων %s
es: No se pudo encontrar una réplica en la lista de réplicas %s
et: Peeglite nimekirjas %s ei leitud peeglit
eu: Ezin da ispilu bat aurkitu %s ispilu zerrendan
fi: Peilipalvelinta ei löytynyt peilipalvelinlistalta %s
fr: Impossible de trouver un miroir dans la liste %s
gl: Non se puido atopar un sitio espello da lista de sitios espello %s
hu: Nem találok egy tükröt sem a %s tükörlistában.
is: Gat ekki fundið spegil úr spegillista %s
it: Impossibile trovare un mirror nell'elenco %s
nb: Klarte ikke å finne et speil fra lista %s
nl: Kan geen mirror vinden uit de mirrorlijst %s
nn: Fann ikkje noko spegel frå spegellista %s.
pl: Odnalezienie serwera na liście serwerów %s nie było możliwe
pt: Não foi possível encontrar um espelho da lista de espelhos %s
pt_br: Não foi possível encontar um espelho da lista %s
ro: Nu s-a găsit un server alternativ din lista de servere alternative %s
ru: Не удаётся найти зеркало из списка зеркал %s
sl: Ni bilo možno najti zrcalnega strežnika s seznama %s
sv: Kunde inte hitta någon spegelserver från spegel-lista %s
tr: %s yansı listesinden bir yansı bulunamadı.

source: found geolocalisation %s %.2f %.2f from timezone %s
ast: alcontrose la xeolocalización %s %.2f %.2f pa la estaya horaria %s
cs: nalezena geolokalizace %s %.2f %.2f z časové zóny %s
cy: wedi canfod geolleoleiddio %s %.2f %.2f o gylchfa amser %s
da: fandt geografisk sted %s %.2f %.2f fra tidszone %s
el: βρέθηκε η γεωτοποθεσία %s %.2f %.2f από την ζώνη ώρας %s
es: se encontró la geolocalización %s %.2f %.2f para el huso horario %s
et: leiti geolokatsioon %s %.2f %.2f ajavööndist %s
eu: %s %.2f %.2f geokokapenak aurkitu dira %s ordugunetik
fi: Pääteltiin sijainti %s %.2f %.2f aikavyöhykkeestä %s
fr: géolocalisation trouvée %s %.2f %.2f du fuseau horaire %s
gl: atopouse a xeolocalización %s %.2f %.2f para a zona horaria %s
hu: %s %.2f %.2f földrajzi helyet állapítottam meg a(z) %s időzóna alapján.
is: fann staðsetningu %s %.2f %.2f út frá tímabelti %s
it: localizzata posizione %s %.2f %.2f nel fuso orario %s
nb: fant geolokasjon %s %.2f %.2f fra tidssone %s
nl: geolocalisatie %s %.2f %.2f gevonden uit tijdzone %s
nn: Fann geoplasseringa %s %.2f %.2f frå tidssonen %s.
pl: odnaleziono lokalizację geograficzną %s %.2f %.2f na podstawie strefy czasowej %s
pt: encontrada a geolocalização%s %.2f %.2f do fuso horário %s
pt_br: encontrada geolocalização %s %.2f %.2f do fuso horário %s
ro: localizarea geografică %s %.2f % găsită.2f din fusul orar %s
ru: найдено географическое расположение %s %.2f %.2f из часового пояса %s
sl: najdena geolokacija %s %.2f %.2f iz časovnega pasu %s
sv: hittade geolokalisering %s %.2f %.2f från tidszon %s
tr: %s %.2f %.2f coğrafi konumu, %s zaman bölgesinden bulundu.

source: getting mirror list from %s
ast: algamando llista d'espeyos dende %s
ca: s'està obtenint la llista de rèpliques de %s
cs: získává se seznam zrcadel z %s
cy: estyn rhestr drychai o %s
da: får spejlliste fra %s
el: λήψη της λίστας των εναλλακτικών διευθύνσεων από το %s
es: obteniendo lista de réplicas desde %s
et: %s peeglite nimekirja lugemine
eu: %s-tik ispilu zerrenda jasotzen
fi: Haetaan peilipalvelinluetteloa osoitteesta %s
fr: récupération de la liste des miroirs depuis %s
gl: obtendo a lista de sitios espello dende %s
he: מייבא רשימת אתרי מראה מ- %s
hu: tükörlista beolvasása innen: %s
is: sæki speglalista frá %s
it: recupero elenco dei mirror da %s
nb: henter lister over speil fra [%s]
nl: ophalen mirrorlijst van %s
nn: Hentar spegelliste frå %s.
pl: pobieranie listy serwerów z %s
pt: a obter lista de espelhos de %s
pt_br: obtendo a lista de espelhos de %s
ro: se preia lista de servere alternative de la %s
ru: загружается список зеркал из %s
sl: prenos seznama zrcalnih strežnikov od %s
sv: hämtar spegel-lista från %s
tr: yansı listesini %s adresinden al

source: Yy
ca: SsYy
cs: AaYy
da: YyJj
el: ΝνYy
es: SsYy
et: JjYy
eu: bByYsS
fi: KkYy
fr: OoYy
gl: SsYy
he: כfFטyY
hu: IiYy
is: JjYy
it: SsYy
nb: JjYy
nl: YyJj
nn: JjYy
pl: Tt
pt: SsYy
pt_br: SsYy
ro: Dd
ru: YyДд
sl: Dd
sv: JjYy
tr: EeYy

source: (y/N)
ast: (s/N)
ca: (s/N)
cs: (a/N)
da: (j/N)
es: (s/N)
et: (j/E)
eu: (b/E)
fi: (k/E)
fr: (o/N)
gl: (s/N)
he: (כן/*לא)
hu: (i/N)
id: (y/T)
is: (j/N)
it: (s/N)
nb: (j/N)
nl: (j/N)
nn: (J/N)
pl: (t/N)
pt: (s/N)
pt_br: (s/N)
ro: (d/N)
sl: (d/N)
sq: (p/J)
sv: (j/N)
tr: ( y, e / H , N )

source: Sorry, bad choice, try again
ast: Perdona, ficiste una mala escoyeta, reinténtalo
ca: Elecció incorrecta, torneu-ho a provar
cs: Je mi líto, to je špatná volba. Zkuste to znovu
cy: Dewis gwael, ceisiwch eto
da: Undskyld, dårligt valg, prøv igen
el: Λυπάμαι, κακή επιλογή, προσπαθήστε ξανά
es: Disculpe, elección incorrecta, reinténtelo
et: Vabandust, selline valik ei ole lubatud. Proovige uuesti
eu: Aukera okerra, saiatu berriro
fi: Virheellinen valinta, yritä uudelleen
fr: Désolé, mauvais choix, veuillez réessayer
gl: Mala elección, probe de novo
he: מצטער ,בחירה רעה, יש לנסות שנית
hu: Ezt nem lehet választani, próbálja meg újra
id: Maaf, pilihan buruk, coba lagi
is: Slæmt val. Reyndu aftur
it: Spiacente, scelta errata, prova di nuovo
nb: feil valg, prøv på nytt
nl: Sorry, ongeldige keuze, probeer het nogmaals
nn: Dårleg val. Prøv på nytt.
pl: Niestety, niepoprawny wybór, spróbuj ponownie
pt: Desculpe, escolha inválida, tente novamente
pt_br: Desculpe, má escolha, tente novamente
ro: Alegere greșită, încercați din nou
ru: Извините, плохой выбор, попробуйте ещё раз
sl: Slaba izbira, poskusite znova
sq: Kemi ndjesë, zgjedhje e gabuar, provoni edhe një herë
sv: Felaktigt val, försök igen.
tr: Üzgünüm ,hatalı seçim, tekrar deneyin

source: Package
ast: Paquete
ca: Paquet
cs: Balíček
cy: Pecyn
da: Pakke
el: Πακέτο
es: Paquete
et: Pakett
eu: Paketea
fi: Paketti
fr: Paquetage
gl: Paquete
he: חבילה
hu: Csomag
is: Pakki
it: Pacchetto
nb: Pakke
nl: Pakket
nn: Pakke
pl: Pakiet
pt: Pacote
pt_br: Pacote
ro: Pachet
ru: Пакет
sl: Paket
sq: Paketë
sv: Paket
tr: Paket

source: Version
ast: Versión
ca: Versió
cs: Verze
cy: Fersiwn
el: Έκδοση
es: Versión
et: Versioon
eu: Bertsioa
fi: Versio
gl: Versión
he: גרסה
hu: Verzió
is: Útgáfa
it: Versione
nb: Versjon
nl: Versie
nn: Versjon
pl: Wersja
pt: Versão
pt_br: Versão
ro: Versiune
ru: Версия
sl: Različica
sq: Versioni
tr: Sürüm

source: Release
ast: Revisión
cs: Vydání
cy: Ryddhad
da: Udgivelse
el: Κυκλοφορία
es: Revisión
et: Väljalase
eu: Askapena
fi: Julkaisu
fr: Révision
gl: Edición
he: שחרור
hu: Kiadás
is: Undirútgáfa
nb: Utgivelse
nl: Uitgave
nn: Utgjeving
pl: Wydanie
pt: Lançamento
ro: Ediție
ru: Релиз
sl: Izdaja
sq: Lëshim
tr: Yayım

source: Arch
ast: Arq.
ca: Arq
da: Arkitektur
el: Αρχιτεκ.
es: Arq.
et: Arhit.
eu: Arkitektura
fi: Arkkitehtuuri
gl: Arquitectura
he: ארכיטקטורה
hu: Architektúra
is: Vélb
nb: Arkitektur
nn: Arkitektur
pl: Architektura
pt: Arquitectura
ro: Arhit
ru: Платформа
sl: Arhit.
sv: Arkitektur
tr: Mimari

source: (suggested)
ca: (suggerit)
cs: (navrhováno)
cy: (awgrym)
da: (forslag)
es: (sugerido)
eu: (iradokita)
fi: (ehdotettu)
gl: (suxerido)
hu: (javasolt)
is: (tillaga)
it: (suggerito)
nb: (forslag)
pl: (sugerowany)
pt: (sugerido)
ro: (sugerat)
sv: (föreslagen)
tr: (önerilen)

source: medium "%s"
ast: mediu "%s"
ca: suport "%s"
cs: zdroj "%s"
cy: cyfrwng "%s"
da: medie "%s"
el: μέσο «%s»
es: soporte «%s»
et: andmekandja "%s"
eu: "%s" euskarria
fi: media "%s"
fr: média « %s »
gl: soporte "%s"
he: מקור "%s"
hu: "%s" adatforrás
is: miðill "%s"
it: supporto "%s"
nb: medie «%s»
nn: mediet «%s»
pl: nośnik "%s"
pt: média "%s"
pt_br: mídia "%s"
ro: mediul „%s”
ru: источник «%s»
sl: vir »%s«
sv: media "%s"
tr: "%s" ortamı

source: command line
ast: llinia de comandos
cs: příkazový řádek
cy: llinell orchymyn
da: kommandolinje
el: γραμμή εντολών
es: línea de comandos
et: käsurida
eu: komando lerroa
fi: komentorivi
fr: ligne de commande
gl: liña de comandos
hu: parancssor
is: skipanalína
it: riga di comando
nb: kommandolinje
nl: opdrachtregel
nn: kommandolinje
pl: wiersz poleceń
pt: linha de comandos
pt_br: linha de comando
ro: linie de comandă
ru: командная строка
sl: ukazna vrstica
sv: kommandorad
tr: komut satırı

source: B
fi: t
fr: o
ro: o
ru: Б

source: KB
fi: kt
fr: Ko
ro: Ko
ru: КБ
sl: KiB

source: MB
fi: Mt
fr: Mo
ro: Mo
ru: МБ
sl: MiB

source: GB
fi: Gt
fr: Go
ro: Go
ru: ГБ
sl: GiB

source: TB
fi: Tt
fr: To
ro: To
ru: ТБ
sl: TiB

source: Marking %s as manually installed, it won't be auto-orphaned
ast: Chequeando %s como instalao manualmente, nun será güerfanu automaticamente
cs: Označuji %s jako ručně instalovaný, nebude pak automaticky považován za sirotka
cy: Marcio %s fel ei fod wedi ei osod â llaw, ni fydd yn cael ei awto-amddifadu
da: Markerer %s as manuelt installeret, den vil ikke stå som forældreløs
el: Σημείωση του %s ως εγκατεστημένο χειροκίνητα, δεν θα θεωρείται ορφανό πακέτο
es: Marcando %s como instalado a mano, no se marcara como huerfano
et: %s märgitakse käsitsi paigaldatuks, seda ei tunnistata enam orvuks
eu: %s eskuz instalatutakoa bezela markatuta, ez da automatikoki umezurtz geldituko
fi: Merkitään paketti %s käsin asennetuksi. Paketista ei tule tarpeetonta (orphan).
fr: Marque %s comme étant manuellement installé, il ne sera pas considéré comme un paquet orphelin
hu: Meg lett jelölve a %s, mint kézzel telepített, így az automatikus elárvulás nem vonatkozik rá
is: Merki %s sem handvirkt uppsettann, hann verður ekki merktur munaðarlaus
it: Se segni %s come installato manualmente, non diventerà «auto-orphaned»
nb: Markerer %s som manuelt installert, den vil ikke bli automatisk foreldreløs
nl: Markeren van %s als handmatig geïnstalleerd. Het zal niet automatisch wees gemaakt worden.
nn: Merkjer «%s» som manuelt installert. Pakken vert no ikkje definert som foreldrelaus automatisk.
pl: %s oznaczono jako zainstalowany ręcznie i nie będzie brany pod uwagę przez funkcję wyszukiwania osieroconych pakietów
pt: A marcar %s como manualmente instalado, não será auto-orfanizado
pt_br: Marcando %s como instalado manualmente, não será orfanizado
ro: Marcînd %s ca instalat manual, nu va fi declarat automat orfan
ru: %s помечается как установленный вручную; он не будет учитываться при определении пакетов-сирот
sl: %s je bil označen kot ročno nameščen in ne bo samodejno osirotel
sv: Markerar %s som manuellt installerad, så det inte blir märkt som obehövligt
tr: %s elle kurulmuş olarak işaretleniyor. Kendiliğinden kaldırılmayacak.

source: The following package: %s is now orphaned.
ast: El paquete siguiente: %s agora ta güérfanu.
cs: Následující balíčky: %s jsou označeny za sirotky.
el: Το ακόλουθο πακέτο: %s είναι στο εξής ορφανό.
es: El siguiente paquete: %s ahora está huérfano.
et: Pakett %s on nüüd orb.
fr: Le paquetage : %s est maintenant orphelin.
it: I seguenti pacchetti: %s ora sono orfani.
nl: Het volgende pakket: %s is nu wees.
pt: O seguinte pacote: %s está agora órfão.
pt_br: O pacote seguinte: %s está órfão.
ro: Pachetul următor: %s este acum orfan.
ru: Следующий пакет: %s теперь осиротел.
sl: Naslednji paket: %s je sedaj osirotel.

source: You may wish to remove it.
ast: Pues deseyar desanicialu.
cs: Možná si je přejete odstranit.
el: Ίσως επιθυμείτε την αφαίρεσή του.
es: Tal vez quiera removerlo.
et: Selle võib soovi korral eemaldada.
fr: Vous pouvez, si vous le souhaitez, l'effacer.
it: Potresti volerli rimuovere.
nl: U kunt deze verwijderen.
pt: Pode-o querer remover.
pt_br: Você deseja removê-lo.
ro: Poate doriți să-l înlăturați.
ru: Вы можете удалить его.
sl: Po želji ga lahko odstranite.
sq: Ju mund të dëshironi të hiqni atë.

source: The following package: %s is now orphaned, if you wish to remove it, you can use "urpme --auto-orphans"
ast: El paquete siguiente: %s quedóse güerfanu, usa "urpmi --auto-orphans" pa desanicialu
cs: Následující balíček: %s je nyní sirotek, k jeho odstranění můžete použít „urpme --auto-orphans”
cy: Mae'r pecyn canlynol: %s yn amddifad, os hoffech ei dynnu defnyddiwch "urpme --auto-orphans".
da: De følgende pakker: %s er nu forældreløse, hvis du ønsker at fjerne dem, så brug "urpme --auto-orphans"
el: Το παρακάτω πακέτο : %s είναι πλέον ορφανό, αν επιθυμείτε να το αφαιρέσετε, μπορείτε να χρησιμοποιήσετε "urpme --auto-orphans"
es: El siguiente paquete: %s ha quedado huérfano, utilice "urpme --auto-orphans" para quitarlo
et: Järgmine pakett on nüüd orb: %s Kui soovite seda eemaldada, kasutage käsku "urpme --auto-orphans".
eu: Ondoko paketea: %s umezurtz dago, ezabatu nahi baduzu, "urpme --auto-orphans" erabili dezakezu
fi: Seuraava paketti on tarpeeton, koska muut asennetut paketit eivät enää tarvitse sitä. %s Tarpeettomat paketit voidaan poistaa komennolla "urpme --auto-orphans".
fr: Le paquetage suivant : %s est désormais orphelin, si vous voulez le désinstaller, vous pouvez utiliser « urpme --auto-orphans »
hu: A következő csomag elárvult: %s Ha el akarja távolítani, használja az "urpme --auto-orphans" parancsot.
it: Il seguente pacchetto: %s ora è orfano, se desideri rimuoverlo, puoi eseguire il comando "urpme --auto-orphans"
nb: Den følgende pakka: %s er nå foreldreløs, bruk «urpme --auto-orphans» hvis du ønsker å fjerne den.
nl: Het volgende pakket: %s is nu wees, gebruik "urpme --auto-orphans" als u het wilt verwijderen.
nn: Pakken %s er no foreldrelaus. Du kan bruka «urpme --auto-orphans» for å fjerna han.
pl: Następujący pakiet: %s jest osierocony, jeśli chcesz go usunąć, użyj polecenia "urpme --auto-orphans"
pt: O seguinte pacote: %s está agora órfão, se o desejar remover, pode usar "urpme --auto-orphans"
pt_br: O seguinte pacote: %s agora é órfão, para removê-lo, use o comando "urpme --auto-orphans"
ro: Următorul pachet: %s este acum orfan, puteți utiliza „urpme --auto-orphans” dacă doriți să-l înlăturați
ru: Следующий пакет: %s теперь осиротел, если вы хотите удалить его, используйте "urpme --auto-orphans"
sl: Ta paket je osirotel: %s Če ga želite odstraniti, uporabite »urpme --auto-orphans«.
sv: Följande paket: %s behövs ej mera, använd "urpme --auto-orphans" för att ta bort det
tr: Aşağıdaki paketler artık gereksiz: %s , "urpme --auto-orphans" kullanarak sistemden kaldırabilirsiniz.

source: unable to parse "%s" in file [%s]
ast: nun pue analizase "%s" nel ficheru [%s]
ca: no es pot analitzar "%s" en el fitxer [%s]
cs: nelze zpracovat "%s" v souboru [%s]
cy: methu didoli ffeil hdlist "%s" yn ffeil (%s)
da: kunne ikke tolke '%s' i fil [%s]
el: αδυναμία ανάλυσης του "%s" στο αρχείο [%s]
es: no se puede analizar "%s" en el archivo [%s]
et: "%s" parsimine failis [%s] nurjus
eu: [%s] fitxategian ezin da "%s" analizatu
fi: "%s" ei voitu tulkita tiedostossa [%s]
fr: impossible d'analyser « %s » dans le fichier [%s]
gl: non foi posible analizar "%s" no ficheiro [%s]
he: אין אפשרות לפענח את "%s" בקובץ [%s]
hu: "%s" elemzése sikertelen a következő fájlban: "%s"
id: gagal mem-parse "%s" pada file [%s]
is: get ekki skilið "%s" í skrá [%s]
it: impossibile analizzare "%s" nel file [%s]
nb: Klarte ikke tolke «%s» i fila [%s].
nl: niet in staat "%s" te interpreteren in bestand [%s]
nn: Klarte ikkje tolka «%s» i fila [%s].
pl: nie można przetworzyć "%s" w pliku [%s]
pt: não é possível analisar "%s" no ficheiro [%s]
pt_br: incapaz de processar "%s" no arquivo [%s]
ro: nu se poate analiza „%s” în fișierul [%s]
ru: не удаётся разобрать «%s» в файле [%s]
sl: v datoteki [%s] ni mogoče razčleniti »%s«
sq: analizimi i pa mundur i "%s" në skedaren [%s]
sv: kan inte tyda "%s" i fil [%s]
tr: "%2$s" dosyasındaki "%1$s" ayrıştırılamıyor

source: examining parallel handler in file [%s]
ast: esaminando'l manexador paralelu nel ficheru [%s]
ca: s'està examinant manegador paral·lel en fitxer [%s]
cs: zkoumám paralelní zpracování v souboru [%s]
cy: archwilio trinydd paralel mewn ffeil [%s]
da: undersøger parallelbehandling i fil [%s]
el: εξέταση παράλληλου χειριστή στο αρχείο [%s]
es: examinando el manejador paralelo en el archivo [%s]
et: paralleelkäitleja uurimine failis [%s]
eu: [%s] fitxategiko maneiatzaile paraleloa aztertzen
fi: Tutkitaan rinnakkaiskäsittelijää tiedostosta [%s]
fr: examen du support distribué dans le fichier [%s]
he: בודק את המזהה המקבילי בקובץ [%s]
hu: párhuzamosság vizsgálata a következő fájlban: "%s"
id: memeriksa handler paralel pada file [%s]
is: athuga samhliða höndlun í skrá [%s]
it: esamino l'handler parallelo nel file [%s]
nb: Undersøker parallellhåndtering i fila [%s].
nl: bezig met onderzoeken parallelle handler in bestand [%s]
nn: Undersøkjer parallellhandtering i fila [%s].
pl: badanie równoległej funkcji obsługi w pliku [%s]
pt: a examinar o uso paralelo no ficheiro [%s]
pt_br: examinando aquisição em paralelo no arquivo [%s]
ro: se examinează descriptorul distribuit din fișierul [%s]
ru: проверяется обработчик parallel в файле [%s]
sl: preverjanje vzporednega ročnika v datoteki [%s]
sq: kontrollimi i përkrahjes në skedaren paralele [%s]
sv: undersöker parallell hanterare i fil [%s]
tr: "%s" dosyasındaki paralel işleyici inceleniyor

source: found parallel handler for nodes: %s
ast: alcontrose manexador paralelu pa los nodos: %s
ca: s'ha trobat un manegador paral·lel per als nodes: %s
cs: nalezeno paralelní zpracování pro uzly: %s
cy: canfod trinydd paralel ar gyfer nodau: %s
da: fandt parallelbehandling for knuder: %s
el: βρέθηκε παράλληλος χειριστής για του κόμβους: %s
es: se encontró manejador paralelo para los nodos: %s
et: leiti paralleelkäitleja sõlmedele: %s
eu: nodoentzako maneiatzaile paraleloa aurkitu da: %s
fi: Rinnakkaiskäsittelijä löydetty solmukohdille: %s
fr: support distribué trouvé pour les noeuds : %s
he: נמצא parallel handler עבור הצמתים: %s
hu: párhuzamosság van definiálva a következő gépekre: %s
id: menemukan handler paralel untuk node: %s
is: fann samhliða punt fyrir hnúta: %s
it: trovato handler parallelo per i nodi: %s
nb: Fant parallellhåndtering for tilgangpunktene: %s
nl: parallelle handler gevonden voor knooppunten: %s
nn: Fann parallellhandtering for nodar: %s.
pl: znaleziono równoległą funkcję obsługi dla węzłów: %s
pt: encontrado uso paralelo para nós: %s
pt_br: encontrado manipulador paralelo para os nós: %s
ro: s-a găsit descriptorul distribuit pentru nodurile: %s
ru: найден обработчик parallel для узлов: %s
sl: najden je bil vzporedni ročnik za vozlišča: %s
sq: gjetja e përkrahjes në nyjet paralele: %s
sv: hittade parallella hanterare för noder: %s
tr: düğümler için paralel işleyici bulundu: %s
