Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --sources - print source URLs of selected packages
cs: --sources - vypiš URL vybraných balíčků
el: --sources - εμφανίζει το πηγαίο URL των επιλεγμένων πακέτων.
es: --sources - imprime las URL fuente de los paquetes seleccionados
et: --sources - näitab valitud pakettide lähte-URLi.
fr: --sources - affiche les URLs de source des paquetages sélectionnés
it: --sources - stampa le URLs delle sorgenti dei pacchetti selezionati
nl: --sources - broncode-URLs van de geselecteerde pakketten weergeven
pt: --sources - mostra o URL fonte dos pacotes seleccionados
pt_br: --sources - URLs fonte de impressão dos pacotes selecionados
ro: --sources - afișează adresele URL sursă ale pachetului selectat.
ru: --sourcerpm - вывести адреса исходников выбранных пакетов
sl: --sources - izpiše URL izvorov izbranih paketov
tr: --sources - seçili paketlerin kaynak URL adreslerini yazdırır

source: --ignorearch - allow to query rpms for unmatched architectures.
ast: --ignorearch - permitir consultar rpms p'arquitectures que non correspuendan.
cs: --ignorearch - povolí dotazy na RPM balíčky pro jiné architektury
cy: --ignorearch - caniatáu ymholi rpmau ar gyfer saernïaeth annhebyg.
da: --ignorearch - tillad at spørge efter rpm'er for forskellige arkitekturer.
el: --ignorearch - επιτρέπει την αναζήτηση πακέτων και για άλλες αρχιτεκτονικές.
es: --ignorearch - permitir consultar rpms para arquitecturas que no correspondan.
et: --ignorearch - lubab sobimatu arhitektuuriga RPM-ide päringuid.
eu: --ignorearch - rpm-ak bat ez datozen arkitektura bila galdekatzeko aukera eskaintzen du.
fi: --ignorearch - salli rpm-pakettien haku myös eri laitteistoarkkitehtuureista.
fr: --ignorearch - autoriser la recherche de paquets pour d'autres architectures.
gl: --ignorearch - permitir consultar rpms de arquitecturas diferentes.
hu: --ignorearch - a nem megfelelő architektúrájú RPM-csomagok lekérdezésének engedélyezése
id: --ignorearch - ijinkan untuk query rpm untuk arsitektur yang tidak sesuai.
is: --ignorearch - leyfa fyrirspurn eftir rpm pökkum fyrir annan vélbúnað.
it: --ignorearch - permette di cercare rpm per un'altra architettura.
nb: --ignorearch – tillat å spørre etter pakker for andre arkitekturer.
nl: --ignorearch - rpm-zoekaanvraag voor niet-overeenkomende architecturen toestaan.
nn: --ignorearch – Tillat førespurnad etter pakkar for andre arkitekturar.
pl: --ignorearch - pozwól na kolejkowanie pakietów rpm przeznaczonych dla innych architektur.
pt: --ignorearch - permite consultar rpms para arquitecturas não correspondentes.
pt_br: --ignorearch - permite consultar pacotes de arquiteturas divergentes.
ro: --ignorearch - permite căutarea pachetelor pentru arhitecturile necorespunzătoare.
ru: --ignorearch - разрешить запрашивать rpm-файлы для несоответствующих архитектур
sl: --ignorearch - dovoli uvrstitev paketov za drugo arhitekturo na seznam.
sv: --ignorearch - tillåt sökande för rpm-paket som inte motsvarar arkitekturen.
tr: --ignorearch - eşleşmeyen mimariler için rpm'leri sorgulamaya izin verir.

source: --use-distrib - configure urpmi on the fly from a distrib tree. This permit to querying a distro.
ast: --use-distrib - configurar urpmi al vuelu dende un árbol de distribución. Esto permite consultar una distro.
cs: --use-distrib - nastaví urpmi za provozu ze stromu distribuce. To umožní dotaz na distribuci.
cy: --use-distrib - ffurfweddu urpmi wrth fynd o goeden distrib. Mae hyn yn caniatáu ymholi mewn dosbarthiad.
da: --use-distrib - konfigurér urpmi løbende fra et distrib-træ. Dette muliggør at spørge efter en distro.
el: --use-distrib - ρύθμιση του urpmi στα γρήγορα από ένα δένδρο distrib. Αυτό επιτρέπει το querying μιας διανομής (distro).
es: --use-distrib - configurar urpmi al vuelo desde un árbol de distribución. Esto permite consultar una distro.
et: --use-distrib - seadistab urpmi lennult distributsioonipuu põhjal. Võimaldab esitada päringu distributsiooni kohta.
eu: --use-distrib - urpmi berehala konfiguratzen du distrib zuhaitzetik. Horren bidez distro bati kontsulta egin diezaiokezu.
fi: --use-distrib - määrittele urpmi:n asetukset automaattisesti jakelun puusta (sallii etsimisen jakelusta).
fr: --use-distrib - configure urpmi à la volée d'après l'arbre d'une distribution, permettant d'interroger une distribution.
he: --use-distrib - הגדר את urpmi בזמן ריצה מעץ חבילות ההפצה. דבר זה מאפשר להפעיל שאילתות על הפצה.
hu: --use-distrib - az urpmi menet közben való beállítása egy disztribúciós fából; lehetővé teszi egy disztribúció lekérdezését
id: --use-distrib - konfigurasikan urpmi secara langsung dari pohon distrib. Hal ini mengijinkan query distro.
is: --use-distrib - stilla urpmi eftir dreifingartré. Þetta leyfir fyrirspurnir í dreifingar.
it: --use-distrib - configura urpmi "al volo" da un albero distribuito. Permette di interrogare una distribuzione.
nb: --use-distrib – sett opp urpmi direkte fra ett distribusjonstre. Dette tillater å forespøre en distribusjon.
nl: --use-distrib - urpmi dynamisch configureren vanuit distrib-boom. Hiermee kunt u de distro bevragen.
nn: --use-distrib – Set opp urpmi direkte frå eit distribusjonstre. Med dette kan du gjera spørjingar på ein distribusjon.
pl: --use-distrib - konfiguruje urpmi w locie z drzewa dystrybucyjnego. Ta opcja pozwala na odpytywanie dystrybucji.
pt: --use-distrib - configura o urpmi a partir de uma árvore da distribuição. Isto permite consultar uma distribuição.
pt_br: --use-distrib - configura o urpmi por meio de uma árvore de distribuição. Isso permite consultar essa distribuição.
ro: -use-distrib - configurează din mers urpmi dintr-un arbore de distribuție. Aceasta permite interogarea unei distribuții.
ru: --use-distrib - настроить urpmi на лету из дерева distrib. Параметр позволяет опросить дерево дистрибутива.
sl: --use-distrib - nastavi urpmi na licu mesta iz distrib. drevesa. To dovoli povpraševanje po distribuciji.
sv: --use-distrib - konfigurera urpmi 'on the fly' från ett distributionsträd. Detta tillåter kontroll av distribution.
tr: --use-distrib - urpmi'yi dağıtım ağacından yapılandır. Bu, bir dağıtımı sorgulamaya izin verir.

source: --changelog - print changelog.
ast: --changelog - imprentar el rexistru de cambeos.
ca: --changelog - mostra els canvis.
cs: --changelog - vypíše záznam změn
cy: --changelog - cofnod argraffu.
da: --changelog - udskriv ændringslog.
el: --changelog - εμφανίζει το changelog.
es: --changelog - imprimir el registro de cambios.
et: --changelog - näitab muutuste logi.
eu: --changelog - changelog inprimatzen du.
fi: --changelog - tulosta muutosloki.
fr: --changelog - afficher le changelog.
gl: --changelog - amosa o changelog.
he: --changelog - הדפס דו"ח שינויים.
hu: --changelog - változások listájának megjelenítése
id: --changelog - cetak changelog.
is: --changelog - prenta breytingasögu.
it: --changelog - mostra l'elenco delle modifiche.
nb: --changelog – vis endringslogg.
nl: --changelog - geeft wijzigingslogboek weer.
nn: --changelog – Vis endringslogg.
pl: --changelog - wyświetla dziennik zmian.
pt: --changelog - mostra o registo das mudanças (changelog).
pt_br: --changelog - imprime 'changelog'.
ro: --changelog - afișează jurnalul modificărilor
ru: --changelog - показать журнал изменений
sl: --changelog - izpiše zgodovino sprememb.
sv: --changelog - skriv ut ändringsloggen (changelog).
tr: --changelog - değişiklik günlüklerini yazdır.

source: --conflicts - print conflicts.
ast: --conflicts - imprenta conflictos.
cs: --conflicts - vypíše konflikty
cy: --conflicts - gwrthdaro argraffu
da: --conflicts - udskriv konflikter.
el: --conflicts - εμφανίζει τις συγκρούσεις.
es: --conflicts - imprime conflictos.
et: --conflicts - näitab konflikte.
eu: --conflicts - gatazkak erakutsi.
fi: --conflicts - tulosta ristiriitamerkinnät ("Conflicts").
fr: --conflicts - afficher les conflits.
gl: --conflicts - mostra os conflitos.
he: --conflicts - הדפס את ההתנגשויות.
hu: --conflicts - ütközések megjelenítése
is: --conflicts - prenta ósamræmi.
it: --conflicts - elenca i conflitti.
nb: --conflicts – viser konflikter.
nl: --conflicts - conflicts ('botst') afdrukken.
nn: --conflicts – Vis konfliktinformasjon.
pl: --conflicts - wyświetla listę konfliktów.
pt: --conflicts - mostra os conflitos
pt_br: --conflicts - lista conflitos.
ro: --conflicts - afișează conflictele.
ru: --conflicts - показать конфликты
sl: --conflicts - izpiše konflikte.
sv: --conflicts - visa konflikter
tr: --conflicts - çakışanları yazdır.

source: --obsoletes - print obsoletes.
ast: --obsoletes - amuesa los obsoletos.
cs: --obsoletes - vypíše zastaralé
cy: --obsoletes - argraffu'r hen.
da: --obsoletes - udskriv forældede
el: --obsoletes - εκτύπωση των μη χρησιμοποιούμενων (obsoletes).
es: --obsoletes - muestra los obsoletos.
et: --obsoletes - näitab iganenuid.
eu: --obsoletes - zaharkituak pantailaratu.
fi: --obsoletes - listaa vanhentavuustiedot ("Obsoletes").
fr: --obsoletes - afficher le champ « obsoletes »
hu: --obsoletes - árvák megjelenítése.
is: --obsoletes - prenta úrelta.
it: --obsoletes - elenca obsoleti.
nb: --obsoletes – viser utdaterte.
nl: --obsoletes - obsoletes ('maakt overbodig') afdrukken.
nn: --obsoletes – Vis utdaterte.
pl: --obsoletes - wyświetla przestarzałe znaczniki
pt: --obsoletes - mostra os obsoletos.
pt_br: --obsoletes - exibir obsoletos.
ro: --obsoletes - afișează pachetele învechite.
ru: --obsoletes - показать устаревшие файлы
sl: --obsoletes - prikaže seznam zastarelih paketov.
sv: --obsoletes - visa ersätter
tr: --obsoletes - gereksiz kılınanları yazdır.

source: --provides - print provides.
ast: --provides - imprenta lo que proporciona.
cs: --provides - vypíše, co se poskytuje
cy: --provides - argraffu darparu
da: --provides - vis hvilke filer pakker leverer.
el: --provides - εμφανίζει το πεδίο «provides».
es: --provides - imprime lo que proporciona.
et: --provides - näitab pakutavaid.
eu: --provides - inprimatu 'provides' eremua.
fi: --provides - tulosta tarjoamismerkinnät ("Provides").
fr: --provides - afficher le champ « provides »
gl: --provides - mostra o que proporciona.
hu: --provides - "szolgáltatásjegyzék" címkék
is: --provides - prenta hvað er skaffað.
it: --provides - elenca gli elementi forniti.
nb: --provides - vis tilbud.
nl: --provides - provides ('levert') afdrukken.
nn: --provides – Vis tilbod.
pl: --provides - wyświetla listę dostarczanych pakietów.
pt: --provides - mostra os fornecimentos
pt_br: --provides - lista provides.
ro: --provides - afișează furnizorii de pachete.
ru: --provides - показать предоставляемые файлы
sl: --provides - izpiše, kaj ponuja paket.
sv: --provides - visa tillhandahåller.
tr: --provides - sağladıklarını yazdır.

source: --requires - print requires.
ast: --requires - imprenta lo que necesita.
cs: --requires - vypíše, co se požaduje
cy: --requires - angenrhaid argraffu.
da: --requires - udskriv afhængigheder
el: --requires - εμφανίζει τις εξαρτήσεις.
es: --requires - imprime lo que necesita.
et: --requires - näitab nõutavaid.
eu: --requires - beharrezko dituenak erakutsi.
fi: --requires - tulosta riippuvuusmerkinnät ("Requires").
fr: --requires - afficher les dépendances.
gl: --requires - mostra o que require.
he: --requires - הדפס תלויות.
hu: --requires - követelmények megjelenítése
is: --requires - prenta hvers er þörf.
it: --requires - elenca i prerequisiti (requires).
nb: --requires – vis avhengigheter.
nl: --requires - requires ('vereisten') afdrukken.
nn: --requires – Vis kravinformasjon.
pl: --requires - wyświetla zależne pakiety.
pt: --requires - mostra os requerimentos.
pt_br: --requires - lista requires.
ro: --requires - afișează pachetele necesare.
ru: --requires - показать требуемые файлы
sl: --requires - izpiše zahtevano.
sv: --requires - visa krav
tr: --requires - gereklilikleri yazdırır.

source: --suggests - print suggests.
cs: --suggests - vypíše navrhované balíčky
cy: --suggests - argraffu'r awgrym.
da: --suggests - udskriv forslag.
es: --suggests - muestra los sugeridos.
eu: --suggests - inprimatu iradokitakoak.
fi: --suggests - näytä asennettavaksi ehdotettavat paketit ("Suggests").
hu: --suggests - kapcsolódók megjelenítése.
is: --suggests - prenta tillögur.
it: --suggests - elenca "suggeriti"
nb: --suggests – vis forslag.
pl: --suggests - wyświetla sugestie
pt: --suggests - mostra as sugestões.
ro: --suggests - afișează pachetele sugerate.
sv: --suggests - visa förslag
tr: --suggests - önerilenleri yazdır.

source: --sourcerpm - print sourcerpm.
ast: --sourcerpm - imprenta rpm fonte.
cs: --sourcerpm - vypíše název zdrojového RPM balíčku
cy: --sourcerpm - argraffu rpm ffynhonnell
da: --sourcerpm - vis kilde-rpm
el: --sourcerpm - εμφανίζει το όνομα του πηγαίου πακέτου.
es: --sourcerpm - imprime rpm fuente.
et: --sourcerpm - näitab lähtekoodi RPM-i nime.
eu: --sourcerpm - sourcerpm erakutsi.
fi: --sourcerpm - tulosta lähdekoodipaketin nimi.
fr: --sourcerpm - afficher le nom du paquetage source.
gl: --sourcerpm - mostra o rpm fonte.
hu: --sourcerpm - a forráscsomag neve
is: --sourcerpm - prenta frum-rpm.
it: --sourcerpm - stampa il nome del pacchetto rpm sorgente.
nb: --sourcerpm – vis kilde-rpm.
nl: --sourcerpm - broncode-rpm afdrukken.
nn: --sourcerpm – Vis namn på kjelde-RPM.
pl: --sourcerpm - nazwa pakietu rpm ze źródłami
pt: --sourcerpm - mostra o nome do rpm de código fonte
pt_br: --sourcerpm - lista o pacote fonte do rpm
ro: --sourcerpm - afișează numele pachetului sursă.
ru: --sourcerpm - показать исходный rpm-пакет
sl: --sourcerpm - izpiše ime izvornega paketa rpm.
sv: --sourcerpm - visa källrpm-namn
tr: --sourcerpm - sourcerpm yazdırır.

source: --summary, -S - print summary.
ast: --summary, -S - imprentar la descripción curtia (summariu).
ca: --summary, -S - imprimeix el resum.
cs: --summary, -S - vypíše shrnutí
cy: --summary, -S - crynodeb argraffu.
da: --summary, -S - skriv resumé.
el: --summary, -S - εμφανίζει την περίληψη.
es: --summary, -S - imprimir el descriptivo corto (summary).
et: --summary, -S - näitab kokkuvõtet.
eu: --summary, -S - laburpena inprimatu.
fi: --summary, -S - tulosta yhteenveto.
fr: --summary, -S - afficher le résumé.
gl: --summary, -S - amosar o resumo.
he: --summary, -S - הצג מידע תמציתי.
hu: --summary, -S - összefoglaló megjelenítése
id: --summary, -S - cetak ringkasan.
is: --summary, -S - prenta samantekt.
it: --summary, -S - stampa il sommario.
nb: --summary, -S – vis sammendrag.
nl: --summary, -S - geeft de samenvatting.
nn: --summary, -S – Vis samandrag.
pl: --summary, -S - wyświetla podsumowanie.
pt: --summary, -S - mostra o sumário.
pt_br: --summary, -S - imprime sumário.
ro: --summary, -S - afișează sumarul.
ru: --summary, -S - показать сводку
sl: --summary, -S - izpiše povzetek.
sv: --summary, -S - skriv ut summering.
tr: --summary, -S - özeti yazdırır.

source: --requires-recursive, -d - query package dependencies.
ast: --requires-recursive, -d - consultar les dependencies del paquete.
cs: --requires-recursive, -d - dotázat se na závislosti balíčku
cy: --requires-recursive, -d - ymestyn ymholiad i ddibyniaethau pecynnau. .
da: -d - forespørg om pakkeafhængigheder.
el: --requires-recursive, -d - αναζήτηση στις εξαρτήσεις του πακέτου.
es: --requires-recursive, -d - consultar las dependencias del paquete.
et: --requires-recursive, -d - paketi sõltuvuste päring.
eu: --requires-recursive, -d - galdekatu paketearen mendekotasunak.
fi: --requires-recursive, -d - hae paketin riippuvuudet.
fr: --requires-recursive, -d - interroger les dépendances du paquetage.
gl: --requires-recursive, -d - consultar as dependencias do paquete.
he: --requires-recursive, -d - חפש תלויות של החבילות.
hu: --requires-recursive, -d - a lekérdezés terjedjen ki a csomagfüggőségekre is
is: --requires-recursive, -d - útvíkka fyrirspurn til pakka sem eru háðir.
it: --requires-recursive, -d - cerca le dipendenze del pacchetto.
nb: -d – spør om pakkeavhengigheter.
nl: --requires-recursive, -d - pakketafhankelijkheden bevragen.
nn: --requires-recursive, -d – Utvid spørjing til pakkeavhengnader.
pl: --requires-recursive, -d - rozszerza zapytania o zależności między pakietowe.
pt: --requires-recursive, -d - analisa as dependências do pacote.
pt_br: --requires-recursive, -d - consulta dependências de pacote.
ro: --requires-recursive, -d - interoghează dependențele pachetelor.
ru: --requires-recursive, -d - опросить зависимости пакета
sl: --requires-recursive, -d - poizvedba tudi pri paketih, od katerih je odvisen paket.
sv: --requires-recursive, -d - utöka förfrågning till att omfatta paketberoenden.
tr: --requires-recursive, -d - paket bağımlılıklarını sorgula.

source: --whatrequires - reverse search to what requires package.
ast: --whatrequires - gueta inversa de lo que necesita'l paquete.
ca: --whatrequires - cerca inversa a que necessita el paquet.
cs: --whatrequires - reverzní vyhledávání požadavků balíčku
cy: --whatrequires - chwilio nôl i'r hyn sydd angen ar becyn.
da: --whatrequires - omvendt søgning til hvad der kræver pakke.
el: --whatrequires - αντίστροφη αναζήτηση των στοιχείων που απαιτούν αυτό το πακέτο.
es: --whatrequires - búsqueda inversa de lo que necesita el paquete.
et: --whatrequires - kohandab otsingu sellele, mida pakett nõuab.
eu: --whatrequires - paketeak behar duenaren alderantzizko bilaketa.
fi: --whatrequires - hae paketit, jotka riippuvat annetusta paketista.
fr: --whatrequires - recherche inversée des items nécessitant ce paquetage.
gl: --whatrequires - busca inversa do que require o paquete.
he: --whaterquires - בצע חיפוש הפוך אחר חבילות הדורשות את החבילה המוגדרת.
hu: --whatrequires - fordított keresés: mi igényli a csomagot
id: --whatrequires - pencarian terbalik untuk mencari apa yang membutuhkan paket.
is: --whatrequires - snúa við skilgreindum leitarskilyrðum um hvaða pakka er þörf.
it: --whatrequires - ricerca a ritroso sui requisiti del pacchetto.
nb: --whatrequires – omvendt søk etter hva som krever pakke.
nl: --whatrequires - omgekeerde zoekactie voor wat het pakket vereist.
nn: --whatrequires – Omvendt søk etter kva som krev pakken.
pl: --whatrequires - wyszukiwanie odwrotne tego co wymaga pakietu.
pt: --whatrequires - reverte a procura para o que o pacote requer.
pt_br: --whatrequires - busca reversa para o que requer o pacote.
ro: --whatrequires - căutare inversă în lista de dependențe a pachetului.
ru: --whatrequires - реверсивный поиск требуемых для пакета файлов
sl: --whatrequires - iskanje paketov, ki so odvisni od podanega paketa.
sq: --whatrequires - lejon hulumtimet në pajisje për ta gjetur pakon.
sv: --whatrequires - omvänd sökning för vad som krävs av paket.
tr: --whatrequires - gerekli paketler için ters arama.

source: --whatrequires-recursive - extended reverse search (includes virtual packages).
ast: --whatrequires-recursive - gueta inversa estendía (incluí los paquetes virtuales).
ca: --whatrequires-recursive - cerca inversa a que necessita el paquet.
cs: --whatrequires-recursive - rozšířené reverzní vyhledávání balíčků (včetně virtuálních balíčků)
cy: --whatrequires-recursive - chwilio nôl estyndig (yn cynnwys rhith becynnau)
da: --whatrequires-recursive - udvidet omvendt søgning (inklusive virtuelle pakker).
el: --whatrequires-recursive - εκτεταμένη αντίστροφη αναζήτηση (περιλαμβάνει και τα εικονικά πακέτα).
es: --whatrequires-recursive - búsqueda inversa extendida (incluye los paquetes virtuales).
et: --whatrequires-recursive - laiendatud kohandatud otsing (kaasa arvatud virtuaalsed paketid).
eu: --whatrequires-recursive - alderantzizko bilaketa hedatua (alegiazko paketeak barne).
fi: --whatrequires-recursive - laajennettu whatrequires-haku (sisällyttää näennäispaketit).
fr: --whatrequires-recursive - recherche inversée étendue (paquetages virtuels compris).
gl: --whatrequires-recursive - busca inversa extendida (inclúe os paquetes virtuais).
he: --whatrequires-recursive - חיפוש הפוך מורחב (כולל חבילות וירטואליות).
hu: --whatrequires-recursive - kiterjesztett fordított keresés (virtuális csomagokban is)
id: --whatrequires-recursive - pencarian terbalik yang diperluas (termasuk paket virtual).
is: --whatrequires-recursive - öflugri öfug leit (innifelur sýndarpakka).
it: --whatrequires-recursive - ricerca estesa a ritroso (anche sui pacchetti virtuali).
nb: --whatrequires-recursive – utvider omvendt søk (inkluderer virtuelle pakker).
nl: --whatrequires-recursive - uitgebreide omgekeerde (inclusief virtuele pakketten).
nn: --whatrequires-recursive – Utvida omvendt søk (òg virtuelle pakkar).
pl: --whatrequires-recursive - rozszerzone wyszukiwanie odwrotne (obejmuje pakiety wirtualne).
pt: -R - procura revertida extendida (inclui pacotes virtuais).
pt_br: --whatrequires-recursive - busca reversa extendida (inclui pacotes virtuais).
ro: --whatrequires-recursive - căutare inversă extinsă (include pachetele virtuale).
ru: --whatrequires-recursive - расширенный реверсивный поиск (включая виртуальные пакеты)
sl: --whatrequires-recursive - razširjeno iskanje paketov, ki so odvisni od podanega paketa (tudi med navideznimi paketi).
sv: --whatrequires-recursive - utökad omvänd sökning (inkluderar virtuella paket).
tr: --whatrequires-recursive - gelişmiş testen arama (sanal paketleri de içerir).

source: --whatprovides, -p - search in provides to find package.
ast: --whatprovides, -p - gueta en provides p'atopar el paquete.
cs: --whatprovides, -p - bude hledat balíček v položkách provides
cy: --whatprovides, -p - chwilio yn provides i ganfod pecyn.
da: --whatprovides, -p - søg i 'provides' for at finde pakke.
el: --whatprovides, -p - αναζήτηση του πακέτου που το παρέχει.
es: --whatprovides, -p - busca en provides para encontrar paquete.
et: --whatprovides, -p - lubab pakette otsida pakutavate seas.
eu: --whatprovides, -p - bilatu hornitutakoetan paketea aurkitzeko.
fi: --whatprovides, -p - hae paketit, jotka tarjoavat annetun paketin.
fr: --whatprovides, -p - chercher dans les apports pour trouver le paquetage.
gl: --whatprovides, -p - buscar en proporciona para atopar o paquete.
hu: --whatprovides, -p - csomag keresése a szolgáltatásjegyzékben
id: --whatprovides, -p - cari di provides untuk mencari paket.
is: --whatprovides, -p - leita í skaffar til að finna pakka.
it: --whatprovides, -p - cerca tra gli elementi forniti per trovare il pacchetto.
nb: --whatprovides, -p – tillat søking i tilbud for å finne pakke.
nl: --whatprovides, -p - zoek in 'levert'(provides)-veld om pakket te vinden.
nn: --whatprovides, -p - Tillat søk i tilbod for å finna pakke.
pl: --whatprovides, -p - wyszukiwanie celu znalezienia pakietu.
pt: --whatprovides, -p - procura nos fornecimentos (provides) para encontrar o pacote.
pt_br: --whatprovides, -p - permite a busca em provides para encontrar o pacote.
ro: --whatprovides, -p - caută în furnizorii de pachete pentru găsirea pachetului.
ru: --whatprovides, -p - поиск в provides для поиска пакетов
sl: --whatprovides, -p - da bi našel datoteko, išči v polju »priskrbi«.
sv: --whatprovides, -p - sök i "provides" för att hitta paket.
tr: --whatprovides, -p - paketi bulmak için sağlar içinde aramaya izin ver.
