Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: RPM installation
ast: Instalación de RPM
ca: Instal·lació de RPM
cs: Instalace RPM
cy: Gosod RPM
da: RPM-installering
el: Εγκατάσταση των RPM
es: Instalación de RPMs
et: RPM-i paigaldamine
eu: RPM instalaketa
fi: RPM-pakettien asennus
fr: Installation du RPM
gl: Instalación de RPMs
he: התקנת חבילות תוכנה
hu: RPM telepítése
id: Instalasi RPM
is: RPM innsetning
it: Installazione RPM
nb: RPM-installasjon
nl: RPM-installatie
nn: RPM-installering
pl: Instalacja pakietów RPM
pt: Instalação RPM
pt_br: Instalação de RPM
ro: Instalare RPM
ru: Установка RPM
sl: Namestitev RPM
sq: Instalimi RPM
tr: RPM Paketi Kurulumu

source: Error: unable to find file %s, will cancel operation
ast: Fallu: nun s'alcontró'l ficheru %s, la operación encaboxaráse
ca: Error: no es troba el fitxer %s, es cancel·larà l'operació
cs: Chyba: nelze nalézt soubor %s, operace bude zrušena
cy: Gwall: methu canfod ffeil %s, diddymu'r weithred
da: Fejl: kunne ikke finde fil %s, vil afbryde handling
el: Σφάλμα: αδυναμία εύρεσης του αρχείου %s, η διαδικασία θα ακυρωθεί
es: Error: no se puede encontrar el archivo %s, se cancelará la operación
et: Viga: faili %s ei leitud, toiming katkestatakse
eu: Akatsa: ezin da %s fitxategia aurkitu, eragiketa galaraziko da
fi: Virhe: tiedostoa %s ei löydy, toimenpide peruutetaan
fr: Erreur : fichier %s introuvable, annulation de l'opération
gl: Erro: non foi posible atopar o ficheiro %s, cancelarase a operación
he: שגיאה: לא ניתן למצוא את הקובץ %s, הפעולה תבוטל
hu: Hiba: %s nevű fájl nem található - a művelet megszakítva
id: Kesalahan: tidak dapat mencari file %s, membatalkan operasi
is: Villa: finn ekki skrá %s, mun stöðva aðgerð
it: Errore: impossibile trovare %s, annullo l'operazione
nb: Feil: klarte ikke å finne fila %s, vil avbryte operasjon.
nl: Fout opgetreden: kan bestand %s niet vinden, operatie wordt afgebroken
nn: Feil: Fann ikkje fila «%s». Operasjonen vert avbroten.
pl: Błąd: odnalezienie pliku %s było niemożliwe, operacja zostanie anulowana
pt: Erro: não é possível encontrar o ficheiro %s, cancelar a operação
pt_br: Erro: não foi possível encontrar arquivo %s, cancelando operação
ro: Eroare: nu s-a găsit fișierul %s, se anulează operația
ru: Ошибка: не удаётся найти файл %s, операция отменяется
sl: Napaka: ni bilo možno najti datoteke %s, prekinitev
sq: Gabim: i paaftë për të gjetur skedarin %s, do të anulojë veprimin
sv: Fel: kan inte hitta filen %s, avbryter operationen
tr: Hata: %s bulunamadı, işlem iptal edilecek

source: You have selected a source package: %s You probably didn't want to install it on your computer (installing it would allow you to make modifications to its sourcecode then compile it). What would you like to do?
ast: Seleicionastes un paquete orixe: %s Probablemente nun quies instalalu nel ordenador (instalalu permitiríate facer cambeos al códigu fonte y dempués recompilalu). ¿Qué quies facer?
ca: Heu seleccionat un paquet font: %s Probablement no voleu instal·lar-lo al vostre ordinador(fer-ho us permetrà canviar el codi fount i compilar-lo). Què voleu fer?
cs: Vybrali jste balíček se zdrojovými kódy: %s Tento balíček pravděpodobně nechcete na svém počítači instalovat (jeho instalace vám umožní provádět změny ve zdrojovém kódu programu a program překládat). Jak chcete pokračovat?
cy: Rydych wedi dewis pecyn ffynhonnell: %s Efallai nad oeddech wedi bwriadu ei osod ar eich cyfrifiadur (byddai ei osod yn caniatáu i chi i wneud newidiadau i'r cod ffynhonnell a'i grynhoi.). Beth hoffech chi ei wneud?
da: Du har valgt en kildetekstpakke: %s Du ønsker formodenligt ikke at installere denne på din maskine (installering af den ville gøre det muligt for dig at ændre i kildeteksten og så oversætte den). Hvad ønsker du at gøre?
el: Επιλέξατε ένα πακέτο πηγαίου κώδικα: %s Πιθανόν δεν θέλατε να το εγκαταστήσετε στον υπολογιστή σας (η εγκατάστασή του θα σας επιτρέψει να κάνετε τροποποιήσεις στον πηγαίου του κώδικα και μετά να το μεταγλωττίσετε). Τι θέλετε να κάνετε;
es: Seleccionó un paquete fuente: %s Probablemente no deseaba instalarlo en su computadora (instalarlo le permitiría realizar modificaciones al código fuente y luego recompilarlo). ¿Qué desea hacer?
et: Valisite lähtekoodi paketi: %s On väheusutav, et Te tahate seda tõesti arvutisse paigaldada (kui Te ei soovi just seda ise muuta ja uuesti kompileerida). Mida nüüd ette võtta?
eu: Iturburu pakete bat hautatu duzu: %s Segur aski ez zenuen ordenagailuan instalatu nahi (instalatzeak bere iturburu kodean aldaketak egin eta konpilatzeko aukera emango lizuke). Zer egin nahi duzu?
fi: Asennetaan lähdekoodipaketti: %s Oletettavasti et halua asentaa järjestelmään lähdekoodipakettia. (Lähdekoodipaketin asentaminen mahdollistaa muutoksien tekemisen lähdekoodiin ja ohjelman kääntämisen lähdekoodista). Mitä tehdään?
fr: Vous avez choisi un paquetage de sources : %s Vous ne désirez probablement pas l'installer sur votre ordinateur. (L'installer vous permettra de modifier le code source, puis de le recompiler). Que voulez-vous faire ?
gl: Seleccionou un paquete de fontes: %s Probablemente non o vai querer instalar no seu ordenador (se o instala poderá facer modificacións no código fonte e compilalo despois). Que desexa facer?
he: בחרת בחבילת קוד מקור: %s ייתכן ולא התכוונת להתקין חבילת קוד מקור (שהתקנתה תאפשר לך לבצע שינויים בקוד ולאחר מכן להדר אותה מחדש). מה ברצונך לעשות?
hu: Forráscsomagot jelölt ki: %s Lehetséges, hogy nem kívánta telepíteni a számítógépére (a csomag telepítése lehetővé tenné a forráskód módosítását és lefordítását). Mit szeretne tenni?
id: Anda telah memilih paket sumber: %s Anda mungkin tidak mau menginstal pada komputer Anda (dengan menginstal Anda akan dapat membuat modifikasi ke sourcecodenya lalu mengkompilenya) Apa yang akan Anda lakukan?
is: Þú hefur valið að setja upp frumforrita-pakka: %s Þú vilt sennilega ekki setja þetta upp á tölvunni þinni (með því að setja þennan pakka inn þá getur þú breytt frumforritum og þýtt þau aftur). Hvað vilt þú gera?
it: Hai selezionato un pacchetto sorgente: %s Probabilmente non vuoi installarlo sul tuo computer (installandolo potresti modificarne il codice sorgente e successivamente compilarlo). Cosa vuoi fare?
nb: Du har valgt en kildepakke: %s Du ønsket trolig ikke å installere den på maskina (å installere den vil tillate deg å gjøre endringer i kildekoden for så å kompilere den). Hva ønsker du å gjøre?
nl: U heeft een broncode-bestand uitgekozen: %s U wilt dit waarschijnlijk niet op uw computer installeren (installatie biedt de mogelijkheid de broncode te wijzigen en vervolgens te compileren). Wat wilt u doen?
nn: Du har valt ein kjeldepakke: %s Du ønskjer truleg ikkje å installera han på maskina. (Du kan då gjera endringar i pakken, og kompilera han på nytt.) Er du sikker på at du vil installera pakken?
pl: Wybrano pakiet źródłowy: %s Prawdopodobnie nie miałeś/aś ochoty zainstalować go (zainstalowanie go pozwoliłoby na wprowadzenie zmian do kodu źródłowego i skompilowanie go). Co chcesz zrobić?
pt: Seleccionou um pacote fonte: %s Provavelmente não o queria instalar no seu computador (a instalação deste pacote permite-lhe fazer modificações no código fonte e depois compilá-lo). O que deseja fazer?
pt_br: Você selecionou um pacote de código fonte: %s Provavelmente você não necessita ter ele instalado no seu computador (instalando-o você poder modificar seu código fonte e compilá-lo). O que você deseja fazer?
ro: Ați selectat pachetul sursă: %s Probabil nu v-ați dorit instalarea lui pe calculator (instalarea v-ar fi permis modificarea codului sursă, apoi compilarea sa). Ce doriți să faceți?
ru: Был выбран пакет с исходными кодами: %s Возможно, устанавливать его нет необходимости (после установки можно изменить исходный код программы, а затем откомпилировать её). Что нужно сделать?
sl: Izbrali ste paket z izvorno kodo: %s Verjetno ga niste nameravali namestiti (namestitev izvornega paketa vam omogoča narediti spremembe v izvorni kodi paketa in ga nato prevesti). Kaj želite narediti?
sq: Ju keni zgjedhur një paketë burimesh: %s Ju ndoshta nuk doni ta instaloni në kompjuterin tuaj (instalimi i saj do t'ju lejojë të bëni modifikime në kodin burimor të tij, pastaj hartoni atë). Çfarë do të dëshironit të bënit?
sv: Du har valt ett källpaket: %s Du vill troligen inte installera detta paket (efter installation kan du modifiera källkoden och sedan kompilera koden). Vad vill du göra?
tr: Bir kaynak paketi seçtiniz: %s Muhtemelen bu paketi yüklemek istemediniz. (bu paketi yüklemek kaynak kodunda değişiklik yaparak paketi tekrar derlemenizi sağlayacak). Ne yapmak istersiniz?

source: You are about to install the following software packages on your computer: %s Proceed?
ast: Tas a puntu d'instalar los siguientes paquetes de software nel ordenador: %s ¿Siguir?
ca: Esteu a punt d'instal·lar els següents paquets de programari al vostre ordinador: %s Voleu continuar?
cs: Chystáte se na svůj počítač instalovat následující softwarové balíčky: %s Pokračovat?
cy: Rydych ar fin gosod y pecynnau meddalwedd canlynol ar eich cyfrifiadur: %s Parhau?
da: Du er ved at installere den følgende programpakke på din maskine: %s Fortsæt?
el: Πρόκειται να εγκαταστήσετε τα ακόλουθα πακέτα λογισμικού στον υπολογιστή σας: %s Να συνεχίσω;
es: Está a punto de instalar los siguientes paquetes de software en su computadora: %s ¿Continuar?
et: Kavatsete paigaldada oma arvutisse järgmised tarkvarapaketid: %s Kas jätkata?
eu: Zure konputagailuan hurrengo software paketeak instalatzera zoaz: %s Jarraitu?
fi: Asennetaan seuraavat ohjelmapaketit: %s Jatka?
fr: Vous êtes sur le point d'installer les paquetages suivants sur votre ordinateur : %s Continuer ?
gl: Está a piques de instalar os seguintes paquetes de software no seu ordenador: %s Desexa continuar?
he: חבילות התוכנה הבאות יותקנו כעת במחשבך: %s האם ברצונך להמשיך?
hu: A következő csomagokat készül telepíteni a számítógépre: %s Kívánja folytatni?
id: Anda hendak menginstall paket perangkat lunak berikut pada komputer Anda: %s Lanjutkan?
is: Þú ert um það bil að fara að setja inn eftirfarandi hugbúnaðarpakka á tölvuna: %s Halda áfram?
it: Hai scelto di installare i seguenti pacchetti software sul tuo computer: %s Vuoi continuare?
nb: Du er på vei til å installere de følgende programvarepakkene på maskina: %s Fortsett?
nl: U staat op het punt de volgende softwarepakketten op uw computer te installeren: %s Doorgaan?
nn: Du er i ferd med installera denne pakken på maskina di: %s Vil du halda fram?
pl: Następujące pakiety oprogramowania zostaną zainstalowane na komputerze: %s Kontynuować?
pt: Está prestes a instalar os seguintes pacotes no seu computador: %s Deseja continuar?
pt_br: Você está para instalar o(s) seguinte(s) pacote(s) de software em seu computador: %s Confirma instalação?
ro: Sînteți pe cale să instalați pe calculator următoarele pachete: %s Continuați?
ru: В систему будут установлены следующие пакеты: %s Продолжить?
sl: Ste pred namestitvijo naslednjih programskih paketov: %s Nadaljevanje?
sq: Ju po instaloni paketat e mëposhtme programesh në kompjuterin tuaj: %s Vazhdoj?
sv: Du är på väg att installera följande paket på din dator: %s Fortsätta?
tr: Şu yazılım paketlerini sisteminize kurmak üzeresiniz: %s Devam edilsin mi?

source: You are about to install the following software package on your computer: %s You may prefer to just save it. What is your choice?
ast: Tas a puntu d'instalar el paquete de software siguiente nel ordenador: %s Puede que prefieras namái guardalu. ¿Cuál ye la to escoyeta?
ca: Esteu a punt d'instal·lar els següents paquets de programari al vostre ordinador: %s Potser preferiu només desar-lo. Que voleu fer?
cs: Chystáte se na svůj počítač instalovat následující softwarové balíčky: %s Možná chcete tento balíček pouze uložit. Jak chcete pokračovat?
cy: Rydych ar fin gosod y pecyn meddalwedd canlynol ar eich cyfrifiadur: %s Efallai byddai'n well gennych ei gadw. Beth yw eich dewis?
da: Du er ved at installere den følgende programmelpakke på din maskine: %s Du vil måske foretrække blot at gemme den. Hvad er dit valg?
el: Πρόκειται να εγκαταστήσετε το ακόλουθο πακέτο λογισμικού στον υπολογιστή σας: %s Μπορεί να προτιμάτε απλά να το αποθηκεύσετε. Ποια είναι η επιλογή σας;
es: Está a punto de instalar el paquete de software siguiente en su computadora: %s Puede que prefiera sólo guardarlo. ¿Cuál es su elección?
et: Kavatsete paigaldada oma arvutisse järgmise tarkvarapaketi: %s Võib-olla soovite siiski seda lihtsalt salvestada? Mida ette võtta?
eu: Software-pakete hau instalatzera zoaz ordenagailuan: %s Baliteke gordetzea bakarrik nahi izatea. Zer egin nahi duzu?
fi: Asennetaan ohjelmapaketti: %s Paketti voidaan myös vain tallentaa koneelle. Mitä tehdään?
fr: Vous êtes sur le point d'installer le paquetage suivant sur votre ordinateur : %s Peut-être préférez-vous simplement l'enregistrer. Quel est votre choix ?
gl: Está a piques de instalar o seguinte paquete de software no seu ordenador: %s Podería preferir só gardalo. Que desexa facer?
he: חבילת התוכנה הבאה תותקן במחשבך: %s ייתכן וברצונך רק לשמור את החבילה לדיסק. מה ברצונך לעשות?
hu: A következő csomagot készül telepíteni a számítógépre: %s Választhatja azt is, hogy csak elmenti a csomagot. Mit szeretne tenni?
id: Anda hendak menginstal paket perangkat lunak berikut pada komputer Anda: %s Anda dapat menyimpannya. Apakah pilihan anda?
is: Þú ert að fara að setja eftirfarandi forritapakka inn á tölvuna þína: %s Þú vilt kannski frekar aðeins vista pakkana. Hvað velur þú?
it: Hai scelto di installare il seguente pacchetto software sul tuo computer: %s Potresti preferire salvarlo. Qual è la tua scelta?
nb: Du er på vei til å installere de følgende programvarepakkene på maskina: %s Det kan hende at du bare vil lagre dem. Hva vil du gjøre?
nl: U staat op het punt het volgende softwarepakket op uw computer te installeren: %s Mogelijk geeft u er de voorkeur aan het bestand slechts op te slaan. Wat is uw keuze?
nn: Du er i ferd med installera denne pakken på maskina di: %s Du kan òg velja å berre lagra han. Kva vil du gjera?
pl: Następujące pakiety oprogramowania zostaną zainstalowane na komputerze: %s Być może będziesz mieć ochotę go zapisać. Jaki jest twój wybór?
pt: Está prestes a instalar o seguinte pacote no seu computador: %s Pode preferir apenas gravá-lo. O que deseja?
pt_br: Você está para instalar o(s) seguinte(s) pacote(s) de software em seu computador: %s Você pode apenas salvá-lo(s). Qual a sua escolha?
ro: Sînteți pe cale să instalați pe calculator următorul pachet: %s Poate preferați doar să-l salvați. Ce alegeți?
ru: В систему будет установлен следующий пакет: %s Пакет можно просто сохранить. Что нужно сделать?
sl: Ste pred namestitvijo naslednjega programskega paketa: %s Mogoče bi ga raje samo shranili. Kakšna je vaša izbira?
sq: Ju jeni gati për të instaluar paketën e mëposhtme software në kompjuterin tuaj: %s Ju mund të preferoni vetëm ta ruani atë. Cila është zgjedhja juaj?
sv: Du är på väg att installera följande paket på din dator: %s Kanske föredrar du att endast spara detta. Vilket är ditt val?
tr: Şu yazılım paketini sisteminize kurmak üzeresiniz: %s Bunu sadece kaydetmeyi de seçebilirsiniz. Seçiminiz nedir?

source: _Install
ast: _Instalar
ca: _Instal·la
cs: _Instalovat
cy: _Gosod
da: _Installér
el: _Εγκατάσταση
es: _Instalar
et: _Paigalda
eu: _Instalatu
fi: _Asenna
fr: _Installer
gl: _Instalar
he: _התקנה
hu: _Telepítés
is: Setja _upp
it: _Installa
nb: _Installer
nl: _Installeren
nn: _Installer
pl: _Instaluj
pt: _Instalar
pt_br: _Instalar
ro: _Instalează
ru: _Установить
sl: _Namesti
sq: _Instalo
sv: _Installera
tr: _Kur

source: _Save
ast: _Guardar
ca: _Desa
cs: _Uložit
cy: _Cadw
da: _Gem
el: _Αποθήκευση
es: _Guardar
et: _Salvesta
eu: _Gorde
fi: _Tallenna
fr: _Sauver
gl: _Gardar
he: _שמירה
hu: Menté_s
id: _Simpan
is: Vi_sta
it: _Salva
nb: _Lagre
nl: _Opslaan
nn: _Lagra
pl: _Zapisz
pt: _Gravar
pt_br: _Salvar
ro: _Salvează
ru: _Сохранить
sl: _Shrani
sq: _Ruaj
sv: _Spara
tr: _Kaydet

source: _Cancel
ast: _Encaboxar
ca: _Cancel·la
cs: _Přerušit
cy: _Dileu
da: _Annullér
el: _Ακύρωση
es: _Cancelar
et: _Loobu
eu: _Utzi
fi: _Peruuta
fr: _Annuler
gl: _Cancelar
he: _ביטול
hu: _Mégsem
id: _Batal
is: Hætta _við
it: _Annulla
nb: _Avbryt
nl: _Annuleren
nn: _Avbryt
pl: _Anuluj
pt: _Cancelar
pt_br: _Cancelar
ro: _Anulează
ru: _Отмена
sl: _Prekliči
sq: _Anulo
sv: Av_bryt
tr: İp_tal

source: Choose location to save file
ast: Escueyi allugamientu pa guardar ficheru
ca: Escolliu la ubicació on desar el fitxer
cs: Vyberte, kam chcete uložit soubor
cy: Dewiswch leoliad i gadw'r ffeil
da: Vælg sted at gemme filen
el: Επιλέξτε μια τοποθεσία για την αποθήκευση του αρχείου
es: Elija ubicación para guardar archivo
et: Valige faili salvestamise koht
eu: Aukeratu fitxategiko gordetzeko kokalekua
fi: Valitse tallennettavalle tiedostolle sijainti
fr: Choisissez un emplacement pour enregistrer le fichier
gl: Escolla a localización onde se gardará o ficheiro
he: עליך לבחור מקום לשמירת הקובץ
hu: Válasszon helyet a fájlnak
id: Pilih lokasi penyimpanan file
is: Veldu stað til að vista skrá
it: Scegli dove salvare il file
nb: Velg hvor fila skal lagres.
nl: Kies locatie om bestand in op te slaan
nn: Vel plassering av lagra fil.
pl: Wybierz miejsce zapisania pliku
pt: Escolha onde deseja gravar o ficheiro
pt_br: Escolha o local para salvar o arquivo
ro: Alegeți locația unde se salvează fișierul
ru: Укажите местоположение для сохранения файла
sl: Izberite mesto za shranjevanje datoteke
sq: Zgjedh vendndodhjen për të ruajtur skedarë
sv: Välj var filen ska sparas
tr: Dosyayı kaydetmek için bir yer seçin

source: Options:
ast: Opciones:
ca: Opcions:
cs: Volby:
cy: Dewisiadau:
da: Valgmuligheder:
el: Επιλογές:
es: Opciones:
et: Võtmed:
eu: Aukerak:
fi: Valitsimet:
gl: Opcións:
hu: Opciók:
is: Valkostir:
it: Opzioni:
nb: Valg:
nl: Opties:
nn: Val:
pl: Opcje:
pt: Opções:
pt_br: Opções:
ro: Opțiuni:
ru: Параметры:
sl: Možnosti:
sq: Alternativat:
sv: Alternativ:
tr: Seçenekler:

source: --help - print this help message.
ast: --help - imprenta esti mensax d'aida.
ca: --help - mostra aquest missatge d'ajuda.
cs: --help - vypíše tuto nápovědu.
cy: --help - argraffu neges cymorth.
da: --help - udskriv denne hjælpebesked.
el: --help - εμφανίζει αυτό το μήνυμα βοήθειας.
es: --help - imprime este mensaje de ayuda.
et: --help - näitab seda abiteadet.
eu: --help - laguntza-mezu hau inprimatzen du.
fi: --help - tulosta tämä viesti.
fr: --help - afficher ce message d'aide.
gl: --help - amosa esta mensaxe de axuda.
he: --help - הצגת הודעת עזרה זו.
hu: --help - jelen segítség megjelenítése
id: --help - cetak pesan bantuan ini.
is: --help - prenta þetta.
it: --help - stampa questo messaggio di aiuto.
nb: --help – vis denne hjelpeteksten.
nl: --help - geeft deze hulptekst.
nn: --help – Vis denne hjelpeteksten.
pl: --help - wyświetla ten komunikat pomocy.
pt: --help - mostra esta mensagem de ajuda.
pt_br: --help - imprime esta mensagem de ajuda.
ro: --help - afișează acest mesaj de ajutor.
ru: --help - показать эту справку
sl: --help - prikaži to sporočilo s pomočjo.
sq: --help - shtype këtë lajmë ndihmues.
sv: --help - visar det här hjälpmeddelandet.
tr: --help - bu yardım mesajını görüntüler.

source: --auto - non-interactive mode, assume default answers to questions.
ast: --auto - mou non-interautivu, asumir rempuestes predeterminaes pa les entrugues.
cs: --auto - neinteraktivní mód, použije na otázky výchozí odpovědi
cy: --auto - modd anrhyngweithiol, derbyn atebion rhagosodedig i gwestiynau.
da: --auto - ikke-interaktiv tilstand, antag standardsvar på spørgsmål.
el: --auto - μη αλληλεπιδραστική λειτουργία, χρήση των προεπιλεγμένων παραμέτρων.
es: --auto - modo no-interactivo, asumir respuestas predet. para todas las preguntas.
et: --auto - mitteinteraktiivne režiim, eeldatakse kõigile küsimustele vaikimisi pakutavaid vastuseid.
eu: --auto - modu ez-interaktiboa, galderen erantzun lehenetsiak erabili.
fi: --auto - ei-interaktiivinen tila, vastaa kaikkiin kysymyksiin oletusarvon mukaisesti.
fr: --auto - mode non intéractif, utilisation des paramètres par défaut.
gl: --auto - modo non-interactivo, tómanse as respostas predeterminadas para as preguntas.
hu: --auto - nem-interaktív mód, a kérdésekre az alapértelmezett válaszok lesznek feltételezve
id: --auto - mode non-interaktif, mengasumsikan jawaban default pada semua pertanyaan.
is: --auto - ekki gagnvirkur hamur, gera ráð fyrir sjálfgefnum svörum við spurningum.
it: --auto - modalità automatica, usa la risposta predefinita per tutte le domande
nb: --auto – automatisk modus. Anta standardsvar på alle spørsmål.
nl: --auto - niet-interactieve modus, standaardantwoorden op vragen aannemen.
nn: --auto – Ikkje-interaktiv modus. Anta standardsvar på alle spørsmål.
pl: --auto - tryb nieinteraktywny, stosuje domyślne odpowiedzi na pytania.
pt: --auto - modo não-interactivo, assume respostas predefinidas às questões.
pt_br: --auto - modo não-interativo, assume respostas padrão para as perguntas.
ro: --auto - mod neinteractiv, se atribuie întrebărilor răspunsurile implicite.
ru: --auto - неинтерактивный режим; на вопросы даются ответы по умолчанию
sl: --auto - neinteraktiven način, uporabi privzete odgovore na vprašanja.
sq: --auto - modaliteti jo-interaktiv, supozo përgjigjet e parazgjedhura në pyetje.
sv: --auto - ej interaktivt läge. väljer standardsvar på alla frågor.
tr: --auto - etkileşimli kip kapalı, sorulara varsayılan cevapları ver.

source: --auto-select - automatically select packages to upgrade the system.
ast: --auto-select - escoyer automáticamente paquetes p'anovar sistema.
ca: --auto-select - selecciona automàticament els paquets per actualitzar el sistema.
cs: --auto-select - automaticky vybere balíčky pro aktualizaci systému
cy: --auto-select - dewis pecynnau'n awtomatig i uwchraddio'r system.
da: --auto-select - vælg automatisk pakker for opgradering af systemet.
el: --auto-select - αυτόματη επιλογή των πακέτων για την αναβάθμιση του συστήματος.
es: --auto-select - seleccionar automáticamente paquetes para actualizar sistema.
et: --auto-select - valib automaatselt paketid süsteemi uuendamiseks.
eu: --auto-select - automatikoki sistemaren bertsioa berritzeko paketeak hautatzen ditu
fi: --auto-select - valitse automaattisesti saatavilla olevat päivitykset.
fr: --auto-select - sélection automatique des paquetages à mettre à jour.
gl: --auto-select - seleccionar automáticamente os paquetes para actualizar o sistema.
hu: --auto-select - automatikusan kiválasztja a frissíthető csomagokat
id: --auto-select - otomatis menyeleksi paket untuk upgrade sistem.
is: --auto-select - velja sjálfkrafa pakka til að uppfæra kerfið.
it: --auto-select - seleziona automaticamente i pacchetti per aggiornare il sistema.
nb: --auto-select – velg automatisk alle pakker for oppgradering av systemet.
nl: --auto-select - automatisch pakketten selecteren voor systeemopwaardering.
nn: --auto-select – Vel automatisk alle pakkar som kan oppdaterast.
pl: --auto-select - automatycznie wybiera pakiety aktualizujące system.
pt: --auto-select - selecciona automaticamente os pacotes para actualizar o sistema.
pt_br: --auto-select - automaticamente seleciona os pacotes para atualizar o sistema.
ro: --auto-select - selectează automat pachetele pentru actualizarea sistemului.
ru: --auto-select - автоматически выбрать пакеты для обновления системы
sl: --auto-select - samodejna izbira paketov za nadgradnjo sistema.
sq: --auto-select - zgjedhni automatikisht pakot azhurnuese në sistem.
sv: --auto-select - välj automatiskt paket för att uppdatera systemet.
tr: --auto-select - Sistemi güncellemek için paketleri otomatik seç.
