Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: You must first call urpmi with --buildrequires to install the following dependencies: %s
ast: Primero tienes de llamar a urpmi con --buildrequires pa instalar les dependencias siguientes: %s
cs: Musíte nejprve zavolat urpmi s volbou --buildrequires a nainstalovat následující závislosti: %s
cy: Rhaid galw urpmi yn gyntaf gyda --buildrequires er mwyn gosod y dibyniaethau canlynol: %s
da: Du skal først kalde urpmi med --buildrequires for at installere de følgende afhængigheder: %s
el: Πρέπει πρώτα να χρησιμοποιήσετε την urpmi --buildrequires για να εγκαταστήσετε τις παρακάτω εξαρτήσεις: %s
es: Primero debe llamar a urpmi con --buildrequires para instalar las dependencias siguientes: %s
et: Järgmiste sõltuvuste paigaldamiseks tuleb urpmi välja kutsuda võtmega --buildrequires: %s
eu: Lehenengo urpmi deitu behar duzu --buildrequires aukerarekin ondoko mendekotasunak instalatzeko: %s
fi: Urpmi tulee suorittaa ensin valitsimella --buildrequires, jotta seuraavat riippuvuudet asennetaan: %s
fr: Vous devez d'abord utiliser urpmi --buildrequires pour installer les dépendances suivantes : %s
gl: Primeiro ten que executar urpmi con --buildrequires para instalar as seguintes dependencias: %s
he: יש צורך לקרוא ל-urpmi עם --buildrequires תחילה כדי להתקין את התלויות הבאות: %s
hu: Használja az urpmi-hoz a --buildrequires opciót az alábbi függőségek telepítéséhez: %s
is: Þú verður fyrst að kalla á urpmi með --buildrequires til að setja inn eftirfarandi háða pakka: %s
it: Devi prima lanciare urpmi con --buildrequires per installare le seguenti dipendenze: %s
nb: Du må først kjøre urpmi med --buildrequires for å kunne installere de følgende avhengighetene: %s
nl: U dient urpmi eerst aan te roepen met --buildrequires om de volgende afhankelijkheden te installeren: %s
nn: Du må først køyra urpmi med «--buildrequires» å kunna installera desse avhengnadene: %s
pl: Aby zainstalować poniższe pakiety zależne uruchom polecenie urpmi z opcją --buildrequires. %s
pt: Precisa primeiro correr o urpmi com --buildrequires para instalar as seguintes dependências: %s
pt_br: Você precisa executar o urpmi com --buildrequires para instalar as seguintes dependências: %s
ro: Trebuie să rulați urpmi cu --buildrequires pentru instalarea următoarelor dependențe: %s
ru: Сначала нужно запустить urpmi с параметром --buildrequires, чтобы установить следующие зависимости: %s
sl: Za namestitev naslednjih odvisnosti morate najprej zagnati urpmi z možnostjo --buildrequires: %s
sv: Du måste först använda urpmi --buildqequires för att installera följande beroenden: %s
tr: Şu bağımlılıkları kurabilmek için önce urpmi'yi "--buildrequires" ile çağırmalısınız: %s

source: The following orphan package will be removed.
ast: Desaniciaráse'l paquete güérfanu siguiente.
cs: Bude odstraněn následující sirotek.
cy: Bydd y pecyn amddifad canlynol yn cael ei dynnu
da: Den følgende forældreløse pakke vil blive fjernet.
el: Θα αφαιρεθεί το παρακάτω ορφανό πακέτο.
es: Se quitará el siguiente paquete huérfano.
et: Eemaldatakse järgmine orvust pakett.
eu: Ondoko pakete umezurtza ezabatuko da.
fi: Seuraava tarpeeton paketti poistetaan.
fr: Le paquetage orphelin suivant va être désinstallé.
hu: Az következő árva csomag el lesz távolítva.
is: Eftirfarandi munaðarlaus pakki verður fjarlægður.
it: Verrà rimosso il seguente pacchetto orfano.
nb: Den følgende foreldreløse pakka vil bli fjerna.
nl: Het volgende weespakket wordt verwijderd.
nn: Denne foreldrelause pakken vert fjerna.
pl: Zostanie usunięty następujący osierocony pakiet.
pt: O seguinte pacote órfão será removido.
pt_br: O seguinte pacote órfão será removido
ro: Următorul pachet orfan va fi înlăturat.
sl: Naslednji osiroteli paket bo odstranjen.
sv: Följande obehövliga paket kommer att tas bort.
tr: Aşağıdaki gereksiz paketler kaldırılacak

source: WARNING: %s option is in use. Some strange problems may happen
el: ΠΡΟΣΟΧΗ: Η επιλογή %s είναι σε χρήση. Μπορεί να παρουσιαστούν μερικά παράξενα προβλήματα.
es: ADVERTENCIA: la opción %s está en uso. Pueden ocurrir problemas extraños
et: HOIATUS: kasutusel on võti %s. Võib tekkida kummalisi probleeme
fr: ATTENTION : L'option %s est activée. Des problèmes étranges peuvent se produire
it: ATTENZIONE: l'opzione %s è in uso. Strani problemi potrebbero verificarsi
nl: WAARSCHUWING: %s-optie is in gebruik. Er kunnen zich onverwachte problemen voordoen
pt: AVISO: a opção %s está em uso. Podem ocorrer alguns problemas estranhos
pt_br: AVISO: %s opção está em uso. Alguns problemas estranhos pode acontecer
ro: ATENȚIE: Opțiunea %s este activă. Se pot produce probleme ciudate
ru: ВНИМАНИЕ: использован параметр %s. Могут возникнуть неожиданные проблемы.
sl: OPOZORILO: uporabljena je možnost %s. Lahko pride do nenavadnih težav

source: (test only, installation will not be actually done)
ast: (namái preba, nun se llevará a cabo la instalación)
ca: (només de prova, la instal·lació no es farà)
cs: (pouze test, k instalaci ve skutečnosti nedojde)
cy: (prawf yn unig, ni fydd yn cael ei osod)
da: (kun test, installation vil egentlig ikke blive gennemført)
el: (μονάχα έλεγχος, η εγκατάσταση δεν θα γίνει πραγματικά)
es: (sólo prueba, no se llevará a cabo la instalación)
et: (ainult test, tegelikult midagi ei paigaldata)
eu: (froga soilik, instalazioa ez da egingo)
fi: (vain testi, paketteja ei asenneta oikeasti)
fr: (test uniquement, l'installation ne sera pas effectuée)
gl: (só probar, a instalación non se fará agora mesmo)
he: (בדיקה בלבד, ההתקנה לא תבוצע למעשה)
hu: (csak teszt; a telepítés nem lesz ténylegesen végrehajtva)
id: (hanya pengujian, installasi tidak akan dilakukan)
is: (aðeins prófun, ekkert verður sett inn í raun)
it: (è solo un test, l'installazione non verrà fatta)
nb: (kun test, installasjon vil egentlig ikke bli gjennomført)
nl: (alleen test, installatie zal niet daadwerkelijk plaatsvinden)
nn: (Berre ein test. Pakkane vert ikkje installerte.)
pl: (to tylko test, instalacja nie będzie wykonana)
pt: (testa apenas, a instalação não é executada)
pt_br: (somente teste, instalações não serão efetivadas)
ro: (doar test, fără instalare de pachete)
ru: (только проверка, без установки)
sl: (samo test, namestitev se ne bo izvedla)
sv: (endast test, installation kommer inte att utföras)
tr: (sadece deneme, gerçekte kurulum yapılmayacak.)

source: %s of additional disk space will be used.
ast: Usaránse %s d'espaciu de discu adicional.
ca: s'utilitzarà %s d'espai de disc addicional
cs: Navíc bude použito %s diskového prostoru.
cy: Bydd %s o le ychwanegol ar ddisg yn cael ei ddefnyddio.
da: %s mere diskplads vil blive brugt.
el: Θα χρησιμοποιηθεί επιπλέον χώρος %s στο σκληρό δίσκο.
es: se utilizarán %s de espacio de disco adicional.
et: Kasutusele võetakse veel %s kettaruumi.
eu: diskoan %s leku gehiago erabiliko da.
fi: Pakettien asentaminen vie %s lisää levytilaa.
fr: un espace additionnel de %s sera utilisé.
gl: vanse usar %s de espazo adicional no disco.
he: יעשה שימוש ב-%s שטח כונן נוסף.
hu: További %s lemezterület lesz használva.
is: diskpláss minnkar um %s.
it: Altri %s di spazio disco saranno utilizzati.
nb: %s med ytterligere diskplass vil bli brukt.
nl: %s aan extra schijfruimte zal worden gebruikt.
nn: Det vert brukt %s meir diskplass.
pl: Zostanie wykorzystany dodatkowy obszar na dysku: %s
pt: %s adicionais do espaço do disco irão ser usados.
pt_br: %s de espaço adicional em disco será usado.
ro: Vor fi utilizați %s adiționali din spațiul de pe disc.
ru: Будет использовано %s дополнительного дискового пространства.
sl: Uporabljenega bo %s dodatnega prostora na disku.
sq: %s hapësirë ​​shtesë në disk do të përdoret.
sv: %s mera disk-utrymme kommer att bli använt.
tr: Diskin %s kadarı kullanılacak.

source: %s of disk space will be freed.
ast: Lliberaráse %s d'espaciu de discu.
cs: Bude uvolněno %s diskového prostoru.
cy: Bydd %s o le ar ddisg ar gael.
da: %s diskplads vil blive frigjort.
el: Θα ελευθερωθεί %s χώρου στο σκληρό δίσκο.
es: se liberará %s de espacio de disco.
et: Vabaneb %s kettaruumi.
eu: diskoan %s lekua askatuko da.
fi: Levytilaa vapautuu %s.
fr: un espace de %s sera libéré.
gl: vanse liberar %s de espazo no disco.
he: %s שטח בכונן יפונה.
hu: %s lemezhely fel lesz szabadítva.
is: diskpláss eykst um %s.
it: %s di spazio disco saranno liberati.
nb: %s med diskplass vil bli ledig.
nl: %s aan schijfruimte zal vrijkomen.
nn: Det vert frigjort %s diskplass.
pl: Zostanie zwolniony obszar na dysku: %s.
pt: %s do espaço do disco irão ser libertados
pt_br: %s de espaço em disco serão liberados.
ro: Vor fi eliberați %s din spațiul de pe disc.
ru: Будет освобождено %s дискового пространства.
sl: Sproščenega bo %s prostora na disku.
sq: %s e hapësirë ​​në disk do të lirohen.
sv: %s disk-utrymme kommer att frigöras.
tr: Diskin %s kadarı boşalacak.

source: %s of packages will be retrieved.
ast: Baxaránse %s de paquetes.
cs: Bude staženo %s balíčků.
cy: bydd %s o becynnau yn cael eu hadfer.
da: %s pakker vil blive hentet.
el: %s των πακέτων θα ανακτηθούν.
es: se descargarán %s de paquetes.
et: Tõmmatakse %s andmeid.
eu: paketeen %s eskuratuko dira.
fi: Noudetaan yhteensä %s.
fr: %s de paquets seront récupérés.
gl: vanse obter %s de paquetes.
he: %s של חבילות יאוחזרו.
hu: %s csomag lesz beszerezve.
is: %s af gögnum verður sótt.
it: verranno scaricati %s di pacchetti.
nb: %s med pakker vil bli hentet.
nl: %s aan pakketten zal worden opgehaald.
nn: %s pakkar vert henta ned.
pl: Zostanie pobranych %s pakietów.
pt: %s dos pacotes serão transferidos.
pt_br: %s de pacotes serão baixados.
ro: %s de pachete vor fi preluați.
ru: Будет загружено %s пакетов.
sl: Prenesenih bo %s paketov.
sq: %s e paketave do të rifitohet.
sv: %s paket kommer att hämtas.
tr: Paketler için %s alınacak

source: Proceed with the installation of one package?
ast: ¿Efectuar la instalación del paquete?
cs: Pokračovat v instalaci %d balíčku?
cy: Parhau gyda gosod %d pecyn?
da: Fortsæt installationen med %d pakke?
el: Συνέχιση με την εγκατάσταση ενός πακέτου;
es: ¿Efectuar la instalación del paquete?
et: Kas paigaldada 1 pakett?
eu: Pakete baten instalaketarekin arrera jarraitu nahi duzu?
fi: Asennetaanko valittu paketti?
fr: Procéder à l'installation d'un paquetage ?
gl: Continuar ca instalación dun paquete?
he: להמשיך בהתקנת החבילה?
hu: Kívánja folytatni a fenti csomag telepítését?
id: Lanjutkan dengan installasi satu paket?
is: Halda áfram með uppsetningu á einum pakka?
it: Procedo con l'installazione di un pacchetto?
nb: Fortsette med installeringen av en pakke?
nl: Verdergaan met de installatie van 1 pakket?
nn: Vil du halda fram med installeringa av pakken?
pl: Rozpocząć instalację jednego pakietu?
pt: Prosseguir com a instalação do pacote?
pt_br: Proceder a instalação de um pacote?
ro: Continuați cu instalarea pachetului?
ru: Продолжить установку пакета?
sl: Nadaljujem z namestitvijo %d paketa?
sq: Të vazhdohet me instalimin e një paketë?
sv: Fortsätt installationen ett paket?
tr: Bir adet paket yüklensin mi?(%d)

source: Press Enter when mounted...
ast: Calca Enter cuando'l preséu te montáu...
cs: Po připojení stiskněte Enter...
cy: Pwyso Enter pan wedi ei arosod...
da: Tryk Enter når det er monteret...
el: Πατήστε Enter όταν προσαρτηθεί...
es: Presione «Intro» cuando el soporte sté montado...
et: Vajutage Enter, kui see on tehtud...
eu: Sakatu 'Sartu' muntatuta dagoenean...
fi: Paina Enter liittämisen jälkeen...
fr: Veuillez sur appuyez sur « Entrée » une fois le média monté ...
gl: Prema Enter cando estea montado...
hu: Amikor csatolta, nyomja le az Enter billentyűt...
is: Sláðu á "Enter" þegar tengt...
it: Premi Invio dopo averlo montato...
nb: Trykk på Enter når montert …
nl: Druk op Enter wanneer de koppeling tot stand is gebracht...
nn: Trykk «Enter» når han er montert ...
pl: Naciśnij Enter po zamontowaniu...
pt: Prima Enter quando estiver montado...
pt_br: Tecle Enter quando montado...
ro: Apăsați „Enter” după montare...
ru: После монтирования нажмите клавишу «Enter»...
sl: Pritisnite Enter, ko bo priklopljeno …
sv: Tryck Enter när klart...
tr: Hazır olduğunuzda Enter'a basın...

source: usage: urpmi.addmedia [options] <name> <url> where <url> is one of [file:/]/<path> ftp://<login>:<password>@<host>/<path> ftp://<host>/<path> http://<host>/<path> cdrom://<path> usage: urpmi.addmedia [options] --distrib --mirrorlist <url> usage: urpmi.addmedia [options] --mirrorlist <url> <name> <relative path> examples: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf and [options] are from
cs: použití: urpmi.addmedia [volby] &lt;jméno&gt; &lt;url&gt; kde &lt;url&gt; je jedno z následujících [file:/]/&lt;cesta&gt; ftp://&lt;login&gt;:&lt;heslo&gt;@&lt;host&gt;/&lt;cesta&gt; ftp://&lt;host&gt;/&lt;cesta&gt; http://&lt;host&gt;/&lt;cesta&gt; removable://&lt;cesta&gt; použití: urpmi.addmedia [volby] --distrib --mirrorlist &lt;url&gt; použití: urpmi.addmedia [volby] --mirrorlist &lt;url&gt; &lt;jméno&gt; &lt;relativní cesta&gt; příklady: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports a [volby] jsou z
el: χρήση: urpmi.addmedia [επιλογές] <όνομα> <url> όπου <url> είναι ένα εκ των [file:/]/<διαδρομή> ftp://<login>:<κωδικός_ασφαλείας>@<host>/<διαδρομή> ftp://<host>/<διαδρομή> http://<host>/<διαδρομή> cdrom://<διαδρομή> χρήση: urpmi.addmedia [options] --distrib --mirrorlist <url> χρήση: urpmi.addmedia [options] --mirrorlist <url> <όνομα> <σχετική διαδρομή> παραδείγματα: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf και οι [επιλογές] είναι από
es: uso: urpmi.addmedia [opciones] <nombre> <url> donde <url> es una de [file:/]/<ruta> ftp://<usuario>:<contraseña>@<host>/<ruta> ftp://<host>/<ruta> http://<host>/<ruta> cdrom://<ruta> uso: urpmi.addmedia [opciones] --distrib --mirrorlist <url> uso: urpmi.addmedia [opciones] --mirrorlist <url> <nombre> <ruta relativa> ejemplos: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf y [opciones] es uno o varios de
et: kasutamine: urpmi.addmedia [võtmed] <nimi> <url> kus <url> on esitatud kujul [file:/]/<asukoht> ftp://<kasutajanimi>:<parool>@<masin>/<asukoht> ftp://<masin>/<asukoht> http://<masin>/<asukoht> cdrom://<asukoht> kasutamine: urpmi.addmedia [võtmed] --distrib --mirrorlist <url> kasutamine: urpmi.addmedia [võtmed] --mirrorlist <url> <nimi> <suhteline asukoht> näited: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf ja [võti] on üks järgmistest
fr: utilisation: urpmi.addmedia [options] <name> <url> où <url> est choisi parmi : [file:/]/<chemin> ftp://<login>:<mot de passe>@<hôte>/<chemin> ftp://<hôte>/<chemin> http://<hôte>/<chemin> cdrom://<chemin> utilisation : urpmi.addmedia [options] --distrib --mirrorlist <url> utilisation : urpmi.addmedia [options] --mirrorlist <url> <name> <relative path> exemples: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf et [options] sont choisies parmi
it: uso: urpmi.addmedia [opzioni] <nome> <url> dove <url> può essere uno dei seguenti [file:/]/<percorso> ftp://<login>:<password>@<host>/<percorso> ftp://<host>/<percorso> http://<host>/<percorso> cdrom://<percorso> uso: urpmi.addmedia [opzioni] --distrib --mirrorlist <url> uso: urpmi.addmedia [opzioni] --mirrorlist <url> <nome> <percorso relativo> esempi: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf e le [opzioni] vengono da
nl: gebruik: urpmi.addmedia [opties] <naam> <url> waar <url> één van de volgende is: [file:/]/<pad> ftp://<gebruikersnaam>:<wachtwoord>@<host>/<pad> ftp://<host>/<pad> http://<host>/<pad> cdrom://<path> gebruik: urpmi.addmedia [options] --distrib --mirrorlist <url> gebruik: urpmi.addmedia [options] --mirrorlist <url> <naam> <relatief pad> voorbeelden: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf en [opties] kunnen zijn:
pt: uso: urpmi.addmedia [opções] <nome> <url> onde <url> é um de [file:/]/<localização> ftp://<utilizador>:<senha>@<hospedeiro>/<caminho> ftp://<hospedeiro>/<caminho> http://<hospedeiro>/<caminho> cdrom://<caminho> uso: urpmi.addmedia [opções] --distrib --mirrorlist <url> uso: urpmi.addmedia [opções] --mirrorlist <url> <nome> <caminho relativo> exemplos: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf e as [opções] são de
pt_br: uso: urpmi.addmedia [options] <name> <url> onde <url> é um dos [arquivo:/]/<caminho> ftp://<acesso>:<senha>@<host>/<caminho> ftp://<host>/<caminho> http://<host>/<caminho> cdrom://<caminho> uso: urpmi.addmedia [options] --distrib --mirrorlist <url> uso: urpmi.addmedia [options] --mirrorlist <url> <nome> <arquivo relativo> exemplos: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf e [options] são de
ro: utilizare: urpmi.addmedia [opțiuni] <nume> <url> unde <url> este una din [file:/]/<cale> ftp://<autentificare>:<parolă>@<gazdă>/<cale> ftp://<gazdă>/<cale> http://<gazdă>/<cale> cdrom://<cale> utilizare: urpmi.addmedia [opțiuni] --distrib --mirrorlist <url> utilizare: urpmi.addmedia [opțiuni] --mirrorlist <url> <nume> <cale relativă> exemple: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf și [opțiunile] sînt din
ru: Использование: urpmi.addmedia [параметры] <название> <url> где <url> один из: [file:/]/<путь> ftp://<логин>:<пароль>@<хост>/<путь> ftp://<хост>/<путь> http://<хост>/<путь> cdrom://<путь> Использование: urpmi.addmedia [параметры] --distrib --mirrorlist <url> Использование: urpmi.addmedia [параметры] --mirrorlist <url> <название> <относительный путь> Примеры: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf а [параметры] могут быть следующими
sl: uporaba: urpmi.addmedia [možnosti] <ime> <url>, kjer je <url> eno izmed [file:/]/<pot> ftp://<uporabniško_ime>:<geslo>@<gostitelj>/<pot> ftp://<gostitelj>/<pot> http://<gostitelj>/<pot> cdrom://<pot> uporaba: urpmi.addmedia [možnosti] --distrib --mirrorlist <url> uporaba: urpmi.addmedia [možnosti] --mirrorlist <url> <ime> <relativna_pot> primeri: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf [možnosti] izbirate izmed:
tr: kullanım: urpmi.addmedia [seçenekler] <isim> <url> <url> şunlardan biri olduğunda: [file:/]/<yol> ftp://<kullanıcıadı>:<parola>@<bilgisayar>/<yol> ftp://<bilgisyar>/<yol> http://<bilgisayar>/<yol> cdrom://<yol> kullanım: urpmi.addmedia [seçenekler] --distrib --mirrorlist <url> kullanım: urpmi.addmedia [seçenekler] --mirrorlist <url> <isim> <göreli yol> örnekler: urpmi.addmedia --distrib --mirrorlist '$MIRRORLIST' urpmi.addmedia --mirrorlist '$MIRRORLIST' backports media/main/backports urpmi.addmedia --distrib --zeroconf ve [seçenekler] de şunlardan biridir:

source: --wget - use wget to retrieve distant files.
ast: --wget - usa wget pa recuperar ficheros remotos.
ca: --wget - usa wget per a recuperar fitxers llunyans.
cs: --wget - použije program wget pro načtení souborů
cy: --wget - defnyddio wget i estyn ffeiliau pell.
da: --wget - brug wget til at hente eksterne filer.
el: --wget - χρήση του wget για την ανάκτηση απομακρυσμένων αρχείων.
es: --wget - usa wget para recuperar archivos remotos.
et: --wget - wget kasutamine kaugfailide tõmbamiseks.
eu: --wget - wget erabiltzen du urruneko fitxategiak eskuratzeko.
fi: --wget - käytä etätiedostojen noutamiseen ohjelmaa wget.
fr: --wget - utiliser wget pour récupérer les fichiers distants.
gl: --wget - usar wget para descargar ficheiros distantes.
hu: --wget - a Wget használata távoli fájlok letöltésére
id: --wget - menggunakan wget untuk mengambil file jauh.
is: --wget - nota wget til að sækja fjarlægar skrár.
it: --wget - usa wget per scaricare file remoti.
nb: --wget – bruk wget for hente fjerntliggende filer.
nl: --wget - wget gebruiken om bestanden op afstand te ontvangen.
nn: --wget – Bruk wget til å henta fjerntliggjande filer.
pl: --wget - używa wgeta do pobierania zdalnych plików.
pt: --wget - usa wget para transferir ficheiros distantes.
pt_br: --wget - usa wget para baixar os dados.
ro: --wget - utilizează wget pentru preluarea fișierelor distante.
ru: --wget - использовать wget для загрузки удалённых файлов
sl: --wget - uporabi wget za prenos datotek.
sq: --wget - përdore wget për rikuperimin e skedareve në distancë.
sv: --wget - använd wget för att hämta fjärrfiler.
tr: --wget - uzaktaki dosyaları almak için wget kullan.

source: --curl - use curl to retrieve distant files.
ast: --curl - usa curl pa recuperar ficheros remotos.
ca: --curl - usa curl per a recuperar fitxers llunyans.
cs: --curl - použije program curl pro načtení souborů
cy: --curl - defnyddio curl i estyn ffeiliau pell.
da: --curl - brug 'curl' til at hente retrieve eksterne filer.
el: --curl - χρήση του curl για την ανάκτηση απομακρυσμένων αρχείων.
es: --curl - usa curl para recuperar archivos remotos.
et: --curl - curl'i kasutamine kaugfailide tõmbamiseks.
eu: --curl - curl erabiltzen du urruneko fitxategiak eskuratzeko.
fi: --curl - käytä etätiedostojen noutamiseen ohjelmaa curl.
fr: --curl - utiliser curl pour récupérer les fichiers distants.
gl: --curl - usar curl para descargar ficheiros distantes.
hu: --curl - a Curl használata távoli fájlok letöltésére
id: --curl - menggunakan curl untuk mengambil file jauh.
is: --curl - nota curl til að ná í fjarlægar skrár.
it: --curl - usa curl per scaricare file remoti.
nb: --curl – bruk curl til å hente fjerntliggende filer.
nl: --curl - curl gebruiken om bestanden op afstand te ontvangen.
nn: --curl – Bruk curl til å henta fjerntliggjande filer.
pl: --curl - używa curla do pobierania zdalnych plików.
pt: --curl - usa curl para transferir ficheiros distantes.
pt_br: --curl - usa curl para baixar os dados.
ro: --curl - utilizează curl pentru preluarea fișierelor distante.
ru: --curl - использовать curl для загрузки удалённых файлов
sl: --curl - uporabi curl za prenos datotek.
sq: --curl - pëdore curl për rikuperimin e skedareve në distancë.
sv: --curl - använd curl för att hämta fjärrfiler.
tr: --curl - uzak dosyaları almak için curl kullan.
