Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: the entry to update is missing (one of %s)
ast: falta la entrada a anovar (una de %s)
ca: falta l'entrada per actualitzar (una de %s)
cs: záznam pro update chybí (jeden z %s)
cy: mae'r cofnod i ddiweddaru ar goll (un o %s)
da: mangler det element der skal opdateres (én af %s)
el: η επιλογή για αναβάθμιση λείπει (ένα εκ των %s)
es: falta la entrada a actualizar (una de %s)
et: puudub uuendatava kirje nimi (võimalikud: %s)
eu: eguneratu beharreko sarrera falta da (%s(e)tako bat
fi: Päivitettävän lähteen nimi puuttuu (jokin seuraavista: %s)
fr: l'entrée à mettre à jour est manquante (un parmi %s)
gl: falta a entrada a actualizar (unha de %s)
he: לא חסרה שום כניסה המיועדת לעדכון (אחד מ %s)
hu: a frissítendő bejegyzés hiányzik (valamelyik ezek közül: %s)
id: masukan update hilang (satu dari %s)
is: færsluna sem á að uppfæra vantar (ein af %s)
it: la voce da aggiornare non è presente (una di %s)
nb: Mangler oppføringen som skal oppdateres (en av %s)
nl: de invoer om op te waarderen ontbreekt (één van %s)
nn: Manglar oppføringa som skal oppdaterast (éin av %s)
pl: brak wpisu do aktualizacji (jeden z %s)
pt: a entrada a actualizar está em falta (um de %s)
pt_br: a entrada a ser atualizada está faltando (uma de %s)
ro: intrarea de actualizat lipsește (una din %s)
ru: отсутствует пункт для обновления (один из %s)
sl: manjka vnos za posodobitev (eden od %s)
sq: hyrja për përditësime mungon (një nga %s)
sv: objektet som ska uppdateras saknas (en av %s)
tr: Güncelleme için girdi eksik (bunlardan biri %s)

source: ignoring media %s
ast: Inorando mediu %s
ca: s'està ignorant la font %s
cs: ignoruji zdroj %s
cy: anwybyddu cyfrwng %s
da: ignorerer medie %s
el: αγνόηση του μέσου %s
es: Ignorando soporte %s
et: andmekandja %s ignoreerimine
eu: %s euskarria baztertzen
fi: Ohitetaan media "%s"
fr: média %s ignoré
gl: ignorando o soporte %s
he: מתעלם ממקור "%s"
hu: "%s" adatforrás kihagyása
id: Mengabaikan media %s
is: hunsa miðil %s
it: Ignoro il supporto %s
nb: Overser mediet %s
nl: negeren van medium "%s":
nn: Hoppar over mediet «%s».
pl: ignorowanie nośnika %s
pt: a ignorar a média %s
pt_br: ignorando mídia "%s"
ro: se ignoră %s
ru: игнорируется источник %s
sl: onemogočanje vira %s
sv: ignorerar media %s
tr: %s ortamı yoksayılıyor.

source: enabling media %s
ast: activando'l preséu %s
ca: s'està habilitant la font %s
cs: povoluji zdroj %s
cy: galluogi cyfrwng %s
da: aktiverer medie %s
el: ενεργοποίηση του μέσου %s
es: activando el soporte %s
et: andmekandja %s arvestamine
eu: %s euskarria gaitzen
fi: Otetaan media "%s" käyttöön
fr: activation du média %s
gl: habilitando o soporte %s
he: מאפשר את המקור %s
hu: "%s" adatforrás bekapcsolása
id: mengaktifkan media media %s
is: virkja miðil %s
it: rendo disponibile il supporto %s
nb: Slår på mediet %s
nl: activeren van medium "%s"
nn: Brukar mediet «%s».
pl: włączanie nośnika "%s"
pt: a activar a média %s
pt_br: habilitando mídia "%s"
ro: se activează %s
ru: включается источник %s
sl: omogočanje vira %s
sv: aktiverar media %s
tr: "%s" kurulum kaynağı etkinleştiriliyor.

source: --searchmedia - use only the given media to search requested (or updated) packages.
ast: --searchmedia - usa namái los medios daos pa guetar paquetes solicitaos (o anovaos).
ca: --searchmedia - utilitza només les fonts donades per cercar (o actualitzar) paquets.
cs: --searchmedia - použít pouze zadané zdroje pro vyhledávání požadovaných (nebo aktualizovaných) balíčků
cy: --searchmedia - defnyddio'r cyfrwng darparwyd i chwilio'r pecynnau gofynnwyd (neu diweddarwyd).
da: --searchmedia - brug kun det opgivne medie for at søge efter de ønskede (eller opdaterede) pakker.
el: --searchmedia - χρήση μόνο των μέσων που δόθηκαν, στην αναζήτηση των ζητούμενων (ή των αναβαθμιζόμενων) πακέτων.
es: --searchmedia - usar sólo soportes dados para la búsqueda de los paquetes pedidos (o actualizados).
et: --searchmedia - soovitud (või uuendatavate) pakettide otsinguks kasutatakse ainult määratud andmekandjaid.
eu: --searchmedia - soilik emandako euskarria erabiltzen du eskatutako paketeak (edo eguneratutakoak) bilatzeko.
fi: --searchmedia - käytä ainoastaan annettuja lähteitä pyydetyn (tai päivitetyn) paketin hakemiseen.
fr: --searchmedia - utiliser seulement le média spécifié pour rechercher (ou mettre à jour) les paquetages
gl: --searchmedia - usar só o soporte dado para buscar os paquetes solicitados (ou a actualizar).
he: --searchmedia - השתמש רק במקור הנתון לחיפוש החבילות המבוקשות (או עדכון שלהן).
hu: --searchmedia - csak a megadott adatforrások használata a kért (vagy frissített) csomagok kereséséhez
id: --searchmedia - hanya gunakan media yang diberikan untuk mencari paket yang dicari (atau update)
is: --searchmedia - nota aðeins uppgefin miðil til að leita að umbeðnum (eða uppfærðum) pakka.
it: --searchmedia - usa solo i supporti indicati per cercare i pacchetti richiesti (o aggiornati)
nb: --searchmedia – bare søk etter pakker i dette mediumet.
nl: --searchmedia - alleen de aangegeven media gebruiken om gewenste pakketten te zoeken.
nn: --searchmedia – Berre sjå etter pakkar i dette mediet.
pl: --searchmedia - używa tylko podanych nośników podczas wyszukiwania (lub aktualizacji) pakietów.
pt: --searchmedia - use apenas a média dada para procurar os pacotes pedidos (ou actualizados).
pt_br: --searchmedia - usa apenas a mídia fornecida para buscar pacotes (ou atualizações).
ro: --searchmedia - utilizează numai mediul indicat pentru căutarea pachetelor cerute (sau actualizate).
ru: --searchmedia - использовать только указанные источники для поиска запрошенных (или обновляемых) пакетов
sl: --searchmedia - uporabi samo podane vire za iskanje zahtevanih (ali posodobljenih) paketov.
sv: --searchmedia - använd endast givet media för att söka efter valda (eller uppdaterade) paket.
tr: --searchmedia - istenen (veya güncellenen) paketleri aramak için sdece verilen kurulum kaynağını kullan.

source: --auto-orphans - list orphans
ast: --auto-orphans - llistar los güérfanos
cs: --auto-orphans - vypíše sirotky
cy: --auto-orphans - rhestri'r amddifad
da: --auto-orphans - udskriv forældreløse
el: --auto-orphans - προβολή της λίστας με τα ορφανά
es: --auto-orphans - listar los huérfanos
et: --auto-orphans - näitab orbe
eu: --auto-orphans - umezurtzak zerrendatu
fi: --auto-orphans - listaa tarpeettomat paketit (orphans).
fr: --auto-orphans - lister les orphelins
hu: --auto-orphans - árvák listázása
is: --auto-orphans - munaðarleysingjalisti
it: --auto-orphans - elenca orfani
nb: --auto-orphans – vis foreldreløse pakker
nl: --auto-orphans - weespakketten opsommen
nn: --auto-orphans – Vis oversikt over foreldrelause pakkar.
pl: --auto-orphans - lista osieroconych pakietów
pt: --auto-orphans - lista os órfãos
pt_br: --auto-orphans - lista pacotes órfãos
ro: --auto-orphans - listează pachetele orfane
ru: --auto-orphans - показать список сирот
sl: --auto-orphans - izpis seznama osirotelih paketov
sv: --auto-orphans - lista obehövliga paket
tr: --auto-orphans - gereksiz paketleri listele

source: --not-available - list installed packages not available on any media.
ast: --not-available - llista de paquetes instalaos nun disponible en nengún preséu.
cs: --not-available - vypíše instalované balíčky nedostupné na žádném zdroji.
da: --not-available - list installerede pakker, som ikke er tilgængelige på noget medie.
el: --not-available - εμφανίζει τα εγκατεστημένα πακέτα που δεν είναι διαθέσιμα σε κάποιο μέσο.
es: --not-available - lista los paquetes no disponibles en ningún medio.
et: --not-available - näitab paigaldatud pakette, mida ei leidu enam ühelgi andmekandjal.
eu: --not-available - zerrendatu euskarrietan eskura ezin diren instalatutako paketeak.
fi: --not-available - listaa asennetut paketit, joita ei löydy miltään medialta.
fr: --not-available - liste les paquetages installés disponibles sur aucun média.
hu: --not-available - kilistázza a telepített, de a csomagadatbázisokban nem elérhető csomagokat.
it: --not-available - elenca tutti i pacchetti installati non presenti in alcuna fonte.
nb: --not-available – vis installerte pakker som ikke er tilgjengelige på noen medier.
nl: --not-available - Geef alle geïnstalleerde pakketten weer welke op geen van de media beschikbaar zijn.
nn: --not-available – Vis oversikt over installerte pakkar som ikkje finst på nokon av media.
pl: --not-available - wyświetl zainstalowane pakiety niedostępne na jakimkolwiek medium.
pt: --not-available - lista os pacotes instalados não disponíveis em qualquer média.
pt_br: --not-available - lista pacotes instalados mas não presentes nas midias.
ro: --not-available - listează pachetele instalate ce nu se găsesc pe nici un mediu.
ru: --not-available - выводит список установленных пакетов, не доступных ни в одном источнике.
sl: --not-available - izpis seznama paketov, ki niso na voljo iz nobenega vira.
sv: --not-available - lista installerade paket som inte finns tillgängligt på något media.
tr: --not-available - hiçbir veri kaynağında bulunmayan kurulu paketleri listele.

source: --fuzzy - impose fuzzy search (same as -y).
ast: --fuzzy - forciar gueta difusa (lo mesmu que -y).
ca: --fuzzy - utilitza cerca difusa (igual que -y).
cs: --fuzzy - vnutit fuzzy vyhledávání. (stejné jako -y)
cy: --fuzzy - mynnu chwiliad fuzzy (fel -y).
da: --fuzzy - gennemfør søgning efter fuzzy (samme som -y).
el: --fuzzy - επιβάλει την αναζήτηση κατά προσέγγιση (ίδιο με -y).
es: --fuzzy - forzar búsqueda difusa (lo mismo que -y).
et: --fuzzy - lubab ebatäpset otsingut (sama, mis -y).
eu: --fuzzy - hurbilketazko bilaketa inposatzen du (-y bezala).
fi: --fuzzy - käytä epätarkkaa hakua (sama kuin valitsin -y).
fr: --fuzzy - imposer la recherche floue (identique à -y).
gl: --fuzzy - impoñer a busca aproximada (o mesmo ca -y).
he: --fuzzy - מפעיל חיפוש מקורב (זהה ל -y).
hu: --fuzzy - fuzzy keresés használata (-y opcióval azonos)
id: --fuzzy - lakukan pencarian fuzzy (sama dengan -y).
is: --fuzzy - framkvæma loðna leit (sama og -y).
it: --fuzzy - impone una ricerca fuzzy (uguale a -y).
nb: --fuzzy – bruk uklart søk (samme som -y).
nl: --fuzzy - onprecies zoeken gebruiken (zelfde als -y).
nn: --fuzzy – Bruk òg ikkje-ordrett søk (same som «-y»).
pl: --fuzzy - wymusza wyszukiwanie niespójności (tak jak -y).
pt: --fuzzy - impõe uma procura aproximada (o mesmo que -y).
pt_br: --fuzzy - impõe uma busca aproximada (igual a -y).
ro: --fuzzy - impune căutarea aproximativă (identic cu -y).
ru: --fuzzy - поиск на основе нечёткой логики (эквивалент -y)
sl: --fuzzy - uporabi ohlapno iskanje (isto kot -y).
sq: --fuzzy - shfrytëzoje hulumtimin e paqartë (njëjtë si -y).
sv: --fuzzy - kräv luddig sökning (samma som -y).
tr: --fuzzy - hatalı aramaya zorla (-y ile aynı)

source: --list - list available packages.
ast: --list - llista los paquetes disponibles.
ca: --list - llista els paquets disponibles.
cs: --list - vypíše balíčky, které jsou k dispozici
cy: --list - rhestri'r holl gyfrwng ar gael.
da: --list - skriv tilgængelige pakker.
el: --list - εμφανίζει τα διαθέσιμα πακέτα.
es: --list - lista los paquetes disponibles.
et: --list - näitab saadaolevaid pakette.
eu: --list - pakete erabilgarrien zerrenda.
fi: --list - listaa käytettävissä olevat paketit.
fr: --list - montrer tous les paquetages disponibles.
gl: --list - listar os paquetes dispoñibles.
hu: --list - az elérhető csomagok listázása
id: --list - daftar paket tersedia.
is: --list - lista tiltæka pakka.
it: --list - elenca i pacchetti disponibili.
nb: --list – vis oversikt over tilgjengelige pakker.
nl: --list - geeft alle beschikbare pakketten weer.
nn: --list – Vis oversikt over tilgjengelege pakkar.
pl: --list - wypisuje dostępne pakiety.
pt: --list - lista os pacotes disponíveis.
pt_br: --list - lista os pacotes disponíveis.
ro: --list - listează pachetele disponibile.
ru: --list - показать список доступных пакетов
sl: --list - izpis seznama paketov, ki so na voljo.
sq: --list - shpalosi pakotë lira.
sv: --list - visa tillgängliga paket.
tr: --list - erişilebilir paketleri göster

source: --list-media - list available media.
ast: --list-media - llista los preseos disponibles.
ca: --list-media - llista les fonts disponibles.
cs: --list-media - vypíše seznam dostupných zdrojů
cy: --list-media - rhestri'r holl gyfrwng ar gael.
da: --list-media - list tilgængelige medier.
el: --list-media - εμφανίζει τα διαθέσιμα μέσα ενημέρωσης.
es: --list-media - lista los soportes disponibles.
et: --list-media - näitab saadaolevaid andmekandjaid.
eu: --list-media - euskarri erabilgarrien zerrenda.
fi: --list-media - listaa käytettävissä olevat mediat.
fr: --list-media - montrer tous les médias disponibles.
gl: --list-media - lista os soportes dispoñibles.
hu: --list-media - az elérhető adatforrások listázása
id: --list-media - daftar media tersedia.
is: --list-media - lista tiltæka miðla.
it: --list-media - elenca i supporti disponibili.
nb: --list-media – vis oversikt over tilgjengelige media.
nl: --list-media - beschikbare media opsommen.
nn: --list-media – Vis oversikt over tilgjengelege medium.
pl: --list-media - wypisuje dostępne nośniki.
pt: --list-media - lista as médias disponíveis.
pt_br: --list-media - lista as mídias disponíveis.
ro: --list-media - listează mediile disponibile.
ru: --list-media - показать список доступных источников
sl: --list-media - izpis seznama virov, ki so na voljo.
sq: --list-media - shpalosi burimet e lira.
sv: --list-media - visa tillgänglig media.
tr: --list-media - erişilebilir kurulum kaynaklarını listele

source: --list-url - list available media and their url.
ast: --list-url - llista los preseos disponibles xunto coles URL.
ca: --list-url - llista les fonts disponibles i la seva url.
cs: --list-url - vypíše seznam dostupných zdrojů a jejich url
cy: --list-url - rhestri'r holl gyfrwng ar gael.
da: --list-url - list tilgængelige medier og deres url.
el: --list-url - εμφανίζει τα διαθέσιμα μέσα ενημέρωσης και τα URL τους.
es: --list-url - lista los soportes disponibles junto con sus URL.
et: --list-url - näitab saadaolevaid andmekandjaid URL-idega.
eu: --list-url - erabilgarri dauden euskarriak eta haien url-a zerrendatzen ditu.
fi: --list-url - listaa käytettävissä olevat mediat ja niiden sijainnit.
fr: --list-url - montrer tous les médias disponibles et leurs URL.
gl: --list-url - lista os soportes dispoñibles e o seu url.
he: --list-url - הצגת מאגרי עדכון זמינים ואת כתובתם.
hu: --list-url - elérhető adatforrások és URL-jeik listázása
id: --list-url - daftar media tersedia dan urlnya.
is: --list-url - lista tiltæka miðla og slóðir að þeim.
it: --list-url - elenca i supporti disponibili e la loro url.
nb: --list-url – vis oversikt over tilgjengelige media, med adresser.
nl: --list-url - beschikbare media en hun url opsommen.
nn: --list-url – Vis oversikt over tilgjengelge medium, med adresser.
pl: --list-URL - wypisuje dostępne nośniki i ich URL-e.
pt: --list-url - lista as médias disponíveis e as suas url.
pt_br: --list-url - lista mídias disponíveis e suas url's.
ro: --list-url - listează mediile disponibile și adresele lor URL.
ru: --list-url - показать список доступных источников и их url
sl: --list-url - izpis seznama virov, ki so na voljo, in njihove url-je.
sv: --list-url - lista tillgänglig media och dess sökväg.
tr: --list-url - erişilebilir kurulum kaynaklarını ve bağlantılarını gösterir.

source: --list-nodes - list available nodes when using --parallel.
ast: --list-nodes - llista los nodos disponibles cuando s'usa --parallel.
ca: --list-nodes - llista els nodes disponibles quan s'utilitza --parallel.
cs: --list-nodes - vypíše seznam uzlů k dispozici při použití volby --parallel
cy: --list-nodes - rhestri'r nodau sydd ar gael wrth ddefnyddio --parallel.
da: --list-nodes - list tilgængelige knuder ved brug af --parallel.
el: --list-nodes - εμφανίζει τη λίστα με τους διαθέσιμους κόμβους χρησιμοποιώντας --parallel.
es: --list-nodes - lista los nodos disponibles cuando se usa --parallel.
et: --list-nodes - näitab saadaolevaid sõlmi, kui kasutatakse võtit --parallel.
eu: --list-nodes - --parallel erabiltzean erabilgarri dauden nodoen zerrenda .
fi: --list-nodes - listaa käytettävissä olevat solmukohdat käytettäessä valitsinta --parallel.
fr: --list-nodes - montrer tous les noeuds disponibles en utilisant --parallel.
gl: --list-nodes - lista os nodos dispoñibles cando se usa --parallel.
he: --list-nodes - הצג צמתים זמינים בשימוש עם --parallel.
hu: --list-nodes - az elérhető gépek listázása --parallel használata esetén
id: --list-nodes - daftar node tersedia saat menggunakan --parallel.
is: --list-nodes - lista tiltæka hnútpunkta þegar notað er --parallel.
it: --list-nodes - elenca i nodi disponibili quando si utilizza --parallel.
nb: --list-nodes – vis tilgjengelige noder ved bruk av --parallel.
nl: --list-nodes - beschikbare knooppunten opsommen bij --parallel.
nn: --list-nodes – Vis tilgjengelege nodar ved bruk av «--parallel».
pl: --list-nodes - wypisuje dostępne węzły gdy używana jest opcja --parallel.
pt: --list-nodes - lista os nós disponíveis quando a usar --parallel.
pt_br: --list-nodes - lista os nós disponíveis quando --parallel é usada.
ro: --list-nodes - listează nodurile disponibile cînd se utilizează --parallel.
ru: --list-nodes - показать список доступных узлов при использовании --parallel
sl: --list-nodes -izpis seznama vozlišč, ki so na voljo pri uporabi --parallel.
sq: --list-nodes - shpalosi nyjet kur ato përdoren në --parallel.
sv: --list-nodes - visa tillgängliga noder vid användning av --parallel.
tr: --list-nodes - --parallel kullanırken erişilebilir düğümleri listele.

source: --list-aliases - list available parallel aliases.
ast: --list-aliases - llista de nomatos paralela disponible.
ca: --list-aliases - llista els àlias paral·lels disponibles.
cs: --list-aliases - seznam dostupných paralelních přezdívek
cy: --list-aliases - rhestr ar gael ar gyfer enwau paralel.
da: --list-aliases - list tilgængelige parallelle aliaser.
el: --list-aliases - λίστα των διαθέσιμων παράλληλων ψευδωνύμων.
es: --list-aliases - lista los alias paralelo disponibles.
et: --list-aliases - näitab saadaolevaid aliaseid.
eu: --list-aliases - alias paralelo erabilgarrien zerrenda.
fi: --list-aliases - listaa käytettävissä olevat rinnakkais-aliakset
fr: --list-aliases - lister les alias parallèles disponibles.
hu: --list-aliases - az elérhető párhuzamos aliasok listázása
id: --list-aliases - daftar alias paralel.
is: --list-aliases - lista tiltæk samhliða samheiti.
it: --list-aliases - elenca gli alias paralleli disponibili.
nb: --list-aliases – vis oversikt over tilgjengelige parallellalias.
nl: --list-aliases - beschikbare parallelle aliasen opsommen.
nn: --list-aliases – Vis oversikt over tilgjengelege parallellalias.
pl: --list-aliases - wypisuje dostępne równoległe aliasy.
pt: --list-aliases - lista as aliases paralelas disponíveis.
pt_br: --list-aliases - lista os apelidos paralelos disponíveis
ro: --list-aliases - listează aliasurile paralele disponibile.
ru: --list-aliases - показать список доступных алиасов parallel
sl: --list-aliases - izpis seznama vzporednih vzdevkov, ki so na voljo.
sq: --list-aliass - shpalosi burimet e lira paralele me pseudonime të njëjta.
sv: --list-aliases - lista tillgängliga parallellalias.
tr: --list-aliases - mevcut parelel alias'lari listele.

source: --dump-config - dump the config in form of urpmi.addmedia argument.
ast: --dump-config - volcar la configuración en forma d'argumentu pa urpmi.addmedia.
cs: --dump-config - vypíše nastavení ve formě parametru pro urpmi.addmedia
cy: --dump-config - dympio'r ffurfweddiad mewn ffurf ymresymiad urpmi.addmedia.
da: --dump-config - udskriv konfigurationen i form af urpmi.addmedia argumenter.
el: --dump-config - εμφανίζει την διαμόρφωση με τη μορφή ενός ορίσματος urpmi.addmedia.
es: --dump-config - volcar la configuración en forma de argumento para urpmi.addmedia.
et: --dump-config - seadistusest tehakse tõmmis kujul urpmi.addmedia võti.
eu: --dump-config - config urpmi.addmedia argumentu gisa iraultzen du.
fi: --dump-config - tulosta asetukset urpmi.addmedia-parametrien tapaan muotoiltuna.
fr: --dump-config - afficher la configuration sous forme d'un argument pour urpmi.addmedia.
gl: --dump-config - devolve a configuración en forma de argumento de urpmi.addmedia.
he: --dump-config - ייצא את ההגדרות במבנה של משתני urpmi.addmedia.
hu: --dump-config - beállítások kiírása urpmi.addmedia-argumentumok formájában
id: --dump-config - dump konfigurasi dalam bentuk argumen urpmi.addmedia.
is: --dump-config - sýna uppsetninguna sem urpmi.addmedia viðfang.
it: --dump-config - mostra la configurazione nella forma usata da urpmi.addmedia
nb: --dump-config – dump oppsettet i samme form som urpmi.addmedia-argument.
nl: --dump-config - dump de configuratie in de vorm van een urpmi.addmedia formaat.
nn: --dump-config – Dump oppsettet på same form som «urpmi.addmedia»-argument.
pl: --dump-config - zrzuca konfigurację w postaci urpmi.addmedia argument.
pt: --dump-config - deixa a configuração na forma de argumento urpmi.addmedia.
pt_br: --dump-config - mostrar a configuração como argumentos para o urpmi.addmedia.
ro: --dump-config - afișează configurarea in formatul argumentului urpmi.addmedia.
ru: --dump-config - показать конфигурацию в виде аргумента для urpmi.addmedia
sl: --dump-config - izpis nastavitev v formatu za urpmi.addmedia.
sv: --dump-config - dumpa konfigurationen i form av urpmi.addmedia argument.
tr: --dump-config - yapılandırmayı urpmi.addmedia argümanı biçiminde boşalt.

source: --src - next package is a source package (same as -s).
ast: --src - prósimu paquete ye paquete fonte (igual que -s).
ca: --src - el paquet següent és un paquet font (igual que -s).
cs: --src - další balíček je zdrojový (stejné jako -s)
cy: --src - pecyn nesaf yn becyn ffynhonnell (yr un peth â -s).
da: --src - næste pakke er en kildepakke (samme som -s).
el: --src - το επόμενο πακέτο είναι ένα πακέτο πηγαίου κώδικα (ίδιο με το -s).
es: --src - sig. paquete es paquete fuente (igual que -s).
et: --src - järgmine pakett on lähtetekstipakett (sama, mis -s).
eu: --src - hurrengo paketea iturburu-pakete bat da (-s bezala).
fi: --src - seuraava paketti on lähdekoodipaketti (sama kuin valitsin -s).
fr: --src - le prochain paquetage est un paquetage de sources (identique à -s).
gl: --src - o seguinte paquete é un paquete de fontes (igual ca -s).
he: --src - החבילה הבאה היא חבילת מקור (אותו הדבר כמו -s).
hu: --src - a következő csomag egy forráscsomag (-s opcióval azonos)
id: --src - paket berikut adalah paket sumber (sama dg -s).
is: --src - næsti pakki er frumkóða-pakki (sama og -s).
it: --src - il prossimo pacchetto è un pacchetto sorgente (uguale a -s).
nb: --src – neste pakke er en kildepakke (samme som -s).
nl: --src - volgende pakket is een bronpakket (zelfde als -s).
nn: --src – Neste pakke er ein kjeldepakke (same som «-s»).
pl: --src - następny pakiet jest pakietem źródłowym (tak jak -s).
pt: --src - o próximo pacote é um pacote fonte (o mesmo que -s).
pt_br: --src - o próximo pacote é um pacote fonte (o mesmo que -s).
ro: --src - pachetul următor este un pachet sursă (identic cu -s).
ru: --src - следующий пакет содержит исходные коды (эквивалент -s)
sl: --src - naslednji paket je paket z izvorno kodo (isto kot -s).
sq: --src - pakoja me radhë është pako e burimit (njëjtë si -s).
sv: --src - nästa paket är ett källpaket (samma som -s).
tr: --src - ardından gelen paket bir kaynak paketi ( -s ile aynı).
