Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --verbose - verbose mode.
ast: --verbose - mou informativu.
ca: -verbose - mode detallat.
cs: --verbose - užvaněný režim
cy: --verbose - modd llafar.
da: -v - udførlig tilstand.
el: --verbose - εμφάνιση των λεπτομερειών.
es: --verbose - modo informativo.
et: --verbose - selgitav režiim.
eu: --verbose - modu berritsua.
fi: --verbose - yksityiskohtainen tyyli.
fr: --verbose - mode verbeux.
gl: --verbose - modo detallado.
hu: --verbose - részletes információ
id: --verbose - mode verbose.
is: --verbose - ítarlegri hamur.
it: --verbose - modalità prolissa.
nb: --verbose – utvidede tilbakemeldinger.
nl: --verbose - 'uitgebreid verslag'-modus.
nn: --verbose – Utvida meldingar.
pl: --verbose - tryb komunikatywny.
pt: -verbose - modo detalhado.
pt_br: --verbose - modo detalhado.
ro: --verbose - mod detaliat.
ru: --verbose - подробный режим
sl: --verbose - zgovorni način.
sq: --verbose - model oratori.
sv: --verbose - utförligt läge.
tr: --verbose - kalabalık kipi.

source: -i - ignore case distinctions in patterns.
ast: -i - ignora distinción ente mayús. y minús. nos patrones.
ca: -i - ignora les distincions de majúscules en els patrons.
cs: -i - ignorují se velká a malá písmena ve všech vzorech
cy: -i - anwybyddu gwahaniaeth maint llythrennau ym mhob patrwm.
da: -i - ignorér forskel på store og små bogstaver i alle mønstre.
el: -i - χωρίς διάκριση πεζών/κεφαλαίων.
es: -i - ignora distinción entre mayús. y minús. en los patrones.
et: -i - tõstutundetu igas olukorras.
eu: -i - ereduetan ez bereiztu hizki larri eta xeheak.
fi: -i - älä erottele isoja ja pieniä kirjaimia hauissa.
fr: -i - ignorer la distinction majuscules/minuscules.
gl: -i - ignorar a distinción de maiúsculas-minúsculas nos patróns.
hu: -i - a minták feldolgozása nem nagybetűérzékeny
id: -i - abaikan perbedaan huruf besar/kecil dalam setiap pola.
is: -i - hunsa stafastærð í samanburði allra mynstra.
it: -i - ignora la distinzione tra maiuscole/minuscole nella ricerca.
nb: -i – ikke skill mellom store og små bokstaver i mønstre.
nl: -i - onderscheid hoofd-/kleine letters in elk patroon negeren.
nn: -i – Ikkje skil mellom store og små bokstavar.
pl: -i - ignoruje wielkość liter we wszystkich wzorcach.
pt: -i - ignora as diferenças de capitalização em todos os padrões.
pt_br: -i - ignora a distinção de maiúscula/minúscula em tudo.
ro: -i - ignoră sensibilitatea la majuscule în modele.
ru: -i - не учитывать регистр в шаблонах
sl: -i - ignoriraj razlike malih/velikih črk v vsakem vzorcu.
sq: -i - injoroje rastin e ndryshëm në gjdo model.
sv: -i - versaler och gemener jämförs lika i varje mönster.
tr: -i - her örnekte büyük-küçük harf farklılığını göz ardı et.

source: -I - honor case distinctions in patterns (default).
ast: -I - fai la distinción ente mayús. y minús. nos patrones.
cs: -I - ve vzorech se bere ohled na malá a velká písmena (výchozí)
cy: -i - cadw gwahaniaeth maint llythrennau ym mhob patrwm (rhagosodiad).
da: -I - skeln mellem store og små bogstaver i søgestrenge (standard).
el: -I - διάκριση πεζών-κεφαλαίων (προεπιλογή).
es: -I - hace la distinción entre mayús. y minús. en los patrones (por omisión).
et: -I - tõstu arvestamine mustrites (vaikimisi).
eu: -I - ereduetan hizki larri eta xeheak bereiztu (lehenetsia).
fi: -I - erottele isot ja pienet kirjaimet hauissa (oletus).
fr: -I - respecter la distinction majuscules/minuscules.
hu: -I - a minták feldolgozása nagybetűérzékeny (alapértelmezés)
id: -I - menerima perbedaan huruf besar/kecil pada pola (default).
is: -I - virða stafastærð í samanburði allra mynstra (sjálfgefið).
it: -I - distingui maiuscole/minuscole nella ricerca (predefinito).
nb: -I – skill mellom store og små bokstaver i mønstre (standard).
nl: -I - onderscheid hoofd-/kleine letters in patronen honoreren (standaard).
nn: -l – Skil store og små bokstavar i mønster (standard).
pl: -i - bierze pod uwagę wielkość liter we wszystkich wzorcach (domyślnie).
pt: -I - honra as diferenças de capitalização em todos os padrões (predefinição).
pt_br: -i - Considera diferença entre maiúsculas/minúsculas.
ro: -I - respectă sensibilitatea la majuscule în modele (implicit).
ru: -I - учитывать регистр в шаблонах (по умолчанию)
sl: -I - upoštevaj razlike malih/velikih črk v vsakem vzorcu.
sv: -I - versaler och gemener jämförs olika i varje mönster.
tr: -I - örneklerde büyük/küçük harf ayrımını gözet.(varsayılan)

source: -F<str> - change field separator (defaults to ':').
ast: -F<cad> - camudar el separtador de campos (':' ye'l predet.)
cs: -F<str> - změní oddělovač pole (běžně na ':')
cy: -F<str> - newid ymwahanydd maes (arferol i ':').
da: -F<str> - ændr feltseparator (standard er ':').
el: -F<str> - αντικατάσταση του διαχωριστικού με <str> (από προεπιλογή «:»).
es: -F<cad> - cambiar el separador de campos (':' es el predet.)
et: -F<str> - väljade eraldaja muutmine (vaikimisi ':').
eu: -F<str> - aldatu eremu bakantzailea (lehenetsia ':').
fi: -F<erotin> - vaihda kenttäerotinta (oletus ":").
fr: -F<str> - remplacer le séparateur par <str> (par défaut ':').
gl: -F<str> - cambiar o separador de campos (predeterminado ':').
hu: -F<szöveg> - mezőelválasztó módosítása (alapértelmezés: ":")
id: -F<str> - ganti field pemisah (default menjadi ':').
is: -F<str> - breyta svæðis-skila-staf (sjálfgefið ':').
it: -F<str> - cambia il separatore di campo (predefinito a ':').
nb: -F<str> – bytt feltseparator (standard er «:»).
nl: -F<str> - veldscheidingsteken veranderen (standaard ':').
nn: -F<str> – Byt feltskiljar (standard er «:»).
pl: -F<str> - zmień separator pola (domyślny to ':').
pt: -F<str> - muda o campo separador (predefinido para ':').
pt_br: -F<str> - altera o separador de campo (padrão é ':').
ro: -F<str> - schimbă cîmpul separator (implicit „:”).
ru: -F<str> - изменить разделитель полей (по умолчанию - ':')
sl: -F<niz> - spremeni ločitelj polj (privzeto je ':').
sv: -F<str> - ändra fältavgränsare (standard ':').
tr: -F<str> - alan ayracını değiştir. (':' işaretinde varsayılan).

source: Pattern expressions:
ast: Espresiones de patrón:
cs: Vzorek výrazů:
cy: Mynegiadau patrymau:
da: Søgestrengsudtryk:
el: Πρότυπα υποκατάστασης:
es: Expresiones de patrón:
et: Mustriavaldised:
eu: Adierazpen patroiak:
fi: Hakulausekkeet:
fr: Motifs de substitution :
gl: Expresións patrón:
hu: Mintakifejezések:
id: Pola ekspresi:
is: Mynstursegðir:
it: Chiavi di ricerca:
nb: Søkestrenguttrykk:
nl: Patroonuitdrukkingen:
nn: Mønsteruttrykk:
pl: Wyrażenia wzorcowe:
pt: Expressões padrão:
pt_br: Expressões Regulares:
ro: Expresii regulate:
ru: Выражения для шаблонов:
sl: Regularni izrazi:
sv: Mönster-uttryck:
tr: Kalıp ifadeler:

source: text - any text is parsed as a regexp, unless -l is used.
ast: testu - cualesquier testu tómase como espresión regular, a menos que uses -l.
cs: text - každ text je brán jako regulerní výraz, pokud není zadáno -l
cy: text - unrhyw destun wedi ei ddidoli fel regexp, onibai fod -l yn cael ei ddefnyddio.
da: text - al tekst er forstået som regulære udtryk, med mindre -l er brugt.
el: text - οποιοδήποτε κείμενο επεξεργάζεται ως κανονική έκφραση (regexp), εκτός αν έχει επιλεγεί το -l .
es: texto - cualquier texto se toma como expresión regular, a menos que se use -l.
et: text - suvalist teksti parsitakse regulaaravaldisena, kui ei kasutata võtit -l.
eu: text - edozein testu regexp bezala aztertzen da, -l erabiltzen denean ezik..
fi: teksti - kaikki teksti jäsennetään säännöllisenä lausekkeena, ellei käytetä valitsinta -l.
fr: texte - texte traité en expression régulière, sauf si option -l.
gl: text - todo o texto é analizado coma expresión regular, a non ser que se use -l.
hu: szöveg - a szövegek reguláris kifejezésként vannak kezelve, ezt -l opcióval lehet felülbírálni
id: teks - sembarang teks diparsing sebagai regexp, kecuali -l digunakan.
is: text - allur texti er meðhöndlaður sem regluleg segð, nema -l sé notað.
it: -text - il testo è usato come regexp, se non viene specificato -l.
nb: text - hvilken som helst tekst blir lest som regulære uttrykk, med mindre -l er brukt.
nl: text - alle tekst geïnterpreteerd als regexp, tenzij -l wordt gebruikt.
nn: tekst – All tekst vert tolka som regulære uttrykk, med mindre «-l» vert brukt.
pl: text - jakikolwiek tekst jest przetwarzany jako regexp, do chwili wykorzystania -l .
pt: text - qualquer texto é analisado como uma expressão regular, a não ser que -l seja usado .
pt_br: text - qualquer texto é tratado como uma expressão regulara menos que -l seja usado.
ro: text - orice text este analizat ca regexp, cu excepția utilizării lui -l.
ru: text - любой текст считается регулярным выражением, если только не используется -l
sl: besedilo - brez -l se vsako besedilo razčleni kot regularni izraz.
sv: text - vilken text som helst används för att söka, om inte -l är använt.
tr: text - "-l" kullanılmadığı sürece regexp olarak sözdizimsel analizi yapılan herhangi bir metin.

source: -e - include perl code directly as perl -e.
ast: -e - incluí códigu Perl direutamente como perl -e.
cs: -e - vloží kód Perl přímo jako perl -e
cy: -e - cynnwys perl cod yn union fel perl -e.
da: -e - inkludér perl-kode direkte som perl -e.
el: -e - συμπερίληψη κώδικα perl απευθείας (perl -e).
es: -e - incluye código Perl directamente como perl -e.
et: -e - kaasab otseselt perli koodi kui perl -e.
eu: -e - perl kodea sartzen du zuzenean perl -e gisa.
fi: -e - sisällytä perl-koodia suoraan komennolle "perl -e".
fr: -e - inclure du code perl directement.
gl: -e - inclúe o código perl directamente coma perl -e.
hu: -e - Perl kód közvetlen betevése (perl -e)
id: -e - sertakan kode perl secara langsung sebagai perl -e.
is: -e - innifela perl kóða beint sem perl -e.
it: -e - include il codice perl direttamente come perl -e.
nb: -e – ta med Perl-kode direkte, som perl -e.
nl: -e - voeg perl code direct als perl -e toe.
nn: -e – Ta med perl-kode direkte, som «perl -e».
pl: -e - dołącza kod perla bezpośrednio jako perl -e.
pt: -e - inclui o código perl directamente como perl -e.
pt_br: -e - inclui o código perl diretamente como em 'perl -e'.
ro: -e - include codul perl direct ca perl -e.
ru: -e - включить код perl непосредственно как perl -e
sl: -e - vključi kodo perl neposredno kot perl -e.
sq: -e - përfshije kodin perl direkt sikur perl -e.
sv: -e - inkludera perl-kod direkt som perl -e.
tr: -e - perl kocunu doğrudan perl olarak ekle -e.

source: -a - binary AND operator.
ast: -a - operador binariu Y.
ca: -a - operador binari AND.
cs: -a - binární operátor AND
cy: -a - gweithredwr deuaidd AND.
da: -a - binær OG-operator.
el: -a - δυαδικός τελεστής ΚΑΙ.
es: -a - operador binario Y.
et: -a - binaaroperaator AND.
eu: -a - ETA eragile bitarra.
fi: -a - binäärinen JA-operaattori.
fr: -a - opérateur binaire ET.
gl: -a - operador binario AND.
he: -a - אופרטור AND בינארי.
hu: -a - bináris ÉS művelet.
id: -a - operator AND biner.
is: -a - tvíundarvirkinn OG.
it: -a - operatore binario AND.
nb: -a – binær OG-operatør.
nl: -a - binaire AND operator.
nn: -a – Binær OG-operator.
pl: -a - operator binarny AND.
pt: -a - operador binário AND.
pt_br: -a - operador binário 'E'.
ro: -a - operatorul binar ȘI.
ru: -a - двоичный оператор AND
sl: -a - binarni operator AND.
sq: -a - operues AND binar.
sv: -a - binär AND operator.
tr: -a - ikili AND operatörü.

source: -o - binary OR operator.
ast: -o - operador binariu O.
ca: -o - operador binari OR.
cs: -o - binární operátor OR
cy: -o - gweithredwr deuaidd OR.
da: -o - binær ELLER-operator.
el: -ο - δυαδικός τελεστής Ή.
es: -o - operador O binario.
et: -o - binaaroperaator OR.
eu: -o - EDO eragile bitarra.
fi: -o - binäärinen TAI-operaattori.
fr: -o - opérateur binaire OU.
gl: -o - operador binario OR.
he: -o - אופרטור OR בינארי.
hu: -o - bináris VAGY művelet.
id: -o - operator OR biner.
is: -o - tvíundarvirkinn EÐA.
it: -o - operatore binario OR.
nb: -o – binær ELLER-operatør.
nl: -o - binaire OR operator.
nn: -o – Binær ELLER-operator.
pl: -a - operator binarny AND.
pt: -o - operador binário OR.
pt_br: -o - operador binário 'OU'.
ro: -o - operatorul binar SAU.
ru: -o - бинарный оператор OR
sl: -o - binarni operator OR.
sq: -o - operues OR binar.
sv: -o - binär OR operator.
tr: -o - ikili OR operatör.

source: ! - unary NOT.
ast: ! - NOn unariu.
ca: ! - NOT unari.
cs: ! - unární operátor NOT
cy: ! - unaidd NOT.
da: ! - negation.
el: ! - ΟΧΙ μοναδιαίο.
es: ! - Negación unaria.
et: ! - unaaroperaator NOT.
eu: ! - EZ unarioa.
fi: ! - yksioperandinen EI-operaattori.
fr: ! - NON unaire.
gl: ! - NOT unario.
he: ! - שלילה של מרכיב.
hu: ! - unáris NEM művelet.
is: ! - formerki EKKI.
it: ! - NOT unario.
nb: ! – Unær IKKE-operator.
nn: ! – Unær IKKJE-operator.
pl: ! - modyfikator NOT.
pt: ! - operador unário NOT.
pt_br: ! - operador unário 'NÃO'.
ro: ! - negarea unară NU.
ru: ! - унарный NOT
sl: ! - operator NOT.
sq: -! - njëjsi NOT.
sv: ! - unär NOT.
tr: ! - tekli NOT.

source: ( ) - left and right parentheses.
ast: ( ) - paréntesis esquierda y drecha pa grupos d'espresiones.
ca: ( ) - parentesis esquerre i dret per expressions de grup.
cs: ( ) - levá a pravá závorka
cy: ( ) - parenthesis de a chwith.
da: ( ) - venstre- og højreparenteser.
el: ( ) - αριστερή και δεξιά παρένθεση.
es: ( ) - paréntesis izq. y der. para grupos de expresiones.
et: ( ) - parem- ja vasakpoolne sulg.
eu: ( ) - ezker eta eskuin parentesiak.
fi: ( ) - sulkumerkit lausekeryhmän sulkemiseen.
fr: ( ) - parenthèses droite et gauche.
gl: ( ) - parénteses esquerdo e dereito.
hu: ( ) - bal illetve jobb oldali zárójel
id: ( ) - tanda kurung kiri dan kanan.
is: ( ) - vinstri og hægri svigar.
it: ( ) - parentesi destra e sinistra.
nb: ( ) – venstre- og høyreparentes.
nl: ( ) - linker en rechter haakjes.
nn: ( ) – Venstre- og høgreparentes.
pl: ( ) - lewy i prawy nawias.
pt: ( ) - parêntesis esquerdo e direito.
pt_br: ( ) - parênteses direito e esquerdo.
ro: ( ) - parantezele stînga și dreapta.
ru: ( ) - левая и правая скобки
sl: ( ) - levi in desni oklepaj.
sv: ( ) - vänster och höger parentes.
tr: ( ) - sol ve sağ parantezler.

source: List of tags:
ast: Llista d'etiquetes:
ca: Llista de etiquetes:
cs: Seznam značek (tagů):
cy: Rhestr tagiau:
da: Liste over mærker:
el: Λίστα πεδίων αναζήτησης:
es: Lista de etiquetas:
et: Siltide nimekiri:
eu: Etiketa zerrendak:
fi: Haettavat tiedot:
fr: Liste des champs de recherche :
gl: Lista de etiquetas:
he: רשימת תגים:
hu: Címkék listája:
id: Daftar tag:
is: Listi af tögum:
it: Elenco delle etichette
nb: Oversikt over tagger:
nl: Lijst van tags:
nn: Oversikt over merkelappar:
pl: Lista znaczników:
pt: Lista de marcas:
pt_br: Lista de tags:
ro: Lista de etichete:
ru: Список тегов:
sl: Seznam oznak:
sv: Lista på taggar:
tr: Etiketlerin listesi:

source: --qf - specify a printf-like output format
ast: --qf - especificar un formatu de salida estilu printf
cs: --qf - udává výstupní formát podle příkazu printf
cy: --qf - pennu allbwn fformat printf-aidd
da: --qf - angiv et printf-lignende uddata-format
el: --qf - καθορίζει μια μορφή εμφάνισης τύπου printf
es: --qf - especificar un formato de salida estilo printf
et: --qf - printf laadis vormindatud väljund
eu: --qf - printf-antzeko irteera formatua zehazten du
fi: --qf - määrittele printf-tyylinen tulostusmuoto.
fr: --qf - spécifie un format d'affichage de type printf
gl: --qf - especifica un formato de saída coma o de printf
hu: --qf - printf-szerű kiírási formátum megadása
id: --qf - tentukan sebuah format output yang menyerupai printf
is: --qf - tilgreina printf-líkt úttakssnið
it: --qf - specifica un formato di output simile a printf
nb: --qf – angir et printf-lignende utdataformat
nl: --qf - een printf-achtig uitvoerformaat gebruiken.
nn: --qf – Bruk eit printf-liknande utformat.
pl: --qf - określa format wyjścia w stylu funkcji printf
pt: --qf - indica um formato de saída tipo o printf
pt_br: --qf - especifica um formato de impressão para a saída
ro: --qf - se specifică un format de ieșire tip printf
ru: --qf - выходной формат в стиле printf
sl: --qf - uporabi printf format izpisa
sv: --qf - använd printf-likt visningsformat
tr: --qf - printf benzeri bir çıktı biçimi belirtir

source: example: '%%name:%%files'
ast: exemplu: '%%nome:%%ficheros'
ca: exemple: '%%name:%%files'
cs: příklad: '%%název:%%soubory'
cy: esiampl: '%%enw:%%ffeil'
da: eksempel: '%%navn:%%filer'
el: παράδειγμα:«%%name:%%files»
es: ejemplo: '%%nombre:%%archivos'
et: näide: '%%name:%%files'
eu: adibidez: '%%name:%%files'
fi: esimerkki: "%%name:%%files"
fr: exemple : '%%name:%%files'
gl: exemplo: '%%nome:%%ficheiros'
hu: példa: '%%name:%%files'
id: contoh: '%%name:%%file'
is: example: '%%nafn:%%skrár'
it: esempio: '%%name:%%files'
nb: eksempel: «%%navn:%%filer»
nl: voorbeeld: '%%name:%%files'
nn: Eksempel: «%%name:%%files»
pl: przykład: '%%name:%%files'
pt: exemplo: '%%nome:%%ficheiros'
pt_br: exemplo: '%%nome:%%arquivos'
ro: exemplu: „%%nume:%%fișiere”
ru: пример: '%%name:%%files'
sl: primer: '%%ime:%%datoteke'.
sv: exempel: '%%namn:%%files'
tr: örnek: '%%isim:%%dosyalar'

source: --arch - architecture
ast: --arch - arquitectura
cs: --arch - architektura
cy: --arch - saernïaeth
da: --arch - arkitektur
el: --arch - αναζήτηση στο πεδίο αρχιτεκτονική
es: --arch - arquitectura
et: --arch - arhitektuur
eu: --arch - arkitektura
fi: --arch - laitteistoarkkitehtuuri.
fr: --arch - chercher dans le champ architecture
gl: --arch - arquitectura
he: --arch - ארכיטקטורה
hu: --arch - architektúra
id: --arch - arsitektur
is: --arch - vélbúnaðartegund
it: --arch - architettura.
nb: --arch – arkitektur
nl: --arch - architectuur
nn: --arch – Arkitektur.
pl: --arch - architektura
pt: --arch - arquitectura
pt_br: --arch - arquitetura
ro: --arch - arhitectură
ru: --arch - архитектура
sl: --arch - arhitektura
sq: --arch - arkitekturë
sv: --arch - arkitektur
tr: --arch - mimari

source: --buildhost - build host
ast: --buildhost - máquina na que se compiló.
ca: --buildhost - màquina de construcció.
cs: --buildhost - sestavovací počítač
cy: --buildhost - gwestai'r adeiladedd
da: --buildhost - byggevært
el: --buildhost - αναζήτηση στο πεδίο «BuildHost»
es: --buildhost - máquina en la que se compiló.
et: --buildhost - valmistajamasin
eu: --buildhost - eraikuntza ostalaria
fi: --buildhost - paketoimiskone.
fr: --buildhost - chercher dans le champ « BuildHost »
gl: --buildhost - máquina de construcción
hu: --buildhost - a csomagkészítéshez használt gép
id: --buildhost - buat host
is: --buildhost - byggt á vél.
it: --buildhost - mostra il nome dell'host
nb: --buildhost – byggevert
nl: --buildhost - buildhost ('bouwcomputer')
nn: --buildhost – Byggjevert.
pl: --buildhost - wyświetla znacznik buildhost: komputer budujący pakiet.
pt: --buildhost - endereço de compilação
pt_br: --buildhost - máquina onde foi compilado
ro: --buildhost - gazda pe care se compilează
ru: --buildhost - машина, на которой был собран пакет
sl: --buildhost - strežnik, kjer je bil paket zgrajen.
sv: --buildhost - kompileringsmaskin
tr: --buildhost - derlendiği makine

source: --buildtime - build time
ast: --buildtime - hora de compilación
cs: --buildtime - doba sestavení ze zdrojových kódů
cy: --buildtime - amser adeiladu
da: --buildtime - byggetidspunkt
el: --buildtime - αναζήτηση στο πεδίο «BuildTime»
es: --buildtime - hora de compilación
et: --buildtime - valmistamisaeg
eu: --buildtime - eraikuntza ordua
fi: --buildtime - paketoimisaika.
fr: --buildtime - chercher dans le champ « BuildTime »
gl: --buildtime - hora de construcción
hu: --buildtime - a csomagkészítés időpontja
id: --buildtime - buat waktu
is: --buildtime - hvenær byggt
it: --buildtime - data di compilazione
nb: --buildtime – byggetidspunkt
nl: --buildtime - build-tijdstip
nn: --buildtime – Byggjetidspunkt.
pl: --buildtime - czas utworzenia
pt: --buildtime - data de compilação
pt_br: --buildtime - data que foi compilado
ro: --buildtime - data compilării
ru: --buildtime - время сборки
sl: --buildtime - čas gradnje
sv: --buildtime - kompilerigstid
tr: --buildtime - derlenme zamanı

source: --conffiles - configuration files
ast: --conffiles - ficheros de configuración
cs: --conffiles - soubory s nastavením
cy: --conffiles - ffeiliau ffurfweddiad
da: --conffiles - konfigurationsfiler
el: --conffiles - αναζήτηση στη λίστα των αρχείων διαμόρφωσης
es: --conffiles - archivos de configuración
et: --conffiles - konfiguratsioonifailid
eu: --conffiles - konfiguraketa fitxategiak
fi: --conffiles - asetustiedostot.
fr: --conffiles - chercher dans la liste des fichiers de configuration
gl: --conffiles - ficheiros de configuración
hu: --conffiles - beállítási fájlok
id: --conffiles - file konfigurasi
is: --conffiles - uppsetningaskrár
it: --conffiles - file di configurazione
nb: --conffiles – oppsettsfiler
nl: --conffiles - configuratieestanden
nn: --conffiles – Oppsettfiler.
pl: --conffiles - pliki konfiguracyjne
pt: --conffiles - ficheiros de configuração
pt_br: --conffiles - arquivos de configuração
ro: --conffiles - fișiere de configurare
ru: --conffiles - конфигурационные файлы
sl: --conffiles - nastavitvene datoteke
sv: --conffiles - konfigurationsfiler
tr: --conffiles - yapılandırma dosyaları

source: --conflicts - conflict tags
ast: --conflicts - etiquetes de conflictos
ca: --conflicts - mostra l'etiqueta conflicts: tots els conflictes.
cs: --conflicts - tag s konflikty
cy: --conflicts - tagiau gwrthdaro
da: --conflicts - konfliktmærker
el: --conflicts - αναζήτηση στο πεδίο «Συγκρούσεις»
es: --conflicts - imprime conflictos
et: --conflicts - konfliktide sildid
eu: --conflicts - "gatazka" etiketak
fi: --conflicts - ristiriitamerkinnät ("Conflicts").
fr: --conflicts - chercher dans le champ « conflicts »
gl: --conflicts - etiquetas conflictos
hu: --conflicts - "ütközés" címkék
id: --conflicts - tag konflik tag
is: --conflicts - ósamrýmanleg tög
it: --conflicts - conflitti nelle etichette
nb: --conflicts – konflikttagger
nl: --conflicts - conflicts('botst')-tags
nn: --conflicts – Konfliktmerkelappar.
pl: --conflicts - znaczniki konfliktów.
pt: --conflicts - marcas de conflitos
pt_br: --conflicts - lista conflitos
ro: --conflicts - etichete de conflict
ru: --conflicts - конфликтующие теги
sl: --conflicts - oznaka nezdružljivih paketov
sv: --conflicts - visa konflikter
tr: --conflicts - çakışanlar etiketi

source: --description - package description
ast: --description - descripción del paquete
ca: --description - mostra la descripció.
cs: --description - popis balíčku
cy: --description - disgrifiad pecyn
da: --description - pakkebeskrivelse.
el: --description - αναζήτηση στην περιγραφή των πακέτων
es: --description - descripción del paquete
et: --description - paketi kirjeldus
eu: --description - paketeen deskribapena
fi: --description - paketin kuvaus.
fr: --description - chercher dans les descriptions de paquetages
gl: --description - descrición do paquete
he: --description - תיאור החבילה
hu: --description - csomagleírás
id: --description - penjelasan paket
is: --description - lýsing pakka.
it: --description - descrizione del pacchetto.
nb: --description – pakkebeskrivelse
nl: --description - pakketomschrijving
nn: --description – Pakkeskildring.
pl: --description - opis pakietu.
pt: --description - descrição do pacote
pt_br: --description - descrição do pacote
ro: --description - descrierea pachetului
ru: --description - описание пакета
sl: --description - opis paketa
sv: --description - visa paketbeskrivning
tr: --description - paket açıklaması
