Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: no xml-info available for medium "%s"
ast: nun hai xml-info pal mediu «%s»
cs: není k dispozici žádné xml-info pro zdroj "%s"
cy: dim xml-info ar gyfer cyfrwng "%s"
da: ingen xml-info-fil tilgængelig for medie "%s"
el: δεν υπάρχουν διαθέσιμες πληροφορίες xml για το μέσο "%s"
es: no hay xml-info para el soporte «%s»
et: andmekandjale "%s" ei leitud XML-infot
eu: ez dago "%s" euskarriarentzako xml-info eskuragarri
fi: Medialle "%s" ei löydy xml-info -tiedostoa
fr: pas de fichier xml-info disponible pour le média « %s »
gl: non hai xml-info dispoñible para o soporte "%s"
he: אין קבצי xml info זמינים עבור המקור "%s"
hu: a(z) "%s" adatforrás listafájlja nem elérhető
is: engin XML-info skrá er til fyrir miðil "%s"
it: manca il file xml-info per il supporto "%s"
nb: ingen xml-info tilgjengelig for mediet «%s»
nl: geen xml-info beschikbaar voor medium "%s"
nn: Fann ingen xml-info for mediet «%s».
pl: brak informacji xml dla nośnika "%s"
pt: nenhuma informação xml disponível para a média "%s"
pt_br: xml-info não disponível para a mídia "%s"
ro: nu sînt disponibile informațiile XML pentru mediul „%s”
ru: для источника «%s» не найден файл xml-info
sl: ni bilo možno najti datoteke xml-info za vir »%s«
sq: nuk ka xml-info për të medium "%s"
sv: ingen xml-info tillgänglig för media "%s"
tr: "%s" ortamı için xml-info mevcut değil.

source: --auto-update - update media then upgrade the system.
ast: --auto-update - anovar preseos y dempués anovar el sistema.
cs: --auto-update - provede aktualizaci zdrojů a poté aktualizaci systému.
cy: --auto-update - diweddaru'r cyfrwng ac yna uwchraddio'r system.
da: --auto-update - opdatér media, og opdatér så systemet.
el: --auto-update - ενημέρωση των μέσων και έπειτα του συστήματος.
es: --auto-update - actualizar soportes y luego actualizar el sistema.
et: --auto-update - uuendab andmekandjaid ja seejärel süsteemi.
eu: --auto-update - euskarria eguneratu, ondoren systema berritu.
fi: --auto-update - päivitä mediat ja sen jälkeen järjestelmä.
fr: --auto-update - rafraîchir les média lors de la mise à jour du système.
gl: --auto-update - actualizar o soporte e despois actualizar o sistema.
hu: --auto-update - adatforrások frissítése, majd a rendszer frissítése
id: --auto-update - mengupdate media lalu mengupgrade sistem.
is: --auto-select - uppfæra miðil og uppfæra síðan kerfið.
it: --auto-update - aggiorna i supporti prima di aggiornare il sistema.
nb: --auto-update – oppdater medier, og deretter systemet.
nl: --auto-update - media bijwerken en daarna het systeem opwaarderen.
nn: --auto-update – Oppdater media, og oppdater så systemet.
pl: --auto-update - aktualizuje nośniki i aktualizuje system.
pt: --auto-update - actualiza a média e depois actualiza o sistema.
pt_br: --auto-update - atualiza mídias e então atualiza o sistema.
ro: --auto-update - actualizează mediile, apoi actualizează sistemul.
ru: --auto-update - обновить источник, а затем систему
sl: --auto-update - posodobi vire in nato posodobi sistem.
sv: --auto-update - updatera media och uppdatera system.
tr: --auto-update - önce kurulum kaynağını güncelle, sonra da sistemi yükselt.

source: --no-md5sum - disable MD5SUM file checking.
ast: --no-md5sum - desactivar la preba MD5SUM sobro'l ficheru.
ca: --no-md5sum - deshabilita la comprovació MD5SUM.
cs: --no-md5sum - vypnout kontrolu souborů MD5SUM.
cy: --no-md5sum - analluogi gwirio ffeil MD5SUM.
da: --no-md5sum - deaktivér kontrol med MD5SUM fil.
el: --no-md5sum - απενεργοποίηση του MD5SUM ελέγχου του αρχείου .
es: --no-md5sum - deshabilitar la prueba MD5SUM sobre el archivo.
et: --no-md5sum - keelatakse faili MD5SUM kontroll.
eu: --no-md5sum - MD5SUM fitxategiaren egiaztapena desgaitzen du.
fi: --no-md5sum - poista tiedostojen MD5SUM-tarkistus käytöstä.
fr: --no-md5sum - ne pas effectuer la vérification du fichier MD5SUM.
gl: --no-md5sum - deshabilitar a comprobación de ficheiros MD5SUM.
he: --no-md5sum - נטרל בדיקת חתימת MD5SUM של הקובץ.
hu: --no-md5sum - az MD5-ös összeg ellenőrzésének kikapcsolása
id: --no-md5sum - nonaktifkan pengujian file MD5SUM.
is: --no-md5sum - aftengja MD5SUM skráarathugun.
it: --no-md5sum - disabilita il controllo MD5SUM.
nb: --no-md5sum – ikke utfør kontroll av MD5SUM.
nl: --no-md5sum - MD5SUM bestandscontrole uitschakelen.
nn: --no-md5sum – Ikkje bruk md5sum-kontroll.
pl: --no-md5sum - wyłącza sprawdzanie sumy kontrolnej MD5 dla pliku.
pt: --no-md5sum - desactiva a verificação do ficheiro MD5SUM.
pt_br: --no-md5sum - desabilita checagem MD5SUM dos arquivos.
ro: --no-md5sum - dezactivează verificarea fișierelor cu MD5SUM.
ru: --no-md5sum - отключить проверку файла MD5SUM
sl: --no-md5sum - onemogoči preverjanje datoteke MD5SUM.
sv: --no-md5sum - inaktivera md5sum-kontroll av filer.
tr: --no-md5sum - MD5SUM dosya denetimini iptal et.

source: --force-key - force update of gpg key.
ast: --force-key - forciar anovamientu de contraseña gpg.
ca: --force-key - força l'actualització de la clau gpg.
cs: --force-key - přinutí k aktualizaci klíče gpg.
cy: --force-key - gorfodi diweddaru allwedd gpg.
da: --force-key - gennemtving opdatering af gpg-nøgle.
el: --force-key - εξαναγκασμός ενημέρωσης του κλειδιού gpg.
es: --force-key - forzar actualización de clave gpg.
et: --force-key - sunnib uuendama gpg võtit.
eu: --force-key - gpg gakoa eguneratzera behartzen du.
fi: --force-key - pakota allekirjoitusavaimen päivitys.
fr: --force-key - force la mise à jour de la clef gpg.
gl: --force-key - forzar a actualización da clave gpg.
he: --force-key - אלץ עדכון מפתח gpg.
hu: --force-key - a GPG-kulcs frissítésének kikényszerítése
id: --force-key - paksakan update pada kunci gpg.
is: --force-key - þvinga uppfærslu á GPG lykli.
it: --force-key - forza l'aggiornamento della chiave gpg.
nb: --force-key – tving oppdatering av GPG-nøkkel.
nl: --force-key - dwing bijwerken van de gpg-sleutel af.
nn: --force-key – Tving oppdatering av GPG-nøkkel.
pl: --force-key - wymusza aktualizację klucza gpg.
pt: --force-key - força a actualização da chave gpg.
pt_br: --force-key - força atualização da chave gpg.
ro: --force-key - forțează actualizarea cheii gpg.
ru: --force-key - принудительно обновить gpg-ключ
sl: --force-key - vsili posodobitev ključa GPG.
sv: --force-key - tvinga uppdatering av gpg-nyckel.
tr: --force-key - gpg anahtarını güncellemeye zorla.

source: --auto-orphans - remove orphans without asking
ast: --auto-orphans - desaniciar los güérfanos ensin entrugar
cs: --auto-orphans - odstraní sirotky bez potvrzení
cy: --auto-orphans - tynnu'r amddifad heb ofyn
da: --auto-orphans - fjern forældreløse uden at spørge
el: --auto-orphans - απομάκρυνση των ορφανών, χωρίς επιβαιβέωση
es: --auto-orphans - quitar paquetes huérfanos sin preguntar
et: --auto-orphans - orbude eemaldamine ilma küsimusi esitamata
eu: --auto-orphans - umezurtzak ezabatu galdetu gabe
fi: --auto-orphans - poista tarpeettomat paketit (orphans) kysymättä.
fr: --auto-orphans - supprimer les orphelins sans confirmation
hu: --auto-orphans - kérdés nélkül eltávolítja az árva csomagokat
is: --auto-orphans - fjarlægja munaðarleysingja án þess að spyrja
it: --auto-orphans - rimuove orfani senza chiedere conferma
nb: --auto-orphans – fjern foreldreløse pakker uten å spørre
nl: --auto-orphans - wezen verwijderen zonder bevestiging
nn: --auto-orphans – Fjern foreldrelause pakkar utan å spørja først.
pl: --auto-orphans - usuń osierocone pakiety bez pytania
pt: --auto-orphans - remove os órfãos sem perguntar
pt_br: --auto-orphans - remove pacotes órfãos sem confirmação do usuário
ro: --auto-orphans - înlătură pachetele orfane fără confirmare
ru: --auto-orphans - удалить сирот без вывода запроса
sl: --auto-orphans - samodejno odstrani osirotele pakete
sv: --auto-orphans - ta bort obehövliga paket utan att fråga
tr: --auto-orphans - gereksiz paketleri sormadan kaldır

source: --no-suggests - do not auto select "suggested" packages.
cs: --no-suggests - automaticky nevybírat "navrhované" balíčky
cy: --no-suggests - peidio awto ddewis pecynnau "suggested" .
da: --no-suggests - vælg ikke automatisk "suggested" pakker.
es: --no-suggests - no seleccionar automáticamente paquetes «sugeridos».
eu: --no-suggests - ez aukeratu automatikoki "suggested" paketeak.
fi: --no-suggests - älä valitse ehdotettuja paketteja automaattisesti ("Suggests").
gl: --no-suggests - non seleccionar automaticamente os paquetes "suxeridos".
he: --no-suggests - אל תבחר באופן אוטומטי חבילות "suggested".
hu: --suggests - ne legyenek automatikusan kijelölve a "javasolt" csomagok.
is: --no-suggests - ekki velja sjálfkrafa "tillagða" pakka.
it: --no-suggests - non seleziona automaticamente i pacchetti "suggeriti"
nb: --no-suggests – ikke autovelg «foreslåtte» pakker.
pl: --no-suggests - nie wybieraj automatycznie pakietów oznaczonych jako "sugerowane" .
pt: --no-suggests - não selecciona automaticamente os pacotes "sugeridos".
ro: --no-suggests - nu se selectează automat pachetele „sugerate”.
sv: --no-suggests - välj inte "föreslagna" paket automatiskt.
tr: --no-suggests - "önerilen" pkaetleri otomatikman seçme.

source: --no-uninstall - never ask to uninstall a package, abort the installation.
ast: --no-uninstall - enxamás entrugar si desaniciar un paquete, encaboxar la instalación.
ca: --no-uninstall - mai demana desinstal·lar un paquet, avorta la instal·lació.
cs: --no-uninstall - nikdy se neptat na odstranění balíčku, přerušit instalaci
cy: --no-uninstall - peidio gofyn i ddadosod pecyn, atal gosod.
da: --no-uninstall - spørg aldirig om afinstallering af en pakke, afbryd installationen.
el: --no-uninstall - μην ρωτήσεις για να απεγκαταστήσεις ένα πακέτο, διέκοψε την εγκατάσταση.
es: --no-uninstall - nunca preguntar si desinstalar un paquete, cancelar la instalación.
et: --no-uninstall - kunagi ei paluta paketti eemaldada, paigaldusest loobuda.
eu: --no-uninstall - inoiz ez du pakete bat desinstalatu nahi den galdetzen, instalazioa bertan behera uzten da.
fi: --no-uninstall - älä koskaan kysy paketin poistamisesta, keskeytä asennus.
fr: --no-uninstall - ne jamais demander de désinstallation, plutôt annuler l'installation.
gl: --no-uninstall - nunca preguntar pola desinstalación dun paquete, abortar a instalación.
he: --no-uninstall - לעולם אל תבקש להסיר התקנה של חבילה, בטל את ההתקנה.
hu: --no-uninstall - a program soha ne ajánlja fel csomag eltávolítását, inkább szakadjon félbe a telepítés
id: --no-uninstall - jangan tanya untuk uninstal paket, batalkan instalasi.
is: --no-uninstall - aldrei biðja um að eyða uppsettum pakka, hætta við uppsetningu.
it: --no-uninstall - non chiedere mai di rimuovere un pacchetto, interrompel'installazione
nb: --no-uninstall – be aldri om å avinstallere en pakke, avbryt installeringa.
nl: --no-uninstall - vraag nooit om verwijdering van een pakket, breek de installatie af.
nn: --no-uninstall – Be aldri om å avinstallera ein pakke, men avbryt installeringa.
pl: --no-uninstall - nigdy nie pyta o odinstalowanie pakietu, przerywa instalację.
pt: --no-uninstall - nunca pergunta para desinstalar um pacote, aborta a instalação.
pt_br: --no-uninstall - nunca pergunte para desinstalar um pacote. Caso seja necessário, a instalação será abortada.
ro: --no-uninstall - nu întreba pentru dezinstalarea unui pachet, abandonează instalarea.
ru: --no-uninstall - никогда не предлагать удалять пакет, прерывать установку
sl: --no-uninstall - ne vprašaj za odstranitev paketa, ampak prekini namestitev.
sq: --no-uninstall - mos pyet kurr për dez-instalimin e pakos, abortoje instalimin.
sv: --no-uninstall - fråga aldrig om ett paket ska avinstalleras, avbryt installationen.
tr: --no-uninstall - paket kaldırmayı sorma, kurulumu iptal et.

source: --no-install - don't install packages (only download)
ast: --no-install - non instalar paquetes (namái baxar)
cs: --no-install - neinstalovat balíčky (pouze stáhnout)
cy: --no-install - peidio gosod y pecynnau (dim ond eu llwytho i lawr)
da: --no-install - installér ikke pakker (kun nedhentning)
el: --no-install - μη εγκατάσταση πακέτων (μόνο λήψη)
es: --no-install - no instalar paquetes (sólo descargar)
et: --no-install - pakette ei paigaldata (ainult tõmmatakse).
eu: --no-install - paketeak ez instalatu (jaitsi soilik)
fi: --no-install - älä asenna paketteja (lataa ainoastaan).
fr: --no-install - ne pas installer les paquetages (les télécharger seulement)
gl: --no-install - non instalar os paquetes (só descargalos)
he: --no-install - אל תתקין חבילות (הורדה בלבד)
hu: --no-install - csomagok telepítésének mellőzése (csak letöltés)
id: --no-install - tidak menginstall paket (hanya download).
is: --no-install - ekki setja inn pakka (aðeins sækja)
it: --no-install - non installa i pacchetti, esegue solo il recupero
nb: --no-install – ikke installer pakker (bare last de ned)
nl: --no-install - geen pakketten installeren (alleen downloaden)
nn: --no-install – Ikkje installer pakkar (berre last dei ned)
pl: --install-src - instalacja tylko pakietów źródłowych (bez binariów).
pt: --no-install - não instala pacotes (apenas transfere).
pt_br: --no-install - não instala pacotes (download somente)
ro: --no-install - nu se instalează pachetele (se descarcă doar)
ru: --no-install - не устанавливать пакеты (только загрузить)
sl: --no-install - ne namesti paketov (samo prenesi).
sv: --no-install - installera inte paket (endast nedladdning)
tr: --no-install - paketleri kurma.(sadece indir.)

source: --keep - keep existing packages if possible, reject requested packages that lead to removals.
ast: --keep - caltener paquetes existentes si ye posible, descartar pedíos de paquetes que lleven a desanicialos.
ca: --keep - manté els paquets existents si és possible, rebutja els paquets demanats que porten a la eliminació d'altres paquets.
cs: --keep - pokud je to možné, ponechá existující a odmítne ty z požadovaných balíčků, které vyžadují odstranění jiných
cy: --keep - cadw'r pecynnau presennol os yn bosibl, gwrthod pecynnau sy'n arwain at dynnu.
da: --keep - behold eksisterende pakker om muligt, afvis anmodede pakker som fører til fjernelse.
el: --keep - κράτα τα υπάρχοντα πακέτα εάν είναι δυνατόν, απόρριψε τα ζητούμενα πακέτα που οδηγούν σε αφαιρέσεις.
es: --keep - mantener paquetes existentes si es posible, descartar pedidos de paquetes que lleven a quitarlos.
et: --keep - säilitab võimalusel olemasolevad paketid, lükkab tagasi soovitud paketid, mis toovad kaasa eemaldamise.
eu: --keep - gorde lehendik dauden paketeak ahal bada, ezetsi kentzea eragiten duten pakete-eskaerak.
fi: --keep - jätä olemassa olevat paketit, jos mahdollista ja hylkää paketit, joiden asennus poistaisi muita.
fr: --keep - conserve les paquetages existants si possible, rejette les paquetages demandés qui nécessitent des désinstallations.
gl: --keep - manten os paquetes existentes se é posible, rexeita os paquetes solicitados que provocan eliminacións.
hu: --keep - a már telepített csomagok megtartása, ha lehetséges - a törlést igénylő csomagok nem kerülnek telepítésre
id: --keep - sebisa mungkin menjaga paket, tolak permintaan paket yang bisa menghapus paket yang sudah ada.
is: --keep - halda núverandi pökkum ef mögulegt er, hafna nýjum pökkum sem leiða til að núverandi pakkar séu fjarlægðir.
it: --keep - mantiene i pacchetti esistenti se possibile, rifiuta i pacchetti richiesti che tentano di rimuoverli.
nb: --keep – behold eksisterende pakker hvis mulig, ikke installer pakker som krever fjerning av andre pakker.
nl: --keep - behoud bestaande pakketten wanneer dit mogelijk is, negeer gevraagde pakketten die tot verwijderen nopen.
nn: --keep – Beudisks-daemon gamle pakkar viss mogleg. Ikkje installer pakkar som krev fjerning av andre pakkar.
pl: --keep - zachowuje, jeśli to możliwe, istniejące pakiety odrzuca żądane pakiety prowadzące do usunięcia innych.
pt: --keep - guarda os pacotes existentes se possível, recusa os pacotes pedidos que levam à remoção.
pt_br: --keep - mantém os pacotes existentes se possível, recusando os pacotes solicitados que pedem a remoção do pacote.
ro: --keep - păstrează pachetele existente dacă este posibil, refuză pachetele cerute dacă duc la înlăturări.
ru: --keep - по возможности сохранять существующие пакеты, отклонять запрошенные пакеты, которые приводят к удалению
sl: --keep - če je možno ohrani obstoječe pakete, zavrni zahtevane pakete, ki vodijo v odstranjevanje.
sq: --keep - nëse ka mundësi i mbanë pakot prezente, refuzon pakot e kërkuara me drejtim zhdukje.
sv: --keep - behåll om möjligt existerande paket, ignorera efterfrågade paket som leder till avinstalleringar.
tr: --keep - varolan paketleri koru, mümkünse kaldırılackaları

source: --split-level - split in small transaction if more than given packages are going to be installed or upgraded, default is %d.
ast: --split-level - dividir en transacciones pequeñes si van a anovase o instalar más paquetes daos, %d ye'l predetermináu.
cs: --split-level - rozdělit do menších transakcí, pokud se má instalovat nebo aktualizovat více balíčků než zadaná hodnota, výchozí hodnota je %d
cy: --split-level - hollti'n ddarnau llai os yw mwy na'r pecynnau hyn yn cael eu gosod neu eu uwchraddio rhagosodiad yw %d.
da: --split-level - opdél i lille transaktion hvis mere end givne pakker skal installeres eller opgraderes, standard er %d.
el: --split-level - διαχωρισμός σε μικρότερες συναλλαγές, αν περισσότερα από τα καθορισμένα πακέτα πρόκειται να ενημερωθούν ή να αναβαθμιστούν. Η προεπιλογή είναι %d.
es: --split-level - dividir en transacciones pequeñas si se van a actualizar o instalar más paquetes dados, %d es el predeterminado.
et: --split-level - jagab väikesteks tehinguteks, kui paigaldatakse või uuendatakse enam kui määratud arv pakette, vaikimisi on see %d.
eu: --split-level - transakzio txikiagoetan zatitzen du adierazitako paketeak baino gehiago instalatu edo bertsio-berrituko badira, lehenetsia %d da.
fi: --split-level - hajoita pienempiin tapahtumiin, jos aiotaan asentaa tai päivittää enemmän kuin määritelty määrä paketteja (oletus on %d).
fr: --split-level - découper en petites transactions si plus du nombre spécifié de paquetages doivent être installés ou mis à jour. (%d par défaut).
gl: --split-level - dividir en transaccións menores se se van instalar ou actualizar máis paquetes dos dados polo usuario, por defecto é %d.
hu: --split-level - a műveletek több részre bontása a megadottnál több csomag telepítése vagy frissítése esetén, az alapértelmezés szerinti érték: %d
id: --split-level - pisahkan menjadi transaksi kecil jika paket yang akan diinstal / upgrade lebih banyak daripada yang diberikan, standarnya %d.
is: --split-level - skipta upp í minni færslur ef fleiri en einn pakki mun verða settur inn eða uppfærður, sjálfgefið er %d.
it: --split-level - divide l'operazione in piccole transazioni se più di n pacchetti stanno per essere installati o aggiornato, il valore predefinito di n è %d.
nb: --split-level – del opp i små transaksjoner hvis mer enn enn gitte pakker skal bli installert eller oppdateres, Standardverdi er %d.
nl: --split-level - splitsen in kleinere transacties wanneer meer dan het aangegeven aantal pakketten worden geïnstalleerd of opgewaardeerd, standaard is %d.
nn: --split-level – Del opp i fleire transaksjonar viss fleire enn valt tal på pakkar skal installerast eller oppdaterast. Standardverdi: %d.
pl: --split-level - rozdziela niewielkie transakcje jeśli zostanie zainstalowana lub uaktualniona większa liczba pakietów niż zadana, domyślną wartością jest %d.
pt: --split-level - divide em pequenas transacções se mais do que os pacotes dados forem instalados ou actualizados, o predefinido é %d.
pt_br: --split-level - divide em pequenas transações se mais de um pacote precisa ser instalado ou atualizado, o padrão é %d.
ro: --split-level - împarte în tranzacții mai mici dacă se vor instala sau actualiza mai multe pachete decît cele date, valoarea implicită este %d.
ru: --split-level - разбить на мелкие транзакции, если будут устанавливаться или обновляться дополнительные пакеты кроме указанных, по умолчанию %d
sl: --split-level - deli v kratke transakcije, če je potrebno namestiti ali nadgaraditi več paketov, kot je podano; privzeto je %d.
sq: --split-level - ndrarje në trans-akcion nëse më shumë se një pako e dhënë instalohet apo uzhurnohet, me marrëveshje është %d.
sv: --split-level - dela upp i små transaktioner om fler än angivna paket kommer att installeras eller uppdateras, standard är %d
tr: --split-level - kurulacak veya güncellencek paketlerden daha fazla ise ufak işlemler böl. varsayılan %d dir.

source: --split-length - small transaction length, default is %d.
ast: --split-length - tamañu de transacción pequeña, predetermináu ye %d.
cs: --split-length - malé velikost transakce, výchozí je %d
cy: --split-length - hyd drosglwyddiad byr, rhagosodiad yw %d.
da: --split-length - lille tansaktionslængde, standard er %d.
el: --split-length - μικρότερο μήκος συναλλαγής, η προεπιλογή είναι %d.
es: --split-length - tamaño de transacción pequeña, predeterminado es %d.
et: --split-length - väikese tehingu pikkus, vaikimisi %d.
eu: --split-length - transakzio txikiaren luzera, lehenetsia %d da.
fi: --split-length - pienemmän tapahtuman pituus (oletus on %d).
fr: --split-length - longueur minimale de transaction (%d par défaut).
gl: --split-length - tamaño mínimo de transacción, por defecto é %d.
he: --split-length - אורך טרנזקציה קצרה, ברירת המחדל היא %d.
hu: --split-length - csökkentett művelethossz használata, az alapértelmezés: %d
id: --split-length - panjang transaksi kecil, standarnya %d.
is: --split-length - litlar færslulengdir, sjálfgefið er %d.
it: --split-length - per avere transazione più corte, il valore predefinito è %d.
nb: --split-length – liten transaksjonslengde, standard er %d.
nl: --split-length - korte transactielengte, standaard is %d.
nn: --split-length – Transaksjonslengd: Standardverdi: %d.
pl: --split-length - mały rozmiar transakcji, domyślna wartość to %d.
pt: --split-length - pequeno comprimento de transacção, predefinido é %d.
pt_br: --split-length - transações em pequenos pedaços, o padrão é %d.
ro: --split-length - lungimea tranzacțiilor mici, valoarea implicită este %d.
ru: --split-length - размер мелкой транзакции, по умолчанию %d
sl: --split-length - majhna velikost transakcij, privzeto je %d.
sq: --split-length - gjatësi e vogël e trans-akcionit, me marrëveshje është %d.
sv: --split-length - liten transaktionslängd, standard är %d.
tr: --split-length - ufak işlem uzunluğu, varsayılan %d dir.

source: --fuzzy, -y - impose fuzzy search.
ast: --fuzzy, -y - forciar gueta difusa.
ca: --fuzzy, -y - utilitza cerca difusa.
cs: --fuzzy, -y - vynutit přibližné vyhledávání
cy: --fuzzy - mynnu chwiliad bras.
da: --fuzzy, -y - gennemfør søgning efter fuzzy.
el: --fuzzy, -y - επιβάλει την αναζήτηση κατά προσέγγιση.
es: --fuzzy, -y - forzar búsqueda difusa.
et: --fuzzy, -y - lubab ebatäpset otsingut.
eu: --fuzzy, -y - hurbilketazko bilaketa inposatzen du.
fi: --fuzzy, -y - käytä epätarkkaa hakua.
fr: --fuzzy, -y - imposer la recherche floue.
gl: --fuzzy, -y - impoñer busca aproximada.
he: --fuzzy, -y - מפעיל חיפוש מקורב.
hu: --fuzzy, -y - fuzzy keresés használata
id: --fuzzy, -y - lakukan pencarian fuzzy.
is: --fuzzy - framkvæma loðna leit.
it: --fuzzy, -y - impone una ricerca fuzzy.
nb: --fuzzy, -y – bruk uklart søk.
nl: --fuzzy, -y - onprecies zoeken gebruiken.
nn: --fuzzy – Bruk òg ikkje-ordrett søk.
pl: --fuzzy, -y - wymusza wyszukiwanie niespójności
pt: --fuzzy, -y - impõe uma procura aproximada.
pt_br: --fuzzy, -y - impõe uma busca aproximada.
ro: --fuzzy, -y - impune căutarea aproximativă.
ru: --fuzzy, -y - поиск на основе нечёткой логики
sl: --fuzzy, -y - uporabi ohlapno iskanje.
sv: --fuzzy, -y - använd luddig sökning.
tr: --fuzzy, -y - bulanık aramaya zorla
