Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: nothing to remove (use urpmi.addmedia to add a media)
ast: na pa desaniciar (usa urpmi.addmedia p'amestar un preséu)
ca: no hi ha res per eliminar (utilitzeu urpmi.addmedia per afegir una font)
cs: nic k odebrání (použijte urpmi.addmedia pro přidání zdroje)
cy: dim i'w dynnu (defnyddio urpmi.addmedia i ychwanegu cyfrwng)
da: ingenting at fjerne (brug urpmi.addmedia til at tilføje et medie)
el: τίποτα για διαγραφή (χρησιμοποιήστε το urpmi.addmedia για να προσθέσετε ένα μέσο)
es: nada para quitar (use urpmi.addmedia para agregar un soporte)
et: ei ole midagi eemaldada (andmekandja lisamiskäsk: urpmi.addmedia)
eu: ez dago kentzeko ezer (erabili urpmi.addmedia euskarria gehitzeko)
fi: Ei mitään poistettavaa (käytä komentoa urpmi.addmedia medioiden lisäämiseksi)
fr: rien à retirer (utiliser urpmi.addmedia pour ajouter un média)
gl: non hai nada que eliminar (use urpmi.addmedia para engadir un soporte)
he: אין מה להסיר (יש להשתמש ב urpmi.addmedia לצורך הוספת מאגר)
hu: nincs mit eltávolítani (használja az urpmi.addmedia parancsot adatforrás felvételéhez)
id: tidak ada yang dihapus (gunakan urpmi.addmedia untuk menambah media)
is: ekkert til að fjarlægja (notaðu urpmi.addmedia til að bæta við miðli)
it: niente da rimuovere (usa urpmi.addmedia per aggiungere un supporto)
nb: ingenting å fjerne (bruk urpmi.addmedia for å legge til et medium)
nl: niets te verwijderen (gebruik urpmi.addmedia om media toe te voegen)
nn: Det finst ingenting som kan fjernast. (Bruk «urpmi.addmedia» til å leggja til eit medium.)
pl: brak elementów do usunięcia (użyj urpmi.addmedia aby dodać nośnik)
pt: nada a remover (use urpmi.addmedia para adicionar uma média)
pt_br: nada a remover (use urpmi.addmedia para adicionar uma mídia)
ro: nimic de înlăturat (folosiți urpmi.addmedia pentru a adăuga un mediu)
ru: нечего удалять (добавьте источник с помощью urpmi.addmedia)
sl: noben paket ni označen za odstranitev (uporabite urpmi.addmedia za dodajanje novega vira)
sq: mos zhduk asgjë (përdore urpmi.addmedia për të shtuar një burim)
sv: inget att ta bort (använd urpmi.addmedia för att lägga till media)
tr: Kaldırılacak bir şey yok. (yeni bir kurulum kaynağı eklemek için "urpmi.addmedia" kullanın)

source: the entry to remove is missing (one of %s)
ast: falta la entrada a desaniciar (una de %s)
ca: falta l'entrada per a eliminar (una de %s)
cs: záznam pro odebrání chybí (jeden z %s)
cy: mae'r cofnod i'w dynnu ar goll (un o %s)
da: mangler det element der skal fjernes (én af %s)
el: η επιλογή προς διαγραφή λείπει (ένα εκ των %s)
es: falta la entrada a quitar (una de %s)
et: puudub eemaldatava kirje nimi (võimalikud: %s)
eu: kendu beharreko sarrera falta da (%s(e)tako bat
fi: Poistettavan median nimi puuttuu (jokin seuraavista: %s)
fr: L'entrée à retirer est manquante (l'une parmi %s)
gl: falta a entrada a eliminar (unha de %s)
he: שום כניסה המיועדת להסרה אינה חסרה (אחד מ %s)
hu: a törlendő bejegyzés hiányzik (valamelyik ezek közül: %s)
id: masukan untuk penghapusan hilang (satu dari %s)
is: færsluna sem á að fjarlægja, vantar (ein af %s)
it: l'elemento da rimuovere non è presente (uno di %s)
nb: mangler oppføringen som skal fjernes (skal være en av %s)
nl: het te verwijderen item ontbreekt (één van %s)
nn: Manglar oppføringa som skal fjernast. (Skal vera ein av: %s.)
pl: brak wpisu do usunięcia (jeden z %s)
pt: a entrada a remover está em falta (um de %s)
pt_br: a entrada para remover está faltando (um de %s)
ro: intrarea de înlăturat lipsește (una din %s)
ru: отсутствует удаляемый пункт (один из %s)
sl: manjka vnos za odstranitev (eden od %s)
sq: hyrja zhdukëse mungon (një nga %s)
sv: objektet som ska tas bort saknas (en av %s)
tr: Silme için girdi eksik (bunlardan biri %s)

source: usage: urpmi.update [options] <name> ... where <name> is a medium name to update.
ast: usu: urpmi.update [opciones] <nome> ... onde <nome> ye'l nome del mediu p'anovar.
ca: sintaxi: urpmi.update [opcions] <nom> ... on <nom> és el nom de la font a actualitzar.
cs: použití: urpmi.update [volby] <jméno> ... kde <jméno> je název zdroje pro aktualizaci.
cy: usage: urpmi.update [dewisiadau] <name> ... lle mai <name> yw'r enw cyfrwng i'w dynnu.
da: brug: urpmi.update [valgmuligheder] <navn> ... hvor <navn> er et medie-navn der skal opdateres.
el: χρήση: urpmi.update [επιλογές] <όνομα> ... όπου <όνομα> είναι ένα μέσο προς αναβάθμιση.
es: uso: urpmi.update [opciones] <nombre> ... donde <nombre> es nombre de soporte para actualizar.
et: kasutamine: urpmi.update [võti] <nimi> ... kus <nimi> on uuendatava andmekandja nimi.
eu: Erabilera: urpmi.update [aukerak] <izena> ... non <izena> eguneratu beharreko euskarri-izena den.
fi: Käyttö: urpmi.update [valitsimet] <nimi> ... jossa <nimi> on päivitettävän median nimi.
fr: Utillisation : urpmi.update [options] <nom>... où <nom> est un nom de média à mettre à jour.
gl: uso: urpmi.update [opcións] <nome> ... onde <nome> é o nome do soporte que se desexa actualizar.
he: שימוש: urpmi.update [options] <name> ... כאשר <name> הינו שם המדיה המיודעת לעדכון.
hu: Használat: urpmi.update [opciók] <név> ... ahol <név> a frissítendő adatforrás neve.
id: pemakaian: urpmi.update [opsi] <nama> ... <nama> adalah media yan akan di-update.
is: notkun: urpmi.update [valkostir] <nafn> ... þar sem <nafn> er nafn á miðli sem á að uppfæra.
it: uso: urpmi.update [opzioni] <nome> ... dove <nome> è il nome del supporto da aggiornare.
nb: bruk: urpmi.update [valg] <navn> … hvor <navn> er mediumnavn som skal oppdateres.
nl: gebruik: urpmi.update [opties] <naam> ... waar <naam> een mediumnaam is die bijgewerkt moet worden.
nn: Bruk: urpmi.update [val] <namn> ... der <namn> er namnet på mediet som skal oppdaterast.
pl: użycie: urpmi.update [opcje] <nazwa> ... gdzie <nazwa> jest nazwą nośnika do aktualizacji.
pt: uso: urpmi.update [opções] <nome> ... onde <nome> é o nome da média a actualizar.
pt_br: uso: urpmi.update [opções] <nome> ... onde <nome> é um nome de mídia para atualizar.
ro: utilizare: urpmi.update [opțiuni] <nume>... unde <nume> este numele mediului de actualizat.
ru: использование: urpmi.update [параметры] <название> ... где <название> - название обновляемого источника
sl: uporaba: urpmi.update [možnosti] <ime> …, kjer je <ime> ime vira za posodabljanje.
sq: përdorim:urmpi.update [option] <emri> ... ku <emri> është një emër i burimit përditësues.
sv: användning: urpmi.update [flaggor] <namn>... där <namn> är medianamnet som ska uppdateras.
tr: kullanımı: urpmi.update [seçenekler] <isim> ... <isim> güncellenecek kurulum kaynağının ismidir.

source: --update - update only update media.
ast: --update - anovar namái'l preséu d'anovamientu.
ca: --update - utilitza només les fonts d'actualització.
cs: --update - aktualizovat pouze aktualizační zdroje.
cy: --update - defnyddio cyfrwng diweddaru'n unig.
da: --update - opdatér kun opdateringsmedie.
el: --update - χρήση μόνο των μέσων αναβάθμισης.
es: --update - actualizar sólo el soporte de actualización.
et: --update - uuendatakse ainult uuendus-andmekandjat.
eu: --update - eguneratze-euskarria bakarrik eguneratzen du.
fi: --update - päivitä ainoastaan päivitysmediat.
fr: --update - ne rafraîchir que les médias de mise à jour.
gl: --update - actualizar só os soportes de actualización.
hu: --update - csak frissítési adatforrás legyen frissítve
id: --update - update hanya media update.
is: --update - uppfæra aðeins uppfærslumiðil.
it: --update - usa solo supporti di aggiornamento.
nb: --update – oppdater kun oppdateringsmedium.
nl: --update - vernieuw alleen bijwerkmedia.
nn: --update – Berre oppdater oppdateringsmedium.
pl: --update - używa tylko nośników aktualizacyjnych.
pt: --update - actualiza apenas as médias de actualização.
pt_br: --update - atualize somente as mídia de atualizações.
ro: --update - actualizează numai mediile de actualizare.
ru: --update - обновить только источника с обновлениями
sl: --update - posodobi samo posodobitveni vir.
sq: --update - përditëso vetëm burimet përditësuese.
sv: --update - uppdatera endast uppdateringsmedia.
tr: --update - sadece güncelleme kaynağını güncelle.

source: --force-key - force update of gpg key.
ast: --force-key - forciar anovamientu de contraseña gpg.
ca: --force-key - força l'actualització de la clau gpg.
cs: --force-key - přinutí k aktualizaci klíče gpg.
cy: --force-key - gorfodi diweddaru allwedd gpg.
da: --force-key - gennemtving opdatering af gpg-nøgle.
el: --force-key - εξαναγκασμός ενημέρωσης του κλειδιού gpg.
es: --force-key - forzar actualización de clave gpg.
et: --force-key - gpg võti uuendatakse jõuga.
eu: --force-key - gpg gakoa eguneratzera behartzen du.
fi: --force-key - pakota allekirjoitusavaimen päivitys.
fr: --force-key - force la mise à jour de la clef gpg.
gl: --force-key - forzar a actualización da clave gpg.
he: --force-key - אלץ עדכון מפתח gpg.
hu: --force-key - a GPG-kulcs frissítésének kikényszerítése
id: --force-key - paksakan update pada kunci gpg.
is: --force-key - þvinga uppfærslu á gpg lykli.
it: --force-key - forza l'aggiornamento della chiave gpg.
nb: --force-key – tving oppdatering av gpg-nøkkel.
nl: --force-key - forceer bijwerken van de gpg sleutel.
nn: --force-key – Tving oppdatering av PGP-nøkkel.
pl: --force-key - wymusza aktualizację klucza gpg.
pt: --force-key - força a actualização da chave gpg.
pt_br: --force-key - força atualização da chave gpg.
ro: --force-key - forțează actualizarea cheii gpg.
ru: --force-key - принудительно обновить gpg-ключ
sl: --force-key -prisili posodobitev ključa gpg.
sv: --force-key - tvinga uppdatering av gpg-nyckel.
tr: --force-key - gpg anahtarını güncellemeye zorla.

source: --ignore - don't update, mark the media as ignored.
ast: --ignore - non anovar, marcar el preséu como ignoráu.
cs: --ignore - neaktualizovat, označit zdroje jako ignorované.
cy: --norebuild - peidio diweddaru, marcio'r cyfrwng wedi ei anwybyddu.
da: --ignore - opdatér ikke, markér mediet som ignoreret.
el: --ignore - να μην ενημερωθεί, να σημειωθεί το μέσο ως αγνοημένο.
es: --ignore - no actualizar, marcar el soporte como ignorado.
et: --ignore - uuendamist ette ei võeta, andmekandjat eiratakse.
eu: --ignore - ez eguneratu, markatu euskarria baztertu gisa.
fi: --ignore - älä päivitä, poista media käytöstä.
fr: --ignore - sans mettre à jour, marquer le média en tant qu'ignoré.
gl: --ignore - non actualizar, marcar o soporte coma ignorado.
he: --ignore - אל תעדכן, סמן מקור זה כלא-פעיל.
hu: --ignore - ne legyen frissítés; az adatforrások kihagyottnak jelölése
id: --ignore - jangan update, tandai media sebagai ignored.
is: --ignore - ekki uppfæra, merkja miðilinn sem hunsaðann.
it: --ignore - non aggiornare, segna il supporto come ignorato.
nb: --ignore – ikke oppdater, marker medium som ignorert.
nl: --ignore - niet vernieuwen, markeer de media als genegeerd.
nn: --ignore – Ikkje oppdater, og hopp over mediet i framtida.
pl: --update - nie aktualizuj, oznacz nośnik jako ignorowany.
pt: --ignore - não actualiza, marca a média como ignorada.
pt_br: --ignore - não atualiza, marca a mídia para ser ignorada.
ro: --ignore - nu se actualizează, se marchează mediul ca fiind ignorat.
ru: --ignore - не обновлять, пометить источник как игнорируемый
sl: --ignore - ne posodobljaj, označi vir kot onemogočen.
sv: --ignore - uppdatera ej, märk media som ignorerat.
tr: --ignore - güncelleme, kaynağı yok sayılan olarak işaretle.

source: --no-ignore - don't update, mark the media as enabled.
ast: --no-ignore - non anovar, marcar el preséu como activáu.
cs: --no-ignore - neaktualizovat, označit zdroje jako zapnuté.
cy: --no-ignore - peidiwch diweddaru, marciwch y cyfrwng wedi ei alluogi.
da: --no-ignore - opdatér ikke, markér mediet som aktiveret.
el: --no-ignore - να μην γίνει ενημέρωση, το μέσο θα σημειωθεί ως ενεργοποιημένο.
es: --no-ignore - no actualizar, marcar el soporte como activado.
et: --no-ignore - uuendamist ette ei võeta, andmekandjat siiski arvestatakse.
eu: --no-ignore - ez eguneratu, markatu euskarria gaitu gisa.
fi: --no-ignore - älä päivitä, ota media käyttöön.
fr: --no-ignore - sans mettre à jour, marquer le média en tant qu'actif.
gl: --no-ignore - non actualizar, marcar o soporte coma activado.
he: --no-ignore - אל תעדכן, סמן מקור זה כמאופשר.
hu: --no-ignore - ne legyen frissítés; az adatforrások bekapcsoltnak jelölése
id: --no-ignore - jangan update, tandai media sebagai enabled.
is: --no-ignore - ekki uppfæra, merkja miðilinn sem virkan.
it: --no-ignore - non aggiornare, segna il supporto come disponibile.
nb: --no-ignore – ikke oppdater, marker medium som aktivert.
nl: --no-ignore - niet vernieuwen, markeer de media als geactiveerd.
nn: --no-ignore – Ikkje oppdater, og bruk mediet i framtida.
pl: --no-ignore - nie aktualizuj, oznacz nośnik jako włączony.
pt: --no-ignore - não actualiza, marca a média como activada.
pt_br: --no-ignore - não atualizar, marcar a mídia como habilitada.
ro: --no-ignore - fără actualizare, se marchează mediul ca activat.
ru: --no-ignore - не обновлять, пометить источник как включённый
sl: --no-ignore - ne posodobljaj, označi vir kot omogočen.
sv: --no-ignore - uppdatera ej, märk media som aktiverat.
tr: --no-ignore - güncelleme, kaynağı etkinleştirilmiş olarak işaretle.

source: --probe-rpms - do not use synthesis, use rpm files directly
ast: --probe-rpms - non usar synthesis, usar ficheros rpm direutamente
cs: --probe-rpms - nepoužije soubor syntézy, ale soubory rpm přímo
cy: --probe-rpms - peidio defnyddio synthesis, defnyddiwch ffeiliau rpm
da: --probe-rpms - brug ikke syntese; brug rpm-filer direkte
el: --probe-rpms - αγνοεί το αρχείο synthesis, χρήση του αρχείου rpm
es: --probe-rpms - no usar synthesis, usar archivos rpm directamente
et: --probe-rpms - ei kasutata sünteesifaili, vaid otse RPM-faile.
eu: --probe-rpms - ez erabili synthesis, zuzenean rpm fitxategiak erabili
fi: --probe-rpms - käytä rpm-paketteja suoraan synthesis-tiedoston sijaan.
fr: --probe-rpms - ignorer le synthesis et utiliser les fichiers rpm
gl: --probe-rpms - non usar synthesis, usar os rpm directamente
he: --probe-rpms - אל תשתמש ב-synthesis, השתמש בקבצי ה-rpm ישירות
hu: --probe-rpms - fejléclista használatának mellőzése, RPM-fájlok használata közvetlenül
is: --probe-rpms - ekki nota samantektar-skrá, nota rpm skrár beint.
it: --probe-rpms - usa direttamente i file rpm, invece di synthesis
nb: --probe-rpms – ikke bruk synthesis, bruk rpm-filer direkte
nl: --probe-rpms - gebruik geen synthesisbestand, maar rpm-bestanden direct
nn: --probe-rpms – Ikkje bruk syntese; bruk rpm-filer direkte.
pl: --probe-rpms - nie korzysta z pliku syntezy, wykorzystuje bezpośrednio pliki rpm
pt: --probe-rpms - não usa synthesis, usa directamente os ficheiros rpm
pt_br: --probe-rpms - não usar synthesis, usando arquivos rpm diretamente
ro: --probe-rpms - nu se utilizează synthesis, se utilizeză direct fișierele rpm
ru: --probe-rpms - не использовать файл synthesis; использовать непосредственно rpm-файлы
sl: --probe-rpms - ne uporabi datotek synthesis, neposredno uporabi datoteke rpm
sv: --probe-rpms - använd inte synthesis, använd rpm filer direkt
tr: --probe-rpms - sentez dosyalarını kullanma, doğrudan rpm dosyalarını kullan.

source: -a - select all enabled non-removable media.
el: -a - επιλογή όλων των ενεργοποιημένων μη αφαιρούμενων μέσων.
es: -a - selecciona todos los soportes no extraíbles habilitados.
et: -a - valitakse kõik lubatud mitte-eemaldatavad andmekandjad.
fr: -a - sélectionner tous les médias non amovibles activés
it: -a - seleziona tutti i supporti non rimovibili attivati.
nl: -a - selecteer alle ingeschakelde niet-verwisselbare media.
pt: -a - selecciona todas as médias activadas não-removíveis.
pt_br: -a - seleciona todas as mídias não removíveis habilitadas.
ro: -a - selectează toate mediile non-amovibile activate.
ru: -a - выбрать все включенные несъёмные источники
sl: -a - izberi vse omogočene neodstranljive vire.

source: -f - force updating synthesis
ast: -f - fuerza anovamientu de ficheros synthesis
cs: -f - vynutí aktualizaci souborů syntézy
cy: -f - gorfodi diweddaru ffeiliau synthesis
da: -f - Tving opdatering af syntese
el: -f - εξαναγκάζει την ενημέρωση των αρχείων synthesis
es: -f - fuerza actualización de archivos synthesis
et: -f - sünteestifailid uuendatakse jõuga.
eu: -f - synthesis eguneraketa behartu
fi: -f - pakota synthesis-tiedoston päivitys.
fr: -f - forcer la mise à jour des fichiers synthesis.
gl: -f - forzar a actualización de synthesis
he: -f - אלץ עדכון synthesis
hu: -f - fejléclista frissítésének kikényszerítése
is: -f - þvinga uppfærslu samantektar-skráa
it: -f - impone l'aggiornamento di synthesis
nb: -f – tving oppdatering av synthesis
nl: -f - het bijwerken van synthesis afdwingen
nn: -f – Tving oppdatering av syntese.
pl: -f - wymusza aktualizację plików syntezy.
pt: -f - força a actualização synthesis.
pt_br: -f - força a atualização de synthesis
ro: -f - se forțează actualizarea lui synthesis
ru: -f - принудительно обновить файл synthesis
sl: -f - prisili posodabljanje datotek synthesis
sv: -f - tvinga uppdatering av synthesis
tr: -f - sentez dosyalarını oluşum için zorla.

source: -ff - really force updating synthesis
ast: -ff - realmente fuerza anovamientu de ficheros synthesis
cs: -ff - opravdu vynutí aktualizaci souborů syntézy
cy: -f - gorfodi diweddaru ffeiliau synthesis/
da: -f - gennemtving opdatering af syntese
el: -ff - εξαναγκάζει πραγματικά την ενημέρωση των αρχείων synthesis
es: -ff - realmente fuerza actualización de archivos synthesis
et: -f - sünteestifailid uuendatakse tõepoolest jõuga.
eu: -f - benetan behartu synthesis eguneraketa.
fi: -ff - pakota synthesis-tiedoston päivitys, OIKEASTI.
fr: -ff - vraiment forcer la mise à jour des fichiers synthesis
gl: -ff - forzar de verdade a actualización de synthesis
he: -f - באמת אלץ עדכון synthesis.
hu: -ff - fejléclista frissítésének kikényszerítése (mindenképpen)
is: -ff - virkilega þvinga uppfærslu samantektar-skráa
it: -ff - impone con forza l'aggiornamento di synthesis
nb: -ff – virkelig tving oppdatering av synthesis
nl: -ff - het bijwerken van synthesis echt afdwingen
nn: -f – Tving oppdatering av syntese.
pl: -ff - wymusza aktualizację plików syntezy.
pt: -ff - força realmente a actualização synthesis
pt_br: -ff - realmente força a atualização de synthesis
ro: -ff - se forțează realmente actualizarea lui synthesis
ru: -ff - беспрекословно обновить файл synthesis
sl: -ff - zares prisili posodabljanje datotek synthesis
sv: -ff - hård-tvinga uppdatering av synthesis
tr: -ff - gerçekten sentez dosyalarını güncellemeye zorla.

source: Only superuser is allowed to update media
ast: Sólo'l superusuariu ta autorizáu a anovar preseos
ca: El superusuari és l'únic autoritzat per a actualitzar fonts
cs: Aktualizovat zdroj může pouze uživatel root
cy: Dim ond uwch ddefnyddiwr sy'n cael diweddaru cyfrwng
da: Kun superbrugeren har lov til at opdatere medier
el: Μόνο ο διαχειριστής επιτρέπεται να αναβαθμίζει τα μέσα
es: Sólo el superusuario está autorizado a actualizar soportes
et: Andmekandjaid võib uuendada ainult administraator
eu: Supererabiltzaileak soilik dauka euskarriak eguneratzeko baimena
fi: Vain pääkäyttäjä voi päivittää lähteet
fr: Seul l'administrateur système (root) peut mettre à jour un média
gl: Só o superusuario pode actualizar soportes
he: רק מנהל מערכת מורשה לעדכן מקור תוכנה
hu: Adatforrás frissítéséhez rendszergazdai jogosultság szükséges
id: Hanya superuser yang diijinkan mengupdate media
is: Aðeins kerfisstjórar mega bæta við miðli
it: Solo superuser può aggiornare i supporti
nb: Bare superbruker kan oppdatere medium.
nl: Alleen de beheerder mag media bijwerken
nn: Berre superbrukaren kan oppdatera medium.
pl: Tylko administrator ma prawo aktualizować nośniki
pt: Apenas o super-utilizador pode actualizar as médias
pt_br: Apenas o super usuário tem permissão para atualizar mídia
ro: Doar administratorul poate actualiza mediile
ru: Обновлять источники разрешено только суперпользователю
sl: Samo naduporabnik lahko posodobi vire
sv: Endast systemadministratör får uppdatera media
tr: Paketleri kurmak için sadece sistem yöneticisi yetkilidir

source: nothing to update (use urpmi.addmedia to add a media)
ast: na p'anovar (usa urpmi.addmedia p'amestar un preséu)
ca: no hi ha res per actualitzar (utilitzeu urpmi.addmedia per afegir una font)
cs: nic k aktualizaci (použijte urpmi.addmedia pro přidání zdroje)
cy: dim i'w ddiweddaru (defnyddio urpmi.addmedia i ychwanegu cyfrwng)
da: ingenting at opdatere (brug urpmi.addmedia til at tilføje et medie)
el: τίποτα για αναβάθμιση (χρησιμοποιήστε urpmi.addmedia για να προσθέσετε ένα μέσο)
es: nada para actualizar (use urpmi.addmedia para agregar un soporte)
et: ei ole midagi uuendada (andmekandja lisamiskäsk: urpmi.addmedia)
eu: ez dago eguneratzeko ezer (erabili urpmi.addmedia euskarria gehitzeko)
fi: Ei mitään päivitettävää (käytä komentoa urpmi.addmedia lähteiden lisäämiseksi)
fr: rien à mettre à jour (utiliser urpmi.addmedia pour ajouter un média)
gl: non hai nada que actualizar (use urpmi.addmedia para engadir un soporte)
he: אין מה לעדכן (יש להשתמש ב urpmi.addmedia לצורך הוספת מאגר)
hu: nincs mit frissíteni (használja az urpmi.addmedia parancsot adatforrás felvételéhez)
id: tidak ada yang diupdate (pakailah urpmi.addmedia untuk menambah media)
is: ekkert til að uppfæra (notaðu urpmi.addmedia til að bæta við miðli)
it: niente da aggiornare (usa urpmi.addmedia per aggiungere un supporto)
nb: Ingenting å oppdatere (bruk urpmi.addmedia for å legge til et medium)
nl: niets om te verversen (gebruik urpmi.addmedia om media toe te voegen)
nn: Det finst ingenting å oppdatera. (Bruk «urpmi.addmedia» til å leggja til medium.)
pl: brak elementów do aktualizacji (użyj urpmi.addmedia aby dodać nośnik)
pt: nada a actualizar (use urpmi.addmedia para adicionar uma média)
pt_br: nada a atualizar (use urpmi.addmedia para adicionar uma mídia)
ro: nimic de actualizat (folosiți urpmi.addmedia pentru a adăuga un mediu)
ru: нечего обновлять (добавьте источник с помощью urpmi.addmedia)
sl: noben paket ni označen za posodobitev (uporabite urpmi.addmedia za dodajanje novega vira)
sq: asgjë për tu përditësuar (përdor urpmi.addmedia për të shtuar një burim)
sv: inget att uppdatera (använd urpmi.addmedia för att lägga till media)
tr: Güncellenecek hiç birşey yok. (yeni ortam eklemek için "urpmi.addmedia" kullanın).
