Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: Please enter your credentials for accessing proxy
ast: Por favor, introduz les tos credenciales p'acceder al proxy
ca: Entreu les vostres dades per accedir al servidor intermediari
cs: Zadejte prosím své přístupové informace k proxy
cy: Rhowch eich hawliau ar gyfer cael mynediad i ddirprwy
da: Indtast dine adgangsoplysninger for adgang til proxy
el: Παρακαλώ εισάγετε πιστοποίηση για πρόσβαση διαμεσολαβητή
es: Por favor, ingrese sus credenciales para acceder al proxy
et: Palun anna oma tunnused puhverserveri kasutamiseks
eu: Mesedez sartu proxy-ra sartzeko zure egiaztapen datuak
fi: Syötä välityspalvelimen käyttämiseen tarvittavat tiedot.
fr: Veuillez entrer vos données d'accès pour le proxy
gl: Introduza as súas credenciais para acceder ó proxy
he: עליך להגדיר את פרטי ההתחברות לשרת המתווך
hu: Adja meg az adatait a proxy eléréséhez
id: Harap masukkan hak akses Anda untuk mengakses proxy
is: Vinsamlega gefðu upp aðgangs-auðkenni þitt fyrir staðgengilinn
it: Inserisci i tuoi dati necessari per accedere al proxy
nb: Skriv inn dine preferanser for å få tilgang til mellomtjeneren
nl: Voer uw aanmeldgegevens in voor toegang tot de proxy
nn: Skriv inn brukarnamn og passord for tilgang til mellomtenar
pl: Aby uzyskać dostęp do proxy wprowadź informacje uwierzytelniające
pt: Por favor indique as suas credenciais para aceder ao 'proxy'
pt_br: Favor entrar com suas credenciais para acesso ao proxy
ro: Introduceți acreditările pentru accesarea proxyului
ru: Укажите данные для доступа к прокси-серверу
sl: Vnesite vaša poverila za dostop do posredniškega strežnika
sq: Ju lutemi shkruani kredencialet tuaja për qasje në proxy
sv: Var vänlig ange dina uppgifter för att använda proxy
tr: Lütfen proxy erişimi için gerekli bilgileri giriniz

source: User name:
ast: Nome d'usuariu:
ca: Nom d'usuari:
cs: Jméno uživatele:
cy: Enw Defnyddiwr
da: Brugernavn:
el: Όνομα χρήστη:
es: Nombre de usuario:
et: Kasutajanimi:
eu: Erabiltzaile izena:
fi: Käyttäjätunnus:
fr: Nom d'utilisateur :
gl: Nome de usuario:
he: שם משתמש:
hu: Felhasználónév:
id: Nama pengguna:
is: Notandi:
it: Nome utente:
nb: Brukernavn:
nl: Gebruikersnaam:
nn: Brukarnamn:
pl: Nazwa użytkownika:
pt: Nome de utilizador:
pt_br: Nome do usuário:
ro: Nume utilizator:
ru: Имя пользователя:
sl: Ime uporabnika:
sq: Emri i përdoruesit:
sv: Användarnamn:
tr: Kullanıcı adı:

source: Password:
ast: Contraseña:
ca: Contrasenya:
cs: Heslo:
cy: Cyfrinair:
da: Kodeord:
el: Κωδικός πρόσβασης:
es: Contraseña:
et: Parool:
eu: Pasahitza:
fi: Salasana:
fr: Mot de passe :
gl: Contrasinal:
he: ססמה:
hu: Jelszó:
id: Kata sandi:
is: Lykilorð:
nb: Passord:
nl: Wachtwoord:
nn: Passord:
pl: Hasło:
pt: Senha:
pt_br: Senha:
ro: Parolă:
ru: Пароль:
sl: Geslo:
sq: Fjalëkalim:
sv: Lösenord:
tr: Parola:

source: Unknown webfetch `%s' !!!
ast: ¡¡¡webfetch «%s» desconocíu!!!
cs: Neznámý stahovač `%s'!!!
cy: Webfetch anhysbys '%s' !!!
da: Ukendt nethentningsprogram '%s'.
el: Άγνωστο webfetch `%s' !!!
es: ¡¡¡webfetch «%s» desconocido!!!
et: Tundmatu veebitõmbaja '%s'!
eu: webfetch `%s' ezezaguna !!!
fi: Tuntematon lataaja "%s" !!!
fr: webfetch « %s » inconnu !!!
hu: "%s": ismeretlen webes letöltő
id: Webfetch tidak diketahui `%s' !!!
is: Óþekkt vefaðferð `%s' !!!
it: Webfetch "%s" è sconosciuto!!!
nb: ukjent program for nedlasting «%s».
nl: Onbekend downloadprogramma '%s'!
nn: Ukjend vevhenting «%s».
pl: Nieznany program do pobierania plików %s!!!
pt: Programa de transferências desconhecido `%s' !!!
pt_br: Webfetch desconhecido `%s' !!!
ro: Descărcare necunoscută „%s” !!!
ru: Неизвестный webfetch «%s» !!!
sl: Neznan program za prenos »%s«!!!
sq: webfetch panjohur `%s' !!!
sv: Okänd webfetch '%s' !!!
tr: Bilinmeyen webfetch `%s' !!!

source: %s failed: exited with signal %d
ast: %s falló: coló cola señal %d
cs: %s selhal: skončil se signálem %d
cy: Methodd '%s': gadael gydag arwydd %d
da: %s-fejl: Afsluttede med signalet '%d'.
el: το %s απέτυχε: έγινε έξοδος με το σήμα %d
es: %s falló: salió con la señal %d
et: %s nurjus: lõpetas signaaliga %d
eu: %s-k huts egin du: %d seinalearekin irten da
fi: %s epäonnistui: lopetti signaalilla %d
fr: %s a échoué : sortie sur signal %d
gl: %s fallou: saiu co sinal %d
he: %s כשל: הסתיים עם אות %d
hu: a(z) %s hibát adott vissza: "%d" szignállal lépett ki
id: %s gagal: keluar dengan sinyal %d
is: %s mistókst: hætti mið villumerki %d
it: %s non riuscito: segnale di uscita %d
nb: %s feilet: avsluttet med signal %d
nl: %s mislukt: afgesloten met signaal %d
nn: %s-feil: Avslutta med signalet %d.
pl: %s nie powiodło się: zakończono z sygnałem %d
pt: %s falhado: saiu com o sinal %d
pt_br: %s falhou: código de erro %d
ro: %s a eșuat: terminare cu mesajul %d
ru: сбой %s: завершён с сигналом %d
sl: %s je spodletelo: izhod s signalom %d
sq: %s dështuar: doli me sinjal %d
sv: %s misslyckades: avlutades med signal %d
tr: %s hatası: %d sinayli ile çıkıldı.

source: %s failed: exited with %d
ast: %s falló: coló con %d
cs: %s selhal: skončil s výsledkem %d
cy: Methodd '%s': gadael gyda %d
da: %s-fejl: Afsluttede med '%d'.
el: το %s απέτυχε: έγινε έξοδος με %d
es: %s falló: salió con %d
et: %s nurjus: lõpetas %d-ga
eu: %s-k huts egin du: %d-rekin irten da
fi: %s epäonnistui: lopetti arvolla %d
fr: %s a échoué : sortie avec %d
gl: %s fallou: saiu con %d
he: %s כשל: הסתיים עם %d
hu: a(z) %s hibát adott vissza: "%d" kóddal lépett ki
id: %s gagal: keluar dengan %d
is: %s mistókst: hætti með %d
it: %s non riuscito: uscito con %d
nb: %s feilet: avsluttet med %d
nl: %s mislukt: afgesloten met %d
nn: %s-feil: Avslutta med %d.
pl: %s nie powiodło się: zakończono z %d
pt: %s falhado: saiu com %d
pt_br: %s falhou: código de erro %d
ro: %s a eșuat: terminare cu %d
ru: сбой %s: завершён с %d
sl: %s je spodletelo: izhod z %d
sq: %s dështuar: doli me%d
sv: %s misslyckades: avlutades med %d
tr: %s hatası: %d ile çıkıldı.

source: copy failed
ast: falló la copia
ca: la còpia ha fallat
cs: kopírování selhalo
cy: methodd y copïo
da: kopiering mislykkedes
el: αποτυχία αντιγραφής
es: falló la copia
et: kopeerimine nurjus
eu: kopiak huts egin du
fi: Lataaminen epäonnistui
fr: la copie a échoué
gl: fallo ó copiar
he: העתקה נכשלה
hu: a másolás sikertelen
id: penyalinan gagal
is: afritun mistókst
it: copia non riuscita
nb: kopiering mislyktes
nl: kopiëren is mislukt
nn: mislukka kopiering.
pl: kopiowanie zakończone niepowodzeniem
pt: cópia falhada
pt_br: falha na cópia
ro: copiere eșuată
ru: сбой копирования
sl: kopiranje je spodletelo
sq: kopje dështuar
sv: kopiering misslyckades
tr: Kopyalama başarısız

source: wget is missing
ast: falta wget
ca: no s'ha trobat wget
cs: chybí wget
cy: mae wget ar goll
da: wget mangler
el: λείπει το wget
es: falta wget
et: wget puudub
eu: wget falta da
fi: wget puuttuu
fr: wget est manquant
gl: falta wget
he: wget חסר
hu: a Wget hiányzik
id: wget tidak ada
is: wget vantar
it: manca wget
nb: wget mangler
nl: wget ontbreekt
nn: wget manglar.
pl: brak programu wget
pt: falta o wget
pt_br: wget não encontrado
ro: lipsește wget
ru: Отсутствует wget
sl: manjka program wget
sq: wget mungon
sv: wget saknas
tr: wget bulunamıyor.

source: curl is missing
ast: falta curl
ca: no s'ha trobat curl
cs: chybí curl
cy: mae curl ar goll
da: curl mangler
el: λείπει το curl
es: falta curl
et: curl puudub
eu: curl falta da
fi: curl puuttuu
fr: curl est manquant
gl: falta curl
he: curl חסר
hu: a Curl hiányzik
id: curl tidak ada
is: curl vantar
it: manca curl
nb: curl mangler
nl: curl ontbreekt
nn: curl manglar.
pl: brak programu curl
pt: falta o curl
pt_br: curl não encontrado
ro: lipsește curl
ru: Отсутствует curl
sl: manjka program curl
sq: curl mungon
sv: curl saknas
tr: curl bulunamıyor.

source: curl failed: upload canceled
ca: curl ha fallat: pujada cancel·lada
cs: curl selhal: nahrávání bylo přerušeno
cy: methodd curl: diddymwyd y llwytho
da: curl-fejl: oplægning afbrudt.
es: curl falló: envio cancelado
eu: curl-ek huts egin du: igoera galarazita
fi: curl epäonnistui: siirtäminen peruutettu
hu: A Curl hibát jelzett, a feltöltés meg lett szakítva
it: curl ha fallito: invio cancellato
nb: curl feilet: opplasting avbrutt
pl: curl błąd: pobieranie przerwane
pt: curl falhado: envio cancelado
ro: curl a eșuat: încărcare anulată
sv: curl misslyckades: nerladdningen avbröts
tr: curl hatası: indirme iptal edildi

source: curl failed: download canceled
ast: falló curl: baxada encaboxada
ca: curl ha fallat: baixada cancel·lada
cs: curl selhal: stahování bylo přerušeno
cy: methodd curl: diddymwyd y llwytho i lawr
da: curl-fejl: hentning afbrudt.
el: το curl απέτυχε: ακύρωση της λήψης
es: curl falló: descarga cancelada
et: curl nurjus: allalaadimine katkestati
eu: curl-ek huts egin du: deskarga galarazita
fi: curl epäonnistui: lataaminen peruutettu
fr: échec de curl : téléchargement annulé
gl: curl fallou: cancelouse a descarga
he: curl כשל: ההורדה בוטלה
hu: a Curl hibát jelzett, a letöltés meg lett szakítva
id: curl gagal: download dibatalkan
is: curl mistókst: hætt við að sækja skrá
it: curl ha fallito: recupero cancellato
nb: curl feilet: nedlasting avbrutt
nl: curl is mislukt: download geannuleerd
nn: curl-feil: Nedlasting avbroten.
pl: wystąpił błąd w programie curl: pobieranie przerwane
pt: curl falhado: transferência cancelada
pt_br: curl falhou: download cancelado
ro: curl a eșuat: descărcare anulată
ru: ошибка curl: загрузка отменена
sl: curl je spodletel: prenos preklican
sq: curl dështoj: shkarkimi anuluar
sv: curl misslyckades: nerladdningen avbröts
tr: curl hatası: indirme iptal edildi

source: rsync is missing
ast: falta rsync
ca: no s'ha trobat rsync
cs: chybí rsync
cy: rsync ar goll
da: rsync mangler
el: λείπει το rsync
es: falta rsync
et: rsync puudub
eu: rsync falta da
fi: rsync puuttuu
fr: rsync est manquant
gl: falta rsync
he: rsync חסר
hu: az Rsync hiányzik
id: rsync tidak ada
is: rsync vantar
it: manca rsync
nb: rsync mangler
nl: rsync ontbreekt
nn: rsync manglar.
pl: brak programu rsync
pt: falta o rsync
pt_br: rsync não encontrado
ro: lipsește rsync
ru: Отсутствует rsync
sl: manjka program rsync
sq: rsync mungon
sv: rsync saknas
tr: rsync bulunamıyor

source: ssh is missing
ast: falta ssh
ca: no s'ha trobat ssh
cs: chybí ssh
cy: ssh ar goll
da: ssh mangler
el: λείπει το ssh
es: falta ssh
et: ssh puudub
eu: ssh falta da
fi: ssh puuttuu
fr: ssh est manquant
gl: falta ssh
he: ssh חסר
hu: az SSH hiányzik
id: ssh tidak ada
is: ssh vantar
it: manca ssh
nb: SSH mangler
nl: ssh ontbreekt
nn: ssh manglar.
pl: brak programu ssh
pt: falta o ssh
pt_br: ssh não encontrado
ro: lipsește ssh
ru: Отсутствует ssh
sl: manjka program ssh
sq: ssh mungon
sv: ssh saknas
tr: ssh bulunamıyor

source: prozilla is missing
ast: falta prozilla
ca: no s'ha trobat prozilla
cs: chybí prozilla
cy: prozilla ar goll
da: prozilla mangler
el: λείπει το prozilla
es: falta prozilla
et: prozilla puudub
eu: prozilla falta da
fi: prozilla puuttuu
fr: prozilla est manquant
gl: falta prozilla
he: prozilla חסר
hu: a Prozilla hiányzik
id: prozilla tidak ada
is: prozilla vantar
it: manca prozilla
nb: prozilla mangler
nl: prozilla ontbreekt
nn: prozilla manglar.
pl: brak programu prozilla
pt: falta o prozilla
pt_br: Prozila não encontrado
ro: lipsește prozilla
ru: Отсутствует prozilla
sl: manjka program prozilla
sq: prozilla mungon
sv: prozilla saknas
tr: prozilla bulunamıyor

source: Couldn't execute prozilla
ast: Nun pudo executase prozilla
ca: No s'ha pogut executar prozilla
cs: Nelze spustit aplikaci prozilla
cy: Methu gweithredu prozilla
da: Kunne ikke køre prozilla
el: Αδυναμία εκτέλεσης του prozilla
es: No se pudo ejecutar prozilla
et: Prozilla käivitamine nurjus
eu: Ezin izan da prozilla exekutatu
fi: Ohjelmaa prozilla ei voitu suorittaa
fr: Exécution de prozilla impossible
gl: Non se puido executar prozilla
he: לא ניתן להפעיל את prozilla
hu: Nem sikerült végrehajtani a Prozilla programot
id: Tidak bisa mengeksekusi prozilla
is: Gat ekki keyrt prozilla
it: Impossibile eseguire prozilla
nb: Klarte ikke kjøre prozilla
nl: Kan prozilla niet uitvoeren
nn: Klarte ikkje køyra prozilla.
pl: Uruchomienie programu prozilla było niemożliwe
pt: Não foi possível executar o prozilla
pt_br: Impossível executar o Prozilla
ro: Nu s-a putut lansa prozilla
ru: Не удаётся запустить prozilla
sl: ni bilo možno zagnati prozilla
sq: Nuk mundi të ekzekutohet prozilla
sv: Kunde inte starta prozilla
tr: Prozilla çalıştırılamadı

source: aria2 is missing
ast: falta aria2
ca: no s'ha trobat aria2
cs: chybí aria2
cy: aria2 ar goll
da: aria2 mangler
el: λείπει το aria2
es: falta aria2
et: aria2 puudub
eu: aria2 falta da
fi: aria2 puuttuu
fr: aria2 est manquant
gl: falta aria2
hu: aria2 hiányzik
is: aria2 vantar
it: manca aria2
nb: aria2 mangler
nl: aria2 ontbreekt
nn: aria2 manglar.
pl: brak programu aria2
pt: falta o aria2
pt_br: aria2 não encontrado
ro: lipsește aria2
ru: Отсутствует aria2
sl: manjka program aria2
sq: aria2 mungon
sv: aria2 saknas
tr: aria2 bulunamıyor

source: Failed to download %s
ast: Falló al baxar %s
ca: Ha fallat la descàrrega de %s
cs: Nepodařilo se stáhnout %s
cy: Methu llwytho %s i lawr
da: Mislykkedes med at hente %s
el: Αποτυχία λήψης του %s
es: Falló al descargar %s
et: %s allalaadimine nurjus
eu: %s jaisteak huts egin du
fi: Tiedoston %s lataaminen epäonnistui
fr: Échec du téléchargement de %s
hu: Nem sikerült a %s letöltése
is: Gat ekki sótt %s
it: Non è riuscito il recupero di %s
nb: Klarte ikke å laste ned %s
nl: Downloaden van %s mislukt
nn: Klarte ikkje lasta ned %s
pl: Pobranie %s nie powiodło się
pt: Falha ao transferir %s
pt_br: Falhou ao baixar %s
ro: Descărcarea lui %s a eșuat
ru: Не удалось загрузить %s
sl: Ni bilo možno prenesti %s
sq: Dështoi në shkarkim %s
sv: Misslyckades att hämta %s
tr: %s indirilemedi

source: %s%% of %s completed, ETA = %s, speed = %s
ast: %s%% de %s completu, ETA = %s, velocidá = %s
cs: %s%% z %s hotovo, ETA = %s, rychlost = %s
cy: %s%% o %s wedi ei gwblhau, Amser = %s, cyflymder = %s
da: %s %% af %s færdiggjort. Tid igen: %s. Hastighed: %s.
el: ολοκληρώθηκε το %s%% από τα %s, εκτίμηση = %s, ταχύτητα = %s
es: %s%% de %s completo, ETA = %s, velocidad = %s
et: %s%% %s-st valmis, aega jäänud: %s, kiirus: %s
eu: %s%% / %s osatuta, ETA = %s, abiadura = %s
fi: %s%% valmiina, koko %s, aikaa jäljellä %s, nopeus %s
fr: %s%% de %s terminé, ETA = %s, débit = %s
gl: %s%% de %s completado, TME = %s, velocidade = %s
he: %s%% מ-%s הושלמו, זמן נותר = %s, מהירות = %s
hu: %s%% megvan, összesen: %s, hátralevő: %s, sebesség: %s
id: %s%% dari %s selesai, ETA = %s, kecepatan = %s
is: %s%% of %s lokið, lýkur = %s, hraði = %s
it: %s%% di %s completato, ETA = %s, velocità = %s
nb: %s %% av %s fullført, tid igjen = %s, hastighet = %s
nl: %s%% van %s voltooid, verwacht = %s, snelheid = %s
nn: %s %% av %s fullført. Tid igjen: %s. Fart: %s.
pl: %s%% z %s zostało pobrane, ETA = %s, prędkość = %s
pt: %s%% de %s terminado, ETA = %s, velocidade = %s
pt_br: %s%% de %s completados. ETA = %s. Velocidade = %s
ro: %s%% din %s totali, TES = %s, viteză = %s
ru: %s%% из %s завершено, осталось времени = %s, скорость = %s
sl: %s%% od %s preneseno, do konca = %s, hitrost = %s
sq: %s%% of %s përfunduar, ETA = %s, shpejtësi= %s
sv: %s%% av %s klar, ETA = %s, hastighet = %s
tr: %s%% / %s tamamlandı, Kalan Süre = %s, hız = %s

source: %s%% completed, speed = %s
ast: %s%% completu, velocidá = %s
ca: %s%% completat, velocitat = %s
cs: %s%% hotovo, rychlost = %s
cy: %s%% wedi ei gwblhau, cyflymder = %s
da: %s %% færdiggjort. Hastighed: %s.
el: ολοκληρώθηκε το %s%%, ταχύτητα = %s
es: %s%% completo, velocidad = %s
et: %s%% valmis, kiirus: %s
eu: %s%% osatuta, abiadura = %s
fi: %s%% valmis, nopeus %s
fr: %s%% terminé, débit = %s
gl: %s%% completado, velocidade = %s
he: %s%% הורדו, מהירות = %s
hu: %s%% megvan, sebesség: %s
id: %s%% selesai, kecepatan = %s
is: %s%% lokið, hraði = %s
it: %s%% completato, velocità = %s
nb: %s %% fullført, hastighet = %s
nl: %s%% voltooid, snelheid = %s
nn: %s %% fullført. Fart: %s.
pl: %s%% zakończono, prędkość = %s
pt: %s%% terminado, velocidade = %s
pt_br: %s%% completados. Velocidade = %s
ro: %s%% complet, viteză = %s
ru: %s%% завершено, скорость = %s
sl: %s%% preneseno, hitrost = %s
sq: %s%% përfunduar, shpejtësi = %s
sv: %s%% klar, hastighet = %s
tr: %s%% tamamlandı, hız = %s

source: retrieving %s
ast: baxando %s
ca: s'està recuperant %s
cs: přijímám %s
cy: estyn %s
da: henter %s
el: ανάκτηση %s
es: descargando %s
et: %s tõmbamine
eu: %s berreskuratzen
fi: noudetaan %s
fr: récupération de %s
gl: obtendo %s
he: מאחזר %s
hu: "%s" behozatala
id: menerima %s
is: sæki %s
it: recupero di %s
nb: henter %s
nl: ophalen van %s
nn: Hentar «%s».
pl: pobieranie %s
pt: a transferir %s
pt_br: buscando %s
ro: se preia %s
ru: загружается %s
sl: prenos %s
sq: marrje %s
sv: hämtar %s
tr: %s getiriliyor

source: retrieved %s
ast: baxaos %s
ca: s'ha recuperat %s
cs: přijato %s
cy: estynwyd: %s
da: hentede %s
el: ανακτήθηκε %s
es: descargados %s
et: tõmmati %s
eu: %s eskuratuta
fi: noudettiin %s
fr: %s récupéré
gl: obteuse %s
he: אוחזרו %s
hu: "%s" behozatala megtörtént
id: menerima %s
is: sótti %s
it: %s recuperato
nb: hentet %s
nl: %s opgehaald
nn: Henta «%s».
pl: ...pobrano %s
pt: transferido %s
pt_br: recebido %s
ro: %s preluat
ru: загружено %s
sl: prenešeno %s
sq: marrë %s
sv: hämtade %s
tr: getirildi: [%s]

source: unknown protocol defined for %s
ast: protocolu desconocíu definíu pa %s
ca: el protocol definit per a %s és desconegut
cs: neznámý protokol definovaný pro %s
cy: protocol anhysbys ar gyfer %s
da: ukendt protokol defineret for %s
el: καθορίστηκε άγνωστο πρωτόκολλο για το %s
es: protocolo desconocido definido para %s
et: tundmatu protokoll %s jaoks
eu: %s(e)rako protokolo ezezaguna definitu da
fi: Määritelty tuntematon protokolla kohteelle %s
fr: protocole inconnu défini pour %s
gl: protocolo descoñecido definido por %s
he: פרוטוקול לא מזוהה הוגדר עבור %s
hu: ismeretlen protokoll van definiálva ehhez: "%s"
id: protokol tidak dikenal didefinisikan untuk %s
is: óþekkt samskiptaregla skilgreind fyrir %s
it: protocollo sconosciuto definito per %s
nb: ukjent protokoll spesifisert for %s
nl: onbekend protocol gedefinieerd voor %s
nn: Ukjend protokoll definert for «%s».
pl: nieznany protokół zdefiniowany dla %s
pt: protocolo desconhecido definido para %s
pt_br: protocolo desconhecido definido para %s
ro: protocol necunoscut definit pentru %s
ru: для %s определён неизвестный протокол
sl: za %s je določen neznan protokol
sq: protokol i pa njoftur për përcaktimit e %s
sv: okänt protokoll definierat för %s
tr: %s için bilinmeyen protokol tanımlanmış

source: no webfetch found, supported webfetch are: %s
ast: nun alcontráu webfetch, los webfetch sofitaos son: %s
ca: no s'ha trobat cap programa per baixar coses de la xarxa, els programes suportats són: %s
cs: nebyla nalezena aplikace pro stažení přes web, podporované jsou: %s
cy: heb ganfod webfetch, yn cael eu cynnal gan webfetch: %s
da: Ingen webhentning fundet, understøttede webhentninger er: %s
el: δεν βρέθηκε το webfetch, υποστηριζόμενα webfetch είναι: %s
es: no se encontró webfetch, los webfetch soportados son: %s
et: veebitõmbajat ei leitud, toetatud on programm %s
eu: webfetch ez da aurkitu, webfetch hauek onartzen dira: %s
fi: Yhtään latausohjelmaa ei löytynyt, tuetut ohjelmat: %s
fr: aucun programme de téléchargement trouvé, ceux supportés sont : %s
he: לא נמצא webfetch מבין אלו הנתמכים: %s
hu: nem található webes letöltő; a támogatott letöltők: %s
id: webfetch tidak ditemukan, webfetch yang didukung adalah: %s
is: forrit til að sækja af vef fannst ekki, studd forrit eru: %s
it: non è stato trovato nessun programma per recuperare pacchetti, quelli supportati sono: %s
nb: Ingen program for nedlasting funnet, støttede program er: %s
nl: geen ``webfetch'' gevonden, ondersteund zijn: %s
nn: Fann ingen «webfetch». Støtta «webfetch»-ar er: %s
pl: nie znaleziono narzędzia do pobierania stron, obsługiwanymi są: %s
pt: nenhum programa de transferências encontrado, os programas de transferências suportados são: %s
pt_br: nenhuma webfetch encontrada, webfetch suportadas são: %s
ro: nu s-a găsit webfech, versiunile suportate sînt: %s
ru: не найден webfetch; поддерживаемые webfetch: %s
sl: ni programa za spletni prenos, podprti so: %s
sq: nuk u gjet webfetch, webfetch të mbështetur janë: %s
sv: ingen 'webfetch' hittad, supportad webfetch är: %s
tr: geçerli webfetch bulunamadı, desteklenen webfetch: %s

source: unable to handle protocol: %s
ast: nun puede manexase'l protocolu: %s
ca: incapaç de gestionar el protocol: %s
cs: nelze zpracovat protokol: %s
cy: methu trin protocol: %s
da: kunne ikke behandle protokol: %s
el: αδυναμία χειρισμού πρωτοκόλλου: %s
es: no se puede manejar el protocolo: %s
et: ei suuda käsitleda protokolli: %s
eu: ezin da protokoloa maneiatu: %s
fi: Protokollaa ei voida käsitellä: %s
fr: impossible d'utiliser le protocole : %s
gl: non foi posible manexar o protocolo: %s
he: השימוש בפרוטוקול : %s נכשל
hu: protokollkezelés sikertelen: %s
id: gagal menangani protokol: %s
is: skil ekki samskiptareglu: %s
it: impossibile gestire il protocollo: %s
nb: kunne ikke håndtere protokoll: %s
nl: kon protocol niet verwerken: %s
nn: Kan ikkje bruka protokollen: %s.
pl: nie można obsłużyć protokołu: %s
pt: não é possível usar o protocolo: %s
pt_br: incapaz de usar protocolo: %s
ro: nu se poate folosi protocolul: %s
ru: не удаётся обработать протокол: %s
sl: obravnava protokola »%s« ni možna
sq: i pa mundur përdorimi i protokolit: %s
sv: kan inte hantera protokoll: %s
tr: %s protokolü ile ilgilenemiyor

source: cleaning %s and %s
ast: llimpiando %s y %s
ca: s'està netejant %s i %s
cs: čistím %s a %s
cy: glanhau %s ac %s
da: rydder %s og %s
el: καθαρισμός του %s και του %s
es: limpiando %s y %s
et: puhastatakse %s ja %s
eu: %s eta %s garbitzen
fi: Tyhjennetään %s ja %s
fr: Vidage du répertoire %s et de %s
gl: limpando %s e %s
he: מנקה את %s ואת %s
hu: %s és %s ürítése
id: membersihkan %s dan %s
is: hreinsa %s og %s
it: rimozione di %s e di %s
nb: renser %s og %s
nl: Opschonen van %s en %s
nn: Ryddar opp %s og %s.
pl: czyszczenie %s i %s
pt: a limpar %s e %s
pt_br: limpando %s e %s
ro: se curăță %s și %s
ru: очищаются %s и %s
sl: čiščenje %s in %s
sq: pastrim %s dhe %s
sv: rengör %s och %s
tr: %s ve %s temizleniyor

source: package %s is not found.
ast: paquete %s nun alcontráu.
ca: no s'ha trobat el paquet %s.
cs: balíček %s nenalezen.
cy: heb ganfod pecyn %s
da: pakke %s er ikke fundet.
el: το πακέτο %s δεν βρέθηκε.
es: no se encontró el paquete %s.
et: paketti %s ei leitud.
eu: ez da %s paketea aurkitu.
fi: Pakettia %s ei löytynyt.
fr: paquetage %s non trouvé.
gl: non se atopou o paquete %s.
he: החבילה %s לא נמצאה.
hu: a csomag nem található: "%s"
id: paket %s tak ditemukan.
is: pakki %s fannst ekki.
it: il pacchetto %s non è stato trovato.
nb: fant ikke pakka «%s».
nl: pakket %s is niet gevonden.
nn: Fann ikkje pakken «%s».
pl: pakiet %s nie został odnaleziony.
pt: o pacote %s não foi encontrado.
pt_br: o programa %s não foi encontrado.
ro: pachetul %s nu a fost găsit.
ru: пакет %s не найден.
sl: paketa %s ni mogoče najti.
sq: pakoja %s nuk është prezente
sv: paketet %s hittas inte.
tr: %s paketi bulunamadı.
