Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --list - list transactions since provided date/duration argument
cs: --list - vypiš akce které odpovídají datu/času
cy: --list - rhestri trafodion ers darparu ymresymiad dyddiad hyd
da: --list - list transaktioner siden opgivet dato/varighed-argument
es: --list - lista las transacciones a partir de la fecha/período provistos
eu: --list - zerrendatu ematen den data/iraupen argumentutik egin diren eragiketak
fi: --list - listaa toimenpiteet annettuna ajanjaksona
gl: --list - lista as transaccións dende o argumento data/duración proporcionado
hu: --list - tranzakciók listázása a megadott dátum/időtartam argumentumtól kezdődően
id: --list - mendata transaksi semenjak argumen data/durasi yang diberikan
is: --list - lista færslur síðan uppgefin dagsetning eða tímabil
it: --list - elenca le transazioni dalla data/durata fornita come argomento
nb: --list – vis transaksjoner fra valgt dato/varighet-argument.
pl: --list - pokazuje listę zdarzeń wykonanych od wskazanej daty/przez określony okres
pt: --list - lista transacções desde que dado o argumento de data/duração
ro: --list - afișați tranzacțiile corespunzătoare parametrului dată/durată
sv: --list - lista transaktioner efter angivet datum/period argument
tr: --list - verilen tarih/süre argümanından beri yapılan tüm işlemleri listele.

source: --list-all - list all transactions in rpmdb (long)
cs: --list-all - vypiš všechny akce v rpmdb
cy: --list-all - rhestri'r holl drafodion yn rpmdb (hir)
es: --list-all - listar todas las transacciones de la rpmdb (largo)
fi: --list-all - listaa kaikki rpm-tietokannan toimenpiteet (pitkä)
gl: --list-all - lista tódalas transaccións en rpmdb (longo)
hu: --list-all - az RPM-adatbázisban levő tranzakciók listázása (hosszú)
id: --list-all - daftar semua transaksi pada rpmdb (panjang)
it: --list-all - elenca tutte le transazioni nel db rpm (lungo)
pt: --list-all - lista todas as transacções no rpmdb (comprido).
ro: --list-all - afișarea tuturor tranzacțiilor din rpmdb (lungă)
sv: --list-all - lista alla transaktioner i rpmdb (lång)
tr: --list-all - rpmdb'deki tüm işlemleri listele (uzun)

source: --list-safe - list transactions since checkpoint
cs: --list-safe - vypiš transakce od posledního checkpointu
cy: --list-safe - rhestri'r holl drafodion ers y pwynt gwirio
da: --list-safe - list transaktioner siden kontrolpunkt
es: --list-safe - lista las transacciones a partir del punto de referencia
eu: --list-safe - zerrendatu kontrol-puntutik egindako eragiketak
fi: --list-safe - listaa varmistuspisteen jälkeiset toimenpiteet
hu: --list-safe - tranzakciók listázása az ellenőrzőponttól (checkpoint) kezdődően
id: --list-safe - daftar semua transaksi semenjak checkpoint
is: --list-all - lista allar færslur síðan mörkun.
it: --list-safe - elenca le transazioni dal checkpoint
nb: --list-safe – vis oversikt over alle transaksjoner etter kontrollpunkt
pl: --list-safe - wyświetlaj listę zdarzeń od ostatniej kontroli
pt: --list-safe - lista as transacções desde o ponto de verificação (checkpoint)
ro: --list-safe - afișarea tranzacțiilor de la marcaj
sv: --list-safe - lista transaktioner efter kontrollpunkt
tr: --list-safe - denetleme noktasından beri olan işlemleri listele.

source: --rollback - rollback until specified date, or rollback the specified number of transactions
cs: --rollback - zruš vše do nastaveného data nebo daný počet transakcí
cy: --rollback - mynd yn ôl i'r dyddiad penodol, neu nôl y nifer o drafodion penodwyd
da: --rollback - rul tilbage til specificeret dato, eller rul det specificerede antal transaktioner tilbage
es: --rollback - revenir hasta la fecha especificada, o revenir la cantidad especificada de transacciones
eu: --rollback - zehaztutako data arte atzera egin, edo zehaztutako eragiketa kopurua desegin
fi: --rollback - palauta annetun päivämäärän tilaan, tai peruuta annettu määrä toimenpiteitä
hu: --rollback - visszagörgetés a megadott dátumig, vagy a megadott számú tranzakció visszagörgetése
id: --rollback - mundur hingga tanggal yang ditentukan, atau mundur sejumlah nomor transaksi
is: --rollback - snúa til baka til ákveðinnar dagsetningar eða snúa til baka ákveðin fjölda færslna
it: --rollback - rollback fino alla data specificata, o rollback del numero di transazioni specificato
nb: --rollback – hent tilbake til valgt dato, eller hent tilbake til det valgte antall transaksjoner.
pl: --rollback - przywróć stan z określonego dnia, lub stan sprzed określonej liczby operacji
pt: --rollback - volta atrás até à data indicada, ou volta atrás até ao número indicado de transacções
ro: --rollback - revenire pînă la data specificată, sau revenire cu un număr specificat de tranzacții
sv: --rollback - återställ till specifierat datum, eller specifierat antal transaktioner
tr: --rollback - belirtilen tarihe kadar geri al veya belirtilen işlem sayısına kadar geri al.

source: --disable - turn off repackaging
cs: --disable - deaktivuj přebalení
cy: --disable - diffodd ailbecynnu
es: --disable - desactivar reempaquetado
fi: --disable - poista uudelleenpaketointi käytöstä
hu: --disable - újracsomagolás kikapcsolása
id: --disable - menonaktifkan pemaketan ulang
it: --disable - disattiva il repackaging
pt: --disable - desactivar reempacotamento
ro: --disable - dezactivare reîmpachetare
sv: --disable - stäng av ompaketering
tr: --disable - yeniden paketlemeyi devre dışı bırak.

source: Invalid date or duration [%s]
cs: Neplatné datum nebo doba trvání [%s]
cy: Dyddiad neu hyd annilys [%s]
es: Fecha o duración no válida [%s]
fi: Virheellinen päivämäärä tai ajanjakso [%s]
gl: Data ou duración incorrecta [%s]
hu: Helytelen dátum vagy időtartam [%s]
id: Tanggal atau durasi [%s] yang tidak valid
it: Data o durata non valida [%s]
pt: Data ou duração inválidos [%s]
ro: Dată sau durată nevalide [%s]
sv: Felaktigt datum eller period [%s]
tr: Geçersiz tarih veya zaman [%s]

source: Repackage directory not defined
cs: Nebyl definován adresář pro přebalení.
cy: Heb ddiffinio cyfeiriadur ailbecynnu
es: No se definió el directorio de caché de paquetes
fi: Uudelleenpaketointikansiota ei asetettu
hu: Újracsomagolási könyvtár nincs megadva
id: Direktori repackage tidak didefinisikan
it: Directory per il repackage non definita
pt: Directório de reempacotamento não definido
ro: Directorul de reîmpachetare nu este definit
sv: Ompaketeringskatalogen är inte specifierade
tr: Yeniden paketleme dizini belirtilmemiş.

source: Can't write to repackage directory [%s]
cs: Nemohu zapisovat do adresáře [%s]
cy: Methu ysgrifennu i gyfeiriadur ailbacio [%s]
es: No se puede escribir al directorio caché de paquetes [%s]
fi: Ei voida kirjoittaa uudelleenpaketointikansioon [%s]
hu: Nem sikerült írni az újracsomagolási könyvtárba [%s]
id: Tidak bisa menulis pada direktori repackage [%s]
it: Impossibile scrivere nella cartella di repackage [%s]
pt: Não é possível escrever no directório de reempacotamento [%s]
ro: Nu se poate scrie în directorul de reîmpachetare [%s]
sv: Kan inte skriva til ompaketeringskatalogen [%s]
tr: [%s] yeniden paketleme dizinine yazılamıyor.

source: Cleaning up repackage directory [%s]...
cs: Čistím adresář [%s]
cy: Glanhau cyfeiriadur ailbacio [%s]...
es: Limpiando el directorio caché de paquetes [%s]...
fi: Tyhjennetään uudelleenpaketointikansiota [%s]...
hu: Az újracsomagolási könyvtár takarítása [%s]...
id: Membersihkan direktori repackage [%s]...
it: Pulisco la cartella di repackage [%s]...
pt: A limpar o directório de reempacotamento [%s]...
ro: Se curăță directorul de reîmpachetare [%s]...
sv: Rensar upp ompaketeringskatalogen [%s]...
tr: [%s] yeniden paketleme dizini temizleniyor...

source: %d file removed
cs: Odstraněno %d souborů
cy: Tynnwyd %d pecyn
es: se quitó un archivo
fi: %d tiedosto poistettu
gl: eliminouse %d ficheiro
he: הוסר קובץ %d
hu: %d fájl törölve
id: %d file dihapus
it: Files %d rimossi
pt: %d ficheiro removido
ro: fișierul %d este șters
sv: %d fil borttagen
tr: %d adet dosya kaldırıldı.

source: Spurious command-line arguments [%s]
cs: Špatné argumenty příkazové řádky [%s]
cy: Ymresymiadau llinell orchymyn annilys [%s]
da: Mærkelige kommandolinjeargumenter [%s]
es: Argumentos de línea de comandos erróneos [%s]
eu: Komando-lerro argumentu okerrak [%s]
fi: Virheellinen komentorivi [%s]
hu: Helytelen parancssori argumentumok [%s]
id: Argumen perintah-baris [%s]
is: Aukaleg viðföng í skipanalínu [%s]
it: Argomenti spuri nella riga di comando [%s]
nb: Ugyldige kommandolinjeargumenter [%s]
pl: Nieprawidłowe argumenty linii poleceń [%s]
pt: Argumentos de linha de comando inválidos [%s]
ro: Argumente linie comandă incorecte [%s]
sv: Felaktiga kommandorads argument [%s]
tr: Suni komut satırı argümanları [%s]

source: You can't specify --checkpoint and --rollback at the same time
cs: Není možné použít --checkpoint a --rollback zároveň
cy: Methu pennu --checkpoint a --rollback ar yr un pryd
da: Du kan ikke specificere --checkpoint og --rollback samtidigt
es: No puede especificar --checkpoint y --rollback a la vez
eu: Ezin dituzu --checkpoint eta --rollback aukerak batera deitu
fi: --checkpoint- ja --rollback -valitsimia ei voi käyttää yhtaikaa
gl: Non pode especificar --checkpoint e --rollback ó mesmo tempo
hu: A --checkpoint és a --rollback opció nem adható meg egyszerre
id: Anda tidak bisa menentukan --checkpoint dan --rollback pada waktu yang bersamaan
is: Þú getur ekki tilgreint --checkpoint og --rollback á sama tíma
it: Non puoi specificare --checkpoint e --rollback allo stesso tempo
nb: Du kan ikke bruke --checkpoint og --rollback samtidig.
pl: Nie można wybrać opcji --checkpoint i --rollback w tym samym czasie
pt: Não pode indicar --checkpoint e --rollback ao mesmo tempo
ro: Nu puteți specifica --checkpoint și --rollback simultan
sv: Du kan inte använda --checkpoint och --rollback på samma gång
tr: Aynı anda hem --rollback hem de --cehckpoint komutlarını belirleyemezsiniz.

source: You can't specify --checkpoint and --list at the same time
cs: Není možné použít --checkpoint a --list zároveň
cy: Methu pennu --checkpoint a --list ar yr un pryd
da: Du kan ikke specificere --checkpoint og --list samtidigt
es: No puede especificar --checkpoint y --list a la vez
eu: Ezin dituzu --checkpoint eta --list aukerak batera zehaztu
fi: --checkpoint- ja --list -valitsimia ei voi käyttää yhtaikaa
gl: Non pode especificar --checkpoint e --list ó mesmo tempo
hu: A --checkpoint és a --list opció nem adható meg egyszerre
id: Anda tidak bisa menentukan --checkpoint dan --list pada waktu yang bersamaan
is: Þú getur ekki tilgreint --checkpoint og --list á sama tíma
it: Non puoi specificare --checkpoint e --list allo stesso tempo
nb: Du kan ikke bruke --checkpoint og --list samtidig
pl: Nie można wybrać opcji --checkpoint i --list w tym samym czasie
pt: Não pode indicar --checkpoint e --list ao mesmo tempo
ro: Nu puteți specifica --checkpoint și --list simultan
sv: Du kan inte använda --checkpoint och --list på samma gång
tr: Aynı anda hem --checkpoint hem de --list komutlarını belirleyemezsiniz.

source: You can't specify --rollback and --list at the same time
cs: Není možné použít --list a --rollback zároveň
cy: Methu pennu --rollback a --list ar yr un pryd
da: Du kan ikke specificere --rollback og --list samtidigt
es: No puede especificar --rollback y --list a la vez
eu: Ezin dituzu --rollback eta --list aukerak batera zehaztu
fi: --rollback- ja --list -valitsimia ei voi käyttää yhtaikaa
gl: Non pode especificar --rollback e --list ó mesmo tempo
hu: A --rollback és a --list opció nem adható meg egyszerre
id: Anda tidak bisa menentukan --rollback dan --list pada waktu yang bersamaan
is: Þú getur ekki tilgreint --rollback og --list á sama tíma
it: Non puoi specificare --rollback e --list allo stesso tempo
nb: Du kan ikke bruke --rollback og --list samtidig
pl: Nie można wybrać opcji --rollback i --list w tym samym czasie
pt: Não pode indicar --rollback e --list ao mesmo tempo
ro: Nu puteți specifica --rollback și --list simultan
sv: Du kan inte använda --rollback och --list samtidigt
tr: Aynı anda hem --rollback hem de --list komutlarını belirleyemezsiniz.

source: You can't specify --disable along with another option
cs: Nemůžete požít --specify s jinou volbou
cy: Methu pennu --disable gyda dewis arall
da: Du kan ikke specificere --disable med andre valg
es: No puede especificar --disable junto con otra opción
eu: Ezin duzu --disable beste aukera batekin zehaztu
fi: --disable -valitsinta ei voi käyttää muiden valitsinten kanssa
gl: Non pode especificar --disable xunta con outra opción
hu: A --disable opció nem adható meg más opcióval együtt
id: Anda tidak bisa menentukan --disable bersama dengan opsi lain
is: Þú getur ekki tilgreint --disable með öðrum valkostum
it: Non puoi specificare --disable insieme ad una altra opzione
nb: Du kan ikke bruke --disable med andre valg
pl: Nie można wybrać opcji --disable z inną opcją
pt: Não pode indicar --disable com outra opção
ro: Nu puteți specifica --disable cu o altă opțiune
sv: Du kan inte använda --disable samtidigt som andra flaggor
tr: Diğer bir işlem süresince --disable komutu belirleyemezsiniz.

source: No transaction found since %s
cs: Nenalezeny žádné transakce od %s
cy: Dim trafodion ers %s
da: Ingen transaktion fundet siden %s
es: No se encontró transacción desde %s
eu: %s-tik ez da eragiketarik aurkitu
fi: Toimenpiteitä ei löydetty %s jälkeen
gl: Non se atoparon transaccións dende %s
hu: Nem található ez utáni tranzakció: %s
id: Tidak ada transaksi yang ditemukan semenjak %s
is: Engin færsla fundin síðan %s
it: Nessuna transazione trovata dopo %s
nb: Ingen transaksjon funnet siden %s
pl: Nie odnaleziono żadnej transakcji od %s
pt: Nenhuma transacção encontrada desde %s
ro: Nu sînt tranzacții începînd cu %s
sv: Ingen transaktion hittad sedan %s
tr: %s 'den beri bir işlem bulunmadı.

source: You must be superuser to do this
cs: Musíte být superuživatel
cy: Rhaid bod yn uwch-ddefnyddiwr i wneud hyn
da: Du skal være superbruger for at gøre dette
es: Debe ser el administrador para realizar esto
eu: Superrerabiltzailea izan behar zara hau egiteko
fi: Sinun pitää olla pääkäyttäjä tämän toiminnon suorittamiseksi
gl: Debe ser o superusuario para facer isto
hu: Ehhez rendszergazdai jogosultság szükséges
id: Anda harus pengguna root untuk melakukan hal ini
is: Þú verður að vera kerfisstjóri til að gera þetta
it: Devi essere superuser per fare questo
nb: Du må være superbruker for å gjøre dette
pl: Aby wykonać tą operację musisz być superużytkownikiem (root)
pt: Deve ser superutilizador para poder fazer isto
ro: Trebuie să fiți admistrator pentru această operație
sv: Du måste ha administratörsrättigheter för att göra detta
tr: Bunu yapabilmek için yetkili kullanıcı olmalısınız.

source: Writing rpm macros file [%s]...
cs: Zapisuji rpm makro soubor [%s]...
cy: Ysgrifennu ffeil macros rpm [%s]...
es: Escribiendo archivo rpm macros [%s] ...
fi: Kirjoitetaan rpm macros -tiedostoa [%s]...
gl: Escribindo o ficheiro de macros rpm [%s]...
hu: RPM-makrófájl írása [%s]...
id: Menulis file makro rpm [%s] ...
it: Scrivo il file delle macro rpm [%s]...
pt: A escrever os ficheiros macro rpm [%s]...
ro: Scriere fișier script rpm [%s]...
sv: Skriver rpm makro fil [%s]...
tr: [%s] rpm makro dosyası yazılıyor...

source: No rollback date found
cs: Nenalezen žádný bod návratu (checkpoint)
cy: Heb ganfod dyddiad rholio nôl
es: No se especificó fecha para «rollback»
fi: Palautuspäivämäärää ei löytynyt
hu: Visszagörgetési dátum nem található
id: Tidak ada tanggal mundur yang ditemukan
it: Nessuna data di rollback trovata
pt: Nenhuma data para voltar atrás encontrada
ro: Nu s-a găsit data restaurării
sv: Ingen återställningsdatum hittades
tr: Geri alma tarihi bulunamadı.

source: Rollback until %s...
cs: Vracíme se až do %s...
cy: Rholio nôl hyd %s...
da: Rul tilbage til %s...
es: Volver atrás hasta %s...
eu: Atzera bueltatu %s arte...
fi: Palautetaan tilanteeseen %s...
gl: Desfacer ata %s...
hu: Visszagörgetés eddig: %s...
id: Mundur hingga %s...
is: Snúa til baka að %s...
it: Rollback fino a %s...
nb: Hent tilbake til %s...
pl: Przywracanie stanu na dzień %s...
pt: Voltar atrás até %s...
ro: Restaurare pînă la %s...
sv: Återställ till %s...
tr: %s olana kadar geri al...

source: Disabling repackaging
cs: Deaktivovat přebalování
cy: Anablu ailbecynnu
es: Deshabilitando la regeneración
fi: Poistetaan uudelleenpaketointi käytöstä
hu: Újracsomagolás kikapcsolása
id: Menonaktifkan pemaketan ulang
it: Disabilito il repackaging
pt: A desactivar reempacotamento
ro: Reîmpachetare dezactivată
sv: Inaktiverar ompaketering
tr: Tekrar paketleme kapatılıyor

source: usage: urpmi.removemedia (-a | <name> ...) where <name> is a medium name to remove.
ast: usu: urpmi.removemedia (-a | <nome> ...) onde <nome> ye nome del mediu a desaniciar.
ca: sintaxi: urpmi.removemedia (-a | <nom> ...) on <nom> és el nom de la font a eliminar.
cs: použití: urpmi.removemedia (-a | <jméno> ...) kde <jméno> je název zdroje pro aktualizaci
cy: usage: urpmi.removemedia (-a | <name> ...) lle mai <name> yw'r enw cyfrwng i'w dynnu.
da: brug: urpmi.removemedia (-a | <navn> ...) hvor <navn> er et medie-navn der skal fjernes.
el: χρήση: urpmi.removemedia (-a | <όνομα> ...) όπου <όνομα> είναι ένα μέσο προς αφαίρεση.
es: uso: urpmi.removemedia (-a | <nombre> ...) donde <nombre> es nombre del soporte a borrar.
et: kasutamine: urpmi.removemedia (-a | <nimi> ...) kus <nimi> on eemaldatava andmekandja nimi.
eu: Erabilera: urpmi.removemedia (-a | <izena> ...) non <izena> kendu beharreko euskarri-izena den.
fi: Käyttö: urpmi.removemedia (-a | <nimi> ...), jossa <nimi> on poistettavan median nimi.
fr: Utilisation : urpmi.removemedia ([-a] | <nom> ...) où <nom> est le nom du média à retirer.
gl: uso: urpmi.removemedia (-a | <nome> ...) onde <nome> é o nome do soporte que se desexa eliminar.
hu: Használat: urpmi.removemedia (-a | <név> ...) ahol <név> az eltávolítandó adatforrás neve.
id: pemakaian: urpmi.removemedia (-a | <nama> ...) dimana <nama> adalah nama media yang akan dihapus.
is: notkun: urpmi.removemedia (-a | <nafn> ...) þar sem <nafn> er nafn á miðli sem á að fjarlægja.
it: uso: urpmi.removemedia (-a | <nome> ...) dove <nome> è il nome del supporto da rimuovere.
nb: Bruk: urpmi.removemedia (-a | <navn> … ) hvor <navn> er navn på mediet som skal fjernes.
nl: gebruik: urpmi.removemedia (-a | <naam> ...) waar <naam> een mediumnaam is die verwijderd moet worden.
nn: Bruk: urpmi.removemedia (-a | <namn> ...) der <namn> er namnet på mediet som skal fjernast.
pl: użycie: urpmi.removemedia (-a | <nazwa> ...) gdzie <nazwa> jest nazwą nośnika do usunięcia.
pt: uso: urpmi.removemedia (-a | <nome> ...) onde <nome> é um nome de média para remover.
pt_br: uso: urpmi.removemedia (-a | <nome> ...) onde <nome> é um nome de mídia para remover.
ro: Utilizare: urpmi.removemedia (-a | <nume>...) unde <nume> este numele mediului de înlăturat.
ru: использование: urpmi.removemedia (-a | <название> ...) где <название> - название удаляемого источника.
sl: uporaba: urpmi.removemedia (-a | <ime> …), kjer je <ime> ime vira za odstranitev.
sq: përdorim: urpmi.removemedia (-a | <emri> ...) ku <emri> është një burim për zhdukje.
sv: användning: urpmi.removemedia (-a | <namn>...) där <namn> är medianamnet som ska tas bort.
tr: kullanımı: urpmi.removemedia (-a | <isim> ...) <isim> kaldırılacak ortamın ismidir.

source: -a - select all media.
ast: -a - seleiciona tolos presos.
ca: -a - selecciona totes les fonts.
cs: -a - vybere všechna média
cy: -a - dewis pob cyfrwng.
da: -a - vælg alle medier.
el: -a - επιλογή όλων των μέσων.
es: -a - selecciona todos los soportes.
et: -a - valitakse kõik andmekandjad.
eu: -a - euskarri guztiak hautatzen ditu.
fi: -a - valitse kaikki mediat.
fr: -a - sélectionner tous les médias
gl: -a - selecciona tódolos soportes.
hu: -a - az összes adatforrás kijelölése
id: -a - pilih semua media.
is: -a - velja alla miðla.
it: -a - seleziona tutti i supporti.
nb: -a – velg alle medium.
nl: -a - alle media selecteren.
nn: -a – Vel alle medium.
pl: -a - wybiera wszystkie nośniki.
pt: -a - selecciona todas as médias.
pt_br: -a - seleciona todas as mídias.
ro: -a - selectează toate mediile.
ru: -a - выбрать все источники
sl: -a - izberi vse vire.
sq: -a - zgjidhi të gjitha burimet.
sv: -a - välj all media.
tr: -a - tüm kaynakları seçer.

source: -y - fuzzy match on media names.
ast: -y - coincidencia 'fuzzy' en nomes de preseos.
cs: -y - přibližná shoda v názvu zdroje
cy: -y - cydweddiad bras enwau cyfryngau
da: -y - upræcis matchning på medienavne.
el: -y - επιβάλει την αναζήτηση κατά προσέγγιση στα ονόματα των μέσων.
es: -y - coincidencia 'fuzzy' en nombres de soportes.
et: -y - andmekandjate ligilähedane sobivus.
eu: -y - parekatze lausoa euskarri izenetan.
fi: -y - täsmää epätarkasti medioiden nimiin.
fr: -y - imposer la recherche floue sur les noms de média.
gl: -y - coincidencia aproximada nos nomes dos soportes.
he: -y - זיהוי מקורב של שמות מקורות.
hu: -y - fuzzy keresés az adatforrásnevekben
id: -y - pencocokan fuzzy pada nama media.
is: -y - loðið val á nöfnum miðla.
it: -y - imponi una ricerca fuzzy sul nome dei supporti.
nb: -y – uklart treff på mediumnavn.
nl: -y - onprecies zoeken wat betreft medianamen.
nn: -y – Ikkje-ordrett søk på medienamn.
pl: -a - rozmyte dopasowanie nazw nośników.
pt: -y - correspondência aproximada nos nomes das médias.
pt_br: -y - seleciona mídias com nomes aproximados.
ro: -y - căutare aproximativă în numele mediilor.
ru: -y - нечёткое совпадение названий источников
sl: -y - ohlapno ujemanje z imeni virov.
sv: -y - fuzzy search på medianamn.
tr: -y - kurulum kaynağı isimleri üzerinde bulanık eşleşme.

source: Only superuser is allowed to remove media
ast: Namái'l superusuariu ta autorizáu pa estrayer medios
ca: El superusuari és l'únic autoritzat per a eliminar fonts
cs: Odstranit zdroj může pouze uživatel root
cy: Dim ond uwch ddefnyddiwr sy'n cael tynnu cyfrwng
da: Kun superbrugeren har lov til at fjerne medier
el: Μόνο ο διαχειριστής επιτρέπεται να αφαιρεί μέσα
es: Sólo el superusuario está autorizado a quitar soportes
et: Andmekandjaid võib eemaldada ainult administraator
eu: Supererabiltzaileak soilik dauka euskarriak ezabatzeko baimena
fi: Vain pääkäyttäjä voi poistaa median
fr: Seul l'administrateur système (root) peut supprimer un média
gl: Só o superusuario pode eliminar soportes
he: רק מנהל מערכת מורשה להסיר מקור תוכנה
hu: Adatforrás eltávolításához rendszergazdai jogosultság szükséges
id: Hanya superuser yang diijinkan menghapus media
is: Aðeins kerfisstjórar hafa leyfi til að fjarlægja miðil
it: Solo superuser può rimuovere i supporti
nb: Bare superbruker har adgang til å fjerne medium
nl: Alleen de beheerder mag media verwijderen
nn: Berre superbrukaren kan fjerna medium.
pl: Tylko administrator ma prawo usuwać nośniki
pt: Apenas o superutilizador pode remover as médias
pt_br: Apenas super usuário tem permissão para remover mídias
ro: Doar administratorul poate înlătura mediile
ru: Удалять источники разрешено только суперпользователю
sl: Samo naduporabnik lahko odstrani vir(e)
sv: Endast systemadministratör får ta bort media
tr: Paketleri kurmak için sadece sistem yöneticisi yetkilidir
