Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --test - verify if the removal can be achieved correctly.
ast: --test - verificar si puede llevase a cabo correuctamante'l desaniciu.
ca: --test - verifica si l'eliminació pot ser duta a terme.
cs: --test - zkontrolovat, zda lze dokončit odstranění správně
cy: --test - gwirio os oes modd tynnu'n iawn.
da: --test - afprøv om fjernelsen kan udføres korrekt.
el: --test - επαλήθευση ότι η αφαίρεση μπορεί να επιτευχθεί σωστά.
es: --test - verificar si la desinstalación se puede llevar a cabo correctamente.
et: --test - kontrollitakse, kas eemaldamine on korrektselt võimalik.
eu: --test - ezabaketa egokiro egin daitekeen egiaztatzen du.
fi: --test - testaa, voidaanko poistaminen suorittaa onnistuneesti.
fr: --test - vérifier si la désinstallation peut être achevée correctement.
gl: --test - verifica se a eliminación se pode facer de xeito correcto.
he: --test - בדיקה האם הסרת החבילה יכולה להסתיים בהצלחה.
hu: --test - annak ellenőrzése, hogy az eltávolítás végrehajtható-e
id: --test - pastikan apakah penghapusan bisa dilakukan dengan benar.
is: --test - staðfesta að hægt sé að fjarlægja umbeðna pakka.
it: --test - verifica se la rimozione può avvenire correttamente.
nb: --test – kontroller at fjerning vil fungere.
nl: --test - verifiëren dat de verwijdering correct uitgevoerd kan worden.
nn: --test – Kontroller at fjerninga kan fungera.
pl: --test - sprawdza, czy instalacja zostanie przeprowadzona prawidłowo.
pt: --test - verifica se a remoção pode ser conseguida correctamente.
pt_br: --test - verifica se a remoção pode ser feita corretamente.
ro: --test - verifică dacă înlăturarea poate fi îndeplinită corect.
ru: --test - проверить возможность корректного удаления
sl: --test - preveri, če je možna pravilna odstranitev.
sv: --test - verifiera om borttagningen kan utföras korrekt.
tr: --test - kurulumun başarılı olup olmayacağını doğrula.

source: --parallel - distributed urpmi across machines of alias.
ca: --parallel - urpmi distribuït pels ordinadors de l'àlias.
cs: --parallel - distribuovaný program urpmi na počítačích s přezdívkou
cy: --parallel - urpmi wedi ei ddosbarthu ar draws beiriannau eraill.
da: --parallel - distribueret urpmi over maskiner med alias.
el: --parallel - διανεμημένα urpmi κατά μήκος των μηχανών με ψευδώνυμα.
es: --parallel - urpmi distribuido entre máquinas de alias.
et: --parallel - jagatud urpmi käivitamine üle mitme aliasega määratud masina.
eu: --parallel - urpmi banatzen du alias-makinen artean.
fi: --parallel - urpmi-toiminnot useille määritellyille koneille.
fr: --parallel - urpmi distribué sur plusieurs machines de l'alias.
he: --parallel - הפעלה מבוזרת מול מספר מכונות שתוכנן זהה.
hu: --parallel - elosztott urpmi több számítógép közt
id: --parallel - urpmi tersebar di antara mesin-mesin alias.
is: --parallel - dreifð urpmi yfir samnefndar vélar.
it: --parallel - urpmi distribuito fra varie macchine dell'alias.
nb: --parallel – distribuert urpmi over maskiner med alias.
nl: --parallel - gedistribueerde urpmi over computers van alias.
nn: --parallel – Distribuert urpmi over maskiner med alias.
pl: --parallel - rozproszone urpmi z użyciem komputerów aliasu.
pt: --parallel - urpmi distribuído através das máquinas dos apelidos.
pt_br: --parallel - urpmi distribuído.
ro: --parallel - urpmi distribuit între mașinile de alias.
ru: --parallel - распределённое выполнение urpmi через машины алиаса
sl: --parallel - porazdeljen urpmi po napravah z vzdevki.
sq: --parallel - urmpi është i shpërndarë në pseudo makina të shumëta.
sv: --parallel - distribuerad urpmi över alla maskiner med alias.
tr: --parallel - benzer makineler arasında dağıtılmış urpmi.

source: --repackage - Re-package the files before erasing
cs: --repackage - Před smazáním soubory znovu zabalí
cy: --repackage - Ailbecynnu'r ffeiliau cyn eu dileu
da: --repackage - Ompak filer før sletning
es: --repackage - Volver a empaquetar los archivos antes de borrar
eu: --repackage - fitxategiak bir-paketatu ezabatu aurretik
fi: --repackage - paketoi tiedostot uudelleen ennen poistamista.
he: --repackage - אריזה מחדש של הקובץ לפני מחיקה
hu: --repackage - a fájlok újracsomagolása törlés előtt
id: --repackage - Paket ulang file sebelum menghapus
is: --repackage - Endur-pakka skrám áður en eytt
it: --repackage - Ri-pacchetta i file prima della cancellazione.
nb: --repackage – pakk om filer før sletting
pl: --repackage - przebuduj pakiet przed usunięciem
pt: --repackage - Empacota novamente os ficheiros antes de os apagar
ro: --repackage - reîmpachetează fișierele înaintea ștergerii
sv: --repackage - ompaketera filerna före avinstallation
tr: --repackage - Paketleri silmeden önce yeniden paketle.

source: --root - use another root for rpm removal.
ast: --root - usar otru raigañu pa la desinstalación de rpm.
ca: --root - usa una altre arrel per l'eliminació de rpm.
cs: --root - použít pro odebrání balíčků jiný kořenový adresář
cy: --root - defnyddio root arall ar gyfer tynnu rpm.
da: --root - brug en anden root for rpm-fjernelse.
el: --root - χρήση διαφορετικής διαδρομής root για την αφαίρεση rpm.
es: --root - usar otra raíz para la desinstalación de rpm.
et: --root - muu baasi kasutamine RPM-ide eemaldamisel.
eu: --root - beste root bat erabiltzen du rpm ezabaketarako.
fi: --root - käytä määriteltyä juurta rpm-paketin poistamiseen.
fr: --root - utiliser un autre répertoire racine pour la désinstallation.
gl: --root - usar outra raíz para a eliminación de rpms.
he: --root - שימוש בשורש אחר לצורך הסרת חבילות תוכנה.
hu: --root - másik gyökér használata az RPM-csomageltávolításhoz
id: --root - gunakan root lain untuk penghapusan rpm.
is: --root - nota aðra rót til að fjarlægja rpm.
it: --root - usa un'altra directory root per rimuovere i file rpm.
nb: --root – bruk annen rot for rpm-fjerning.
nl: --root - gebruik andere hoofdmap (root) voor rpm-verwijdering.
nn: --root – Bruka anna rot for rpm-fjerning.
pl: --root - używa innego katalogu głównego do usunięcia rpm.
pt: --root - usa outra raíz para a remoção dos rpm.
pt_br: --root - use outro root para desisntalação de rpm.
ro: --root - utilizează alt administrator pentru înlăturarea pachetelor.
ru: --root - использовать другой корень для удаления rpm-файлов
sl: --root - uporabi drugo korensko mapo za odstranitev paketov rpm.
sq: --root - përdorni një root tjetër për heqjen e rpm.
sv: --root - använd en annan root för att ta bort rpm .
tr: --root - rpm kaldırma için bir başka kök kullanıcı kullan.

source: --urpmi-root - use another root for urpmi db & rpm installation.
ast: --urpmi-root - usar otru raigañu pa la instalación de rpm y la base de datos d'urpmi.
cs: --urpmi-root - použít jiný kořenový adresář pro instalaci balíčků rpm a databázi urpmi
cy: --urpmi-root - defnyddio root arall ar gyfer gosod urpmi db ac rpm.
da: --urpmi-root - Brug anden rod for urpmi-database og rpm-installering.
el: --urpmi-root - χρήση μίας άλλης διαδρομής root για τη βάση δεδομένων urpmi & την εγκατάσταση του rpm.
es: --urpmi-root - usar otra raíz para la instalación de rpm y la base de datos de urpmi.
et: --urpmi-root - muu baasi kasutamine urpmi andmebaasi jaoks ja RPM-ide paigaldamisel.
eu: --urpmi-root - erabili beste erro bat urpmi db eta rpm instalatzeko.
fi: --urpmi-root - käytä määriteltyä juurta urpmi-tietokannalle ja rpm-pakettien asentamiseen.
fr: --urpmi-root - utiliser un autre répertoire racine pour l'installation et la base de donnée urpmi.
gl: --urpmi-root - usar outra raíz para a base de datos de urpmi e a instalación de rpms.
he: --urpmi-root - השתמש בשורש מערכת קבצים אחר ל-urpmi db והתקנת rpm
hu: --urpmi-root - másik gyökér használata az Urpmi-adatbázishoz és az RPM-csomagtelepítéshez
id: --urpmi-root - gunakan root lain untuk installasi db urpmi & rpm.
is: --urpmi-root - nota aðra rót fyrir urpmi gagnagrunn og rpm uppsetningu.
it: --root - cambia la directory radice per installare i file rpm e per il db di urpmi.
nb: --urpmi-root – bruk annen rot for urpmi-database og rpm-installering.
nl: --urpmi-root - gebruik andere hoofdmap (root) voor urpmi db & rpm-installatie.
nn: --urpmi-root – Bruk anna rot for urpmi-database og rpm-installering.
pl: --urpmi-root - używa innego katalogu głównego bazy danych urpmi i instalacji rpm.
pt: --urpmi-root - usa outra raíz para base de dados urpmi e instalação rpm.
pt_br: --urpmi-root - use outro root para o urpmi e instalação rpm.
ro: --urpmi-root - utilizează alt administrator pentru urpmi db și instalarea de pachete.
ru: --root-root - использовать другой корень для базы данных urpmi и установки пакетов
sl: --urpmi-root - uporabi drugo korensko mapo za podatkovno zbirko urpmi in namestitev rpm.
sv: --urpmi-root - använd en annan rot för db & rpm installation.
tr: --urpmi-root - urpmi veritabanı ve rpm kurulumu için bir başka kök kullan.

source: --justdb - update only the rpm db, not the filesystem.
ast: --justdb - anovar namái la BD de rpm, non el sistema de ficheros.
cs: --justdb - aktualizovat pouze databázi RPM, ne souborový systém
cy: --justdb - diweddaru'n unig db yr rpm, nid y system ffeilio.
da: --justdb - opdatér kun rpm-databasen, og ikke filsystemet.
el: --justdb - ενημέρωση της βάσης rpm αλλά όχι το σύστημα αρχείων.
es: --justdb - actualizar sólo la BD de rpm, no el sistema de archivos.
et: --justdb - uuendab ainult RPM-ide andmebaasi, mitte failisüsteemi.
eu: --justdb - eguneratu soilik rpm db, ez fitxategi-sistema.
fi: --justdb - päivitä ainoastaan rpm-tietokanta, älä tiedostojärjestelmää.
fr: --justdb - mettre à jour la base rpm mais pas le système de fichiers.
gl: --justdb - actualizar só a base de datos de rpm, non o sistema de ficheiros.
hu: --justdb - csak az RPM-adatbázis legyen frissítve, a fájlrendszer ne
is: --justdb - uppfæra aðeins rpm gagnagrunn, ekki skráakerfið.
it: --update - aggiorna solo il DB degli rpm, non il filesystem.
nb: --justdb – bare oppdater rpm-databasen, og ikke filsystemet.
nl: --justdb - ververs alleen de rpm-db, niet het bestandssysteem.
nn: --justdb – Berre oppdater rpm-databasen, og ikkje filsystemet.
pl: --justdb - aktualizuj tylko bazę rpm, a nie system plików.
pt: --justdb - actualiza apenas a base de dados rpm, não o sistema de ficheiros.
pt_br: --justdb - atualiza somente a base rpm, não o sistema de arquivos.
ro: --justdb - se actualizează doar rpm db, nu și sistemul de fișiere.
ru: --justdb - обновить базу данных, но не изменять файловую систему
sl: --justdb - posodobi samo podatkovno zbirko rpm, brez datotečnega sistema.
sv: --justdb - updatera endast rpm db, inte filsystemet
tr: --justdb - sadece rpm veritabanını güncelle, dosya sistemini değil.

source: --noscripts - do not execute package scriptlet(s).
ast: --noscripts - nun executar los scriptlets del paquete.
cs: --noscripts - nespustí skriptlet(y) balíčku
cy: --noscripts - peidio gweithredu sgriptledi'r pecyn(au).
da: --noscripts - udfør ikke pakke-småskripter.
el: --noscripts - να μην εκτελεστούν τα scripts απεγκατάστασης.
es: --noscripts - no ejecutar los scriptlets del paquete.
et: --noscripts - pakettide skripte ei käivitata.
eu: --noscripts - ez du scriptlet(s) paketea exekutatzen
fi: --noscripts - älä suorita pakettien komentosarjoja.
fr: --noscripts - ne pas exécuter les scripts de désinstallation.
he: --noscripts - אל תפעיל תסריטונים של החבילה.
hu: --noscripts - a csomagok szkriptjei ne legyenek végrehajtva
id: --noscripts - tidak menjalankan script paket.
is: --noscripts - ekki keyra uppsetninga-skriftur í pakka.
it: --noscripts - non esegue gli script presenti nei pacchetti.
nb: --noscripts – ikke kjør pakkeskript.
nl: --noscripts - de pakketscriptlet(s) niet uitvoeren.
nn: --noscripts – Ikkje køyr pakkeskript.
pl: --noscripts - nie uruchamiaj skryptów pakietu.
pt: --noscripts - não executa o(s) script(s) do pacote.
pt_br: --noscripts - não executa script(s) dos pacotes.
ro: --noscripts - nu se execută scripturile suplimentare ale pachetului.
ru: --noscripts - не выполнять scriptlet'ы пакета
sl: --noscripts - ne izvedi paketnih mini-skript.
sv: --noscripts - kör inga skript i paket(en).
tr: --noscripts - paket betiklerini çalıştıma.

source: --use-distrib - configure urpme on the fly from a distrib tree, useful to (un)install a chroot with --root option.
ast: --use-distrib - configurar urpme al vuelu dende un árbol de distribución, útil pa (des)instalar un chroot cola opción --root.
cs: --use-distrib - nastavit urpme za provozu ze stromu distribuce, užitečné při (od)instalaci chroot s volbou --root
cy: --use-distrib - ffurfweddu urpmi wrth fynd o goeden distrib, defnyddiol wrth (ddad)osod chroot gyda dewis --root.
da: --use-distrib - konfigurér urpme løbende fra et distrib træ, nyttigt til at (af)installere en chroot med root-tilvalget.
el: --use-distrib - ρύθμιση urpme απευθείας από ένα δέντρο διανομής, χρήσιμο για την (απ)εγκατάσταση ενός chroot με την --root επιλογή.
es: --use-distrib - configurar urpme al vuelo desde un árbol de distribución, útil para (des)instalar un chroot con la opción --root.
et: --use-distrib - seadistab urpme lennult distributsioonipuu põhjal, kasulik chroot paigaldamiseks/eemaldamiseks võtmega --root.
eu: --use-distrib - urpme berehala konfiguratzen du distrib zuhaitzetik, erabilgarria chroot --root aukerarekin (des)instalatzeko.
fi: --use-distrib - aseta urpmi automaattisesti jakelun puusta, hyödyllinen asennettaessa juuri käyttäen valitsinta --root.
fr: --use-distrib - configurer urpmi à la volée d'après l'arbre d'une distribution, utile pour (dés)installer un chroot avec l'option --root.
he: --use-distrib - הגדרת urpme בזמן ריצה לפי עץ ההפצה, שימושי להוסיף/להסיר מערכת chroot עם האפשרות --root.
hu: --use-distrib - az urpme menet közben való beállítása egy disztribúciós fából - például chroot telepítéséhez/eltávolításához használható a --root opció esetén
id: --use-distrib - konfigurasikan urpme secara langsung dari pohon distrib, berguna untuk meng(un)install chroot dengan opsi --root.
is: --use-distrib - stilla urpme frá dreifingartrénu, gott að nota til að setja inn/fjarlægja chroot með --root valkostinum.
it: --use-distrib - configura urpme "al volo" da un albero distribuito, utile per (dis)installare un pacchetto chroot con l'opzione --root.
nb: --use-distrib – sett opp urpme direkte fra et distrib-tre. nyttig for å (av)installere en chroot med --root-valget.
nl: --use-distrib - urpme dynamisch configureren vanuit distrib-boom, handig om een chroot te (de)installeren met de --root optie.
nn: --use-distrib – Set opp urpme direkte frå eit «distrib»-tre. Nyttig for å (av)installera ei «chroot» med «--root»-valet.
pl: --use-distrib - konfiguruje urpmi w locie z drzewa dystrybucyjnego, użyteczne przy (od)instalowywaniu chroot z opcją --root.
pt: --use-distrib - configura o urpme rapidamente de uma árvore de distribuição, é útil para (des)instalar um chroot com opção --root.
pt_br: --use-distrib - configura o urpme na hora a partir de uma árvore, útil para (des)instalar um chroot com a opção --root.
ro: --use-distrib - configurează din mers urpme dintr-un arbore de distribuție, utilă pentru (dez)instalarea chroot cu opțiunea --root .
ru: --use-distrib - настроить urpme на лету из дерева distrib; полезно для установки/удаления в/из chroot с параметром --root
sl: --use-distrib - sproti nastavi urpme iz distrib. drevesa, uporabno je za namestitev ali odstranitev chroot z možnostjo --root.
sv: --use-distrib - konfigurera urpmi 'on the fly' från ett distributionsträd, användbart vid (av)installation av chroot med --root option.
tr: --use-distrib - urpme'yi bir dağıtım ağacından ayarla. Bir "chroot"u, --root seçeneğiyle (kur/kaldır)mak için yararlıdır.

source: --verbose, -v - verbose mode.
ast: --verbose, -v - mou informativu.
ca: --verbose, -v - mode detallat.
cs: --verbose, -v - užvaněný režim
cy: --verbose, -v - modd llafar.
da: --verbose, -v - udførlig tilstand.
el: --verbose, -v - αναλυτική λειτουργία.
es: --verbose, -v - modo informativo.
et: --verbose, -v - selgitav režiim.
eu: --verbose, -v - modu berritsua.
fi: --verbose, -v - yksityiskohtainen tyyli.
fr: --verbose, -v - mode verbeux.
gl: --verbose, -v - modo detallado.
hu: --verbose, -v - részletes információ
id: --verbose, -v - mode verbose.
is: --verbose, -v - ítarlegri hamur.
it: --verbose, -v - modalità prolissa.
nb: --verbose, -v – utvidede meldinger.
nl: --verbose, -v - 'uitgebreid verslag'-modus.
nn: --verbose, -v – Utvida meldingar.
pl: --verbose, -v - tryb komunikatywny.
pt: --verbose, -v - modo detalhado.
pt_br: --verbose, -v - modo detalhado.
ro: --verbose , -v - mod detaliat.
ru: --verbose, -v - подробный режим
sl: --verbose, -v - zgovoren način.
sv: --verbose, -v - utförligt läge.
tr: --verbose, -v - kalabalık kipi.

source: -a - select all packages matching expression.
ast: -a - seleiciona tolos paquetes que concasen cola espresión.
ca: -a - selecciona tots els paquets que coincideixen amb l'expressió.
cs: -a - vybere všechny balíčky vyhovující výrazu
da: -a - vælg alle pakker matchende udtryk.
el: -a - επιλογή όλων των πακέτων που ταιριάζουν με την έκφραση.
es: -a - selecciona todas los paquetes que coincidan con la expresión.
et: -a - valib kõik käsureaga sobivad paketid.
eu: -a - pakete denak hautatzen ditu bat datozen adierazpenak kontuan hartuz.
fi: -a - valitse kaikki hakulausekkeeseen täsmäävät.
fr: -a - sélectionner tous les paquetages correspondants à l'expression.
gl: -a - selecciona tódolos paquetes que concordan ca expresión.
he: -a - בחירת כל החבילות עם ביטוי מתאים.
hu: -a - a mintára illeszkedő csomagok kijelölése
id: -a - pilih semua paket yang cocok dengan ekspresi.
is: -a - velja alla pakka sem passa við segð.
it: -a - seleziona tutti i pacchetti che soddisfano l'espressione.
nb: -a – velg alle pakker som stemmer med uttrykket.
nl: -a - selecteer alle pakketten die overeenkomen met de expressie.
nn: -a – Vel alle pakkar som samsvarer med uttrykket.
pl: -a - wybiera wszystkie pasujące pakiety.
pt: -a - selecciona todos os pacotes correspondentes à expressão.
pt_br: -a - seleciona todos os pacotes que combinam com a expressão.
ro: -a - selectează toate pachetele ce se potrivesc cu expresia.
ru: -a - выбрать все пакеты, удовлетворяющие выражению
sl: -a - izberi vse pakete ki ustrezajo izrazu.
sq: -a - zgjedhni të gjitha pakot me përshkrim të njëjtë.
sv: -a - välj alla paket som matchar uttryck.
tr: -a - ifadeye uyan tüm paketleri seçer.

source: Only superuser is allowed to remove packages
ast: Sólo'l superusuariu ta autorizáu a desaniciar paquetes
ca: El superusuari és l'únic autoritzat per a eliminar paquets
cs: Odstranit balíčky může pouze uživatel root
cy: Dim ond uwch ddefnyddiwr sy'n cael tynnu pecynnau
da: Kun superbrugeren har lov til at fjerne pakker
el: Μόνο ο διαχειριστής επιτρέπεται να αφαιρέσει πακέτα
es: Sólo el superusuario está autorizado a quitar paquetes
et: Tarkvara võib eemaldada ainult administraator
eu: Supererabiltzaileak soilik dauka paketeak ezabatzeko baimena
fi: Vain pääkäyttäjä voi poistaa paketteja
fr: Seul l'administrateur système (root) peut supprimer des paquetages
gl: Só o superusuario pode eliminar paquetes
he: רק מנהל מערכת מורשה להסיר חבילות תוכנה
hu: Csomagok eltávolításához rendszergazdai jogosultság szükséges
id: Hanya superuser yang diperbolehkan menghapus paket
is: Aðeins kerfisstjóri hefur leyfi til að fjarlægja pakka
it: Solo superuser può rimuovere pacchetti
nb: Bare superbruker har adgang til å fjerne pakker.
nl: Alleen de beheerder mag media verwijderen
nn: Berre superbrukaren kan fjerna pakkar.
pl: Tylko administrator ma prawo usuwać pakiety
pt: Apenas o administrador tem permissão para remover os pacotes
pt_br: Apenas super usuário tem permissão para remover programas
ro: Doar administratorul poate înlătura pachete
ru: Только суперпользователю разрешается удалять пакеты
sl: Samo naduporabniku je dovoljeno odstranjevanje paketov
sv: Endast systemadministratör får ta bort paket
tr: Paketleri kaldırmak için sadece sistem yöneticisi yetkilidir

source: unknown packages
ast: paquetes desconocíos
ca: paquets desconeguts
cs: neznámé balíčky
cy: pecynnau anhysbys
da: ukendte pakker
el: άγνωστα πακέτα
es: paquetes desconocidos
et: tundmatud paketid
eu: pakete ezezagunak
fi: tuntemattomia paketteja
fr: paquetages inconnus
gl: paquetes descoñecidos
he: חבילות לא מוכרות
hu: ismeretlen csomagok
id: paket tidak dikenal
is: óþekktir pakkar
it: pacchetti sconosciuti
nb: ukjente pakker
nl: onbekende pakketten
nn: Ukjende pakkar
pl: nieznane pakiety
pt: pacotes desconhecidos
pt_br: pacotes desconhecidos
ro: pachete necunoscute
ru: неизвестные пакеты
sl: neznani paketi
sq: pako të pa njoftura
sv: okända paket
tr: bilinmeyen paketler

source: unknown package
ast: paquete desconocíu
ca: paquet desconegut
cs: neznámý balíček
cy: pecyn anhysbys
da: ukendt pakke
el: άγνωστο πακέτο
es: paquete desconocido
et: tundmatu pakett
eu: pakete ezezaguna
fi: tuntematon paketti
fr: paquetage inconnu
gl: paquete descoñecido
he: חבילה לא מוכרת
hu: ismeretlen csomag
id: paket tidak dikenal
is: Óþekktur pakki
it: pacchetto sconosciuto
nb: ukjent pakke
nl: onbekend pakket
nn: Ukjend pakke
pl: nieznany pakiet
pt: pacote desconhecido
pt_br: pacote desconhecido.
ro: pachet necunoscut
ru: неизвестный пакет
sl: neznan paket
sq: pako e pa njoftur
sv: okänt paket
tr: bilinmeyen paket

source: Removing the following package will break your system:
ast: Desaniciar el paquete siguiente frayará'l sistema:
cs: Odebrání následujícího balíčku naruší funkčnost vašeho systému:
cy: Bydd tynnu pecyn canlynol yn torri eich system:
da: Fjernelse af den følgende pakke vil skade dit system:
el: Η αφαίρεση του παρακάτω πακέτου θα καταστρέψει το σύστημά σας:
es: Quitar el paquete siguiente dañará su sistema:
et: Järgmise paketi eemaldamine halvab Teie süsteemi:
eu: Ondoko paketea kentzeak zure sistema apurtuko du:
fi: Seuraavan paketin poistaminen rikkoo järjestelmän:
fr: La désinstallation du paquetage suivant rendra votre système instable
hu: Az alábbi csomag eltávolítása tönkreteheti a rendszert:
is: Ef eftirfarandi pakki er fjarlægður raskast uppsetning kerfisins:
it: la rimozione del seguente pacchetto comprometterà il sistema:
nb: Fjerning av den følgende pakka vil ødelegge systemet ditt:
nl: Het verwijderen van het volgende pakket zal uw systeem verstoren:
nn: Du vil øydeleggja systemet viss du fjernar denne pakken:
pl: Usunięcie poniższego pakietu spowoduje uszkodzenie systemu:
pt: A remoção do seguinte pacote irá danificar o seu sistema:
pt_br: A remoção do pacote irá danificar o seu sistema:
ro: Înlăturarea următorului pachet va corupe sistemul:
ru: Удаление следующего пакета повредит Вашу систему:
sl: Odstranitev tega paketa bo pokvarila vaš sistem:
sv: Borttagning av följande paket skulle förstöra systemet:
tr: Aşağıdaki paketlerin kaldırılması sisteminizi çökertecektir.

source: Nothing to remove
ast: Ensin res que desaniciar
ca: Res a eliminar
cs: Není co odebrat
cy: Dim i'w dynnu
da: Ingenting at fjerne
el: Τίποτα προς αφαίρεση
es: Nada que quitar
et: Pole midagi eemaldada
eu: Ez dago ezer kentzeko
fi: Ei mitään poistettavaa
fr: Rien à désinstaller
gl: Non hai nada que eliminar
he: אין מה להסיר
hu: Nincs mit eltávolítani
id: Tidak ada yang dihapus
is: Ekkert til að fjarlægja
it: Nulla da rimuovere
nb: Ingenting å fjerne
nl: Niets te verwijderen
nn: Ingenting å fjerna.
pl: Brak elementów do usunięcia
pt: Nada a remover
pt_br: Nada para remover
ro: Nimic de înlăturat
ru: Нечего удалять
sl: Noben paket ni označen za odstranitev
sq: Mos zhduk asgjë
sv: Ingenting att ta bort
tr: Kaldırılacak bir şey yok
