Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: Packages %s are already installed
ast: Los paquetes %s yá tán instalaos
ca: Els paquets %s ja estan instal·lats
cs: Balíčky %s jsou již nainstalovány
cy: Pecynnau %s wedi eu gosod eisoes
da: Pakkerne %s er allerede installerede
el: Τα πακέτα %s είναι ήδη εγκατεστημένα
es: Los paquetes %s ya están instalados
et: Paketid %s on juba paigaldatud
eu: %s paketeak dagoeneko instalatuta daude
fi: Paketit %s ovat jo asennettu
fr: Les paquetages %s sont déjà installés
gl: Os paquetes %s xa están instalados
he: החבילות %s כבר מותקנות
hu: A(z) "%s" csomagok már telepítve vannak
id: Paket-paket %s telah terinstal
is: Pakkar %s eru nú þegar komnir inn
it: I pacchetti %s sono già installati
nb: Pakkene %s er allerede installerte.
nl: De pakketten %s zijn reeds geïnstalleerd
nn: Pakkane «%s» er alt installerte.
pl: Pakiet %s jest już zainstalowany w systemie
pt: Os pacote %s já se encontram instalados
pt_br: Pacotes %s já estão instalados
ro: Pachetele %s sînt deja instalate
ru: Пакеты %s уже установлен
sl: Paketi %s so že nameščeni
sv: Paketen %s är redan installerade
tr: %s paketleri kurulu

source: due to conflicts with %s
ast: debío a conflictos con %s
ca: degut a conflictes amb %s
cs: z důvodu konfliktů s %s
cy: oherwydd gwrthdaro gyda %s
da: grundet modstrid med %s
el: λόγω συγκρούσεων με το %s
es: debido a conflictos con %s
et: konflikti tõttu paketiga %s
eu: %s(r)ekin gatazkak daudelako
fi: johtuen ristiriidasta %s kanssa
fr: en raison de conflit avec %s
gl: debido a conflictos con %s
he: עקב התנגשות עם %s
hu: ezzel való ütközés miatt: "%s"
id: karena konflik dengan %s
is: vegna árekstra við %s
it: per conflitti con %s
nb: på grunn av konflikter med «%s»
nl: vanwege conflicten met %s
nn: på grunn av konfliktar med «%s»
pl: z powodu kolizji z pakietem %s
pt: devido a conflitos com %s
pt_br: devido a conflitos com %s
ro: datorită conflictelor cu %s
ru: из-за конфликтов с %s
sl: zaradi konfliktov z/s %s
sq: ka arritur gjatë konflikteve me %s
sv: på grund av konflikter med %s
tr: %s paketi ile çelişkisinden

source: due to unsatisfied %s
ast: debío a que nun ta satisfecho %s
ca: degut a %s no satisfetes
cs: z důvodu nesplněného %s
cy: %s heb ei foddloni
da: grundet uopfyldt %s
el: λόγω μη ικανοποίησης του %s
es: debido a que no se satisfizo %s
et: rahuldamata %s tõttu
eu: %s bete gabe dagoelako
fi: täyttämättömän %s vuoksi
fr: car %s est non satisfait
gl: debido a %s non satisfeitas
he: עקב תלות %s שלא מולאה
hu: "%s" igényei miatt
id: karena %s tidak terpenuhi
is: vegna óuppfylltra %s
it: perché non è soddisfatto %s
nb: grunnet utilfredsstilt %s
nl: vanwege onvoldane %s
nn: då «%s» ikkje er tilfredsstilt
pl: z powodu niesatysfakcjonującego pakietu %s
pt: devido a não satisfazer %s
pt_br: devido a estar faltando %s
ro: datorită dependenței nesatisfăcute %s
ru: из-за неудовлетворённости %s
sl: zaradi neizpolnjene odvisnosti %s
sq: ka arritur gjatë mosmarrëveshjes %s
sv: på grund av otillräckliga %s
tr: %s paketinden dolayı yetersiz

source: trying to promote %s
ast: intentando promover %s
ca: s'està intentant promoure %s
cs: pokouším se postoupit %s
cy: ceisio hybu %s
da: prøver at fremme %s
el: προσπάθεια ενίσχυσης του %s
es: intentando promover %s
et: püüdes välja pakkuda %s
eu: %s jaso nahian
fi: yritettäessä täyttää riippuvuus %s
fr: Tentative de promouvoir %s
gl: tratando de promover %s
he: מנסה לקדם %s
hu: a legalkalmasabb "%s" keresése
id: mencoba mempromosikan %s
is: þegar reynt var að setja upp %s
it: sto selezionando %s
nb: prøver å fremme %s
nl: probeer %s op te waarderen
nn: Prøver å prioritera «%s»
pl: próba ulepszenia %s
pt: a tentar promover %s
pt_br: tentando promover %s
ro: se încearcă promovarea lui %s
ru: попытка активизировать %s
sl: poskus podpiranja %s
sq: tentim në gradimin e %s
sv: försöker befordra %s
tr: %s yükseltilmeye çalışılıyor.

source: in order to keep %s
ast: pa caltener %s
ca: per tal de mantenir %s
cs: aby bylo možné zachovat %s
cy: fel modd i gadw %s
da: for at kunne beholde %s
el: για να κρατηθεί το %s
es: para mantener %s
et: säilitamaks %s
eu: %s gordetzeko
fi: %s säilyttämiseksi
fr: afin de garder %s
gl: para manter %s
he: בכדי לשמור %s
hu: "%s" megtartása érdekében
id: untuk menjaga %s
is: til þess að halda %s
it: per conservare %s
nb: for å kunne beholde %s
nl: Om %s te behouden
nn: for å kunna behalda «%s»
pl: w celu zachowania pakietu %s
pt: para poder manter %s
pt_br: para manter %s
ro: pentru a păstra %s
ru: чтобы сохранить %s
sl: za ohranitev %s
sq: në urdhër për ta mbajturë %s
sv: för att behålla %s
tr: %s 'in tutulması sırasında

source: The following package has to be removed for others to be upgraded: %s
ast: Tien de desaniciase'l paquete siguiente pa poder anovar otros: %s
ca: El paquets següent s'ha d'eliminar per poder actualitzar uns altres: %s
cs: Následující balíček musí být odstraněn, aby bylo možné jiné aktualizovat: %s
cy: Rhaid i'r pecyn canlynol gael ei dynnu i eraill gael eu diweddaru. %s
da: Den følgende pakke skal fjernes for at andre kan opgraderes: %s
el: Το παρακάτω πακέτο πρέπει να αφαιρεθεί για να αναβαθμιστούν κάποια άλλα: %s
es: Se tiene que quitar el paquete siguiente para poder actualizar otros: %s
et: Teiste uuendamiseks tuleb eemaldada järgmine pakett: %s
eu: Ondoko paketea ezabatu behar da besteak berritu ahal daitezen: %s
fi: Seuraava paketti on poistettava, jotta toiset voidaan päivittää: %s
fr: Afin de poursuivre la mise à jour, le paquetage suivant doit être désinstallé : %s
gl: Teñe que eliminarse o seguinte paquete para poder actualizar outros: %s
he: החבילה הבאה עומדת להימחק כדי שניתן יהיה לשדרג חבילות אחרות: %s
hu: A következő csomagot el kell távolítani, hogy a szükséges csomagok frissíthetők legyenek: %s
id: Paket berikut harus dihapus agar yang lain dapat di-upgrade: %s
is: Eftirfarandi pakka þarf að fjarlægja til að uppfæra aðra: %s
it: Questo pacchetto deve essere rimosso per poterne aggiornare altri: %s
nb: Den følgende pakka må fjernes for at andre skal kunne oppgraderes: %s
nl: Het volgende pakket moet worden verwijderd om andere te kunnen opwaarderen: %s
nn: Denne pakken må fjernast for at andre skal kunna oppgraderast: %s
pl: Poniższy pakiet musi zostać usunięte aby zaktualizować inne: %s
pt: O seguinte pacote tem que ser removido para que outros sejam actualizados: %s
pt_br: Este pacote precisa ser removido para que os outros sejam atualizados: %s
ro: Pachetul următor trebuie înlăturat pentru ca celelalte să fie actualizate: %s
ru: Следующий пакет будет удалён для обновления остальных: %s
sl: Naslednji paket mora biti odstranjen, da bodo drugi lahko nadgrajeni: %s
sv: Följande paket måste tas bort för att andra ska bli uppdaterade: %s
tr: Diğer paketlerin güncellenmesi için aşağıdaki paketin kaldırılması gerekiyor: %s

source: The following packages have to be removed for others to be upgraded: %s
ast: Tienen de desaniase los paquetes siguientes pa poder anovar otros: %s
ca: Els paquets següents s'han d'eliminar per poder actualitzar uns altres: %s
cs: Následující balíčky musí být odstraněny, aby bylo možné jiné aktualizovat: %s
cy: Rhaid i'r pecynnau canlynol gael eu tynnu i eraill gael eu diweddaru. %s
da: De følgende pakker skal fjernes for at andre kan opgraderes: %s
el: Τα παρακάτω πακέτα πρέπει να αφαιρεθούν για να αναβαθμιστούν κάποια άλλα: %s
es: Se tienen que quitar los paquetes siguientes para poder actualizar otros: %s
et: Teiste uuendamiseks tuleb eemaldada järgmised paketid: %s
eu: Pakete hauek kendu egin behar dira besteak berritzeko: %s
fi: Seuraavat paketit on poistettava, jotta toiset voidaan päivittää: %s
fr: Afin de poursuivre la mise à jour, les paquetages suivants doivent être désinstallés : %s
gl: Teñen que eliminarse os seguintes paquetes para poder actualizar outros: %s
he: החבילות הבאות עומדות להימחק בכדי שניתן יהיה לשדרג חבילות אחרות: %s
hu: A következő csomagokat el kell távolítani, hogy a szükséges csomagok frissíthetők legyenek: %s
id: Paket berikut harus dihapus agar yang lain dapat di-upgrade: %s
is: Eftirfarandi pakka þarf að fjarlægja til að uppfæra aðra: %s
it: Questi pacchetti devono essere rimossi per poterne aggiornare altri: %s
nb: Følgende pakker må fjernes for at andre skal bli oppgradert: %s
nl: De volgende pakketten moeten worden verwijderd om andere te kunnen opwaarderen: %s
nn: Desse pakkane må fjernast for at andre skal kunna oppgraderast: %s
pl: Poniższe pakiety muszą być usunięte aby zaktualizować inne: %s
pt: Os seguintes pacotes têm que ser removidos para que outros sejam actualizados: %s
pt_br: Estes programas precisam ser removidos para outros serem atualizados: %s
ro: Pachetele următoare trebuiesc înlăturate pentru ca celelalte să fie actualizate: %s
ru: Следующие пакеты будут удалены для обновления остальных: %s
sl: Naslednji paketi morajo biti odstranjeni, da bodo drugi lahko nadgrajeni: %s
sq: Pakot a radhitura duhet të zhduken që të tjerat të azhurnohen: %s
sv: Följande paket måste tas bort för att andra ska bli uppdaterade: %s
tr: Diğer paketlerin güncellenmesi için aşağıdaki paketlerin kaldırılması gerekiyor: %s

source: in order to install %s
ast: pa instalar %s
ca: per tal d'instal·lar %s
cs: pro instalaci %s
cy: er mwyn gosod %s
da: for at kunne installere %s
el: για να εγκατασταθεί το %s
es: para instalar %s
et: paigaldamaks %s
eu: %s instalatzeko
fi: %s asentamiseksi
fr: pour installer le paquetage %s
gl: para instalar %s
he: בכדי להתקין %s
hu: "%s" telepítése érdekében
id: untuk menginstall %s
is: til þess að setja inn %s
it: per installare %s
nb: for å kunne installere %s
nl: in volgorde om %s te installeren
nn: for å kunna installera «%s»
pl: w celu zainstalowania pakietu %s
pt: para poder instalar %s
pt_br: para instalar %s
ro: pentru a instala %s
ru: чтобы установить %s
sl: za namestitev %s
sq: në urdhër për instalim %s
sv: för att installera %s
tr: %s 'in kurulumu sırasında

source: due to missing %s
ast: debío a que falta %s
ca: degut a que falten %s
cs: z důvodu chybějícího %s
cy: oherwydd %s coll
da: grundet manglende %s
el: λόγω έλλειψης του %s
es: debido a que falta %s
et: puuduva %s tõttu
eu: %s falta delako
fi: puuttuvan %s vuoksi
fr: en raison du manque de %s
gl: debido a que falta %s
he: עקב %s חסר
hu: "%s" hiánya miatt
id: karena %s hilang
is: vegna þess að %s vantar
it: perché manca %s
nb: grunnet manglende %s
nl: vanwege ontbrekende %s
nn: då «%s» manglar
pl: z powodu brakującego %s
pt: devido a faltar %s
pt_br: devido estar faltando %s
ro: datorită lipsei lui %s
ru: из-за отсутствия %s
sl: zaradi manjkajočega %s
sq: ka arritur nga mungesa %s
sv: för att %s saknas
tr: %s paketinin kayıplığından

source: Invalid signature (%s)
ast: Robla incorreuta (%s)
ca: Signatura no vàlida (%s)
cs: Neplatný podpis (%s)
cy: Llofnod annilys (%s)
da: Ugyldig signatur (%s)
el: Μη έγκυρη υπογραφή (%s)
es: Firma no válida (%s)
et: Vigane allkiri (%s)
eu: Sinadura ez da baliozkoa (%s)
fi: Virheellinen allekirjoitus (%s)
fr: Signature incorrecte (%s)
gl: Sinatura incorrecta (%s)
he: חתימה לא תקפה (%s)
hu: Érvénytelen elektronikus aláírás (%s)
id: Tanda tangan tidak valid (%s)
is: ógild undirskrift (%s)
it: Firma non valida (%s)
nb: ugyldig signatur (%s)
nl: Ongeldige ondertekening (%s)
nn: Ugyldig signatur (%s).
pl: Niepoprawny podpis (%s)
pt: Assinatura inválida (%s)
pt_br: Assinatura inválida (%s)
ro: Semnătură incorectă (%s)
ru: Неверная подпись (%s)
sl: Neveljaven podpis (%s)
sq: Nënshkrim i pa pranueshëm (%s)
sv: Ogiltig signatur (%s)
tr: Geçersiz imza (%s)

source: Invalid Key ID (%s)
ast: ID de contraseña nun válida (%s)
ca: ID de clau no vàlid (%s)
cs: Neplatné ID klíče (%s)
cy: Enw Allwedd Annilys (%s)
da: Ugyldig nøgle-id (%s)
el: Μη έγκυρο ID Κλειδιού (%s)
es: ID de clave no válida (%s)
et: Vigane võtme ID (%s)
eu: ID gakoa ez da baliozkoa (%s)
fi: Virheellinen avaintunniste (%s)
fr: Identifiant de clef incorrect (%s)
he: מפתח זהות לא תקין (%s)
hu: Érvénytelen kulcsazonosító (%s)
id: Kunci ID tidak valid (%s)
is: Ógilt auðkenni lykils (%s)
it: Key ID (%s) non valida
nb: ugyldig nøkkel-ID (%s)
nl: Ongeldig sleutel-ID (%s)
nn: Ugyldig nøkkel-ID (%s).
pl: Niepoprawny identyfikator klucza (%s)
pt: ID de chave inválido (%s)
pt_br: Chave Inválida ID (%s)
ro: ID cheie invalid (%s)
ru: Неверный Key ID (%s)
sl: Neveljaven ID ključa (%s)
sq: Çelës invalid ID (%s)
sv: Ogiltigt nyckel-id (%s)
tr: Geçersiz Anahtar Kimliği (%s)

source: Missing signature (%s)
ast: Falta la robla (%s)
ca: Falta la signatura (%s)
cs: Chybí podpis (%s)
cy: Llofnod coll (%s)
da: Manglende signatur (%s)
el: Απουσία υπογραφής (%s)
es: Falta firma (%s)
et: Puudub signatuur (%s)
eu: Sinadura falta da (%s)
fi: Puuttuva allekirjoitus (%s)
fr: Signature absente (%s)
gl: Falta a sinatura (%s)
he: חתימה חסרה (%s)
hu: Hiányzó elektronikus aláírás (%s)
id: Tanda tangan hilang (%s)
is: Vantar undirskrift (%s)
it: Firma mancante (%s)
nb: mangler signatur (%s)
nl: Geen ondertekening aanwezig (%s)
nn: Manglar signatur (%s).
pl: Brakujący podpis (%s)
pt: Assinatura em falta (%s)
pt_br: Assinatura não encontrada (%s)
ro: Semnătură absentă (%s)
ru: Отсутствует подпись (%s)
sl: Manjkajoč podpis (%s)
sq: Mungon nënshkrimi (%s)
sv: Signatur saknas (%s)
tr: Kayıp imza (%s)

source: system
ast: sistema
ca: sistema
cs: systém
el: σύστημα
es: sistema
et: süsteem
eu: sistema
fi: järjestelmä
fr: système
hu: rendszer
is: kerfi
it: sistema
nb: systemet
nl: systeem
pt: sistema
pt_br: sistema
ro: sistemul
ru: система
sl: sistem
sq: sistem
tr: sistem

source: You should restart your computer for %s
ast: Deberíes reaniciar l'ordenador pa %s
ca: Heu de reiniciar l'ordinador per %s
cs: Měli byste kvůli %s restartovat váš počítač
da: Du bør genstarte din maskine for %s
el: Θα πρέπει να κάνετε επανεκκίνηση για το %s
es: Debería reiniciar su computadora para %s
et: Arvuti tuleks taaskäivitada, sest seda vajab %s
eu: Zure konputagailua berrabiatu behar zenuke %s-rentzako
fi: Tietokone tulisi käynnistää uudelleen paketin %s asennuksen vuoksi
fr: Vous devriez relancer votre ordinateur pour %s
hu: A számítógép újraindítása szükséges a(z) %s számára
it: Dovresti riavviare il computer per %s
nb: Du må starte datamaskinen på nytt for %s
nl: U dient uw computer te herstarten voor %s
nn: Du må starta maskina på nytt for %s.
pl: Uruchom ponownie komputer dla %s
pt: Deve reiniciar o seu computador para o %s
pt_br: Você deve reiniciar o computador para %s
ro: Trebuie să reporniți calculatorul pentru %s
ru: Необходимо перезапустить компьютер для %s
sl: Priporočamo, da zaradi %s ponovno zaženete računalnik
sq: Ju duhet të rifilloni kompjuterin tuaj për %s
sv: Du borde starta om din dator för %s
tr: %s için bilgisayarınızı yeniden başlatmalısınız

source: You should restart your session for %s
ast: Deberíes reaniciar la sesión pa %s
ca: Heu de reiniciar la sessió per %s
cs: Měli byste kvůli %s restartovat vaše sezení
da: Du bør genstarte din session for %s
el: Θα πρέπει να κάνετε επανασύνδεση για το %s
es: Debería reiniciar su sesión para %s
et: Seanss tuleks taaskäivitada, sest seda vajab %s
eu: Zure saio berrabiatu behar zenuke %s-rentzako
fi: Istunto tulisi käynnistää uudelleen paketin %s asennuksen vuoksi
fr: Vous devriez relancer votre session pour %s
hu: A munkafolyamat újraindítása szükséges a(z) %s számára
it: Dovresti riavviare la sessione per %s
nb: Du må starte økten på nytt for %s
nl: U dient uw sessie te herstarten voor %s
nn: Du må logga ut og inn att for %s.
pl: Uruchom ponownie sesję dla %s
pt: Deve reiniciar a sua sessão para o %s
pt_br: Você deve reiniciar sua sessão para o %s
ro: Trebuie să reporniți sesiunea pentru %s
ru: Необходимо перезапустить сеанс для %s
sl: Priporočamo, da zaradi %s ponovno zaženete sejo
sq: Ju duhet të rifilloni sesionin tuaj për %s
sv: Du borde starta om din session för %s
tr: %s için oturumunuzu yeniden başlatmalısınız

source: You should restart %s for %s
ast: Deberíes reaniciar %s pa %s
ca: Heu de reiniciar %s per %s
cs: Měli byste restartovat %s pro %s
cy: Dylech ailddechrau %s ar gyfer %s
da: Du bør genstarte %s for %s
el: Θα πρέπει να κάνετε επανεκκίνηση στο %s για το %s
es: Debería reiniciar %s para %s
et: %s tuleks taaskäivitada, sest seda vajab %s
eu: %s berrabiatu beharko zenuke %s-rentzako
fi: %s tulisi käynnistää uudelleen paketin %s asennuksen vuoksi
fr: Vous devriez relancer %s pour %s
hu: A(z) %s újraindítása szükséges a(z) %s számára
is: Þú ættir að endurræsa %s fyrir %s
it: Dovresti riavviare %s per %s
nb: Du må starte %s på nytt for %s
nl: U dient %s te herstarten voor %s
nn: Du må starta «%s» på nytt for %s.
pl: Uruchom ponownie %s dla %s
pt: Deve reiniciar %s para o %s
pt_br: Você deve reiniciar %s para %s
ro: Trebuie să reporniți %s pentru %s
ru: Необходимо перезапустить %s для %s
sl: Priporočamo, da ponovno zaženete %s zaradi %s
sq: Ju duhet të rifilloni %s për %s
sv: Du borde starta om %s för %s
tr: %s'i %s için yeniden başlatmalısınız

source: Can't write file
ast: Nun pue escribise'l ficheru
ca: No s'ha pogut escriure el fitxer
cs: Nelze zapisovat do souboru
cy: Methu ysgrifennu'r ffeil
da: Kan ikke skrive fil
el: Αδυναμία εγγραφής του αρχείου
es: No se puede escribir archivo
et: Faili kirjutamine nurjus
eu: Ezin da fitxategia idatzi
fi: Tiedostoon ei voida kirjoittaa
fr: Ne peut créer le fichier
gl: Non se puido escribir o ficheiro
he: לא מצליח לכתוב קובץ
hu: A fájl nem írható
is: Get ekki skrifað skrá
it: Impossibile scrivere il file
nb: Klarer ikke å lagre fil
nl: Kan niet naar bestand schrijven
nn: Klarte ikkje lagra fil
pl: Zapisanie pliku było niemożliwe
pt: Não é possível escrever gravar o ficheiro
pt_br: Não foi possível escrever arquivo
ro: Nu se poate scrie fișierul
ru: Не удаётся записать файл
sl: Pisanje v datoteko ni možno
sq: Nuk mund të shkruaj skedarin
sv: Kan inte skriva fil
tr: Dosya yazılamıyor.

source: Can't open file
ast: Nun pue abrise'l ficheru
ca: No s'ha pogut obrir el fitxer
cs: Nelze otevřít soubor
cy: Methu agor y ffeil
da: Kan ikke åbne fil
el: Αδυναμία ανοίγματος του αρχείου
es: No se puede abrir archivo
et: Faili avamine nurjus
eu: Ezin da fitxategia ireki
fi: Tiedostoa ei voida avata
fr: Ne peut ouvrir le fichier
gl: Non se puido abrir o ficheiro
he: לא מצליח לפתוח קובץ
hu: Nem sikerült megnyitni a fájlt
is: Get ekki opnað skrá
it: Impossibile aprire il file
nb: Klarer ikke å åpne fil
nl: Openen van bestand mislukt
nn: Klarte ikkje opna fil
pl: Otworzenie pliku było niemożliwe
pt: Não é possível abrir o ficheiro
pt_br: Não foi possível abrir arquivo
ro: Nu se poate deschide fișierul
ru: Не удаётся открыть файл
sl: Odpiranje datoteke ni možno
sq: Nuk mund të hap skedarin
sv: Kan inte öppna fil
tr: Dosya açılamıyor.

source: Can't move file %s to %s
ast: Nun pue movese'l ficheru %s a %s
ca: No s'ha pogut moure el fitxer %s a %s
cs: Nelze přesunout soubor %s na %s
cy: Methu symud ffeil %s i %s
da: Kan ikke flytte fil %s til %s.
el: Αδυναμία μετακίνησης του αρχείου %s στο %s
es: No se puede mover archivo %s a %s
et: Faili %s liigutamine asukohta %s ei ole võimalik
eu: Ezin da %s fitxategiar %s-ra mugitu
fi: Tiedostoa %s ei voi siirtää kohteeseen %s
fr: Impossible de déplacer %s vers %s
gl: Non se puido mover o ficheiro %s a %s
he: לא מצליח להעביר את הקובץ %s אל %s
hu: %s nem mozgatható ide: %s
is: Get ekki flutt skrána %s til %s
it: Impossibile spostare il file %s a %s
nb: Kan ikke flytte filen %s til %s
nl: Kan bestand %s niet verplaatsen naar %s
nn: Klarte ikkje flytta fila %s til %s.
pl: Nie można przenieść pliku %s na %s
pt: Não é possível mover o ficheiro %s para %s
pt_br: Não é possível mover arquivo %s para %s
ro: Nu se poate muta fișierul %s la %s
ru: Не удаётся переместить файл %s в %s
sl: Premik datoteke %s v %s ni možen
sq: Nuk mund të lëvizë skedarin %s në %s
sv: Kan inte flytta fil %s till %s
tr: %s dosyası%s 'e taşınamıyor.

source: --auto - automatically select a package in choices.
ast: --auto - escoyer un paquete nes escoyetes automáticamente.
ca: --auto - en escollir, selecciona un paquets automàticament.
cs: --auto - automaticky vybere balíček z výběru
cy: --auto - dewis pecyn yn awtomatig o fewn dewisiadau.
da: --auto - vælg automatisk en pakke ved valg.
el: --auto - αυτόματη επιλογή πακέτου κατ' επιλογήν.
es: --auto - seleccionar un paquete en las elecciones automáticamente.
et: --auto - valib automaatselt ühe paketi, kui võimalusi on mitu.
eu: --auto - automatikoki pakete bat hautatzen du aukeratik.
fi: --auto - valitse paketit tarvittaessa automaattisesti.
fr: --auto - sélectionner automatiquement un paquetage parmi les choix
he: --auto - בחירה אוטומטית של חבילה מהאפשרויות.
hu: --auto - választási lehetőségnél automatikusan választ csomagot
id: --auto - seleksi otomatis paket pilihan.
is: --auto - velja sjálfvirkt pakka í vali.
it: --auto - include automaticamente un pacchetto nelle scelte.
nb: --auto – velg automatisk pakker i alternativer.
nl: --auto - selecteer automatisch een pakket uit de keuzes.
nn: --auto – Vel automatisk pakkar ved fleire alternativ.
pl: --auto - automatycznie wybiera najlepszy pakiet z listy.
pt: --auto - selecciona automaticamente um pacote nas escolhas.
pt_br: --auto - automaticamente seleciona um pacote, em escolhas.
ro: --auto - selectează automată un pachet printre opțiuni.
ru: --auto - автоматически выбрать пакет из предлагаемых
sl: --auto - samodejno izberi paket v možnostih.
sq: --auto - zgjedhje automatike në njërën ndër pakot zgjedhëse.
sv: --auto - välj automatiskt ett paket från valen.
tr: --auto - Otomatik seçenekler arasından paketleri seç.

source: --auto-orphans - remove orphans
ast: --auto-orphans - desaniciar los güérfanos
cs: --auto-orphans - odstraní sirotky
cy: --auto-orphans - tynnu amddifad
da: --auto-orphans - fjern forældreløse
el: --auto-orphans - απομάκρυνση των ορφανών πακέτων
es: --auto-orphans - quitar los huérfanos
et: --auto-orphans - orbude eemaldamine
eu: --auto-orphans - umezurtzak ezabatu
fi: --auto-orphans - poista tarpeettomat paketit (orphans).
fr: --auto-orphans - supprimer les orphelins
hu: --auto-orphans - árvák eltávolítása
is: --auto-orphans - fjarlægja munaðarleysingja
it: --auto-orphans - rimuove orfani
nb: --auto-orphans – fjern foreldreløse pakker
nl: --auto-orphans - wezen verwijderen
nn: --auto-orphans – Fjern foreldrelause pakkar.
pl: --auto-orphans - usuń osierocone pakiety
pt: --auto-orphans - remove os órfãos
pt_br: --auto-orphans - remove dependências e programas órfãos
ro: --auto-orphans - înlătură pachetele orfane
ru: --auto-orphans - удалить сирот
sl: --auto-orphans - odstrani osirotele pakete
sv: --auto-orphans - avinstallera obehövliga paket
tr: --auto-orphans - gereksiz olanları kaldır
