Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --no-md5sum - disable MD5SUM file checking.
ast: --no-md5sum - desactivar la preba MD5SUM sobro'l ficheru.
ca: --no-md5sum - deshabilita la comprovació MD5SUM.
cs: --no-md5sum - zakázat ověřování souborů pomocí MD5SUM
cy: --no-md5sum - analluogi gwirio ffeil MD5SUM.
da: --no-md5sum - deaktivér kontrol med MD5SUM fil.
el: --no-md5sum - απενεργοποίηση του MD5SUM ελέγχου του αρχείου .
es: --no-md5sum - deshabilitar la prueba MD5SUM sobre el archivo.
et: --no-md5sum - keelatakse faili MD5SUM kontroll.
eu: --no-md5sum - MD5SUM fitxategiaren egiaztapena desgaitzen du.
fi: --no-md5sum - poista tiedostojen MD5SUM-tarkistus käytöstä.
fr: --no-md5sum - Supprime la vérification de la somme de contrôle MD5.
gl: --no-md5sum - deshabilitar a comprobación de ficheiros MD5SUM.
he: --no-md5sum - נטרל בדיקת חתימת MD5SUM של הקובץ.
hu: --no-md5sum - az MD5-ös összeg ellenőrzésének kikapcsolása
id: --no-md5sum - nonaktifkan pengujian file MD5SUM.
is: --no-md5sum - aftengja MD5SUM skráarathugun.
it: --no-md5sum - disabilita il controllo MD5SUM sui file.
nb: --no-md5sum – ikke utfør MD5SUM-filkontroll.
nl: --no-md5sum - MD5SUM bestandscontrole uitschakelen.
nn: --no-md5sum – Ikkje bruk md5sum-kontroll.
pl: --no-md5sum - wyłącza sprawdzanie sumy kontrolnej MD5 dla pliku.
pt: --no-md5sum - desactiva a verificação do ficheiro MD5SUM.
pt_br: --no-md5sum - desabilita checagem de arquivo com MD5SUM.
ro: --no-md5sum - dezactivează verificarea fișierelor cu MD5SUM.
ru: --no-md5sum - отключить проверку файла MD5SUM
sl: --no-md5sum - onemogoči preverjanje datotek z MD5SUM.
sv: --no-md5sum - inaktivera md5sum-kontroll av filer.
tr: --no-md5sum - MD5SUM kontrolünü devre dışı bırak.

source: --nopubkey - don't import pubkey of added media
ast: --nopubkey - non importar la contraseña pública del preséu amestáu
cs: --nopubkey - neimportovat veřejné klíče z přidaných zdrojů
cy: --nopubkey - peidio mewnforio pubkey y cyfrwng ychwanegwyd
da: --nopubkey - importér ikke pubkey fra tilføjet medie
el: --nopubkey - να μην γίνει εισαγωγή δημόσιου κλειδιού των νέων μέσων (media)
es: --nopubkey - no importar la clave pública del soporte añadido
et: --nopubkey - lisatud andmekandja avalikku võtit ei impordita
eu: --nopubkey - ez inportatu erantsitako euskarrien gako-publikoa
fi: --nopubkey - älä tuo julkista avainta lisättäessä mediaa.
fr: --nopubkey - ne pas importer la clé publique des nouveaux médias
gl: --nopubkey - non importar a clave pública do soporte engadido
he: --nopubkey - אל תייבא את מפתח האימות של המקור שנוסף
hu: --nopubkey - a felvett adatforrás publikus kulcsa ne legyen importálva
id: --nopubkey - jangan import kunci publik dari media yang ditambahkan
is: --nopubkey - ekki flytja inn dulritunar-lykil fyrir viðbættan miðil
it: --nopubkey - non importa la chiave pubblica dei supporti aggiunti
nb: --nopubkey – ikke importer offentlig nøkkel for nytt medie
nl: --nopubkey - publieke sleutel van toegevoegde media niet importeren
nn: --nopubkey – Ikkje importer offentlegnøkkel til nytt medium.
pl: --nopubkey - bez importu klucza publicznego dodanego nośnika
pt: --nopubkey - não importa a chave pública da média adicionada
pt_br: --nopubkey - não importa chave pública da mídia adicionada
ro: --nopubkey - nu se importă cheia publică a mediului adăugat
ru: --nopubkey - не импортировать публичный ключ из добавленного источника
sl: --nopubkey - brez uvoza javnih ključev dodanih virov
sv: --nopubkey - importera inte pubkey för adderat media
tr: --nopubkey -eklenen kaynağın ortak anahtarını alma.

source: --raw - add the media in config, but don't update it.
ast: --raw - amestar el preséu en config, pero non anovalu.
cs: --raw - přidat zdroje do nastavení, ale neaktualizovat
cy: --raw - ychwanegu cyfrwng yn config, ond nid yn ei ddiweddaru.
da: --raw - tilføj mediet i config, men opdatér det ikke.
el: --raw - προσθήκη του μέσου (media) στην διαμόρφωση, αλλά χωρίς ενημέρωση.
es: --raw - añadir el soporte en config, pero no actualizarlo.
et: --raw - andmekandja lisatakse seadistustefaili, aga seda ei uuendata.
eu: --raw - erantsi euskarria konfig-en, baino ez eguneratu.
fi: --raw - lisää media asetustiedostoihin, mutta älä päivitä sitä.
fr: --raw - ajoute le média dans la configuration, mais sans le mettre à jour.
gl: --raw - engadir o soporte á configuración, pero non actualizalo.
he: --raw - הוסף את המקור לרשימה, אבל אל תעדכן את רשימת הקבצים.
hu: --raw - az adatforrás felvétele, de a frissítésének mellőzése
id: --raw - tambahkan media pada konfigurasi, tetapi jangan update.
is: --raw - bæta miðlinum við uppsetningu, en ekki uppfæra hann.
it: --raw - aggiunge il supporto alla configurazione ma non lo aggiorna.
nb: --raw – legg til medie i oppsettet, men ikke oppdater det.
nl: --raw - media toevoegen in configuratie, maar niet bijwerken.
nn: --raw – Legg mediet til oppsettet, men ikkje oppdater det.
pl: --raw - dodaje nośnik, ale go nie aktualizuje.
pt: --raw - adiciona a média na configuração, mas não a actualiza.
pt_br: --raw - adiciona a mídia à configuração, sem atualizá-la.
ro: --raw - adaugă mediul în configurare, dar nu-l actualizează.
ru: --raw - добавить источник в config, но не обновлять его
sl: --raw - dodaj vir v nastavitve, a ga ne posodobi.
sv: --raw - lägg till mediat i config, men uppdatera inte det.
tr: --raw - yapılandırmaya kurulum kaynağını ekle; ancak güncelleme.

source: -q - quiet mode.
ast: -q - mou silenciosu.
ca: -q - mode silenciós.
cs: -q - režim bez výpisů
cy: -q - modd distaw.
da: -q - stille udgave.
el: -q - σιωπηλή λειτουργία.
es: -q - modo silencioso.
et: -q - vaikne režiim.
eu: -q - modu lasaia.
fi: -q - hiljainen tyyli.
fr: -q - mode silencieux.
gl: -v - modo abreviado.
he: -q - מצב שקט.
hu: -q - néma üzemmód
id: -q - mode diam.
is: -q - hljóður hamur.
it: -q - modalità silenziosa.
nb: -q – stille modus.
nl: -q - stille modus.
nn: -q – Stillemodus.
pl: -q - tryb cichy.
pt: -q - modo silencioso.
pt_br: -q - modo silencioso (não informativo).
ro: -q - mod silențios.
ru: -q - тихий режим (quiet)
sl: -q - tihi način.
sq: -q - model i qetë.
sv: -q - tyst läge.
tr: -q - Sessiz kipi.

source: -v - verbose mode.
ast: -v - mou informativu.
ca: -v - mode detallat.
cs: -v - režim s výpisy
cy: --verbose - modd llafar.
da: -v - udførlig tilstand.
el: -v - αναλυτική περιγραφή.
es: -v - modo informativo.
et: -v - selgitav režiim.
eu: -v - modu berritsua.
fi: -v - yksityiskohtainen tyyli.
fr: -v - mode verbeux.
gl: -v - modo detallado.
hu: -v - részletes információ
id: -v - mode verbose.
is: -v - ítarlegri hamur.
it: -v - modalità prolissa.
nb: -v – utvidete meldinger.
nl: -v - 'extra informatie'-modus.
nn: -v – Utvida meldingar.
pl: -v - tryb komunikatywny.
pt: -v - modo detalhado.
pt_br: -v - modo detalhado.
ro: -v - mod detaliat.
ru: -v - подробный режим
sl: -v - zgovoren način.
sq: -v - model oratori.
sv: -v - utförligt läge.
tr: -v - kalabalık kipi.

source: known xml-info policies are %s
ast: les polítiques xml-info conocíes son %s
cs: známé xml-info politiky jsou %s
cy: polisiau hysbys known xml-info yw %s
da: kendte xml-info politikker er %s
el: οι γνωστές πολιτικές xml-πληροφοριών είναι οι %s
es: las políticas xml-info conocidas son %s
et: saadaolevad XML-info reeglid on %s
eu: xml-info politika ezagunak dira %s
fi: Tunnetut toimintatavat xml-info -tiedostoille ovat %s
fr: les politiques xml-info connues sont %s
gl: as políticas de xml-info coñecidas son %s
hu: Ismert listafájl meghatározás a(z) %s-hez
is: þekktar xml-info stefnur eru %s
it: le regole conosciute per gli xml-info sono: %s
nb: kjente xml-info-praksiser er %s
nl: bekende soorten xml-infobeleid zijn %s
nn: Kjende xml-info-praksisar: %s
pl: zasady korzystania z informacji o programach w formacie XML: %s
pt: as conhecidas políticas de informação xml são %s
pt_br: políticas xml-info conhecidas são %s
ro: politicile xml-info cunoscute sînt %s
ru: возможные политики xml-info: %s
sl: znani načini za xml-info so %s
sv: kända xml-info policyn är %s
tr: bilinen xml-bilgisi kuralları şunlardır: %s

source: no argument needed for --distrib --mirrorlist <url>
ast: nun se necesita argumentu pa --distrib --mirrorlist <url>
cs: pro --distrib --mirrorlist <url> není potřeba žádný parametr
cy: dim angen ymresymiad ar gyfer --distrib --mirrorlist <url>
da: intet argument krævet for --distrib --mirrorlist <url>
el: δεν απαιτείται όρισμα για --distrib --mirrorlist <url>
es: no se necesita argumento para --distrib --mirrorlist <url>
et: --distrib --mirrorlist <url> ei vaja mingeid argumente
eu: ez da argumenturik behar honentzako: --distrib --mirrorlist <url>
fi: Argumenttia ei tarvita käytettäessä valitsimia --distrib --mirrorlist <url>
fr: pas d'arguments requis pour --distrib --mirrorlist <url>
gl: non fai falta un argumento para --distrib --mirrorlist <url>
hu: Hiányzik az argumentum: --distrib --mirrorlist <url>
is: ekki er þörf á viðfangi fyrir --distrib --mirrorlist <slóð>
it: non servono argomenti per --distrib --mirrorlist <url>
nb: ingen argument trengs for --distrib --mirrolist <url>
nl: geen argument nodig voor --distrib --mirrorlist <url>
nn: Treng ikkje noko argument for «--distrib --mirrorlist <adresse>».
pl: argument nie jest potrzebny dla opcji --distrib --mirrorlist <url>
pt: não é necessário nenhum argumento para --distrib --mirrorlist <url>
pt_br: nenhum argumento necessário para --distrib --mirrorlist <url>
ro: nu sînt necesare argumente pentru --distrib --mirrorlist <url>
ru: для параметра --distrib --mirrorlist <url> не нужны аргументы
sl: za --distrib --mirrorlist <url> ni potreben noben argument
sv: inget argument behövs för --distrib --mirrorlist <address>
tr: --distrib --mirrorlist <url> ile birlikte herhangi bir argüman gerekli değildir.

source: bad <url> (for local directory, the path must be absolute)
ast: <url> incorreuta (pal direutoriu llocal, el camín tien de ser absolutu)
cs: chybné <url> (pro lokální adresář musí být cesta absolutní)
cy: gwallus <url> (ar gyfer cyfeiriadur lleol, rhaid i'r llwybr fod yn absoliwt)
da: Ugyldig <adresse> (for lokalt katalog, stien skal være absolut).
el: εσφαλμένο <url> (στην περίπτωση τοπικού καταλόγου, η διαδρομή θα πρέπει να είναι απόλυτη)
es: <url> incorrecta (para el directorio local, la ruta debe ser absoluta)
et: vigane <url> (kohaliku kataloogi asukoht peab olema absoluutne)
eu: <url> okerra (bertako direktorioentzako, bide absolutua behar da)
fi: Virheellinen <url> (käytettäessä paikallista hakemistoa, polun tulee olla absoluuttinen)
fr: <url> incorrecte (pour un répertoire local, le chemin doit être absolu)
gl: <url> incorrecto (para un directorio local, a ruta debe ser absoluta)
he: כתובת <url> שגויה (לספריות מקומיות הנתיב צריך להיות מוחלט)
hu: helytelen <url> (helyi könyvtár esetén az útvonalnak abszolútnak kell lennie)
is: óggild <slóð> (slóð að staðbundnum möppum verður að vera algild)
it: <url> non valido (per una directory locale serve un percorso assoluto)
nb: Ugyldig <adresse> (for lokale mapper må adressen være absolutt)
nl: ongeldige <url> (voor een lokale map dient het pad absoluut te zijn)
nn: Ugyldig <adresse> (for lokale mapper må adressa vera absolutt).
pl: nieprawidłowy <url> (dla katalogu lokalnego wymagana jest ścieżka bezwzględna)
pt: <url> inválido (para directórios locais, o caminho tem que ser absoluto)
pt_br: <url> inválida (para diretório local o caminho deve ser absoluto)
ro: <url> greșit (pentru directoarele locale, calea trebuie să fie absolută)
ru: неверный <url> (для локального каталога путь должен быть абсолютным)
sl: napačen <url> (za krajevno mapo mora biti pot absolutna)
sq: keq <url> (për dosjen lokale, rruga duhet të jetë absolute)
sv: felaktig <address> (för lokal katalog måste sökvägen vara absolut)
tr: hatalı <url> (yerel dizin için, yol kesin olmalıdır.)

source: Only superuser is allowed to add media
ast: Sólo'l superusuariu ta autorizáu a amestar preseos
ca: El superusuari és l'únic autoritzat per a afegir fonts
cs: Přidat zdroj může pouze uživatel root
cy: Dim ond uwch ddefnyddiwr sy'n cael ychwanegu cyfrwng
da: Kun superbrugeren har lov til at tilføje medier
el: Μόνο ο διαχειριστής επιτρέπεται να προσθέσει μέσα
es: Sólo el superusuario está autorizado a añadir soportes
et: Andmekandjaid võib lisada ainult administraator
eu: Supererabiltzaileak soilik dauka euskarriak eransteko baimena
fi: Vain pääkäyttäjä voi lisätä medioita
fr: Seul l'administrateur système (root) peut ajouter un média
gl: Só o superusuario pode engadir soportes
he: רק מנהל מערכת מורשה להוסיף מקור תוכנה
hu: Adatforrás felvételéhez rendszergazdai jogosultság szükséges
id: Hanya superuser yang diijinkan menambahkan media
is: Aðeins kerfisstjóra (root) er heimilt að bæta við miðli
it: Solo superuser può aggiungere supporti
nb: Bare superbruker har adgang til å legge til medier
nl: Alleen de beheerder mag media toevoegen
nn: Berre superbrukaren kan leggja til medium.
pl: Tylko administrator ma prawo dodawać nośniki
pt: Apenas o super-utilizador pode adicionar médias
pt_br: Apenas o super usuário tem permissão para adicionar mídias
ro: Doar administratorul poate adăuga un mediu
ru: Добавлять источники разрешено только суперпользователю
sl: Samo naduporabnik lahko dodaja vire
sv: Endast systemadministratörer får lägga till media
tr: Ortam eklemek için sadece sistem yöneticisi yetkilidir.

source: creating config file [%s]
ast: criando'l ficheru de configuración [%s]
cs: vytvářím soubor s nastavením [%s]
cy: yn creu ffeil config (%s)
da: opretter config-fil [%s]
el: δημιουργία αρχείου ρυθμίσεων (config) [%s]
es: creando el archivo de configuración [%s]
et: luuakse seadistustefail [%s]
eu: Konfig fitxategia sortzen [%s]
fi: Luodaan asetustiedosto [%s]
fr: création du fichier de configuration [%s]
gl: creando o ficheiro de configuración [%s]
he: יוצר את קובץ ההגדרות [%s]
hu: "%s" beállításfájl létrehozása
id: membuat file konfigurasi [%s]
is: bý til uppsetningarskrá [%s]
it: creazione del file di configurazione [%s]
nb: Oppretter oppsettfil [%s]
nl: aanmaken config-bestand [%s]
nn: Lagar oppsettfil [%s].
pl: tworzenie pliku konfiguracyjnego [%s]
pt: a criar ficheiro de configuração [%s]
pt_br: criando arquivo de configuração [%s]
ro: se creează fișierul de configurare [%s]
ru: создаётся конфигурационный файл [%s]
sl: ustvarjanje nastavitvene datoteke [%s]
sv: skapar inställningsfil [%s]
tr: [%s] yapılandırma dosyası oluşturuluyor.

source: Can't create config file [%s]
ast: Nun puede criase'l ficheru de configuración [%s]
ca: No s'ha pogut crear el fitxer de configuració [%s]
cs: Nelze vytvořit soubor s nastavením [%s]
cy: Methu creu ffeil Config (%s)
da: Kan ikke oprette config-fil [%s]
el: Δεν μπορεί να δημιουργηθεί το αρχείο ρυθμίσης [%s]
es: No se puede crear el archivo de configuración [%s]
et: Seadistustefaili [%s] loomine nurjus
eu: Ezin da konfig fitxategia sortu [%s]
fi: Asetustiedostoa [%s] ei voida luoda
fr: Ne peut créer le fichier de configuration [%s]
gl: Non se puido crear o ficheiro de configuración [%s]
he: לא מצליח ליצור את קובץ ההגדרות [%s]
hu: "%s" beállításfájl nem hozható létre
id: Tidak bisa menulis file konfigurasi [%s]
is: Get ekki búið til uppsetninga-skrá [%s]
it: Impossibile creare il file di configurazione [%s]
nb: Kan ikke skrive oppsettfil [%s]
nl: Niet mogelijk config-bestand [%s] te maken
nn: Kan ikkje laga oppsettfil [%s].
pl: Utworzenie pliku konfiguracyjnego było niemożliwe [%s]
pt: Não pode criar o ficheiro de configuração [%s]
pt_br: Não foi possível criar o arquivo de configuração [%s]
ro: Nu se poate crea fișierul de configurare [%s]
ru: Не удаётся создать конфигурационный файл [%s]
sl: Ustvarjanje nastavitvene datoteke [%s] ni možno
sv: Kan inte skapa inställningsfil [%s]
tr: [%s] yapılandırma dosyası oluşturulamıyor.

source: no need to give <relative path of synthesis> with --distrib
ast: nun ye necesario dar <camín rellativu de synthesis> con --distrib
cs: s volbou --distrib není třeba zadávat <relativní cestu k syntéze>
cy: dim angen rhoi <llwybr perthynnol synthesis> gyda --distrib
da: ingen grund til at angive <relativ sti for syntese> med --distrib
el: δε χρειάζεται να δώσεις <σχετική διαδρομή του synthesis> με το --distrib
es: no es necesario dar <ruta relativa de synthesis> con --distrib
et: võtme --distrib puhul puudub vajadus anda <suhteline tee sünteesifaili juurde>
eu: ez dago <synthesis-en bide erlatiboa> eman beharrik --distrib aukerarekin
fi: Kohtaa <synthesis-tiedoston suhteellinen polku> ei tarvita valitsimen --distrib kanssa
fr: inutile de spécifier le <chemin relatif de synthesis> avec --distrib
gl: non cómpre dar a <ruta relativa a synthesis> con --distrib
he: אין צורך לספק <relative path of hdlist> עם --distrib
hu: <a fejléclista relatív útvonala> --distrib esetén szükségtelen
is: engin þörf á að gefa upp <tengd slóð að samantektar-skrá> með --distrib
it: con --distrib non serve fornire un <percorso relativo per synthesis>
nb: Trenger ikke å oppgi <relativ sti til synthesis> med --distrib-valget
nl: niet nodig om <relatief pad van synthesis> te geven met --distrib
nn: Treng ikkje oppgi <relativ stig til syntese> med «--distrib»-valet.
pl: nie ma potrzeby podawania <ścieżki względnej do syntezy> z opcją --distrib
pt: não é necessário indicar o <localização relativa do synthesis> com --distrib
pt_br: não é preciso fornecer <caminho relativo do synthesis> com --distrib
ro: nu este nevoie să dați <calea relativă pentru synthesis> cu --distrib
ru: с параметром --distrib <относительный путь к файлу synthesis> указывать не нужно
sl: z --distrib ni potrebno podajati <relativna pot do datotek synthesis>
sv: behöver inte ange <relativ sökväg till synthesis> med --distrib
tr: <sentez'in göreceli konumu> --distrib ile gerekli değil

source: Do you want to add media '%s'?
ast: ¿Quies amestar el preséu «%s»?
cs: Chcete přidat zdroj '%s'?
cy: Hoffech chi ychwanegu cyfrwng '%s'?
da: Ønsker du at tilføje medie '%s'?
el: Θες να προσθέσεις το μέσο '%s' ;
es: Desea añadir el soporte «%s»
et: Kas soovite lisada andmekandja '%s'?
eu: '%s' euskarria erantsi nahi duzu?
fi: Haluatko lisätä median "%s"?
fr: Voulez-vous ajouter le média « %s » ?
hu: Szeretné felvenni ezt az adatforrást: '%s'?
is: Viltu bæta við miðli '%s'?
it: Vuoi aggiungere il supporto '%s'?
nb: Ønsker du å legge til mediet «%s»?
nl: Wilt u media '%s' toevoegen?
nn: Ønskjer du å leggja til mediet «%s»?
pl: Czy chcesz dodać nośnik '%s'?
pt: Deseja adicionar a média '%s'?
pt_br: Você deseja adicionar a mídia '%s'?
ro: Doriți să adăugați mediul „%s”?
ru: Добавить источник «%s»?
sl: Ali želite dodati vir '%s'?
sv: Vill du lägga till källa '%s'
tr: '%s' kurulum kaynağını eklemek ister misiniz?

source: unable to add medium
ast: nun puede amestase'l mediu
ca: no s'ha pogut afegir el suport
cs: nelze přidat zdroj
cy: methu ychwanegu cyfrwng
da: kunne ikke tilføje medie
el: Αδυναμία προσθήκης μέσου
es: no se puede añadir el soporte
et: andmekandja lisamine nurjus
eu: ezin da euskarria erantsi
fi: Mediaa ei voitu lisätä
fr: impossible d'ajouter le média
gl: non foi posible engadir o soporte
he: לא ניתן להוסיף את המקור
hu: az adatforrás nem hozzáadható
is: get ekki bætt við miðli
it: impossibile aggiungere il supporto
nb: Klarte ikke å legge til mediet
nl: kon medium niet toevoegen
nn: Klarte ikkje leggja til medium.
pl: dodanie nośnika nie było możliwe
pt: não é possível adicionar a média
pt_br: incapaz de adicionar mídia
ro: nu se poate adăuga mediul
ru: не удаётся добавить источник
sl: dodajanje vira ni bilo možno
sq: e pamundur shtimi medies
sv: kunde inte lägga till media
tr: ortam eklenemiyor.

source: <relative path of synthesis> missing
ast: falta <camín rellativu de synthesis>
cs: <relativní cesta k syntéze> chybí
cy: <llwybr perthynnol synthesis> ar goll
da: <relativ sti for syntese> mangler
el: η <σχετική διαδρομή του synthesis> λείπει
es: falta <ruta relativa de synthesis>
et: Puudub <suhteline tee sünteesifaili juurde>
eu: <synthesis-en bide erlatiboa> falta da
fi: <synthesis-tiedoston suhteellinen polku> puuttuu
fr: <chemin relatif de synthesis> manquant
gl: falta a <ruta relativa a synthesis>
he: חסר <relative path of hdlist>
hu: <a fejléclista relatív útvonala> hiányzik
is: <tengda slóð að samantektarskrá> vantar
it: manca il <percorso relativo per synthesis>
nb: <relativ sti til synthesis> mangler
nl: <relatief pad van syntesis> ontbreekt
nn: Manglar <relativ stig til syntese>.
pl: brak <ścieżki względnej do pliku syntezy>
pt: falta a <localização relativa de synthesis>
pt_br: <caminho relativo do synthesis> faltando
ro: lipsește <calea relativă pentru synthesis>
ru: не указан <относительный путь к файлу synthesis>
sl: manjka <relativna pot do datotek synthesis>
sv: <relativ sökväg till synthesis> saknas
tr: <sentez'in göreli yolu> eksik

source: Can't use %s with remote medium
ast: Nun pue usase %s col mediu remotu
cs: Nelze použít %s se vzdáleným zdrojem
cy: Methu defnyddio %s gyda chyfrwng pell
da: Kan ikke bruge '%s' med eksternt medie.
el: Αδυναμία χρήσης του %s με το απομακρυσμένο μέσο
es: No se puede usar %s con un soporte remoto
et: %s kasutamine ei ole võimalik võrguandmekandjaga
eu: Urruneko euskarriekin ezin da %s erabili
fi: %s ei voida käyttää etämedian kanssa
fr: Impossible d'utiliser %s avec un média distant
gl: Non se pode usar %s cun soporte remoto
he: לא מצליח להשתמש ב-%s עם מקור מרוחק
hu: "%s" távoli adatforrással nem használható
id: Tidak bisa menggunakan %s tanpa media remote
is: Get ekki notað %s með fjartengdum miðli
it: Non si può usare %s con un supporto remoto
nb: Kan ikke bruke %s med eksternt medie
nl: Kan %s niet met medium op afstand gebruiken
nn: Kan ikkje bruka «%s» med fjernmedium.
pl: Nie można użyć %s ze zdalnym nośnikiem
pt: Não é possível usar %s com uma média remota
pt_br: Não se pode usar %s com mídia remota
ro: Nu se poate utiliza %s cu mediul distant
ru: %s нельзя использовать без удалённого источника
sl: Ni mogoče uporabiti %s z oddaljenim virom
sv: Kan inte använda %s med fjärr-media
tr: %s , uzak ortam ile birlikte kullanılamıyor.

source: --checkpoint - set repackaging start now
cs: --checkpoint - nastaví checkpoint
cy: --checkpoint - gosod cychwyn ailbacio nawr
da: --checkpoint - sæt genpakkestart nu
es: --checkpoint - inicializar ahora el punto de referencia
eu: --checkpoint - ezarri birpaketatze bat orain hasi dadin
fi: --checkpoint - aseta uudelleenpaketoinnin alku nyt
hu: --checkpoint - újracsomagolás indítása most
id: --checkpoint - tentukan pemaketan ulang dimulai sekarang
is: --checkpoint - setja endurpökkunar ræsipunkt hér
it: --checkpoint - fa partire il repackaging adesso
nb: --checkpoint – sett ompakkingstart nå.
pl: --checkpoint - ustawia start ponownego tworzenia pakietu
pt: --checkpoint - define o reempacotamento para começar agora
ro: --checkpoint - stabilirea punctului începerii acum a reîmpachetării
sv: --checkpoint - sätt ompaketeringsstart nu
tr: --checkpoint - yeniden paketleme başlangıcını şimdi belirle.

source: --noclean - don't clean repackage directory on checkpoint
cs: --noclean - nebudou odstraněny soubory na checkpointu
cy: --noclean - peidio glanhau rpm ar checkpoint
es: --noclean - no eliminar los rpms del cache en la creación del punto de referencia
fi: --noclean - älä tyhjennä uudelleenpaketointikansiota varmistuspisteessä
hu: --noclean - ellenőrzőpont (checkpoint) esetén ne törlődjön az újracsomagolási könyvtár
id: --noclean - jangan hapus direktori repackage pada checkpoint
it: --noclean - non pulisce la cartella di repackage al checkpoint
pt: --noclean - não limpa o directório de reempacotamento no ponto de verificação
ro: --noclean - nu se curăță directorul de reîmpachetare la marcaj
sv: --noclean - rensa inte ompaketeringskatalog vid kontrollpunkt.
tr: --noclean - denetleme noktasındaki yeniden paketleme dizinini temizleme.
