Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --bug - output a bug report in directory indicated by next arg.
ast: --bug - emitir un informe de fallu dedireutoriu indicáu pol argumentu siguiente.
ca: --bug - crea un informe d'errors en el directori que s'indica en l'argument següent.
cs: --bug - vygeneruje hlášení o chybě do adresáře zadaného následujícím parametrem
cy: --bug - cynhyrchu adroddiad gwall i'r cyfeiriadur nodir gan yr arg. nesaf
da: --bug - udskriv en fejlrapport i et katalog angivet i næste argument.
el: --bug - δημιουργία αναφοράς bug στον κατάλογο που καθορίζεται σε επόμενο ορισμό.
es: --bug - emitir un reporte de bug en el directorio indicado por el argumento siguiente.
et: --bug - vearaporti väljastamine kataloogi, mis on ära näidatud järgnevas argumendis.
eu: --bug - errorearen berri ematea bideratzen du, hurrengo argumentuak adierazitako direktorioan.
fi: --bug - kirjoittaa virheraportin hakemistoon, joka määritellään seuraavassa muuttujassa.
fr: --bug - générer un rapport d'anomalie dans le répertoire indiqué en second argument.
gl: --bug - crear un informe de erro no directorio indicado polo seguinte argumento.
he: --bug - ייצר קובץ שגיאות בספריה הנתונה על ידי המשתנה הבא.
hu: --bug - hibajelentés írása a következő argumentumban megadott könyvtárba
id: --bug - keluarkan laporan bug ke direktori yang ditentukan oleh arg. berikut.
is: --bug - skrifa út villutilkynningu í möppuna sem tilgreind er í næsta viðfangi.
it: --bug - produce un bug report nella directory indicata con l'argomento successivo.
nb: --bug – skriv feilrapport i mappen valgt av neste argument.
nl: --bug - schrijf een foutrapport naar de map aangegeven door het volgende argument.
nn: --bug – Skriv feilrapport i mappa valt av neste argument.
pl: --bug - raport błędów w katalogu wskazanym przez następny argument
pt: --bug - escreve um relatório de erro na pasta indicada no próximo argumento.
pt_br: --bug - escreve um relatório de falhas no diretório indicado pelo próximo argumento.
ro: --bug - produce un raport de erori în directorul indicat de argumentul următor.
ru: --bug - сохранить отчёт об ошибках в каталог, определённый следующим аргументом
sl: --bug - pripravi poročilo o napaki v mapo nakazano z naslednjim argumentom.
sq: --bug - dorëzoje një raport të bug(it) në repertorin e sugjeruar nga argumenti i dytë.
sv: --bug - mata ut en felrapport i katalogen som indikeras av nästa arg.
tr: --bug - sonraki argüman tarafından belirtilen dizini bir hata raporu oluştur.

source: --excludepath - exclude path separated by comma.
ast: --excludepath - camín d'esclusión dixebráu por coma.
cs: --excludepath - nebrat v úvahu cestu oddělenou čárkami
cy: --excludepath - eithrio llwybr wedi ei wahanu a chollnod.
da: --excludepath - udelukkelsessti adskilt med komma.
el: --excludepath - εξαιρούμενες διαδρομές διαχωρισμένες με κόμμα.
es: --excludepath - ruta de exclusión separada por coma.
et: --excludepath - eiratakse asukohta (või asukohti, eraldajaks koma).
eu: --excludepath - kanpoan uzten du komaz bereizitako bide-izena.
fi: --excludepath - jätä asentamatta seuraaviin pilkuilla eroteltuihin hakemistoihin.
fr: --excludepath - exclure les chemins indiqués, séparés par des virgules.
gl: --excludepath - excluir as rutas separadas por comas.
hu: --excludepath - bizonyos útvonalak (elválasztás: vessző) kihagyása
id: --excludepath - path pengecualian, dipisah oleh koma.
is: --excludepath - undanskilja slóðir, aðskildar með kommu.
it: --excludepath - percorsi da escludere, separati da virgole.
nb: --excludepath – hopp over sti (kommadelt liste).
nl: --excludepath - pad (gescheiden door komma) uitsluiten.
nn: --excludepath – Hopp over stig (kommadelt liste).
pl: --excludepath - wyłącza ścieżki oddzielone przecinkami.
pt: --excludepath - exclui localizações separadas por vírgulas.
pt_br: --excludepath - exclui o(s) caminho(s), separados por vírgula.
ro: --excludepath - exclude calea separată prin virgulă.
ru: --excludepath - исключить пути, перечисленные через запятую
sl: --excludepath - izključi poti ločene z vejico.
sq: --excludepath - përdori vetëm burimet e ndara me presje.
sv: --excludepath - ignorera sökväg separerad av komma.
tr: --excludepath - virgül ile ayrılmış yolları dahil etme.

source: --excludedocs - exclude doc files.
ast: --excludedocs - excluyir ficheros de documentación.
ca: --excludedocs - exclou els fitxers de documentació.
cs: --excludedocs - vynechá soubory s dokumentací
cy: --excludedocs - eithrio ffeiliau docs.
da: --excludedocs - udelader docs-filer.
el: --excludedocs - εξαιρούμενα αρχεία τεκμηρίωσης.
es: --excludedocs - excluir archivos de documentación.
et: --excludedocs - jäetakse välja dokumentatsioonifailid.
eu: --excludedocs - docs fitxategiak kanpoan uzten ditu.
fi: --excludedocs - jätä dokumentaatio asentamatta.
fr: --excludedocs - exclure les fichiers de documentation.
gl: --excludedocs - exclúe os ficheiros da documentación.
he: --excludedocs - למעט קבצי מסמכים.
hu: --excludedocs - dokumentációs fájlok kihagyása
id: --excludedocs - pengecualian untuk file dokumentasi.
is: --excludedocs - undanskilja doc skrár (handbækur).
it: --excludedocs - esclude i file di documentazione.
nb: --excludedocs – ikke ta med dokumentfiler.
nl: --excludedocs - doc bestanden niet meerekenen.
nn: --excludedocs – Ikkje ta med hjelpefiler.
pl: --excludedocs - wyłącza pliki dokumentacji.
pt: --excludedocs - exclui os ficheiros de documentação.
pt_br: --excludedocs - exclui arquivos de documentação.
ro: --excludedocs - exclude fișierele de documentație.
ru: --excludedocs - исключить файлы документации (docs)
sl: --excludedocs - izključi datoteke z dokumentacijo.
sq: --excludedocs - mos i prano skedaret doc.
sv: --excludedocs - exkludera dokumentfiler.
tr: --excludedocs - doc dosyalarını dışla.

source: --ignoresize - don't verify disk space before installation.
ast: --ignoresize - non verificar espaciu en discu enantes de la instalación.
cs: --ignoresize - před instalací nekontrolovat prostor na disku
cy: --ignoresize - peidio gwirio maint ar ddisg cyn gosod.
da: --ignoresize - kontrollér ikke for ledig diskplads før installation.
el: --ignoresize - να μην γίνει έλεγχος της χωρητικότητας του δίσκου πριν την εγκατάσταση.
es: --ignoresize - no verificar espacio en disco antes de la instalación.
et: --ignoresize - kettaruumi ei kontrollita enne paigaldamist.
eu: --ignoresize - ez egiaztatu diskoan dagoen lekua instalazio aurretik.
fi: --ignoresize - älä tarkista vapaan tilan määrää ennen asennusta.
fr: --ignoresize - ne pas vérifier la place disque avant installation.
gl: --ignoresize - non verificar o espacio baleiro do disco antes de instalar.
hu: --ignoresize - telepítés előtt ne legyen ellenőrizve az üres lemezhely
id: --ignoresize - jangan verifikasi ruang diask sebelum installasi.
is: --ignoresize - ekki athuga með diskpláss fyrir uppsetningu.
it: --ignoresize -non verifica lo spazio disponibile prima dell'installazione
nb: --ignoresize – ikke kontroller at det er nok ledig diskplass før installering.
nl: --ignoresize - de vrije schijfruimte niet controleren voor installatie
nn: --ignoresize – Ikkje kontroller at det er nok ledig diskplass før installering.
pl: --ignoresize - anuluje sprawdzania miejsca na dysku przed instalacją.
pt: --ignoresize - não verifica o espaço em disco antes da instalação
pt_br: --ignoresize - não verifica o espaço em disco antes da instalação.
ro: --ignoresize - nu se verifică spațiul pe disc înaintea instalării.
ru: --ignoresize - не проверять дисковое пространство перед установкой
sl: --ignoresize - ne preverjaj velikosti praznega prostora pred namestitvijo.
sv: --ignoresize - kontrollera inte diskutrymme före installation.
tr: --ignoresize - yüklemeden önce disk alanını kontrol etme.

source: --ignorearch - allow to install rpms for unmatched architectures.
ast: --ignorearch - permitir instalar rpms pa arquitectures que nun correspuenden.
cs: --ignorearch - dovolí instalovat balíčky z jiných architektur
cy: --ignorearch - caniatáu gosod rpm ar gyfer saernïaeth annhebyg.
da: --ignorearch - tillad at installere rpm'er for forskellige arkitekturer.
el: --ignorearch - επιτρέπει την εγκατάσταση πακέτων για άλλες αρχιτεκτονικές.
es: --ignorearch - permitir instalar rpms para arquitecturas que no corresponden.
et: --ignorearch - lubatakse paigaldada sobimatule arhitektuurile mõeldud RPM-e.
eu: --ignorearch - bat ez datozen arkitekturetan instalatzen uzteko.
fi: --ignorearch - älä tarkista rpm-pakettien arkkitehtuuria.
fr: --ignorearch - autoriser l'installation de paquetages prévus pour d'autres architectures.
gl: --ignorearch - permitir instalar rpms de arquitecturas diferentes.
hu: --ignorearch - az RPM-csomagok telepítésének engedélyezése nem megfelelő architektúra esetén is
id: --ignorearch - ijinkan menginstall rpm dari arsitektur yang tidak sesuai.
is: --ignorearch - leyfa uppsetningu á rpm pökkum fyrir aðra vélbúnaðartegund.
it: --ignorearch - permette di installare pacchetti di altre architetture.
nb: --ignorearch – tillat å installere pakker for andre arkitekturer.
nl: --ignorearch - rpm-installatie voor niet-overeenkomende architecturen toestaan.
nn: --ignorearch – Tillat å installera pakkar for andre arkitekturar.
pl: --ignorearch - pozwól na instalację pakietów rpm przeznaczonych dla innych architektur.
pt: --ignorearch - permite instalar rpms de arquitecturas não correspondentes.
pt_br: --ignorearch - permite instalar rpms de arquiteturas divergentes.
ro: --ignorearch - permite instalarea pachetelor pentru o altă arhitectură.
ru: --ignorearch - разрешать устанавливать rpm-файлы для несоответствующих архитектур
sl: --ignorearch - dovoli namestitev paketov rpm drugačne arhitekture.
sv: --ignorearch - tillåt installation av rpm som inte matchar arkitektur.
tr: --ignorearch - eşleşmeyen mimarilerdeki rpm'lerin kurulmasına izin ver.

source: --noscripts - do not execute package scriptlet(s)
ast: --noscripts - non executar los scriplets del paquete
cs: --noscripts - nespustí skript(y) balíčku
cy: --noscripts - peidio gweithredu sgripledi pecyn(au)
da: --noscripts - kør ikke pakkers skript
el: --noscripts - να μην εκτελεστούν τα scripts εγκατάστασης
es: --noscripts - no ejecutar los scriplets del paquete
et: --noscripts - pakettide skripte ei käivitata.
eu: --noscripts - ez du scriptlet(s) paketea exekutatzen
fi: --noscripts - älä suorita pakettien komentosarjoja.
fr: --noscripts - ne pas exécuter les scripts d'installation
hu: --noscripts - a csomagok szkriptjei ne legyenek végrehajtva
id: --noscripts - tidak menjalankan script paket
is: --noscripts - ekki keyra uppsetninga-skriftur í pakka
it: --noscripts - non esegue gli script contenuti nei pacchetti
nb: --noscripts – ikke kjør pakkeskript
nl: --noscripts - de pakketscriptlet(s) niet uivoeren
nn: --noscripts – Ikkje køyr pakkeskript.
pl: --noscripts - nie uruchamiaj skryptów pakietu
pt: --noscripts - não executa o(s) script(s) do(s) pacote(s)
pt_br: --noscripts - não executa script(s) dos pacotes
ro: --noscripts - nu se execută scripturile suplimentare ale pachetului
ru: --noscripts - не выполнять scriptlet'ы пакета
sl: --noscripts - ne izvedi paketnih mini-skript.
sv: --noscripts - kör inte paketens skript
tr: --noscripts - hiç bir paket betiğini çalıştırma.

source: --replacefiles - ignore file conflicts
ast: --replacefiles - ignora conflictos de ficheros.
ca: --replacefiles - ignora conflictes de fitxers
cs: --replacefiles - ignorovat konflikty v souborech
cy: --replacefiles - anwybyddu gwrthdaro ffeiliau
da: --replacefiles - ignorér filkonflikter
el: --replacefiles - αγνοεί τις συγκρούσεις αρχείων
es: --replacefiles - ignora conflictos de archivos.
et: --replacefiles - failikonflikte eiratakse.
eu: --replacefiles - jaramonik ez fitxategi gatazkei
fi: --replacefiles - ohita tiedostoristiriidat.
fr: --replacefiles - ignore les conflits de fichiers.
hu: --replacefiles - ütközések figyelmen kívül hagyása
is: --replacefiles - hunsa árekstra á skrám
it: --replacefiles - ignora i conflitti tra file.
nb: --replacefiles – overse filkonflikter.
nl: --replacefiles - bestandsconflicten negeren.
nn: --replacefiles – Ignorer filkonfliktar.
pl: --replacefiles - ignoruje konflikty między plikami
pt: --replacefiles - ignora conflitos dos ficheiros
pt_br: --replacefiles - ignora conflitos de arquivos
ro: --replacefiles - ignoră conflictele de fișiere
ru: --conflicts - игнорировать конфликты файлов
sl: --replacefiles - spreglej spore med datotekami
sv: --replacefiles - ignorera filkonflikter
tr: --replacefiles - çakışanları yok say

source: --skip - packages which installation should be skipped
ast: --skip - paquetes que non deberíen instalase
ca: --skip - paquets que cal ignorar en la instal·lació
cs: --skip - balíčky, jejichž instalace by měla být přeskočena
cy: --skip - pecynnau dylid osgoi eu gosod.
da: --skip - pakker hvis installation bør overspringes
el: --skip - πακέτα τα οποία η εγκατάσταση θα πρέπει να παρακάμψει
es: --skip - paquetes que no deberían instalarse
et: --skip - paigaldamisel vahele jäetavad paketid.
eu: --skip - instalatu behar ez liratekeen paketeak
fi: --skip - paketit joiden asennus tulisi ohittaa.
fr: --skip - paquetages dont l'installation doit être ignorée
gl: --skip - omitir a instalación destes paquetes.
he: --skip - חבילות שיש לדלג על ההתקנה שלהן
hu: --skip - a nem telepítendő csomagok
id: --skip - paket installasi yang harus dilewati
is: --skip - pakkar sem ætti að sleppa uppsetningu
it: --skip - pacchetti da saltare durante l'installazione.
nb: --skip – pakker som installasjonen skal hoppe over
nl: --skip - pakketten waarvan de installatie moet worden overgeslagen
nn: --skip – Pakkar som installasjonen skal hoppa over.
pl: --skip - pakiety, których instalacja powinna być pominięta
pt: --skip - pacotes cuja instalação deve ser ignorada
pt_br: --skip - pacotes que a instalação deve ignorá-los.
ro: --skip - pachete a căror instalare ar trebui omisă
ru: --skip - пакеты, установка которых будет пропущена
sl: --skip - paketi, ki naj bodo pri namestitvi preskočeni
sv: --skip - paket som ej ska installeras.
tr: --skip - kurulumunun atlanılması gereken paketler

source: --prefer - packages which should be preferred
ast: --prefer - paquetes que deberíen ser preferíos
cs: --prefer - balíčky, které by měly být upřednostněny
cy: --prefer - pecynnau angenrheidiol
da: --prefer - Pakker som skal foretrækkes.
el: --prefer - πακέτα που θα πρέπει να προτιμηθούν
es: --prefer - paquetes que deberían ser preferidos
et: --prefer - eelistatavad paketid.
eu: --prefer - hobetsi beharko liratekeen paketeak
fi: --prefer - paketit, joita suositaan.
fr: --prefer - paquetages qui doivent être favorisés
hu: --prefer - előnyben részesítendő csomagok
is: --prefer - pakkar sem ættu að vera teknir framfyrir aðra
it: --prefer - pacchetti da preferire
nb: --prefer – pakker som skal foretrekkes
nl: --prefer - pakketten die de voorkeur dienen te krijgen
nn: --prefer – Pakkar som skal føretrekkast.
pl: --prefer - preferowane pakiety
pt: --prefer - pacotes que devem ser preferidos
pt_br: --prefer - pacotes que a instalação deve dar preferência
ro: --prefer - pachete care ar trebui preferate
ru: --prefer - предпочитаемые пакеты
sl: --prefer - paketi, ki so bolj zaželjeni
sv: --prefer - paket som skall föredras
tr: --prefer - tercih edilemesi gereken paketler.

source: --more-choices - when several packages are found, propose more choices than the default.
ast: --more-choices - cuando s'alcuentren dellos paquetes, proponer más opciones que les predeterminaes.
cs: --more-choices - pokud je nalezeno více balíčků, bude se nabízet více voleb než implicitně
cy: --more-choices - pan fydd nifer o becynnau wedi eu canfod, cynnig mwy o ddewis na'r rhagosodiad.
da: --more-choices - når flere pakker er fundet, så foreslå flere muligheder end normalt.
el: --more-choices - όταν βρίσκονται πολλά πακέτα, να προτείνονται περισσότερες επιλογές από αυτές της προεπιλογής.
es: --more-choices - cuando se encuentran varios paquetes, proponer más opciones que las predeterminadas.
et: --more-choices - mitme paketi leidmisel pakutakse lisaks vaikevalikule ka teisi valikuid.
eu: --more-choices - pakete ugari aurkitzen direnean, proposatu lehenetsiak baino aukera gehiago.
fi: --more-choices - mikäli löytyy useita paketteja, ehdota enemmän vaihtoehtoja kuin vain oletusvalinta.
fr: --more-choices - lorsque beaucoup de paquetages sont trouvés, proposer plus de choix que par défaut.
gl: --more-choices - cando se atopan varios paquetes, propoñer máis eleccións ademais da predeterminada.
he: --more-choices - כאשר קיימות מספר חבילות מתאימות, הצע מגוון אפשרויות ולא רק את ברירת המחדל.
hu: --more-choices - ha nagyobb mennyiségű csomagot talált a rendszer, akkor az alapértelmezettnél több lehetőséget kínáljon fel
id: --more-choices - ketika beberapa paket ditemukan, tampilkan pilihan lain dari nilai default.
is: --more-choices - þegar nokkrir pakkar finnast, tilgreina fleiri valkosti en venjulega.
it: --more-choices - qualora si trovassero più pacchetti propone più scelte che quelle predefinite.
nb: --more-choices – vis flere valg enn standard ved treff på flere pakker
nl: --more-choices - indien verscheidene pakketten worden gevonden, meer keuzemogelijkheden aanbieden dan gewoonlijk.
nn: --more-choices – Vis fleire val enn standard ved treff på fleire pakkar.
pl: --more-choices - gdy kilka pakietów zostanie znalezionych, proponuje większy wybór niż tylko domyślny.
pt: --more-choices - quando vários pacotes são encontrados, propõe mais escolhas do que o está predefinido.
pt_br: --more-choices - quando diversos pacotes forem encontrados, proponha mais escolhas por padrão.
ro: --more-choices - cînd sînt găsite mai multe pachete, se propun mai multe opțiuni decît în mod implicit.
ru: --more-choices - если найдены разные пакеты, предложить больше вариантов, чем предлагается по умолчанию
sl: --more-choices - ko je najdenih več paketov, ponudi več izbir kot je privzeto.
sv: --more-choices - om flera paket hittas, föreslå fler alternativ än standard.
tr: --more-choices - birden çok paket bulunduğunda, varsayılan yerine daha fazla seçenek teklif et.

source: --nolock - don't lock rpm db.
ast: --nolock - non trabar la DB de rpm.
cs: --nolock - nezamkne se databáze RPM balíčků
cy: --nolock - peidio cloi db rpm.
da: --nolock - lås ikke rpm-database.
el: --nolock - μα μην κλειδωθεί η βάση rpm.
es: --nolock - no bloquear la DB de rpm.
et: --nolock - RPM-ide andmebaasi ei lukustata.
eu: --nolock - ez giltzatu rpm db.
fi: --nolock - älä lukitse rpm-tietokantaa.
fr: --nolock - ne pas verrouiller la base rpm.
gl: --nolock - non bloquear a base de datos rpm.
hu: --nolock - ne legyen zárolva az RPM-adatbázis
id: --nolock - jangan kunci database rpm.
is: --nolock - ekki læsa rpm gagnagrunni.
it: --nolock - non bloccare il db degli rpm
nb: --nolock – ikke lås rpm-database.
nl: --nolock - rpm-database niet op slot zetten.
nn: --nolock – Ikkje lås pakkedatabasen.
pl: --nolock - nie blokuj bazy pakietów rpm.
pt: --nolock - não tranca a base de dados rpm.
pt_br: --nolock - não bloqueia o banco de dados rpm.
ro: --nolock - nu se blochează rpm db.
ru: --nolock - не блокировать базу данных rpm
sl: --nolock - ne zakleni podatkovne baze rpm.
sv: --nolock - lås inte rpm db.
tr: --nolock - rpm veritabanını kilitleme.

source: --strict-arch - upgrade only packages with the same architecture.
ast: --strict-arch - anovar namái paquetes cola mesma arquitectura.
cs: --strict-arch - aktualizovat pouze balíčky se shodnou architekturou
cy: --strict-arch - uwchraddio dim ond pecynnau gyda'r un bensaernïaeth.
da: --strict-arch - opgradér kun pakker med den samme arkitektur.
el: --strict-arch - αναβάθμισε μόνο τα πακέτα με την ίδια αρχιτεκτονική.
es: --strict-arch - actualiza sólo paquetes con la misma arquitectura.
et: --strict-arch - uuendatakse ainult senise arhitektuuriga pakette.
eu: --strict-arch - berritu soilik arkitektura berdina duten paketeak.
fi: --strict-arch - päivitä ainoastaan samaan arkkitehtuuriin kuuluvia paketteja.
fr: --strict-arch - mettre à jour uniquement les paquetages avec la même architecture.
gl: --strict-arch - actualizar só paquetes ca mesma arquitectura.
he: --strict-arch - עדכן רק חבילות בעלות אותה ארכיטקטורה.
hu: --strict-arch - csak az azonos architektúrájú csomagok frissítése
id: --strict-arch - hanya upgrade paket dengan arsitektur yang sama.
is: --strict-arch - uppfæra aðeins pakka með sömu vélbúnaðartegund.
it: --strict-arch - aggiorna solo i pacchetti della stessa architettura.
nb: --strict-arch – bare oppgrader pakker med samme arkitektur.
nl: --strict-arch - waardeer alleen pakketten op met dezelfde architectuur.
nn: --strict-arch – Berre oppgrader pakkar med same arkitektur.
pl: --strict-arch - aktualizuj tylko pakiety przygotowane dla tej samej architektury.
pt: --strict-arch - apenas actualiza os pacotes com a mesma arquitectura.
pt_br: --strict-arch - só atualiza os pacotes com a mesma arquitectura.
ro: --strict-arch - actualizează numai pachetele pentru aceeași arhitectură.
ru: --strict-arch - обновить пакеты только с такой же архитектурой
sl: --strict-arch - nadgradi samo pakete iste arhitekture.
sv: --strict-arch - uppdatera endast paket med samma arkitektur.
tr: --strict-arch - aynı mimaride olan paketleri güncelle.

source: -a - select all matches on command line.
ast: -a - seleiciona toles coincidencies en llinia de comandos.
ca: -a - selecciona totes les coincidències en la línia d'ordres.
cs: -a - vybere všechny vyhovující z příkazové řádky
cy: -a - dewis pob cydweddiad ar y llinell gorchymyn.
da: -a - vælg alle træffere på kommandolinje.
el: -a - επιλογή όλων των μέσων που ταιριάζουν στη γραμμή εντολών.
es: -a - selecciona todas coincidencias en línea de comando.
et: -a - valitakse kõik käsureaga sobivad.
eu: -a - komando-lerroko bat-etortze guztiak hautatzen ditu.
fi: -a - valitse kaikki komentoriviin täsmäävät.
fr: -a - sélectionner toutes les correspondances de la ligne de commande.
hu: -a - kijelölés a parancssorban megadott minta szerint
id: -a - pilih semua yg cocok dengan perintah baris.
is: -a - velja allt sem passar á skipanalínu.
it: -a - seleziona tutte le corrispondenze da riga di comando.
nb: -a – velg alle treff på kommandolinja.
nl: -a - selecteer alle resultaten van console.
nn: -a – Vel alle treff på kommandolinja.
pl: -a - wybiera wszystkie dopasowania w wierszu poleceń.
pt: -a - escolhe todas as correspondências na linha de comando.
pt_br: -a - seleciona todos os listados na linha de comando.
ro: -a - selectează toate potrivirile din linia de comandă.
ru: -a - выбрать все совпадения из командной строки
sl: -a - izberi vsa ujemanja v ukazni vrstici.
sq: -a - zgjedhni të gjitha korrespondencat në linjën komanduese.
sv: -a - välj alla träffar på kommandoraden.
tr: -a - komut satırındakilere uyanların tümünü seçer.

source: --quiet, -q - quiet mode.
ast: --quiet, -q - mou silenciosu.
ca: --quiet, -q - mode silenciós.
cs: --quiet, -q - režim bez výpisů
cy: --quiet, -q - modd distaw.
da: --quiet, -q - stille udgave.
el: --quiet, -q - σιωπηλή λειτουργία.
es: --quiet, -q - modo silencioso.
et: --quiet, -q - vaikne režiim.
eu: --quiet, -q - modu lasaia.
fi: --quiet, -q - hiljainen tyyli.
fr: --quiet, -q - mode silencieux.
gl: --quiet, -q - modo silencioso.
he: --quiet, -q - מצב שקט.
hu: --quiet, -q - néma üzemmód
id: --quiet, -q - mode diam.
is: --quiet, -q - hljóður hamur.
it: --quiet, -q - modalità silenziosa.
nb: --quiet, -q – stille modus.
nl: --quiet, -q - stille modus.
nn: --quiet, -q – Stillemodus.
pl: --quiet, -q - tryb cichy.
pt: --quiet, -q - modo silencioso.
pt_br: --quiet, -q - modo silencioso.
ro: --quiet, -q - mod silențios.
ru: --quiet, -q - тихий режим (quiet)
sl: --quiet, -q - tihi način.
sv: --quiet, -q - tyst läge.
tr: --quiet, -q - Sessiz kipi.
