Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --distribution - distribution
ast: --distribution - distribución
cs: --distribution - distribuce
cy: --distribution - dosbarthiad
el: --distribution - αναζήτηση στο πεδίο «Διανομή»
es: --distribution - distribución
et: --distribution - distributsioon
eu: --distribution - banaketa
fi: --distribution - jakelu.
fr: --distribution - chercher dans le champ « distribution »
gl: --distribution - distribución
he: --distribution - הפצה
hu: --distribution - disztribúció
id: --distribution - distribusi
is: --distribution - dreifing
it: --distribution - distribuzione
nb: --distribution – distribusjon
nl: --distribution - distributie
nn: --distribution – Distribusjon.
pl: --distribution - dystrybucja
pt: --distribution - distribuição
pt_br: --distribution - distribuição
ro: --distribution - distribuție
ru: --distribution - дистрибутив
sl: --distribution - distribucija
sv: --distribution - visa distribution
tr: --distribution - dağıtım

source: --epoch - epoch
ast: --epoch - época
ca: --epoch - mostra l'etiqueta epoch: època.
cs: --epoch - epocha
cy: --epoch - cyfnod
da: --epoch - epoke
el: --epoch - αναζήτηση στο πεδίο «epoch»
es: --epoch - época
et: --epoch - epohh
eu: --epoch - garaia.
fi: --epoch - aikakausi.
fr: --epoch - chercher dans le champ « epoch »
hu: --epoch - generáció
is: --epoch - tímapunktur.
it: --epoch - epoca di compilazione.
pl: --epoch - iteracja
pt: --epoch - época
ro: --epoch - epocă
sl: --epoch - doba
sv: --epoch - visa epok
tr: --epoch - tarih

source: --filename - filename of the package
ast: --filename - nome de ficheru del paquete
cs: --filename - název souboru balíčku
cy: --filename - enw ffeil y pecyn
da: --filename - filnavn på pakken
el: --filename - αναζήτηση στο όνομα αρχείου του πακέτου
es: --filename - nombre de archivo del paquete
et: --filename - paketi failinimi
eu: --filename - paketearen fitxategi izena
fi: --filename - paketin tiedostonimi.
fr: --filename - chercher dans le nom de fichier du paquetage
gl: --filename - nome de ficheiro do paquete
he: --filename - שם הקובץ של החבילה
hu: --filename - a csomag fájlneve
id: --filename - nama file paket
is: --filename - skráarnafn pakka
it: --filename - nome dei pacchetti.
nb: --filename – filnavnet til pakka
nl: --filename - bestandsnaam van het pakket
nn: --filename – Filnamnet til pakken.
pl: --filename - nazwa pakietu.
pt: --filename - nome do ficheiro do pacote
pt_br: --filename - nome do pacote
ro: --filename - denumirea fișierului pachetului
ru: --filename - имя пакета
sl: --filename - datotečno ime paketa
sq: --filename - emri i paketës
sv: --filename - paketets filnamn
tr: --filename - paketin dosya adı

source: --files - list of files contained in the package
ast: --files - llista de ficheros conteníos nel paquete
ca: --files - llista els fitxers del paquet.
cs: --files - seznam souborů obsažených v balíčku
cy: --files - rhestr ffeiliau o fewn y pecyn
da: --files - liste over filer i pakken
el: --files - αναζήτηση στη λίστα των αρχείων του πακέτου.
es: --files - lista de archivos contenidos en el paquete
et: --files - paketi failide nimekiri
eu: --files - paketeak biltzen dituen fitxategien izen zerrenda
fi: --files - listaa paketissa olevat tiedostot.
fr: --files - chercher dans la liste des fichiers d'un paquetage
gl: --files - lista dos ficheiros contidos no paquete
he: -files - רשימת הקבצים הכלולים בחבילה.
hu: --files - a csomagban levő fájlok listája
id: --files - daftar file yang terdapat pada paket
is: --files - listi af skrám sem eru í pakkanum
it: --files - elenca i file presenti in un pacchetto.
nb: --files – liste over filer i pakka
nl: --files - geeft alle bestanden in het pakket weer
nn: --files – Oversikt over filer i pakken.
pl: --files - lista plików zawartych w pakiecie
pt: --files - lista dos ficheiros existentes no pacote
pt_br: --files - lista de arquivos contidos no pacote
ro: --files - lista fișierelor conținute în pachet
ru: --files - список файлов в пакете
sl: -files - seznam datotek v paketu
sq: --files - listën e skedarëve të përmbajtur në paketë
sv: --files - lista filer i paketet
tr: --files - paketin içerdiği dosyaların listesi

source: --group - group
ast: --group - grupu
ca: --group - mostra el grup del paquet.
cs: --group - skupina
cy: --group - grŵp
da: --group - gruppe
el: --group - αναζήτηση στο πεδίο της Ομάδας
es: --group - grupo
et: --group - grupp
eu: --group - taldea
fi: --group - ryhmä.
fr: --group - chercher dans le champ « Group »
gl: --group - grupo
he: --group - קבוצה
hu: --group - csoport
id: --group - grup
is: --group - hópur.
it: --group - gruppo
nb: --group – gruppe
nl: --group - groep
nn: --group – Gruppe.
pl: --group - grupa
pt: --group - grupo
pt_br: --group - grupo
ro: --group - grup
ru: --group - группа
sl: --group - skupina
sv: --group - visa grupp
tr: --group - grup

source: --license - license
ast: --license - llicencia
cs: --license - licence
cy: --license - trwydded
da: --license - licens
el: --license - αναζήτηση στο πεδίο Άδειας χρήσης
es: --license - licencia
et: --license - litsents
eu: --license - lizentzia
fi: --license - lisenssi.
fr: --license - licence
gl: --license - licenza
hu: --license - licenc
is: --license - höfundarleyfi
it: --license - licenza
nb: --license – lisens
nl: --license - licentie
nn: --license – Vis lisensvilkår.
pl: --license - licencja
pt: --license - licença
pt_br: --license - licença
ro: --license - licență
ru: --license - лицензия
sl: --license - licenca
sq: --license - liçensë
sv: --license - licens
tr: --license - lisans

source: --name - package name
ast: --name - nome del paquete
cs: --name - název balíčku
cy: --name - enw'r pecyn
da: --name - pakkenavn
el: --name - αναζήτηση στο όνομα του πακέτου
es: --name - nombre del paquete
et: --name - paketi nimi
eu: --name - pakete izena
fi: --name - paketin nimi.
fr: --name - chercher dans le nom du paquetage
gl: --name - nome do paquete
he: --name - שם החבילה
hu: --name - csomagnév
id: --name - nama paket
is: --name - pakkanafn.
it: --name - nome del pacchetto.
nb: --name – pakkenavn
nl: --name - pakketnaam
nn: --name – Pakkenamn.
pl: --name - nazwa pakietu
pt: --name - nome do pacote
pt_br: --name - nome do pacote
ro: --name - numele pachetului
ru: --name - имя пакета
sl: --name - ime paketa
sq: --name - emri paketës
sv: --name - visa paketnamn
tr: --name - paket adı

source: --obsoletes - obsoletes tags
ast: --obsoletes - tolo obsoleto
ca: --obsoletes - mostra l'etiqueta obsoletes: tots els paquets que deixa obsolets.
cs: --obsoletes - co se nahrazuje (dělá zastaralým)
cy: --obsoletes - tagiau'r hen
da: --obsoletes - mærk forældet
el: --obsoletes - αναζήτηση στο πεδίο «Obsoletes»
es: --obsoletes - todo lo obsoleto
et: --obsoletes - iganenute sildid
eu: --obsoletes - "zaharkituak" etiketak
fi: --obsoletes - vanhentamismerkinnät ("Obsoletes").
fr: --obsoletes - chercher dans le champ « obsoletes »
hu: --obsoletes - "elavulttá tesz" címkék
id: --obsoletes - tag kadaluarsa
is: --obsoletes - úreldir (tög)
it: --obsoletes - lista di quanto reso obsoleto dal pacchetto.
nb: --obsoletes – utdaterer tagger
nl: --obsoletes - obsoletes('maakt overbodig')-tags
nn: --obsoletes – Utdatert-merkelappar.
pl: --obsoletes - wszystkie przestarzałe znaczniki
pt: --obsoletes - marcas de obsoletos
pt_br: --obsoletes - lista todos arquivos obsoletos
ro: --obsoletes - listează toate fișierele învechite
ru: --obsoletes - теги obsoletes (устаревшие)
sl: --obsoletes - oznake nadomeščenih paketov
sv: --obsoletes - visa ersätter
tr: --obsoletes - gereksiz kılınanlar etiketi

source: --packager - packager
ast: --packager - empaquetador
ca: --packager - empaquetador.
cs: --packager - kdo vytvořil balíček
cy: --packager - pecynydd
da: --packager - pakkeprogram.
el: --packager - αναζήτηση στο πεδίο του δημιουργού του πακέτου
es: --packager - quien lo empaquetó
et: --packager - paketi valmistaja
eu: --packager - paketatzailea
fi: --packager - paketoija.
fr: --packager - chercher dans le nom du créateur du paquetage
gl: --packager - empaquetador
he: --packager - האורז
hu: --packager - csomagkészítő
id: --packager - pemaket
is: --packager - pakkað af
it: --packager - curatore del pacchetto.
nb: --packager – pakkebygger
nl: --packager - pakketsamensteller.
nn: --packager – Pakkebyggjar.
pl: --packager - osoba tworząca pakiet
pt: --packager - empacotador
pt_br: --packager - empacotador
ro: --packager - creator
ru: --packager - создатель пакета
sl: --packager - avtor paketa
sv: --packager - visa paketerare
tr: --packager - paketleyen

source: --provides - provides tags
ast: --provides - etiquetes del proveedor
ca: --provides - mostra l'etiqueta provides: tots allò que proporciona.
cs: --provides - co se poskytuje
cy: --provides - tag darparu
da: --provides - tilbudsetiketter
el: --provides - αναζήτηση στο πεδίο «Provides»
es: --provides - lo que proporciona
et: --provides - pakutavate sildid
eu: --provides - "hornitu" etiketak.
fi: --provides - tarjoamismerkinnät ("Provides").
fr: --provides - chercher dans le champ « provides »
gl: --provides - etiquetas proporciona
hu: --provides - "szolgáltatásjegyzék" címkék
id: --provides - tag yang disediakan
is: --provides - hvað er skaffað.
it: --provides - elementi forniti dal pacchetto.
nb: --provides – tilbudstagger
nl: --provides - provides('levert')-tags
nn: --provides – Tilbod-merkelappar.
pl: --provides - znacznik provides: wszystkie. pakiety.
pt: --provides - marcas de fornecimentos (provides)
pt_br: --provides - lista dos que provem o pacote
ro: --provides - furnizează lista pachetelor
ru: --provides - теги provides (предоставляются)
sl: --provides - oznake vsebovanih paketov
sv: --provides - visa tillhandahålls
tr: --provides - sunulanlar etiketi

source: --requires - requires tags
ast: --requires - etiquetes requerimientos
ca: --requires - mostra l'etiqueta requires: tots allò que necessita.
cs: --requires - co se požaduje
cy: --requires - tagiau angenrhaid
da: --requires - afhængighedsetiketter
el: --requires - αναζήτηση στο πεδίο Εξαρτήσεων
es: --requires - lo que necesita
et: --requires - nõutavate sildid
eu: --requires - "beharrezko" etiketak
fi: --requires - riippuvuusmerkinnät ("Requires").
fr: --requires - chercher dans la liste des dépendances
gl: --requires - etiquetas require
hu: --requires - "követelmények" címkék
id: --requires - tag kebutuhan
is: --requires - þarfnast (tög)
it: --requires - requisiti necessari per installare il pacchetto.
nb: --requires – avhengighetstagger
nl: --requires - requires('vereist')-tags
nn: --requires – Krev-merkelappar.
pl: --requires - wszystkie zależności.
pt: --requires - marcas de requerimentos (requires).
pt_br: --requires - lista dos que requerem o pacote
ro: --requires - lista pachetelor necesare
ru: --requires - теги requires (требуются)
sl: --requires - oznake zahtevanih paketov
sv: --requires - visa krav
tr: --requires - gereklilikler etiketi

source: --size - installed size
ast: --size - tamañu instaláu
cs: --size - instalovaná velikost
cy: --size - maint wedi gosod
da: --size - installeret størrelse
el: --size - αναζήτηση στο πεδίο μέγεθος μετά την εγκατάσταση
es: --size - tamaño instalado
et: --size - paigalduse suurus
eu: --size - neurria instalatu ondoren
fi: --size - koko asennettuna.
fr: --size - chercher dans le champ taille après installation
gl: --size - tamaño despois de instalar
he: --size - גודל מותקן
hu: --size - telepített méret
id: --size - ukuran yang terinstall
is: --size - uppsett stærð.
it: --size - dimensione del pacchetto installato.
nb: --size – installert størrelse
nl: --size - geïnstalleerde grootte.
nn: --size – Installert storleik.
pl: --size - rozmiar
pt: --size - tamanho instalado
pt_br: --size - tamanho da instalação.
ro: --size - spațiul instalat ocupat
ru: --size - установленный размер
sl: --size - velikost namestitve
sv: --size - visa installerad storlek
tr: --size - kurulu boyut

source: --sourcerpm - source rpm name
ast: --sourcerpm - nome del rpm fonte
cs: --sourcerpm - název zdrojového balíčku rpm
cy: --sourcerpm - enw rpm ffynhonnell
da: --sourcerpm - navn på kilde-rpm
el: --sourcerpm - αναζήτηση στο όνομα του πηγαίου πακέτου
es: --sourcerpm - nombre del rpm fuente
et: --sourcerpm - lähtekoodi RPM-i nimi
eu: --sourcerpm - rpm iturburu izena.
fi: --sourcerpm - lähdepaketin nimi.
fr: --sourcerpm - chercher dans le nom du paquetage source
gl: --sourcerpm - nome do rpm fonte
hu: --sourcerpm - a forráscsomag neve
id: --sourcerpm - nama rpm sumber
is: --sourcerpm - frum-rpm-skrá.
it: --sourcerpm - nome dei pacchetti rpm con i sorgenti.
nb: --sourcerpm – navn på kilde-rpm
nl: --sourcerpm - naam van de broncode-rpm.
nn: --sourcerpm – Namn på kjelde-RPM.
pl: --sourcerpm - nazwa pakietu rpm ze źródłami
pt: --sourcerpm - nome do rpm de código fonte
pt_br: --sourcerpm - nome da fonte do rpm
ro: --sourcerpm - numele pachetului sursă
ru: --sourcerpm - rpm с исходными кодами
sl: --sourcerpm - ime izvornega paketa rpm
sv: --sourcerpm - visa källrpm-namn
tr: --sourcerpm - kaynak rpm adı

source: --suggests - suggests tags
cs: --suggests - doporučené (navrhované) balíčky
cy: --suggests - cynnig tagiau
da: --suggests - Forslagsetiketter.
es: --suggests - lo que sugiere
eu: --suggests - bilatu «suggests» bezala markatutakoen artean
fi: --suggests - ehdotusmerkinnät ("Suggests").
gl: --suggests - etiquetas suxire
hu: --suggests - "javasol" címkék
is: --suggests - tillögur (tög)
it: --suggests - lista dei pacchetti suggeriti
nb: --suggests – forslagstagger
pl: --suggests - znaczniki z sugestiami
pt: --suggests - marcas sugeridas
ro: --suggests - lista de sugestii
sv: --suggests - suggests tag
tr: --suggests - önerilenler etiket

source: --summary - summary
ast: --summary - resume
ca: --summary - imprimeix el resum.
cs: --summary - shrnutí
cy: --summary - crynodeb
da: --summary - sammendrag
el: --summary - αναζήτηση στο πεδίο «Περίληψη»
es: --summary - resumen
et: --summary - kokkuvõte
eu: --summary - laburpena
fi: --summary - yhteenveto.
fr: --summary - chercher dans le résumé
gl: --summary - resumo
hu: --summary - összefoglaló
id: --summary - ringkasan
is: --summary - samantekt
it: --summary - sommario del pacchetto.
nb: --summary – sammendrag
nl: --summary - samenvatting
nn: --summary – Samandrag.
pl: --summary - podsumowanie
pt: --summary - sumário
pt_br: --summary - sumário
ro: --summary - sumar
ru: --summary - сводка
sl: --summary - povzetek
sv: --summary - visa summerig
tr: --summary - özet

source: --vendor - vendor
ast: --vendor - fabricante
cs: --vendor - dodavatel
cy: --vendor - gwerthwr
da: --vendor - leverandør
el: --vendor - αναζήτηση στο πεδίο του «Προμηθευτή»
es: --vendor - fabricante
et: --vendor - tootja
eu: --verbose - hornitzailea
fi: --vendor - toimittaja.
fr: --vendor - chercher dans le nom du fournisseur
gl: --vendor - vendedor
hu: --vendor - terjesztő
is: --vendor - útgefandi
it: --vendor - fornitore
nb: --vendor – leverandør
nl: --vendor - leverancier
nn: --vendor – Leverandør.
pl: --vendor - dostawca
pt: --vendor - vendedor
pt_br: --vendor - fabricante
ro: --vendor - fabricant
ru: --vendor - поставщик
sl: --vendor - ponudnik
sq: --vendor - shitës
sv: --vendor - visa distributör
tr: --vendor - sağlayıcı

source: -m - the media in which the package was found
ast: -m - el preséu nel que s'atopó'l paquete
cs: -m - zdroj, ve kterém byl balíček nalezen
cy: -m - y cyfrwng lle cafwyd y pecyn
da: -m - mediet i hvilken pakken blev fundet
el: -m - εμφανίζει το μέσο στο οποίο βρέθηκε το πακέτο
es: -m - el soporte en el que se encontró el paquete
et: -m - paketti sisaldav andmekandja
eu: -m - paketea zeukan euskarria
fi: -m - media, josta paketti löytyy.
fr: -m - chercher dans le média où le paquetage a été trouvé
gl: -m - o soporte no que se atopou o paquete
he: -m - המקור בו נמצאה החבילה
hu: -m - a csomagot tartalmazó adatforrás
id: -m - media dimana paket ditemukan
is: -m - miðillinn sem innihélt pakkann
it: -m - il supporto dov'è stato trovato il pacchetto
nb: -m – mediet som pakka ble funnet i
nl: -m - de media waarin het pakket gevonden is
nn: -m – Mediet som pakken vart funnen i.
pl: -m - nośnik na którym znajduje się pakiet
pt: -m - a média onde o pacote foi encontrado
pt_br: -m - a mídia onde o pacote foi encontrado
ro: -m - mediul în care a fost găsit pachetul
ru: -m - источник, в котором был найден пакет
sl: -m - vir, kjer je bil paket najden
sv: -m - visa källan paketet finns i
tr: -m - paketin bulunduğu kurulum kaynağı.

source: -f - print version, release and arch with name.
ast: -f - imprenta versión, release y arquitectura con nome.
ca: -f - mostra la versió, llançament i arquitectura amb el nom.
cs: -f - společně se jménem vypíše verzi, vydání a architekturu
cy: -f - argraffu fersiwn a rhyddhad ac arch gydag enw.
da: -f - udskriv version, udgave og arkitektur med navn.
el: -f - εμφανίζει την έκδοση, κυκλοφορία και αρχιτεκτονική στο όνομα του πακέτου.
es: -f - imprime versión, release y arquitectura con nombre.
et: -f - näitab koos nimega versiooni, väljalaset ja arhitektuuri.
eu: -f - bertsioa, argitalpena eta fitxategia ere izenarekin inprimatzen ditu.
fi: -f - tulosta nimen lisäksi versio, julkaisu ja arkkitehtuuri.
fr: -f - afficher la version, la release et l'architecture du paquetage avec le nom.
gl: -f - imprime a versión, a edición e o nome da arquitectura.
he: -f - הדפסת גרסה, שחרור וארכיון עם שם.
hu: -f - a névvel együtt a verzió, a kiadásszám és az architektúra is jelenjen meg
id: -f - cetak versi, rilis dan arch dengan nama.
is: -f - prenta útgáfu, undirnúmer og vélartegund með nafni.
it: -f - stampa versione, release e architettura con il nome.
nb: -f – vis versjon, utgivelse og arkitektur med navn.
nl: -f - geeft de versie, uitgave en arch met naam.
nn: -f – Vis versjon-, utgåve og arkitekturinformasjon.
pl: -f - wyświetla wersję, wydanie oraz archiwum z nazwą.
pt: -f - mostra a versão, a saída e a arquitectura com o nome.
pt_br: -f - imprime versão, 'release' e arquitetura, com nome.
ro: -f - afișează versiunea, ediția și arhitectura cu nume.
ru: -f - показать версию, релиз и архитектуру с названием
sl: -f - izpis različice, izdaje in arhitekture z vsakim imenom.
sq: -f - çfaqe versionin, hollësitë dhe arkitekturen me emër.
sv: -f - visa version, utgåva och arkitektur med namn.
tr: -f - sürüm, yayımı ve mimarisini yazdırır.

source: unterminated expression (%s)
ast: espresión non finada (%s)
cs: neukončený výraz (%s)
cy: Mynegiadauheb ei derfynnu (%s)
da: uafsluttet udtryk (%s)
el: μη τερματισμένη έκφραση (%s)
es: expresión no terminada (%s)
et: lõpetamata avaldis (%s)
eu: amaitugabeko adierazpena (%s)
fi: Päättämätön hakulauseke (%s)
fr: expression non terminée (%s)
hu: befejezetlen kifejezés (%s)
is: ólokuð segð (%s)
it: espressione non completata (%s)
nb: uavbrutt uttrykk (%s)
nl: niet-afgesloten uitdrukking (%s)
nn: Uavslutta uttrykk: %s
pl: niezakończone wyrażenie (%s)
pt: expressão não terminada (%s)
pt_br: expressão indeterminada (%s)
ro: expresie nedeterminată (%s)
ru: незавершённое выражение (%s)
sl: nezaključen izraz (%s)
sv: ej avslutat mönster-uttryck (%s)
tr: sonlandırılmamış ifade (%s)

source: Incorrect format: you may use only one multi-valued tag
ast: Formatu incorreutu: tienes d'usar namái una etiqueta multi-valor
cs: Nesprávný formát: můžete použít pouze jeden vícehodnotový tag
cy: Fformat anghywir: gallwch ddefnyddio un tag aml-werth yn unig
da: Ugyldigt format: du kan kun bruge flerværdi-etiketter
el: Άγνωστος τύπος: μπορείτε να χρησιμοποιήσετε μόνο μια επιλογή πολλαπλών τιμών (multi-valued tag)
es: Formato incorrecto: debe usar sólo una etiqueta multi-valor
et: Vigane vorming: kasutada tohib ainult üht mitme väärtusega silti
eu: Formatu okerra: etiketa balio-anitz bakarra erabili dezakezu
fi: Virheellinen muoto: vain yhtä moniarvoista merkintää voi käyttää kerrallaan
fr: Format incorrect : vous ne pouvez utiliser qu'une seule option multi-valeur
gl: Formato incorrecto: só pode usar unha etiqueta multivaluada
hu: Helytelen formátum: csak egy darab többértékű címke használható
id: Format tidak benar: Anda hanya boleh menggunakan satu tag yang bernilai banyak
is: Ógilt snið: þú mátt aðeins nota eitt fjölgildis-tag
it: formato non corretto, puoi usare una sola etichetta multi-valore
nb: Ugyldig format: du kan bare bruke én flerverditagg
nl: Onjuist formaat: u mag maar één tag gebruiken met meerdere waarden
nn: Ugyldig format: Du kan berre bruka éin fleirverdi-merkelapp.
pl: Nieprawidłowy format: możesz używać tylko znaczniki wielowartościowe
pt: Formato incorrecto: pode apenas usar uma marca multi-avaliada
pt_br: Formato incorreto: você deve utilizar somente uma opção com múltiplos valores
ro: Format incorect: puteți utiliza numai o singură etichetă cu valori multiple
ru: Неверный формат: можно использовать только один тег с несколькими значениями
sl: Nepravilen format: uporabite lahko samo eno oznako z več vrednostmi
sv: Felaktigt format: du kan endast använda en flervals-tagg
tr: Geçeresiz biçim: sadece multi-valued etiket kullanılabilir

source: no hdlist available for medium "%s"
ast: nun hai hdlist pal mediu "%s"
cs: není k dispozici žádný soubor hdlist pro zdroj "%s"
cy: dim ffeil hdlist ar gyfer cyfrwng "%s"
da: ingen hdlist-fil tilgængelig for medie "%s"
el: δεν βρέθηκε αρχείο hdlist για το μέσο "%s"
es: no hay hdlist para el soporte «%s»
et: andmekandjale "%s" ei leitud hdlist-faili
eu: ez dago "%s" euskarriarentzako hdlist eskuragarri
fi: Medialle "%s" ei löydy hdlist-tiedostoa
fr: pas de fichier hdlist disponible pour le média « %s »
gl: non hai un hdlist dispoñible para o soporte "%s"
he: אין קבצי hdlist זמינים עבור המקור "%s"
hu: a(z) "%s" adatforráshoz nem elérhető a fejléclista (hdlist)
is: engin hdlist skrá er til fyrir miðil "%s"
it: manca il file hdlist per il supporto "%s"
nb: fant ingen hdlist for mediet «%s»
nl: geen hdlist-bestand beschikbaar voor medium "%s"
nn: Fann inga «hdlist» for mediet «%s».
pl: nie znaleziono pliku hdlist dla nośnika "%s"
pt: nenhum ficheiro hdlist disponível para a média "%s"
pt_br: nenhum hdlist disponível para a mídia "%s"
ro: nu este disponibil un hdlist pentru mediul „%s”
ru: для источника «%s» не найден файл hdlist
sl: ni bilo možno najti datoteke hdlist za vir »%s«
sv: ingen hdlist-fil tillgänglig för media "%s"
tr: "%s" ortamı için hdlist mevcut değil.

source: no synthesis available for medium "%s"
ast: nun hai synthesis pal mediu "%s"
cs: není k dispozici žádný soubor se syntézou pro zdroj "%s"
cy: adeiladu ffeil synthesis file ar gyfer cyfrwng "%s"
da: ingen syntese-fil tilgængelig for medie "%s"
el: δεν υπάρχει διαθέσιμη σύνθεση για το μέσο "%s"
es: no hay synthesis para el soporte «%s»
et: andmekandjale "%s" ei leitud sünteesifaili
eu: ez dago "%s" euskarriarentzako synthesis eskuragarri
fi: Medialle "%s" ei löydy synthesis-tiedostoa
fr: pas de fichier synthesis disponible pour le média « %s »
gl: non hai un synthesis dispoñible para o soporte "%s"
he: אין קבצי synthesis עבור המקור "%s"
hu: a "%s" adatforrás kiterjesztett függőséglistája nem elérhető
is: engin samantektarskrá er til fyrir miðil "%s"
it: manca il file di synthesis per il supporto "%s"
nb: fant ingen synthesis for mediet «%s»
nl: geen synthesis beschikbaar voor medium "%s"
nn: Fann inga syntesefil for mediet «%s».
pl: brak pliku syntezy dla nośnika "%s"
pt: nenhum ficheiro synthesis disponível para a média "%s"
pt_br: synthesis não disponível para a mídia "%s"
ro: nu este disponibil un synthesis pentru mediul „%s”
ru: для источника «%s» не найден файл synthesis
sl: ni bilo možno najti datoteke synthesis za vir »%s«
sv: ingen synthesis-fil tillgänglig för media "%s"
tr: "%s" ortamı için sentez mevcut değil.
