Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --buildrequires - install the buildrequires of the packages
ast: --buildrequires - instalar los buildrequires de los paquetes
cs: --buildrequires - instalovat balíčky nutné pro sestavení balíčků
cy: --buildrequires - gosod buildrequires y pecynnau
da: --buildrequires - installér buildrequires for pakkerne
el: --buildrequires - εγκατάσταση των buildrequires των πακέτων
es: --buildrequires - instalar los buildrequires de los paquetes
et: --buildrequires - paigaldatakse pakettide ehitamiseks nõutavad paketid
eu: --buildrequires - instalatu paketeen «buildrequires»
fi: --buildrequires - asenna paketit, jotka tarvitaan pakettien kääntämiseen lähdekoodipaketeista.
fr: --buildrequires - installer les buildrequires des paquetages
he: --buildrequires - התקן את ה-buildrequires של החבילות
hu: --buildrequires - csomagkövetelmények telepítése
is: --buildrequires - setja inn "buildrequires" pakkans
it: --buildrequires - installa i pacchetti necessari alla compilazione del pacchetto (buildrequires)
nb: --buildrequires – installer avhengighetene for pakkebygginga.
nl: --buildrequires - de "buildrequires" van de pakketten installeren
nn: --buildrequires – Installer «buildrequires» til pakken.
pl: --buildrequires - instaluje pakiety zależne wymagane do budowania
pt: --buildrequires - instala os requerimentos de compilação (buildrequires) dos pacotes.
pt_br: --buildrequires - instala buildrequires dos pacotes
ro: --buildrequires - instalează cerințele de compilare ale pachetelor
ru: --buildrequires - установить требуемые для сборки пакеты
sl: --buildrequires - namesti pakete potrebne za gradnjo paketov
sv: --buildrequires - installera paket behövliga för kompilering
tr: --buildrequires - paketlerin derleme gerekliliklerini kurar.

source: --install-src - install only source package (no binaries).
ast: --install-src - instalar namái paquete de fontes (dengún binariu)
ca: --install-src - instal·la només paquets de codi font (cap binari).
cs: --install-src - instalovat pouze balíček se zdroji (bez binárních souborů)
cy: --install-src - gosod pecynnau ffynhonnell yn unig (dim binaries).
da: --install-src - installér kun kildepakker (ingen binære).
el: --install-src - εγκατάσταση μόνο του πηγαίου πακέτου (όχι εκτελέσιμα).
es: --install-src - instalar sólo paquete de fuentes (ningún binario)
et: --install-src - paigaldatakse ainult lähtetekstipakett (mitte binaarpakett).
eu: --install-src - iturburu-paketea bakarrik instalatzen du (binarioak ez).
fi: --install-src - asenna ainoastaan lähdekoodipaketit (ei binäärejä).
fr: --install-src - n'installer que les paquetages de sources (pas les binaires).
gl: --install-src - instalar só o paquete de fontes (non os binarios).
hu: --install-src - csak a forráscsomag telepítése (a programok mellőzése)
id: --install-src - hanya instal paket source (tanpa kode biner).
is: --install-src - setja aðeins inn frumkóða-pakka (engin forþýdd forrit).
it: --install-src - installa solo il pacchetto dei sorgenti (non i binari).
nb: --install-src – bare installer kildepakke (ingen binære).
nl: --install-src - installeer alleen bronpakketten (geen uitvoerbare bestanden)
nn: --install-src – Berre installer kjeldepakkar.
pl: --install-src - instaluje tylko pakiet źródłowy (bez binariów).
pt: --install-src - instala apenas o pacote fonte (nenhum binário).
pt_br: --install-src - instala somente o pacote de fontes (sem binários).
ro: --install-src - instalează numai pachetele sursă (fără binare).
ru: --install-src - установить только пакеты с исходными кодами (без бинарных файлов)
sl: --install-src - namesti samo paket z izvorno kodo (brez binarnih).
sq: --install-src - instalo vetëm burimet e pakove (jo binare).
sv: --install-src - installera endast källpaket (inga binärer).
tr: --install-src - sadece kaynak kodu paketlerini kur (ikilileri değil).

source: --clean - remove rpm from cache before anything else.
ast: --clean - desaniciar rpm de la caché enantes que na.
ca: --clean - esborra els rpm de la memòria cau abans de res més.
cs: --clean - nejprve odstraní RPM balíčky z vyrovnávací paměti
cy: --clean - tynnu rpm o'r storfa cyn unrhyw beth arall.
da: --clean - fjern rpm fra cache før noget andet.
el: --clean - αφαίρεσε τα rpm από την προσωρινή μνήμη πριν την εκτέλεση άλλης ενέργειας.
es: --clean - quitar rpm del cache antes que nada.
et: --clean - eemaldab enne muud tegevust RPM-i puhvrist.
eu: --clean - kendu rpm cachetik beste ezer baino lehen.
fi: --clean - poista rpm-paketti välimuistista ennen muita tapahtumia.
fr: --clean - enlever tous les rpm du cache avant toute opération.
gl: --clean - eliminar os rpms da caché antes de nada.
hu: --clean - RPM-fájl eltávolítása a gyorstárból a műveletek előtt
id: --clean - hapus rpm dari cache sebelum hal-hal yg lain.
is: --clean - fjarlægja rpm úr biðminni áður en annað er gert.
it: --clean - rimuove gli rpm dalla cache prima di fare qualsiasi altra cosa.
nb: --clean – fjern rpm fra mellomlageret først.
nl: --clean - rpm uit cache verwijderen vóór al het andere
nn: --clean – Fjern rpm-filer frå mellomlager først.
pl: --clean - zaczyna od usuwania plików rpm z pamięci podręcznej.
pt: --clean - remove os rpm da caixa antes de qualquer coisa.
pt_br: --clean - remove os rpm do cache antes de iniciar.
ro: --clean - șterge pachetele din pretampon înainte de orice altceva.
ru: --clean - перед началом операции удалить rpm-файлы из кэша
sl: --clean - odstrani pakete rpm iz predpomnilnika pred kakršnikolim drugim dejanjem.
sq: --clean - zhduki të gjithë rpm e fshehta para gjdo operacioni.
sv: --clean - ta bort rpm från cache före allt annat.
tr: --clean - herhangi birşeyden önce rpm'yi önbellekten sil.

source: --noclean - don't clean rpms from cache.
ast: --noclean - nun desaniciar los rpms de la caché.
cs: --noclean - neodstraňovat RPM balíčky z vyrovnávací paměti
cy: --noclean - peidio glanhau rpm o'r storfa.
da: --noclean - fjern ikke rpm'er fra cache.
el: --noclean - κρατά τα rpm στην προσωρινή μνήμη.
es: --noclean - no eliminar los rpms del cache.
et: --noclean - säilitab puhvris mittekasutatud RPM-id.
eu: --noclean - ez garbitu rpm-ak katxetik.
fi: --noclean - älä poista rpm-paketteja välimuistista.
fr: --noclean - ne supprime aucun paquetage du cache.
gl: --noclean - non eliminar os rpms da caché.
he: --noclean - אל תמחק חבילות מהמטמון.
hu: --noclean - az RPM-fájlok ne törlődjenek a gyorstárból
id: --noclean - jangan hapus rpm dari cache.
is: --noclean - ekki hreinsa rpm pakka úr biðminni.
it: --noclean - mantieni nella cache i pacchetti rpm scaricati
nb: --noclean – ikke fjern rpm-pakker fra mellomlageret.
nl: --noclean - rpm's niet uit buffer wissen.
nn: --noclean – Beudisks-daemon rpm-filer i mellomlager.
pl: --noclean - zachowuje pliki rpm w pamięci podręcznej.
pt: --noclean - não apaga os rpms da caixa.
pt_br: --noclean - não remove os rpms do cache.
ro: --noclean - nu se șterg pachetele din pretampon.
ru: --noclean - не удалять rpm-файлы из кэша
sl: --noclean - ne odstrani paketov rpm iz predpomnilnika.
sv: --noclean - rensa inte rpms från cache.
tr: --noclean - rpm'yi ön bellekte kullanılmadan sakla

source: --replacepkgs - force installing packages which are already installed.
ast: --replacepkgs - forciar instalación de paquetes ya instalaos.
cs: --replacepkgs - vynutit instalaci balíčků, které jsou již nainstalovány
cy: --replacepkgs - gorfodi gosod pecynnau sydd wedi eu gosod eisoes.
da: --replacepkgs - gennemtving installering af pakker som allerede er installerede.
el: --replacepkgs - εξαναγκασμός εγκατάστασης πακέτων που είναι ήδη εγκατεστημένα.
es: --replacepkgs - forzar instalación de paquetes que ya están instalados.
et: --replacepkgs - juba paigaldatud pakettide jõuga taaspaigaldamine.
eu: --replacepkgs - behartu dagoeneko instalatuta dauden paketeen instalaketa.
fi: --replacepkgs - pakota jo asennettujen pakettien uudelleenasennus.
fr: --replacepkgs - force l'installation des paquetages qui sont déjà installés.
gl: --replacepkgs - forzar a instalación de paquetes que xa están instalados.
hu: --replacepkgs - a már telepített csomagok telepítésének kikényszerítése
is: --replacepkgs - þvinga innsetningu pakka sem eru þegar uppsettir.
it: --replacepkgs - forza l'installazione dei pacchetti anche se già installati.
nb: --replacepkgs – tving gjennom installering av pakker som allerede er installert.
nl: --replacepkgs - installatie van al geïnstalleerde pakketten afdwingen.
nn: --replacepkgs – Tving gjennom installering av pakkar som alt er installerte.
pl: --replacepkgs - wymuś instalację pakietów, które znajdują się już w systemie.
pt: --replacepkgs - força a instalação de pacotes que já se encontram instalados.
pt_br: --replacepkgs - força a reinstalação de pacotes já instalados.
ro: --replacepkgs - forțează reinstalarea pachetelor deja instalate.
ru: --replacepkgs - принудительно установить уже установленные пакеты
sl: --replacepkgs - vsili namestitev paketov, ki so že nameščeni.
sv: --replacepkgs - tvinga installation av paket som redan är installerade.
tr: --replacepkgs - sistemde yüklü paketleri yüklemeye zorla.

source: --allow-nodeps - allow asking user to install packages without dependencies checking.
ast: --allow-nodeps - permitir entrugar al usuariu pa instalar paquetes ensin verificar les dependencies.
ca: --allow-nodeps - permet de preguntar a l'usuari si vol instal·lar paquets sense comprovar les dependències.
cs: --allow-nodeps - povolí žádost na uživatele, aby instaloval balíčky bez kontroly závislostí
cy: --allow-nodeps - caniatáu gofyn i ddefnyddiwr i osod pecynnau heb wirio dibyniaethau.
da: --allow-nodeps - tillad at spørge bruger om installering af pakker uden kontrol af afhængigheder.
el: --allow-nodeps - επιτρέπει την εγκατάσταση πακέτων χωρίς να ελέγχει τις εξαρτήσεις.
es: --allow-nodeps - permitir preguntar al usuario para instalar paquetes sin verificar las dependencias.
et: --allow-nodeps - kasutajal lubatakse paigaldada pakettide sõltuvusi kontrollimata.
eu: --allow-nodeps - erabiltzaileari paketeak instalatzeko eskatzeko aukera ematen du, mendekotasunak egiaztatu gabe.
fi: --allow-nodeps - salli pakettien asennus ilman riippuvuuksien tarkistusta.
fr: --allow-nodeps - autoriser l'installation des paquetages sans vérifier les dépendances.
gl: --allow-nodeps - permitirlle ó usuario instalar paquetes sen comprobar as dependencias.
he: --allow-nodeps - אפשר לבקש מהמשתמש להתקין חבילות ללא בדיקת תלויות.
hu: --allow-nodeps - lehetővé teszi a csomagok függőségellenőrzés nélküli telepítését (a felhasználótól érkező megerősítést követően)
id: --allow-nodeps - izinkan meminta user untuk menginstal paket tanpa menguji ketergantungan.
is: --allow-nodeps - leyfa uppsetningu pakka án þess að athuga hvort það vanti tengda pakka eða pakkar rekist á.
it: --allow-nodeps - permette di chiedere all'utente se desidera installare dei pacchetti senza controllare le dipendenze.
nb: --allow-nodeps – tillater å spørre bruker om å installere pakker uten sjekking av avhengigheter.
nl: --allow-nodeps - sta toe de gebruiker te vragen om pakketten te installeren zonder afhankelijkhedencontrole.
nn: --allow-nodeps – Tillat å spørja brukarar å installera pakkar utan sjekking av avhengnader.
pl: --allow-nodeps - umożliwia użytkownikowi, który sobie zażyczy, instalację pakietów bez sprawdzania zależności.
pt: --allow-nodeps - permite perguntar ao utilizador se deseja instalar os pacotes sem verificar as dependências.
pt_br: --allow-nodeps - permite ao usuário instalar pacotes sem checagem de dependências.
ro: --allow-nodeps - permite interogarea utilizatorului la instalarea pachetelor fără verificarea dependențelor
ru: --allow-nodeps - разрешить устанавливать пакеты без проверки зависимостей после запроса у пользователя
sl: --allow-nodeps - dovoli si vprašati uporabnika za namestitev paketov brez preverjanja odvisnosti.
sq: --allow-nodeps - mundëson që përdoruesi në pytje të instaloj pakot pas i verifikuar mvarësit e tyre.
sv: --allow-nodeps - tillåter användaren installera paket utan att kontrollera beroenden.
tr: --allow-nodeps - kullanıcıya bağımlılıkları sormadan kuruluma izin verir.

source: --allow-force - allow asking user to install packages without dependencies checking and integrity.
ast: --allow-force - permitir entrugar al usuariu pa instalar paquetes ensin verificar les dependencies nin integridá.
ca: --allow-force - permet de preguntar a l'usuari si vol instal·lar paquets sense comprovar les dependències i la integritat.
cs: --allow-force - povolí žádost na uživatele, aby instaloval balíčky bez kontroly závislostí a integrity
cy: --allow-force - caniatáu gofyn i ddefnyddiwr osod pecyn heb wirio dibyniaethau na'u cyfanrwydd.
da: --allow-force - tillad at spørge bruger om installering af pakker uden kontrol af afhængigheder og integritet.
el: --allow-force - επιτρέπει την εγκατάσταση πακέτων χωρίς να ελέγχει τις εξαρτήσεις και την ακεραιότητα.
es: --allow-force - permitir preguntar al usuario para instalar paquetes sin verificar las dependencias ni la integridad.
et: --allow-force - kasutajal lubatakse paigaldada pakette ilma sõltuvusi ja sobivust kontrollimata.
eu: --allow-force - erabiltzaileari paketeak instalatzeko eskatzeko aukera ematen du, mendekotasunak eta osotasuna egiaztatu gabe.
fi: --allow-force - salli pakettien asennus ilman riippuvuuksien ja eheyden tarkistusta.
fr: --allow-force - autoriser l'installation des paquetages sans vérifier ni les dépendances ni l'intégrité.
gl: --allow-force - permitirille ó usuario que o solicite instalar paquetes sen verificar as dependencias e a integridade.
he: --allow-force - מאפשר לתשאל את המשתמש אודות התקנת חבילות בלי בדיקת תלויות.
hu: --allow-force - lehetővé teszi a csomagok függőség- és helyességellenőrzés nélküli telepítését (a felhasználótól érkező megerősítést követően)
id: --allow-force - izinkan meminta user menginstal paket tanpa menguji ketergantungan dan integritas.
is: --allow-force - leyfa notanda að setja upp pakka án þess að athuga tengda pakka eða staðfesta uppruna.
it: --allow-force - permette di chiedere all'utente se desidera installare dei pacchetti senza controllare dipendenze e integrità.
nb: --allow-force – tillat å spørre bruker om å installere pakker uten sjekking av avhengigheter og integritet.
nl: --allow-force - sta toe de gebruiker te vragen om pakketten te installeren zonder afhankelijkhedencontrole en zonder integriteitscontrole.
nn: --allow-force – Tillat å spørja brukarar å installera pakkar utan sjekking av avhengnader og integritet.
pl: --allow-force - umożliwia użytkownikowi, który sobie tego zażyczy instalację pakietów bez sprawdzania zależności i spójności.
pt: --allow-force - permite perguntar ao utilizador se deseja instalar os pacotes sem verificar as dependências e integridade.
pt_br: --allow-force - permite ao usuário instalar pacotes sem conferir dependências e integridade.
ro: --allow-force - permite interogarea utilizatorului pentru instalarea pachetelor fără verificarea dependențelor și a integrității.
ru: --allow-force - разрешить устанавливать пакеты без проверки зависимостей и целостности после запроса у пользователя
sl: --allow-force - dovoli si vprašati uporabnika za namestitev paketov brez preverjanja odvisnosti in integritete.
sq: --allow-force - mundëson që përdoruesi në pytje të instaloj pakot pas i verifikuar mvarësit dhe integritetin e tyre.
sv: --allow-force - tillåter användaren att installera paket utan kontroll av beroenden och integritet.
tr: --allow-force - kullanıcıya bağımlılıkları ve diğer olumsuzlukları sormadan kuruluma izin verir.

source: --allow-suggests - auto select "suggested" packages.
cs: --allow-suggests - automaticky vybírat "navrhované" balíčky
cy: --allow-suggests - awto ddewis pecynnau "awgrymwyd".
da: --allow-suggests - vælg automatisk "foreslåede" pakker.
es: --allow-suggests - seleccionar automáticamente los paquetes «sugeridos».
eu: --allow-suggests - automatikoki aukeratu "suggested" packeteak.
fi: --allow-suggests - asenna ehdotetut paketit automaattisesti ("Suggests").
hu: --allow-suggests - a "javasolt" csomagok automatikus kijelölése.
is: --allow-suggests - velja sjálfkrafa "tillagða" pakka.
it: --allow-suggests - seleziona automaticamente i pacchetti "suggeriti"
nb: --allow-suggests – autovelg «foreslåtte» pakker.
pl: --allow-suggests - automatyczny wybór "sugerowanych" pakietów.
pt: --allow-suggests - selecciona automaticamente os pacotes "sugeridos".
ro: --allow-suggests - selectare automată a pachetelor „sugerate”.
sv: --allow-suggests - välj "föreslagna" paket automatiskt.
tr: --allow-suggests - "önerilen" paketleri otomatik seç.

source: --use-distrib - configure urpmi on the fly from a distrib tree, useful to install a chroot with --root option.
ast: --use-distrib - configurar urpmi al vuelu dende un árbol de distribución, útil pa instalar un chroot cola opción --root.
cs: --use-distrib - nastavit urpmi za provozu ze stromu distribuce, užitečné při instalaci chroot s volbou --root
cy: --use-distrib - ffurfweddu urpmi wrth fynd o goeden distrib, defnyddiol wrth osod chroot gyda dewis o --root.
da: --use-distrib - konfigurér urpmi løbende fra et distrib-træ, nyttigt til at installere en chroot med --root-tilvalget.
el: --use-distrib - ρύθμισε το urpmi απευθείας από ένα δένδρο διανομής, χρήσιμο για να εγκαταστήσετε ένα chroot με την επιλογή --root .
es: --use-distrib - configurar urpmi al vuelo desde un árbol de distribución, útil para instalar un chroot con la opción --root.
et: --use-distrib - urpmi seadistamine lennult distributsioonipuu põhjal, kasulik chroot paigaldamiseks võtmega --root.
eu: --use-distrib - urpmi berehala konfiguratzen du distrib zuhaitzetik, erabilgarria chroot --root aukerarekin instalatzeko.
fi: --use-distrib - aseta urpmi automaattisesti jakelun puusta, hyödyllinen asennettaessa chroot-ympäristöön käyttäen valitsinta --root.
fr: --use-distrib - configurer urpmi à la volée d'après l'arbre d'une distribution; utile pour (dés)installer un chroot avec l'option --root.
he: --use-distrib - הגדר את urpmi בזמן ריצה מעץ חבילות ההפצה, שימושי להתקנת chroot עם האפשרות --root.
hu: --use-distrib - az urpmi menet közben való beállítása egy disztribúciós fából - például chroot telepítéséhez használható a --root opció esetén
id: --use-distrib - konfigurasikan urpmi secara langsung dari pohon distrib, berguna untuk menginstall chroot dengan opsi --root.
is: --use-distrib - stilla urpmi frá dreifingartrénu, gott að nota til að setja inn chroot með --root valkostinum.
it: ..--use-distrib - configura urpmi "al volo" da un albero distribuito, utile per installare un ambiente chroot con l'opzione --root.
nb: --use-distrib – sett opp urpmi direkte fra et distribusjonstre. Nyttig for å installere en chroot med --root-valget.
nl: --use-distrib - urpmi dynamisch configureren vanuit een distrib-boom, handig om een chroot te instaleren met de --root optie.
nn: --use-distrib – Set opp urpmi direkte frå eit distribusjonstre. Nyttig for installering av ei «chroot» med «--root»-valet.
pl: --use-distrib - konfiguruje urpmi w locie z drzewa dystrybucyjnego, opcja użyteczna przy instalacji chroot z opcją --root.
pt: --use-distrib - configura o urpmi para outra fonte, útil para (des)instalar um chroot com a opção --root.
pt_br: --use-distrib - configura o urpmi por meio de uma árvore de distribuição padrão, útil para instalar um chroot com a opção --root.
ro: --use-distrib - configurează din mers urpmi dintr-un arbore de distribuție, utilă pentru instalarea unui chroot cu opțiunea --root .
ru: --use-distrib - настроить urpmi на лету из дерева distrib; полезно для установки в chroot с параметром --root
sl: --use-distrib - sproti nastavi urpmi iz distrib. drevesa, uporabno je za namestitev chroot z možnostjo --root .
sv: --use-distrib - konfigurera urpmi 'on the fly' från ett distributionsträd, användbart vid installation av chroot med --root option.
tr: --use-distrib - urpmi'yi bir dağıtım ağacından ayarla.bir "chroot"u, --root seçeneğiyle kurmak için yararlıdır.

source: --metalink - generate and use a local metalink.
ast: --metalink - xenerar y usar un metaenllace llocal.
cs: --metalink - generovat a používat místní metalink
cy: --metalink - cynhyrchu a defnyddio metalink lleol.
da: --metalink - generér og brug et lokalt metalink.
el: --metalink - δημιουργία και χρήση ενός τοπικού μετασυνδέσμου.
es: --metalink - generar y usar un metavínculo local.
et: --metalink - kohaliku metalingi loomine ja kasutamine.
eu: --metalink - sortu eta erabili bertako metaesteka bat.
fi: --metalink - luo ja käytä paikallista metalinkkiä.
fr: --metalink - générer et utiliser un metalink local.
hu: --metalink - Egy helyi metalink-et legenerál, és azt használja.
is: --metalink - búa til og nota staðværan metalink.
it: --metalink - genera e usa un metalink locale.
nb: --metalink – opprett og bruk en lokal metalenke.
nl: --metalink - lokale metalink genereren en gebruiken.
nn: --metalink – Lag og bruk lokal metalink.
pl: --metalink - wygeneruj i użyj lokalnego metalinku.
pt: --metalink - gera e usa um 'metalink' local.
pt_br: --metalink - cria e utiliza um metalink local.
ro: --metalink - generează și utilizează o metalegătură locală.
ru: --metalink - сгенерировать и использовать локальные метассылки
sl: --metalink -ustvari in uporabi krajevno meta povezavo.
sv: --metalink - generera och använd en lokal metalink.
tr: --metalink - bir metalink üret kullan.

source: --download-all - download all needed packages before trying to install them
ast: --download-all - baxar tolos paquetes necesarios enantes d'intentar instalalos
cs: --download-all - stáhnout všechny potřebné balíčky před pokusem o jejich instalaci
da: --download-all - hent alle krævede pakker før forsøg på at installere dem
el: --download-all - λήψη όλων των απαραιτήτων πακέτων πριν γίνει η προσπάθεια εγκατάστασής τους
es: --download-all - descargar los paquetes necesarios antes de instalar
et: --download-all - kõigi vajalike pakettide allalaadimine enne nende paigaldamist
eu: --download-all - jaitsi beharrezko pakete guztiak haiek instalatzen saiatu aurretik
fi: --download-all - lataa kaikki tarvittavat paketit ennen asentamista
fr: --download-all - télécharger tous les paquetages nécessaires avant installation
hu: --download-all - minden csomag letöltése a telepítés megkezdése előtt
it: --download-all - recupera tutti i pacchetti necessari prima di provare ad installarli
nb: --download-all – last ned alle nødvendige pakker før installering
nl: --download-all - download alle benodigde pakketten alvorens deze te installeren
nn: --download-all – Last ned alle pakkane før installering.
pl: --download-all - pobierz wszystkie wymagane pakiety przed instalacją
pt: --download-all - transfere todos os pacotes necessários antes de os tentar instalar
pt_br: --download-all - baixar todos os programas antes de tentar instalá-los
ro: --download-all - descarcă toate pachetele necesare înainte de a încerca instalarea lor
ru: --download-all - скачать все необходимые пакеты перед попыткой их установки
sl: --download-all - pred namestitvijo prenesi vse potrebne pakete
sv: --download-all - ladda ner alla behövliga paket innan de blir installerade
tr: --download-all - kurmayı denemeden önce tüm gerekli paketleri indir.
