Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: virtual medium "%s" should have a clear url, medium ignored
ast: el mediu virtual «%s» tendría de tener una URL llimpia, mediu ignoráu
ca: la font virtual "%s" ha de tenir una url neta, font ignorada
cs: virtuální zdroj "%s" by měl mít jasnou adresu URL, zdroj se ignoruje
cy: dylai cyfrwng rhithiol "%s" gael url clir, anwybyddu'r cyfrwng
da: virtuelt medie "%s" bør have en klar url, medie ignoreret
el: το εικονικό μέσο «%s» πρέπει να έχει ένα καθαρό σύνδεσμο url, το μέσο αγνοείται
es: el soporte virtual «%s» debería tener una URL limpia, soporte ignorado
et: virtuaalsel andmekandjal "%s" peaks olema selge URL, seda eiratakse
eu: "%s" euskarri birtualak url garbia eduki beharko luke, ez ikusi egingo zaio
fi: Virtuaalimedialla "%s" tulisi olla kunnollinen url, media ohitettu
fr: le média virtuel « %s » devrait avoir une url en clair, média ignoré
gl: o soporte virtual "%s" debe ter un url claro, soporte ignorado
he: מאגר וירטואלי "%s" צריך שיהיה לו כתובת ברורה, התעלמות מאגר
hu: a(z) "%s" virtuális adatforrás nem tiszta URL-lel rendelkezik, ezért az adatforrás nem kerül feldolgozásra
id: media maya "%s" harus memiliki url yang jelas, media diabaikan
is: sýndarmiðill "%s" ætti að hafa auða slóð, miðill hunsaður
it: il supporto virtuale "%s" dovrebbe avere una url in chiaro, supporto ignorato
nb: det virtuelle mediet «%s» bør ha en entydig adresse, overser mediet
nl: virtueel medium "%s" dient een lege url te hebben, medium genegeerd
nn: Det virtuelle mediet «%s» må ha ei eintydig adresse. Hoppar over medium.
pl: wirtualny nośnik "%s" powinien posiadać jasny URL, zignorowano nośnik
pt: a média virtual "%s" deve ter um url claro, média ignorada
pt_br: mídia virtual "%s" deve ter uma url limpa, mídia ignorada
ro: mediul virtual „%s” ar trebui să aibă un URL clar, se ignoră mediul
ru: виртуальный источник «%s» должен содержать пустой url; источник проигнорирован
sl: navidezni vir »%s« mora imeti jasen url, vir je bil zato prezrt
sq: burimi virtuel "%s" duhet të posedoj një url të qartë, burim i injoruar
sv: virtuellt media "%s" bör ha en tydlig URL, media ignorerat
tr: "%s" sanal ortamı açık bir url içermeli, ortam yok sayıldı.

source: unable to access list file of "%s", medium ignored
ast: nun puede accedese al ficheru de la llista de "%s", mediu ignoráu
ca: no es pot accedir al fitxer list de "%s", s'ignora la font
cs: nelze získat seznam souborů pro "%s", zdroj bude ignorován
cy: methu cael mynediad ffeil rhestr "%s", anwybyddu'r cyfrwng
da: kan ikke få adgang til filen "%s", medie ignoreret
el: αδυναμία πρόσβασης στο αρχείο λίστας του "%s", το μέσο αγνοείται
es: no se puede acceder al archivo de lista de «%s», soporte ignorado
et: ligipääs "%s" nimekirjafailile nurjus, andmekandjat eiratakse
eu: ezin da "%s"(r)en zerrenda-fitxategia atzitu, euskarriari ez ikusi egingo zaio
fi: Median "%s" list-tiedostoa ei voida käyttää, media ohitettu
fr: impossible d'accéder au fichier de liste de « %s », média ignoré
gl: non foi posible acceder á lista de ficheiros de "%s", soporte ignorado
he: אין אפשרות גישה לקובץ הרשימה של "%s", מדיה זו לא תהיה בשימוש
hu: "%s" listafájlja nem elérhető; az adatforrás nem kerül feldolgozásra
id: gagal mengakses file list "%s", media diabaikan
is: gat ekki kannað lista-skrá fyrir "%s", miðill hunsaður
it: impossibile accedere alla lista dei file "%s", supporto ignorato
nb: klarte ikke åpne listefila til «%s», overser mediet
nl: kon list bestand van "%s" niet benaderen, medium genegeerd
nn: Klarte ikkje opna «list»-fila til «%s». Hoppar over mediet.
pl: nie można uzyskać dostępu do pliku listy związanego z "%s", zignorowano nośnik
pt: não é possível aceder ao ficheiro lista de "%s", média ignorada
pt_br: incapaz de acessar a lista de arquivos de "%s", mídia ignorada.
ro: nu se poate accesa fișierul listă pentru „%s”, se ignoră mediul
ru: нет доступа к файлу списка источника «%s»; источник проигнорирован
sl: do seznama datotek vira »%s« ni mogoče dostopati, vir je bil zato prezrt
sq: e pa mundur hyrja në skedaren e listës të "%s", burim i injoruar
sv: kunde inte komma åt listfil för "%s", media ignorerat
tr: "%s" ortamının liste dosyasına erişilemiyor, yoksayıldı

source: unable to access synthesis file of "%s", medium ignored
ast: nun puede accedese al ficheru synthesis de "%s", mediu ignoráu
cs: nelze přistupovat k souboru se syntézou "%s", zdroj bude ignorován
cy: methu cael mynediad i ffeil "%s", anwybyddu'r cyfrwng
da: kunne ikke nå syntese-fil af "%s", medie ignoreret
el: αδυναμία πρόσβασης στο αρχείο synthesis του "%s", το μέσο αγνοείται
es: no se puede acceder al archivo synthesis de «%s», soporte ignorado
et: ligipääs "%s" sünteesifailile nurjus, andmekandjat eiratakse
eu: ezin da "%s"(r)en synthesis fitxategia atzitu, euskarriari jaramonik ez
fi: Median "%s" synthesis-tiedostoa ei voida käyttää, media ohitettu
fr: impossible d'accéder au fichier synthesis de « %s », média ignoré
gl: non foi posible acceder ó ficheiro synthesis de "%s", soporte ignorado
he: אין אפשרות לגשת לקובץ synthesis של "%s", מדיה זו לא תהיה בשימוש
hu: "%s" fejléclistája nem elérhető; az adatforrás nem kerül feldolgozásra
is: gat ekki kannað samantektarskrá fyrir "%s", miðill hunsaður
it: impossibile accedere al file synthesis per "%s", supporto ignorato
nb: klarte ikke åpne synthesis-filen til «%s», overser mediet
nl: kon synthesisbestand van "%s" niet benaderen, medium genegeerd
nn: Klarte ikkje opna syntesefila til «%s». Hoppar over mediet.
pl: nie można uzyskać dostępu do pliku syntezy "%s", zignorowano nośnik
pt: não é possível aceder ao ficheiro synthesis de "%s", média ignorada
pt_br: incapaz de acessar o arquivo synthesis de "%s", mídia ignorada
ro: nu se poate accesa fișierul synthesis pentru „%s”, se ignoră mediul
ru: нет доступа к файлу synthesis для «%s»; источник проигнорирован
sl: do datoteke synthesis vira »%s« ni mogoče dostopati, vir je bil zato prezrt
sq: pamundësi për qasje në skedarin e sintezës së "%s", medium injoruar
sv: kunde inte komma åt synthersis-fil för "%s", media ignorerat
tr: "%s" ortamının synthesis dosyasına erişilemiyor, yoksayıldı

source: trying to override existing medium "%s", skipping
ast: intentando pasar al mediu esistente "%s", saltando
cs: pokouším se obejít existující zdroj "%s", přeskakuji
cy: ceisio osgoi'r cyfrwng presennol "%s", hepgor
da: prøver at forbigå eksisterende medie "%s", springer over
el: προσπάθεια παράκαμψης του υπάρχοντος μέσου «%s», παράβλεψη
es: intentando sobreescribir el soporte existente «%s», omitiendo
et: püütakse vältida olemasolevat andmekandjat "%s"
eu: existitzen den "%s" euskarriari jaramonik ez egiteko ahalegina, ekiditen
fi: Yritetään syrjäyttää olemassa olevaa mediaa "%s", ohitetaan
fr: tentative d'outrepasser un média existant « %s », non pris en compte
gl: intentando sobrescribir o soporte "%s" xa existente, omitindo
he: מנסה לדלג על המקור "%s", מתחמק
hu: a(z) "%s" néven létező adatforrás elkerülése - kihagyás
id: mencoba menimpa media yang ada "%s", mengabaikan
is: reyni að hunsa núverandi miðil "%s", forðast
it: cerco di fare a meno del supporto esistente "%s", vado oltre
nb: prøver å overstyre det eksisterende mediet «%s», overser
nl: overslaan, vanwege poging om bestaand medium "%s" te omzeilen
nn: Prøver å overstyra mediet «%s» som finst frå før. Hoppar over.
pl: próba przełączenia istniejącego nośnika "%s", anulowano
pt: a tentar sobrepor a média existente "%s", a ignorar
pt_br: tentando contornar mídia existente "%s", evitando
ro: se încearcă ignorarea mediul existent „%s”, se omite
ru: попытка переопределить существующий источник «%s»; пропускается
sl: poskušam obiti obstoječi vir, izpuščanje »%s«
sq: duke u përpjekur të anashkalojë mesazhin ekzistues "%s", kalim
sv: försöker gå förbi befintligt media "%s", hoppar över
tr: varolan "%s" ortamı atlanmaya çalışılırken engelleniyor

source: failed to migrate removable device, ignoring media
ast: fallu al migrar el preséu removible, inorando preseos
cs: selhala migrace vyjímatelného zařízení, médium se ignoruje
cy: methu symud y ddyfais symudol, anwybyddu'r cyfrwng
da: kunne ikke migrere flytbar enhed, ignorerer medie
el: σφάλμα στην εισαγωγή της αφαιρούμενης συσκευής, το μέσο θα αγνοηθεί
es: fallo al migrar el dispositivo removible, ignorando soportes
et: eemaldatava seadme migreerimine nurjus, andmekandjat eiratakse
eu: gailu eramangarria migratzeak huts egin du, euskarria baztertzen
fi: Siirrettävän laitteen uudelleenasetus epäonnistui, ohitetaan media
fr: échec de migration du périphérique amovible, média ignoré
hu: Sikertelen az eltávolítható eszköz csatlakoztatása. Az adatforrás kihagyva...
is: mistókst að flytja útskiptanlegan miðil, hunsa miðil
it: impossibile migrare la periferica rimovibile, supporto ignorato
nb: migrering av flyttbar enhet feilet, overser mediet
nl: migreren van verwisselbaar apparaat mislukt, media wordt genegeerd
nn: Klarte ikkje migrera flyttbar eining. Hoppar over medium.
pl: migracja nośnika wymiennego była niemożliwa, ignorowanie
pt: falha ao migrar o dispositivo removível, ignorar a média
pt_br: falha ao migrar dispositivo removível, ignorando mídia
ro: migrarea dispozitivului amovibil a eșuat, se ignoră mediul
ru: не удалось выполнить миграцию съёмного устройства; источник игнорируется
sl: Migracija odstranljive naprave ni uspela. Vir bo spregledan.
sq: dështoj të shpërngulë pajisje të lëvizshme, duke injoruar media
sv: misslyckades att migrera flyttbar enhet, ignorerar medium
tr: çıkartılabilir disk aktarımı başarısız oldu, kurulum kaynağı yok sayılıyor

source: wrote config file [%s]
ast: escritu ficheru de configuración [%s]
ca: escriure fitxer de configuració [%s]
cs: zapsán soubor s nastavením [%s]
cy: ysgrifennu ffeil ffurfweddu (%s)
da: skriver config fil [%s]
el: εγγραφή αρχείου ρυθμίσεων [%s]
es: se escribió el archivo de configuración [%s]
et: seadistustefaili [%s] kirjutamine
eu: [%s] konfigurazio-fitxategia idatzi
fi: Kirjoitettiin asetustiedosto [%s]
fr: le fichier de configuration [%s] a été écrit
gl: escribiuse o ficheiro de configuración [%s]
he: כתיבת קובץ הגדרות [%s]
hu: beállítások mentése: "%s"
id: menulis ke file konfigurasi [%s]
is: skrifa uppsetningarskrá [%s]
it: scritto il file di configurazione [%s]
nb: skrev oppsettfila [%s].
nl: config-bestand [%s] wegschrijven
nn: Skriv oppsettfil [%s].
pl: zapisywanie pliku konfiguracyjnego [%s]
pt: escrever ficheiro de configuração [%s]
pt_br: grava o arquivo de configuração [%s]
ro: s-a scris fișierul de configurare [%s]
ru: записан конфигурационный файл [%s]
sl: nastavitvena datoteka [%s] je zapisana
sq: shkruaja e skedares konfiguruese [%s]
sv: skriv inställningsfil [%s]
tr: yapılandırma dosyası [%s] yazılıyor

source: Can't use parallel mode with use-distrib mode
ast: Nun puede usase'l mou paralelu col mou use-distrib
ca: No es pot usar el mode paral·lel amb el mode use-distrib
cs: Nelze použít paralelní režim spolu s režimem use-distrib
cy: Methu defnyddio'r modd paralel gyda'r modd use-distrib
da: Kan ikke bruge parallel-tilstand med 'use-distrib '-tilstand
el: Δεν μπορεί να χρησιμοποιηθεί παράλληλη κατάσταση με use-distrib κατάσταση
es: No se puede usar el modo paralelo con el modo use-distrib
et: Paralleelrežiimi ei saa kasutada koos võtmega use-distrib
eu: Modu paraleloa ezin da use-distrib moduarekin erabili
fi: Rinnakkaistilaa ei voi käyttää tilan use-distrib kanssa
fr: Le mode distribué ne peut pas être utilisé avec le mode « use-distrib »
gl: Non se pode usar o modo parallel co modo use-distrib
he: אין אפשרות להפעיל מצב parallel עם מצב use-distrib
hu: Párhuzamos mód nem használható a "use-distrib" üzemmóddal
id: Tidak bisa menggunakan mode paralel dengan mode use-distrib
is: Get ekki notað samhliða ham með "use-distrib" ham
it: Non è possibile usare la modalità parallela con quella distribuita
nb: Kan ikke bruke parallell-modus med use-distrib.
nl: Kan parallelle modus niet tegelijk met use-distrib modus gebruiken
nn: Kan ikkje bruka parallellmodus i «use-distrib»-modus.
pl: Nie można użyć trybu równoległego z trybem use-distrib
pt: Não é possível usar o modo paralelo com o modo use-distrib
pt_br: Não pode usar o modo paralelo com modo 'use-distrib'
ro: Nu se poate utiliza modul paralel în modul use-distrib
ru: Нельзя одновременно использовать режимы parallel и use-distrib
sl: Uporaba vzporednega načina z načinom use-distrib ni možna
sq: Nuk mund të përdorë modalitetin paralel me modalitetin use-distrib
sv: Kan ej använda parallellt läge med use-distrib läge
tr: use-distrib modunda paralel mod kullanılamaz

source: using associated media for parallel mode: %s
ast: usando el preséu asociáu pal mou paralelu: %s
ca: s'està utilitzant la font associada al mode paral·lel : %s
cs: používám asociované zdroje pro paralelní režim: %s
cy: defnyddio cyfrwng cysylltiedig ar gyfer modd paralel: %s
da: bruger tilknyttet medie for parallel tilstand: %s
el: χρήση του συσχετισμένου μέσου για παράλληλη κατάσταση λειτουργίας: %s
es: usando el soporte asociado para el modo paralelo: %s
et: seostatava andmekandja kasutamine paralleelrežiimis: %s
eu: modu paralelorako asoziatutako euskarria erabiltzen: %s
fi: Merkittyjä medioita käytetään rinnakkaistilassa: %s
fr: utilisation du média associé pour le mode distribué : %s
he: משתמש במדיה מקושרת עבור מצב מקבילי: %s
hu: a hozzárendelt adatforrás használata párhuzamos módhoz: %s
id: menggunakan media terkait untuk mode paralel: %s
is: nota tengdan miðil fyrir samhliða ham: %s
it: uso i supporti associati per il metodo parallelo: %s
nb: bruker tilknyttet medie for parallellmodus: %s
nl: geassocieerde media worden voor parallelle modus gebruikt: %s
nn: Brukar tilknytta medium for parallellmodus: %s.
pl: użycie nośnika przypisanego dla trybu równoległego: %s
pt: a usar a média associada para modo paralelo: %s
pt_br: usando mídias associadas para o modo paralelo: %s
ro: se utilizează mediile asociate pentru modul paralel: %s
ru: используется связанный источник для режима parallel: %s
sl: uporaba združenega vira za vzporeden način: %s
sq: përdorimi i burimit të lidhur për modë paralel: %s
sv: använder associerad media för parallelläge: %s
tr: paralel mod için ortak ortam kullanılıyor: %s

source: --synthesis cannot be used with --media, --excludemedia, --sortmedia, --update, --use-distrib or --parallel
ast: --synthesis nun puede usase con --media, --excludemedia, --sortmedia, --update, --use-distrib o --parallel
ca: --synthesis no es pot usar amb --media, --excludemedia, --sortmedia, --update, --use-distrib ni --parallel
cs: volbu --synthesis nelze použít s volbami --media, --excludemedia, --sortmedia, --update, --use-distrib nebo --parallel
cy: --nid oes modd defnyddio synthesis gyda --media, --excludemedia, --sortmedia, --diweddaru, --use-distrib or --parallel
da: --synthesis kan ikke bruges med --media, --excludemedia, --sortmedia, --update, --use-distrib eller --parallel
el: --synthesis δεν μπορεί να χρησιμοποιηθεί με --media, --excludemedia, --sortmedia, --update, --use-distrib ή --parallel
es: --synthesis no se puede usar con --media, --excludemedia, --sortmedia, --update, --use-distrib o --parallel
et: võtit --synthesis ei saa kasutada võtmega --media, --excludemedia, --sortmedia, --update, --use-distrib või --parallel
eu: --laburpena ezin da hauekin erabili: --media, --excludemedia, --sortmedia, --update, --use-distrib edo --parallel
fi: valitsinta --synthesis ei voi käyttää yhdessä valitsimien --media, --excludemedia, --sortmedia, --update, --use-distrib tai --parallel kanssa
fr: --synthesis ne peut être utilisé avec --media, --excludemedia, --sortmedia, --update, --use-distrib ou --parallel
gl: non se pode usar --synthesis con --media, --excludemedia, --sortmedia, --update, --use-distrib ou --parallel
he: --synthesis לא יכול לשמש ביחד עם --media, --excludemedia, --sortmedia, --use-distrib או --parallel
hu: a --synthesis nem használható ezekkel: --media, --excludemedia, --sortmedia, --update, --use-distrib, --parallel
id: --synthesis tidak dapat dipakai dengan --media, --excludemedia, --sortmedia, --update, --use-distrib atau --parallel
is: --synthesis er ekki hægt að nota saman með --media, --excludemedia, --sortmedia, --update, --use-distrib eða --parallel
it: --synthesis non può essere utilizzato con --media, --excludemedia, --sortmedia, --update, --use-distrib o --parallel
nb: Kan ikke bruke --synthesis sammen med --media, --excludemedia, --sortmedia, --update, --use-distrib eller --parallel
nl: --synthesis kan niet gebruikt worden met --media, --excludemedia, --sortmedia, --update, --use-distrib of --parallel
nn: Kan ikkje bruka «--synthesis» saman med «--media», «--excludemedia», «--sortmedia», «--update», «--use-distrib» eller «--parallel».
pl: --synthesis nie można używać z opcjami --media, --excludemedia, --sortmedia, --update, --use-distrib i --parallel
pt: --synthesis não pode ser usado com --media, --excludemedia, --sortmedia, --update, --use-distrib ou --parallel
pt_br: --synthesis não pode ser usada com --media, -excludemedia, -sortmedia, --update, --use-distrib ou --parallel
ro: --synthesis nu poate fi folosit cu --media, --excludemedia, --sortmedia, --update, --use-distrib sau --parallel
ru: параметр --synthesis нельзя использовать с --media, --excludemedia, --sortmedia, --update или --parallel
sl: --synthesis ni možno uporabiti z --media, --excludemedia, --sortmedia, --update, --use-distrib ali --parallel
sq: --synthesis nuk mund të përdoret me --media, --excludemedia, --sortmedia, --update, --use-distrib ose --parallel
sv: --synthesis kan inte användas med --media, --excludemedia, --sortmedia, -- update, --use-distrib eller --parallel
tr: --synthesis bu parametrelerle kullanılamaz --media, --excludemedia, --sortmedia, --update, --use-distrib veya --parallel

source: Search start: %s end: %s
ast: Aniciu de la búsqueda: %s fin: %s
cs: Hledání začátek: %s konec: %s
cy: Cychwyn chwilio: %s diwedd: %s
da: Søgnings-start: %s slut: %s
el: Έναρξη αναζήτησης: %s τέλος: %s
es: Inicio de la búsqueda: %s fin: %s
et: Otsingu algus: %s lõpp: %s
eu: Bilaketa hasera: %s amaiera: %s
fi: Haun alku: %s loppu: %s
fr: Recherche début : %s fin : %s
gl: Comezo da busca: %s final: %s
he: תחילת חיפוש: %s סיום: %s
hu: Keresés kezdete: %s vége: %s
id: Pencarian dimulai: %s akhir: %s
is: Leit byrjun: %s endir: %s
it: Avvio ricerca: %s e finisce: %s
nb: Søkestart: %s. slutt: %s.
nl: Zoek begin: %s eind: %s
nn: Søkjestart: %s. Søkjeslutt: %s.
pl: Początek wyszukiwania: %s koniec: %s
pt: Inicio de procura: %s fim: %s
pt_br: Procura inicia em %s e termina em %s
ro: Pornire căutare: %s terminare: %s
ru: Поиск: начало - %s, конец - %s
sl: Iskanje; začetek: %s konec: %s
sq: Fillo kërkimin: %s mbaro: %s
sv: Sök början: %s slut: %s
tr: Arama başlangıcı: %s bitişi: %s

source: skipping package %s
ast: saltando paquete %s
ca: s'està saltant el paquet %s
cs: přeskakuji balíček %s
cy: hepgor pecyn %s
da: overspringer pakke %s
el: παράλειψη του πακέτου %s
es: omitiendo paquete %s
et: pakett %s jäetakse vahele
eu: %s paketea saltatzen
fi: Ohitetaan paketti %s
fr: paquetage %s ignoré
gl: omitindo o paquete %s
he: מדלג על חבילה %s
hu: a(z) %s csomag kihagyása
id: lewatkan paket %s
is: sleppi pakka %s
it: salto il pacchetto %s
nb: hopper over pakke %s
nl: pakket %s overslaan
nn: Hoppar over pakken «%s».
pl: pomijanie pakietu %s
pt: a ignorar o pacote %s
pt_br: pulando o pacote %s
ro: se omite pachetul %s
ru: пропускается пакет %s
sl: izpuščanje paketa %s
sq: kalimi i pakos %s
sv: hoppar över paket %s
tr: %s paketi atlanıyor

source: would install instead of upgrade package %s
ast: instalaría en llugar d'anovar el paquete %s
ca: instal·laria en comptes d'actualitzar el paquet %s
cs: místo aktualizace bych instaloval balíček %s
cy: gosod yn lle uwchraddio pecyn %s
da: ville installere i stedet for at opgradere pakke %s
el: θα εγκαταστήσει αντί για να αναβαθμίσει το πακέτο %s
es: instalaría en vez de actualizar el paquete %s
et: paketti %s ei uuendata, seda saab ainult paigaldada
eu: %s paketea eguneratu beharrean instalatu egingo luke
fi: Paketti %s asennettaisiin päivittämisen sijaan
fr: effectuerait une installation plutôt qu'une mise à jour de %s
gl: instalaría no canto de actualizar o paquete %s
he: האם להתקין במקום לשדרג את החבילה %s
hu: csomagfrissítés helyett telepítés szükséges: "%s"
id: paket %s akan diinstal, bukan diupgrade
is: mundi setja inn í stað uppfærslu á pakka %s
it: installerebbe il pacchetto %s invece di aggiornarlo
nb: ville installert i stedet for å oppgradere pakka %s
nl: Zou pakket %s installeren, niet opwaarderen
nn: Ville installert i staden for å oppgradera pakken «%s».
pl: mogłoby to spowodować zainstalowanie zamiast uaktualnienia pakietu %s
pt: instalaria em vez de actualizar o pacote %s
pt_br: é necessário instalar ao invés de atualizar o pacote %s
ro: instalare în locul actualizării pachetului %s
ru: будет произведена установка вместо обновления пакета %s
sl: bi namestilo namesto nadgradilo paket %s
sq: dëshiron ta instaloj në vend që t'azhurnoj pakon %s
sv: skulle installera istället för att uppdatera paket %s
tr: %s paketinin yükseltilmesi yerine kurulması

source: medium "%s" already exists
ast: ya esiste'l mediu "%s"
ca: la font "%s" ja existeix
cs: zdroj "%s" již existuje
cy: cyfrwng "%s" yn bodoli eisoes
da: medie "%s" eksisterer allerede
el: το μέσο «%s» υπάρχει ήδη
es: ya existe el soporte «%s»
et: andmekandja "%s" on juba olemas
eu: "%s" euskarria lehendik badago
fi: Media "%s" on jo olemassa
fr: le média « %s » existe déjà
gl: o soporte "%s" xa existe
he: המאגר "%s" כבר קיים
hu: "%s" adatforrás már létezik
id: media "%s" telah ada
is: miðill "%s" er þegar til
it: il supporto "%s" già esistente
nb: mediet «%s» finnes allerede
nl: medium "%s" bestaat al
nn: Mediet «%s» finst allereie.
pl: nośnik "%s" już istnieje
pt: a média "%s" já existe
pt_br: mídia "%s" já existe
ro: mediul „%s” există deja
ru: источник «%s» уже существует
sl: vir »%s« že obstaja
sq: burimi "%s" ekziston me heret
sv: media "%s" finns redan
tr: "%s" ortamı zaten var

source: (ignored by default)
ast: (inoráu por defeutu)
ca: (ignorat per omissió)
cs: (implicitně ignorováno)
cy: (anwybyddwyd drwy ragosodiad)
da: (oversprunget som standard)
el: (αγνοήθηκε από προεπιλογή)
es: (ignorado por defecto)
et: (vaikimisi eiratakse)
eu: (era lehenetsian jaramonik ez)
fi: (oletuksena pois käytöstä)
fr: (ignoré par défaut)
gl: (ignorado por defecto)
hu: (alapértelmezésben figyelmen kívül hagyva)
id: (diabaikan secara default)
is: (sjálfgefið hunsað)
it: (ignorato come predefinito)
nb: (oversett som standard)
nl: (standaard niet in aanmerking genomen)
nn: (Hoppa over som standard.)
pl: (domyślnie ignorowany)
pt: (ignorado por predefinição)
pt_br: (ignorado por default)
ro: (se ignoră implicit)
ru: (игнорируется по умолчанию)
sl: (privzeto se spregleda)
sq: (injoruar në parazgjedhje)
sv: (ignorerat som standard)
tr: (varsayılan olarak yok sayıldı)
