Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: Can't use %s with %s
ast: Nun pue usase %s con %s
ca: Impossible utilitzar %s amb %s
cs: Nelze použít %s zároveň s %s
cy: Methu defnyddio %s gyda %s
da: Kan ikke bruge '%s' med '%s'.
el: Αδύνατη η χρήση του %s με το %s
es: No se puede usar %s con %s
et: %s kasutamine ei ole võimalik %s-ga
eu: Ezin da %s %s-rekin erabili
fi: Valitsinta %s ei voida käyttää valitsimen %s kanssa
fr: Impossible d'utiliser %s avec %s
gl: Non se pode usar %s con %s
he: לא ניתן להשתמש ב-%s עם %s
hu: %s nem használható ezzel: %s
id: Tidak bisa menggunakan %s dengan %s
is: Get ekki notað %s með %s
it: Impossibile utilizzare %s con %s
nb: Kan ikke bruke «%s» med «%s».
nl: Kan %s niet gebruiken samen met %s
nn: Kan ikkje bruka «%s» med «%s».
pl: Nie można użyć %s z %s
pt: Não pode usar %s com %s
pt_br: Não é possível usar %s com %s
ro: Nu se poate utiliza %s cu %s
ru: %s нельзя использовать без %s
sl: Ni mogoče uporabiti %s z/s %s
sq: Nuk mund të përdorni %s me %s
sv: Kan inte använda %s med %s
tr: %s, %s ile kullanılamaz

source: Too many arguments
ast: Abondos argumentos
ca: Massa arguments
cs: Příliš mnoho parametrů
cy: Gormod o ymresymiadau
da: For mange argumenter
el: Πάρα πολλά ορίσματα
es: Demasiados argumentos
et: Liiga palju argumente
eu: Argumentu gehiegi
fi: Liian monta argumenttia
fr: Trop d'arguments
gl: Demasiados argumentos
he: יותר מדי משתנים
hu: Túl sok argumentum
id: Terlalu banyak argumen
is: Of mörg viðföng
it: Troppi argomenti
nb: For mange argumenter
nl: Te veel argumenten
nn: For mange argument.
pl: Zbyt wiele argumentów
pt: Demasiados argumentos
pt_br: Muitos parâmetros
ro: Prea multe argumente
ru: Слишком много аргументов
sl: Preveč argumentov
sq: Shumë argumente
sv: För många argument
tr: Çok fazla parametre

source: %s version %s %s This is free software and may be redistributed under the terms of the GNU GPL. usage:
ast: %s versión %s %s Esto ye software llibre y tien de redistribuyise embaxo los términos de la GNU GPL. usu:
ca: %s versió %s %s Aquest programa és lliure i es pot redistribuir sota els termes de la GPL de GNU. sintaxi:
cs: %s verze %s %s Toto je svobodný software a je volně šiřitelný dle podmínek licence GNU GPL. použití:
cy: %s fersiwn %s %s Meddalwedd rhydd yw hwn a gall gael ei ddosbarthu o dan amodau'r GPL GNU. defnydd:
da: %s version %s %s Dette er frit programmel og kan redistribueres under vilkårene for GNU GPL. brug:
el: %s έκδοση %s %s Αυτό είναι ελεύθερο λογισμικό και μπορεί να αναδιανεμηθεί υπό τους όρους της GNU GPL. χρήση :
es: %s versión %s %s Esto es software libre y se debe redistribuir bajo los términos de la GNU GPL. uso:
et: %s versioon %s %s See on vaba tarkvara, mida võib levitada vastavalt GNU Üldise Avaliku Litsentsi tingimustele. kasutamine:
eu: %s %s bertsioa %s Software askea da hau eta GNU-ren GPL-k ezarritako baldintzak jarraituz birbanatu daiteke. erabilera:
fi: %s versio %s %s Tämä on vapaa ohjelmisto, jota saa levittää GNU GPL -lisenssin mukaisesti. Käyttö:
fr: %s version %s %s Ceci est un logiciel libre pouvant être redistribué selon les termes de la licence GNU GPL. utilisation :
gl: %s versión %s %s Isto é software libre e pode redistribuírse baixo os termos da GNU GPL. uso:
he: גרסת %s %s %s זוהי תוכנה חופשית וניתן להפיצה בהתאם לתנאי הרישיון GNU GPL. שימוש:
hu: %s %s %s Ez a program szabad szoftver; a GNU GPL feltételei szerint terjeszthető. Használat:
id: %s versi %s %s Ini adalah software bebas dan boleh didistribusikan ulang di bawah syarat GPL GNU. pemakaian:
is: %s útgáfa %s %s Þetta er frjáls hugbúnaður og má dreifa samkvæmt skilmálum GNU GPL. notkun:
it: %s versione %s %s Questo è software libero e può essere ridistribuito secondo i termini della licenza GNU GPL. uso:
nb: %s – versjon %s %s Dette er fri programvare og kan redistribueres under vilkårene til GNU GPL. bruk:
nl: %s versie %s %s Dit is vrije software en mag worden verspreid onder de voorwaarden van de GNU GPL. gebruik:
nn: %s – versjon %s %s Dette er fri programvare, og kan distribuerast under vilkåra i GNU GPL-lisensen. Bruk:
pl: %s wersja %s %s To jest otwarte oprogramowanie i może być rozpowszechniane na zasadach licencji GNU GPL. użycie:
pt: versão %s %s %s Isto é um programa livre e pode ser redistribuído sob os termos GPL GNU. uso:
pt_br: %s versão %s %s Este é um software livre, e pode ser redistribuído sob os termos da GNU GPL. uso:
ro: %s versiunea %s %s Acesta este un program liber și poate fi redistribuit sub termenii licenței GNU GPL. utilizare:
ru: %s версия %s %s Это свободное программное обеспечение и может распространяться согласно условиям GNU GPL. использование:
sl: %s različica %s %s To je prosta programska oprema in se sme razmnoževati pod dovoljenjem GNU GPL. Uporaba:
sq: %s versioni %s %s Ky është software gratis dhe mund të shpërndahet ndër termet e GNU GPL. përdorim:
sv: %s version %s %s Det här är fri programvara och får distribueras enligt villkoren i GNU GPL. användning:
tr: %s sürüm %s %s Bu bir özgür yazılımdır ve GNU GPL lisansı altında tekrar dağıtılabilinir. kullanımı:

source: Copyright (C) %s by %s
ca: Copyright (C) %s per %s
cs: Copyright (C) %s %s
cy: Hawlfraint (C) %s %s
da: Ophavsret © %s ved %s
el: Πνευματικά δικαιώματα %s από τη %s
es: Copyright © %s por %s
et: Autoriõigus (C) %s: %s
eu: Copyright (C) %s %s
fi: Copyright (C) %s, %s
fr: Copyright (C) %s par %s
gl: Copyright (C) %s de %s
he: כל הזכויות שמורות (C) %s %s
hu: Copyright (C) %s, %s
id: Hak cipta (C) %s oleh %s
is: Höfundaréttur (C) %s %s
it: Copyright (C) %s di %s
nb: Copyright © %s %s
nl: Copyright © %s door %s
nn: Copyright © %s %s
pt: Direitos de Autor (C) %s pela %s
pt_br: Copyright (C) %s por %s
ro: Drepturi de autor (C) %s de către %s
ru: Copyright (C) %s %s
sl: Avtorske pravice (C) %s %s
sq: E Drejta Autorit (C) %s %s
sv: Copyright (C) %s, %s
tr: Copyright (C) %s bir %s ürünüdür

source: Copying failed
ast: Falló la copia
ca: La còpia ha fallat
cs: Kopírování selhalo
cy: Methodd y copïo
da: Kopiering mislykkedes
el: Η αντιγραφή απέτυχε
es: Falló la copia
et: Kopeerimine nurjus
eu: Ezin izan da kopiatu
fi: Kopiointi epäonnistui
fr: La copie a échoué
gl: Fallo ó copiar
he: ההעתקה נכשלה
hu: A másolás sikertelen
id: Penyalinan gagal
is: Afritun brást
it: Copia fallita
nb: Kopiering mislyktes.
nl: Kopiëren mislukt
nn: mislukka kopiering.
pl: Kopiowanie zakończone niepowodzeniem
pt: Cópia falhada
pt_br: Falha na cópia
ro: Copiere eșuată
ru: Копирование не удалось
sl: Kopiranje je spodletelo
sq: Kopjimi dështoi
sv: Kopiering misslyckades
tr: Kopyalama başarısız

source: You must mount CD-ROM yourself (or install perl-Hal-Cdroms to have it done automatically)
ast: Tienes de montar el CD-ROM tú mesmu (o instalar perl-Hal-Cdroms pa que se monte automáticamente)
cs: Musíte připojit CD-ROM sami (nebo nainstalovat balíček perl-Hal-Cdroms, který to dělá automaticky)
cy: Rhaid i chi arosod y CD-ROM eich hun (neu osod perl-Hal-Cdroms i'w wneud yn awtomatig)
da: Du skal montere CD-ROM selv (eller installere perl-Hal-Cdroms for at få det gjortautomatisk)
el: Πρέπει να προσαρτήσετε το CD-ROM από μόνος-η σας (ή να εγκαταστήσετε το perl-Hal-Cdroms ώστε αυτό να γίνεται αυτόματα)
es: Debe montar el CD-ROM usted mismo (o instalar perl-Hal-Cdroms para que se monte automáticamente)
et: Te peate CD-ROM-i käsitsi haakima (või paigaldama paketi perl-Hal-Cdroms, kui soovite, et seda tehakse automaatselt)
eu: CD-ROMa zuk zeuk muntatu behar duzu (edo perl-Hal-Cdroms instalatatu automatikoki egin dadin)
fi: CD/DVD-levy täytyy liittää tiedostojärjestelmään itse (tai asentaa paketti perl-Hal-Cdroms automaattista liittämistä varten).
fr: Vous devez monter le CD-ROM vous-même (ou installer perl-Hal-Cdroms afin que celà soit fait automatiquement)
gl: Debe montar o CD-ROM vostede mesmo (ou instalar perl-Hal-Cdroms para que o faga automaticamente)
hu: Muszáj a CD-ROM-ot kézzel csatlakoztatnia (vagy telepítse a perl-Hal-Cdroms csomagot az automatikus csatlakoztatáshoz)
is: Þú verður að tengja Geisladiskinn sjálf(ur) (eða setja inn perl-Hal-Cdroms svo þetta gerist sjálfkrafa)
it: Devi montare manualmente il CD-ROM (ma se installi perl-Hal-Cdroms verrà fatto automaticamente)
nb: Du må montere CD-ROM-en manuelt (eller installere perl-Hal-Cdroms for å få det gjort automatisk.
nl: U dient de cd-rom zelf aan te koppeken (of perl-Hal-Cdroms te installeren om het automatisch te laten doen)
nn: Du må montera CD-ROM-en sjølv (eller installera perl-Hal-Cdroms for at det skal gjerast automatisk).
pl: Musisz zamontować CD-ROM samodzielnie (lub zainstalować perl-Hal-Cdroms, aby to zautomatyzować)
pt: Precisa de montar o CD-ROM (ou instalar o pacote perl-Hal-Cdroms para que seja feito automaticamente)
pt_br: Você deve montar o CD manualmente (ou instalar o perl-Hal-Cdroms para que seja montado automaticamente)
ro: Trebuie să montați singur discul optic (sau instalați perl-Hal-Cdroms pentru a se efectua automat)
ru: CD-ROM необходимо смонтировать вручную (или установите perl-Hal-Cdroms, чтобы это выполнялось автоматически)
sl: CD-ROM morate priklopiti sami (ali pa namestiti perl-Hal-Cdroms za samodejni priklop)
sq: Ju duhet ngarkoni vetë CD-ROM (ose instaloni perl-Hal-Cdroms për ta bërë atë automatikisht)
sv: Du måste montera CD-ROM själv (eller installera perl-Hal-Cdroms för att få det automatiserat)
tr: CD-ROM'u kendiniz bağlamalısınız. (veya otomatik olarak yapılması için perl-Hal-Cdroms kurun)

source: Udisks daemon (udisks-daemon) is not running or not ready
ast: El degorriu Udisks (udisks-daemon) nun ta activu o nun ta preparáu
cy: Nid yw'r Udisks daemon (udisks-daemon) yn rhedeg neu nid yw'n barod
da: Udisks dæmon (udisks-daemon) kører ikke, eller ikke klar
el: Ο δαίμονας Udisks (udisks-daemon) δεν εκτελείται ή δεν είναι έτοιμος
es: El demonio Udisks (udisks-daemon) no está activo o no está listo
et: Udisks-deemon (udisks-daemon) ei tööta või ei ole valmis
eu: Udisks deabrua (udisks-daemon) ez dago martxan edo ez dago prest
fi: Udisks-taustaprosessi (udisks-daemon) ei ole käynnissä tai valmis.
fr: Le démon Udisks (udisks-daemon) n'est pas lancé ou n'est pas prêt
hu: A Udisks démon (udisks-daemon) nem fut vagy nem áll készen
is: Hal þjónusta (udisks-daemon) er ekki keyrandi eða ekki tilbúin
it: Il demone Udisks (udisks-daemon) non è attivo o non è pronto
nb: Udisks-tjenesten (udisks-daemon) kjører ikke, eller er ikke klar
nl: Udisks-voorziening (udisks-daemon) is niet actief of onklaar
nn: Udisks-tenesta («udisks-daemon») køyrer ikkje, eller ikkje klar.
pl: Usługa Udisks (udisks-daemon) nie działa lub nie jest gotowa
pt: O serviço Udisks (udisks-daemon) está a correr ou não está pronto
pt_br: O daemon do Udisks (udisks-daemon) não está rodando ou não está respondendo
ro: serviciul Udisks (udisks-daemon) nu rulează sau nu este pregătit
ru: Udisks-демон (udisks-daemon) не запущен или не готов к работе
sl: Ozadnji program Udisks (udisks-daemon) ne teče oziroma ni pripravljen
sq: Udisks daemon (udisks-daemon) nuk është lëshuar ose nuk është gati
sv: Udisks-demonen (udisks-daemon) är inte igång eller ej klar
tr: Udisks uygulamacığı (udisks-daemon) ya çalışmıyor ya da hazır değil

source: medium "%s" is not available
ast: el preséu "%s" nun ta disponible
ca: el suport "%s" no està disponible
cs: zdroj "%s" není k dispozici
cy: nid yw cyfrwng "%s" ar gael
da: medie "%s" er ikke tilgængeligt
el: το μέσο "%s" δεν είναι διαθέσιμο
es: el soporte «%s» no está disponible
et: andmekandja "%s" ei ole kättesaadav
eu: "%s" euskarria ez dago eskuragarri
fi: Media "%s" ei ole käytettävissä
fr: le média « %s » n'est pas disponible
gl: o soporte "%s" non está dispoñible
he: המקור "%s" אינו זמין
hu: a(z) "%s" adatforrás nem elérhető
id: media "%s" tidak tersedia
is: miðill "%s" er ekki tiltækur
it: il supporto «%s» non è disponibile
nb: Mediet «%s» er ikke tilgjengelig.
nl: medium "%s" is niet beschikbaar.
nn: Mediet «%s» er ikkje tilgjengeleg.
pl: nośnik %s jest niedostępny
pt: a média "%s" não está disponível
pt_br: mídia "%s" não está disponível
ro: mediul „%s” nu este disponibil
ru: источник «%s» недоступен
sl: vir »%s« ni na voljo
sq: medium "%s" nuk është i disponueshëm
sv: mediat "%s" är inte tillgängligt
tr: "%s" ortamı mevcut değil

source: unable to read rpm file [%s] from medium "%s"
ast: nun puede lleese'l ficheru rpm [%s] del preséu "%s"
ca: no s'ha pogut llegir el fitxer rpm [%s] des de la font "%s"
cs: nelze načíst soubor RPM [%s] pro zdroj "%s"
cy: methu darllen ffeil rpm (%s) o gyfrwng "%s"
da: kunne ikke læse rpm-fil [%s] fra medie "%s"
el: αδυναμία ανάγνωσης του αρχείου rpm [%s] από το μέσο "%s"
es: no se puede leer el archivo rpm [%s] del soporte «%s»
et: RPM-faili [%s] lugemine andmekandjalt "%s" nurjus
eu: ezin izan dugu [%s] rpm fitxategia "%s" euskarrian irakurri
fi: Rpm-pakettia [%s] ei voitu lukea medialta "%s"
fr: impossible de lire le fichier rpm [%s] depuis le média « %s »
gl: non foi posible ler o ficheiro rpm [%s] dende o soporte "%s"
he: אין אפשרות לקרוא את קובץ ה-RPM [%s] מ "%s"
hu: a(z) [%s] csomagfájl (RPM) nem olvasható a(z) "%s" adatforrásból
id: gagal membaca file rpm [%s] dari media "%s"
is: get ekki lesið rpm skrá [%s] frá miðli "%s"
it: impossibile leggere il file rpm [%s] dal supporto "%s"
nb: klarte ikke lese rpm-fil [%s] fra mediet «%s»
nl: kon rpm bestand [%s] niet lezen van medium "%s"
nn: Klarte ikkje lesa rpm-fil [%s] frå mediet «%s».
pl: nie można czytać pliku rpm [%s] z nośnika "%s"
pt: não é possível ler o ficheiro rpm [%s] da média "%s"
pt_br: incapaz de ler o arquivo rpm [%s] para a mídia "%s"
ro: nu se poate citi fișierul rpm [%s] de pe mediul „%s”
ru: не удаётся прочитать rpm-файл [%s] из источника «%s»
sl: branje datoteke rpm [%s] iz vira »%s« ni možno
sq: i pa mundur leximi i skedares [%s] nga burimi "%s"
sv: kunde inte läsa RPM-fil [%s] från media "%s"
tr: rpm dosyası [%s] , "%s" ortamından okunamıyor

source: syntax error in config file at line %s
ast: fallu de sintaxis nel ficheru de configuración na llinia %s
ca: error de sintaxi al fitxer de configuració a la línia %s
cs: syntaktická chyba v souboru s nastavením na řádku %s
cy: gwall cystrawen yn ffeil config ar linell %s
da: Syntaksfejl i opsætningfilen, linje %s.
el: σφάλμα σύνταξης στο αρχείο ρυθμίσεων, στη γραμμή %s
es: error de sintaxis en el archivo de configuración en la línea %s
et: süntaksiviga seadistustefaili real %s
eu: sintaxi akatsa konfig fitxategiaren %s lerroan
fi: Syntaksivirhe asetustiedoston rivillä %s
fr: erreur de syntaxe à la ligne %s du fichier de configuration
gl: erro de sintaxe no ficheiro de configuración na liña %s
he: שגיאת תחביר בקובץ בשורה %s בקובץ התצורה
hu: szintaktikai hiba a beállítási fájlban a következő sornál: %s
id: kesalahan sintak pada file konfigurasi pada barus %s
is: málfræðivilla í uppsetningarskrá, línu %s
it: errore di sintassi alla riga %s del file di configurazione
nb: Syntaksfeil på linje %s i oppsettfila.
nl: Syntaxisfout in configuratiebestand op regel %s
nn: Syntaksfeil i oppsettfila, linje %s.
pl: błąd składni pliku konfiguracyjnego w linii %s
pt: erro de sintaxe no ficheiro de configuração na linha %s
pt_br: erro de sintaxe no arquivo de configuração na linha %s
ro: eroare de sintaxă în fișierul de configurare la linia %s
ru: ошибка синтаксиса в конфигурационном файле: строка [%s]
sl: skladenjska napaka v nastavitveni datoteki v vrstici %s
sq: gabim syntax error në skedarin e in rregullimit në linjën %s
sv: syntaxfel i inställningsfil på rad %s
tr: Yapılandırma dosyasının %s satırında yazım hatası

source: unable to read config file [%s]
ast: nun pudo lleese'l ficheru de configuración [%s]
ca: no s'ha pogut llegir el fitxer de configuració [%s]
cs: nelze načíst soubor s nastavením [%s]
cy: Methu creu ffeil config (%s)
da: kunne ikke læse config-fil [%s]
el: αδυναμία ανάγνωσης του αρχείου ρυθμίσεων (config) [%s]
es: no se puede leer el archivo de configuración [%s]
et: seadistustefaili [%s] lugemine nurjus
eu: ezin da konfig fitxategia irakurri [%s]
fi: Asetustiedostoa [%s] ei voitu lukea
fr: impossible de lire le fichier de configuration [%s]
gl: non foi posible ler o ficheiro de configuración [%s]
he: לא ניתן לקרוא את קובץ התצורה [%s]
hu: nem sikerült olvasni a(z) "%s" beállítási fájlt
id: tidak dapat membaca file konfigurasi [%s]
is: get ekki lesið uppsetningarskrá [%s]
it: impossibile leggere il file di configurazione [%s]
nb: klarte ikke lese oppsettfila [%s].
nl: kan configuratiebestand [%s] niet lezen
nn: Klarte ikkje lesa oppsettfila [%s].
pl: odczytanie pliku konfiguracyjnego było niemożliwe [%s]
pt: não é possível ler o ficheiro de configuração [%s]
pt_br: incapaz de ler o arquivo de configuração [%s]
ro: nu se poate citi fișierul de configurare [%s]
ru: не удаётся прочитать конфигурационный файл [%s]
sl: branje datoteke nastavitvene datoteke [%s] ni možno
sq: e pamundur për të lexuar skedarin e rregullimit [%s]
sv: kan inte läsa inställningsfil [%s]
tr: yapılandırma dosyasına [%s] yazılamıyor

source: medium `%s' is defined twice, aborting
ast: el mediu «%s» ta definíu dos vegaes, albortando
ca: el suport `%s' està definit dues vegades, cancel·lant
cs: zdroj `%s' je definovaný dvakrát, končím
cy: mae cyfrwng '%s' wedi ei ddiffinio ddwy waith, cau
da: Mediet '%s' er defineret to gange. Afbryder
el: το μέσο `%s' προσδιορίστηκε δύο φορές, γίνεται εγκατάλειψη
es: el soporte «%s» está definido dos veces, abortando
et: andmekandja '%s' on määratud kaks korda, loobutakse'
eu: '%s' euskarria bitan definituta dago, galarazten
fi: Media "%s" on asetettu kahdesti, keskeytetään
fr: le média « %s » est défini deux fois, interruption
gl: o soporte `%s' está definido dúas veces, abortando
he: המקור '%s' מוגדר פעמים, נוטש
hu: "%s" adatforrás kétszer van megadva - megszakítás
id: media `%s' didefinisikan dua kali, membatalkan diri
is: miðill `%s' er tilgreindur tvisvar, hætti
it: il supporto %s è stato definito due volte. Interrompo
nb: mediet «%s» er spesifisert to ganger, avbryter
nl: medium "%s" is twee keer gedefinieerd, afbreken
nn: Mediet «%s» er definert to gonger. Avbryt.
pl: nośnik %s jest dwukrotnie zdefiniowany, przerywanie
pt: a média `%s' está definida duas vezes, abortar
pt_br: mídia `%s' está definida duas vezes, abortando
ro: mediul „%s” este definit de două ori, se abandonează
ru: источник «%s» определён дважды; останов
sl: vir »%s« je naveden dvakrat, prekinjam
sq: medium `%s' është përcaktuar dy herë, ndërprerje
sv: medium '%s' är definierat två gånger, avbryter
tr: `%s' ortamı ikinci defa tanımlandı, iptal ediliyor

source: unable to write config file [%s]
ast: nun puede escribise'l ficheru de configuración [%s]
ca: no s'ha pogut escriure el fitxer de configuració [%s]
cs: nelze zapsat soubor s nastavením [%s]
cy: methu ysgrifennu i ffeil ffurfweddiad (%s)
da: kunne ikke skrive config-fil [%s]
el: αδυναμία εγγραφής του αρχείου ρυθμίσεων [%s]
es: no se puede escribir el archivo de configuración [%s]
et: seadistustefaili [%s] kirjutamine nurjus
eu: ezin da [%s] konfigurazio-fitxategia idatzi
fi: Asetustiedostoon [%s] ei voitu kirjoittaa
fr: impossible d'écrire le fichier de configuration [%s]
gl: non foi posible escribir o ficheiro de configuración [%s]
he: כתיבת קובץ ההגדרות [%s] נכשלה
hu: a beállítások mentése nem sikerült: "%s"
id: gagal menulis ke file konfigurasi [%s]
is: get ekki skrifað í uppsetningarskrá [%s]
it: impossibile scrivere il file di configurazione [%s]
nb: klarer ikke å skrive oppsettfila [%s].
nl: kon configuratiebestand [%s] niet wegschrijven
nn: Klarte ikkje skriva oppsettfila [%s].
pl: nie można zapisać pliku konfiguracyjnego [%s]
pt: não é possível gravar o ficheiro de configuração [%s]
pt_br: incapaz de gravar o arquivo de configuração [%s]
ro: nu se poate scrie în fișierul de configurare [%s]
ru: не удаётся записать конфигурационный файл [%s]
sl: zapisovanje nastavitvene datoteke [%s] ni možno
sq: i pa mundur shkrimi i skedares konfiguruese [%s]
sv: kan inte skriva inställningsfil [%s]
tr: yapılandırma dosyasına [%s] yazılamıyor

source: %s is not available, falling back on %s
ast: %s nun ta disponible, prebando con %s
ca: %s no està disponible, recorrent a %s
cs: %s není k dispozici, návrat k %s
cy: Nid yw %s ar gael, mynd yn ôl at %s
da: %s er ikke tilgængelig, falder tilbage til %s
el: το %s δεν είναι διαθέσιμο, επιστροφή στη χρήση του %s
es: %s no está disponible, probando con %s
et: %s ei ole kättesaadav, kasutatakse %s
eu: %s ez dago eskuragarri, %s erabiliko da
fi: %s ei ole saatavilla, käytetään %s
fr: %s n'est pas disponible, utilisation de %s
gl: non está dispoñible %s, volvendo a %s
he: %s אינו זמין, נופל חזרה אל %s
hu: %s nem elérhető, helyette ez lesz használva: %s
id: %s tidak tersedia, kembali ke %s
is: %s er ekki tiltækt, nota varamiðil %s
it: %s non è disponibile, si utilizzerà %s
nb: %s er ikke tilgjengelig, faller tilbake til %s
nl: %s is niet beschikbaar, terugvallen op %s
nn: «%s» er ikkje tilgjengeleg. Fell tilbake på «%s».
pl: %s jest niedostępny, ponowne stosowanie %s
pt: %s não está disponível, a voltar a usar %s
pt_br: %s não está disponível, utilizando %s no lugar
ro: %s nu este disponibil, se revine la %s
ru: %s недоступен, выполняется откат до %s
sl: %s ni na voljo, vrnitev na %s
sq: %s nuk është në dispozicion, duke rikthyer %s
sv: %s är inte tillgänglig, faller tillbaka till %s
tr: %s mevcut değil, %s e dönülüyor

source: can not read proxy settings (not enough rights to read %s)
ast: nun pueden lleese los axustes del proxy (ensin permisu suficiente pa lleer %s)
ca: no s'ha pogut llegir la configuració del proxy (sense prou drets per llegir %s)
cs: nelze načíst nastavení proxy (nejsou dostatečná práva ke čtení %s)
cy: methu darllen y gosodiadau dirprwy (dim digon o hawl i ddarllen %s)
da: kan ikke læse proxy-indstillinger (ikke rettigheder nok til at læse %s)
el: αδυναμία ανάγνωσης των ρυθμίσεων του proxy (διαμεσολαβητής) (τα δικαιώματα δεν είναι επαρκή για την ανάγνωση του %s)
es: no se pueden leer los ajustes del proxy (sin permiso suficiente para leer %s)
et: puhverserveri sätete lugemine nurjus (%s lugemiseks puuduvad õigused)
eu: ezin proxy ezarpenak irakurri (behar adinako eskubiderik ez %s irakurtzeko)
fi: Välityspalvelimen asetuksia ei voida lukea (oikeudet eivät riitä tiedoston %s lukemiseen)
fr: impossible de lire les paramètres proxy (droits insuffisants sur %s)
hu: nem olvasható a proxy beállítás (nincs joga a(z) %s olvasásához)
is: get ekki lesið staðgengils-stillingar (ekki næg réttindi til að lesa %s)
it: impossibile leggere le impostazioni del proxy (diritti insufficienti per leggere %s)
nb: kan ikke lese innstillingene for mellomtjeneren (ikke nok rettigheter til å lese%s)
nl: kan proxy-instellingen niet lezen (onvoldoende rechten om %s te lezen)
nn: Klarte ikkje lesa mellomtenar-innstillingar (har ikkje løyve til å lesa «%s»).
pl: odczytanie ustawień proxy było niemożliwe (niewystarczające prawa do odczytu %s)
pt: não é possível ler as configurações do 'proxy' (sem permissão para ler %s)
pt_br: não foi possível ler configuração do proxy (permissões de leitura insuficientes %s)
ro: nu se pot citi parametrii de proxy (drepturi insuficiente pentru citirea lui %s)
ru: не удаётся прочитать параметры прокси-сервера (недостаточно прав, чтобы прочитать %s)
sl: branje nastavitev posredniškega strežnika ni možno (ni dovolj pravic za branje %s)
sq: nuk mund të lexojë cilësimet e proxy (ska të drejta të mjaftueshme për të lexuar %s)
sv: kan inte läsa proxy-inställningar (inte tillräckliga behörigheter för att läsa %s)
tr: Vekil sunucu ayarları okunamıyor (%s okumak için yeterli yetki yok)
