Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: unable to use parallel option "%s"
ast: nun pudo usase la opción paralela "%s"
ca: no s'ha pogut usar l'opció de paral·lel "%s"
cs: nelze použít paralelní volbu "%s"
cy: methu defnyddio dewis paralel "%s"
da: kan ikke bruge parallel mulighed "%s"
el: αδυναμία χρήσης της επιλογής parallel "%s"
es: no se puede utilizar la opción paralelo «%s»
et: paralleelvõtme "%s" kasutamine nurjus
eu: ezin da "%s" aukera paraleloa erabili
fi: Rinnakkaisvalitsinta "%s" ei voitu käyttää
fr: impossible d'utiliser l'option distribuée « %s »
he: אין אפשרות להשתמש באפשרות המקבילה "%s"
hu: "%s" párhuzamossági opció nem használható
id: gagal menggunakan opsi paralel "%s"
is: get ekki notað samhliðavalkost "%s"
it: impossibile utilizzare l'opzione parallel "%s"
nb: Klarte ikke bruke parallellvalget «%s»
nl: niet in staat parallelle optie "%s" te gebruiken
nn: Klarte ikkje bruka parallellvalet «%s».
pl: nie można użyć równoległej opcji "%s"
pt: não é possível usar a opção paralela "%s"
pt_br: incapaz de usar a opção paralela "%s"
ro: nu se poate folosi opțiunea distribuită „%s”
ru: нельзя использовать параметр parallel «%s»
sl: uporaba vzporedne izbire »%s« ni možna.
sq: i pa mundur përdorimi i opcionit paralel "%s"
sv: kan inte använda parallellalternativ "%s"
tr: paralel seçenek "%s" kullanılamadı

source: on node %s
ast: nel nodu %s
ca: en el node %s
cs: na uzlu %s
cy: ar nod %s
da: på knude %s
el: στον κόμβο %s
es: en el nodo %s
et: sõlmes %s
eu: %s korapilunean
fi: solmukohdassa %s
fr: sur le noeud %s
hu: a %s node-on
id: pada node %s
is: á hnút %s
it: sul nodo %s
nb: på tilgangpunkt %s
nl: op knooppunt %s
nn: på noden %s
pl: na etapie %s
pt: no nó %s
pt_br: no node %s
ro: pe nodul %s
ru: в узле %s
sl: na vozlišču %s
sv: på nod %s
tr: nod %s üzerinde

source: Installation failed on node %s
ast: Falló la instalación nel nodu %s
ca: La instal·lació ha fallat en el node %s
cs: Instalace na uzlu %s selhala
cy: Methodd y gosod ar nod %s
da: Installationen fejlede på knude %s
el: Η εγκατάσταση απέτυχε στον κόμβο %s
es: Falló la instalación en el nodo %s
et: Paigaldamine nurjus sõlmes %s
eu: Instalazioak %s korapilunean huts egin du
fi: Asennus epäonnistui solmukohdassa %s
fr: L'installation a échoué sur le noeud %s
hu: A telepítés nem sikerült a %s node-on
is: Innsetning brást á hnút %s
it: Installazione sul nodo %s fallita
nb: Installasjon mislyktes på tilgangpunkt %s
nl: Installatie mislukt op knooppunt %s
nn: Feil ved installering på noden %s
pl: Instalacja nie powiodła się na etapie %s
pt: Instalação falhada no nó %s
pt_br: A Instalação falhou no nodo %s
ro: Instalarea a eșuat pe nodul %s
ru: Ошибка установки на узле %s
sl: Na vozlišču %s namestitev ni bila uspešna
sq: Instalimi dështoi në nyje %s
sv: Installationen misslyckades på nod %s
tr: Nod %s üzerinde kurulum başarısız oldu.

source: rshp failed, maybe a node is unreacheable
ast: falló rshp, quiciabés nun pudo algamase un nodu
ca: ha fallat rshp, potser el node no està accessible
cs: rshp selhalo, možná není dostupný uzel
cy: methodd rshp, efallai fod y nod yn anghyraeddadwy
da: rshp mislykkedes, måske er en knude uopnåelig
el: το rshp απέτυχε, ίσως ο κόμβος να μην είναι προσβάσιμος
es: falló rshp, tal vez no se puede alcanzar un nodo
et: rshp nurjus, võib-olla ei ole sõlm kättesaadav
eu: rshp-k huts egin du, agian ezin da korapilune bat atzeman
fi: rshp epäonnistui, solmukohta on ehkä tavoittamattomissa
fr: rshp a échoué, un noeud est peut-être injoignable
hu: rshp hiba. Lehet, hogy a node elérhetetlen.
id: rshp gagal, mungkin sebuah node tidak dapat dicapai
is: rshp brást, kannski er ekki hægt að tengjast hnút
it: rshp non riuscito, forse un nodo non è raggiungibile
nb: rshp feilet, kanskje et tilgangpunkt er utilgjengelig
nl: rshp is mislukt, een knooppunt zou onbereikbaar kunnen zijn
nn: Feil ved rshp. Det kan vera noden ikkje kan nåast.
pl: rshp napotkał błąd, być może węzeł jest niedostępny
pt: rshp falhado, talvez um nó esteja inalcançável
pt_br: rshp falhou, provavelmente um nó está inacessível
ro: rshp a eșuat, poate nodul nu este accesibil
ru: сбой rshp, может быть узел не недостижим
sl: rshp ni uspel, mogoče je vozlišče nedostopno
sq: rshp dështoj, ndoshta një nyje është e paarritshme
sv: rshp misslyckades, kanske en nod är otillgänglig
tr: rshp başarısız, belki bir noda ulaşılamıyordur

source: mput failed, maybe a node is unreacheable
ast: falló mput, igual nun pudo algamase'l nodu
ca: ha fallat mput, potser el node no està accessible
cs: mput selhalo, možná není dostupný uzel
cy: methodd mput, efallai fod y nod yn anghyraeddadwy
da: mput mislykkedes, måske er en knude uopnåelig
el: το mput απέτυχε, ίσως ο κόμβος να μην είναι προσβάσιμος
es: falló mput, tal vez no se puede alcanzar un nodo
et: mput nurjus, võib-olla ei ole sõlm kättesaadav
eu: mput-k huts egin du, agian ezin da korapilune bat atzeman
fi: mput epäonnistui, solmukohta on ehkä tavoittamattomissa
fr: mput a échoué, un noeud est peut-être injoignable
hu: mput hiba. Lehet, hogy a node elérhetetlen.
id: mput gagal, mungkin sebuah node tidak dapat dicapai
is: mput brást, kannski er ekki hægt að tengjast hnút
it: mput non riuscito, forse un nodo non è raggiungibile
nb: mput feilet, kanskje et tilgangpunkt er utilgjengelig
nl: mput is mislukt, een knooppunt zou onbereikbaar kunnen zijn
nn: Feil ved mput. Det kan vera noden ikkje kan nåast.
pl: mput napotkał błąd, być może węzeł jest niedostępny
pt: mput falhado, talvez um nó esteja inalcançável
pt_br: mput falhou, provavelmente um nó está inacessível
ro: mput a eșuat, poate nodul nu este accesibil
ru: сбой mput, может быть узел недостижим
sl: mput je spodletel, mogoče je vozlišče nedostopno
sq: mput dështuar, ndoshta një nyje është e paarritshme
sv: mput misslyckades, kanske en nod är otillgänglig
tr: mput başarısız, belki bir noda ulaşılamıyordur

source: scp failed on host %s (%d)
ast: falló scp nel agospiador %s (%d)
cs: scp selhalo na počítači %s (%d)
cy: methodd scp ar westai %s (%d)
da: scp mislykkedes på vært %s (%d)
el: απέτυχε το scp, στον υπολογιστή %s (%d)
es: falló scp en el equipo %s (%d)
et: scp nurjus masinas %s (%d)
eu: scp-k huts egin du %s ostalarian (%d)
fi: SCP-siirto epäonnistui kohteelle %s (%d)
fr: scp a échoué sur l'hôte %s (%d)
hu: scp hiba a %s gépen (%d)
id: scp gagal pada host %s (%d)
is: scp mistókst á hnút %s (%d)
it: scp non riuscito sull'host %s (%d)
nb: scp feilet på vert %s (%d)
nl: scp mislukt op hostcomputer %s (%d)
nn: Feil ved scp på verten %s (%d)
pl: scp nie powiodło się na komputerze %s(%d)
pt: scp falhado na máquina %s (%d)
pt_br: scp falhou no host %s (%d)
ro: scp a eșuat la gazda %s (%d)
ru: сбой scp на хосте %s (%d)
sl: scp je spodletel pri gostitelju %s (%d)
sq: scp dështoj në host %s (%d)
sv: scp misslyckades på maskin %s (%d)
tr: %s makinesi (%d) üzerinde scp başarısız oldu

source: cp failed on host %s (%d)
ast: falló cp nel agospiador %s (%d)
cs: cp selhalo na počítači %s (%d)
cy: methodd cp ar westai %s (%d)
da: cp mislykkedes på vært %s (%d)
el: απέτυχε το cp, στον υπολογιστή %s (%d)
es: falló cp en el equipo %s (%d)
et: cp nurjus masinas %s (%d)
eu: cp-k huts egin du %s ostalarian (%d)
fi: Kopiointi epäonnistui kohteessa %s (%d)
fr: cp a échoué sur l'hôte %s (%d)
hu: cp hiba a %s gépen (%d)
is: cp mistókst á hnút %s (%d)
it: cp non riuscito sull'host %s (%d)
nb: cp feilet på vert %s (%d)
nl: cp mislukt op hostcomputer %s (%d)
nn: Feil ved cp på verten %s (%d)
pl: cp nie powiodło się na komputerze %s(%d)
pt: cp falhado na máquina %s (%d)
pt_br: cp falhou no host %s (%d)
ro: cp a eșuat la gazda %s (%d)
ru: сбой cp на хосте %s (%d)
sl: cp je spodletel pri gostitelju %s (%d)
sq: cp dështoj në host %s (%d)
sv: cp misslyckades på maskin %s (%d)
tr: %s makinesi (%d) üzerinde cp başarısız oldu

source: %s failed on host %s (maybe it does not have a good version of urpmi?) (exit code: %d)
ast: falló %s nel agospiador %s (¿igual nun tienes la versión correuta d'urpmi?) (códigu de salida: %d)
cs: %s selhalo na počítači %s (možná tam není správná verze urpmi?) (návratová hodnota: %d)
cy: methodd %s ar westai %s (efallai nad oes ganddo fersiwn da o urpmi?) (cod gadael: %d)
da: %s mislykkedes på vært %s (måske har den ikke en god version af urpmi?) (afslutningskode: %d)
el: απέτυχε το %s, στον υπολογιστή %s (μήπως δεν διαθέτει μια καλή έκδοση του urpmi;) (το αποτέλεσμα εξαγωγής του κώδικα: %d)
es: falló %s en el equipo %s (¿tal vez no tiene la versión correcta de urpmi?) (código de salida: %d)
et: %s nurjus masinas %s (võib-olla ei ole urpmi korraliku versiooniga?) (väljumiskood: %d)
eu: %s-k huts egin du %s ostalarian (agian ez dauka urpmi-ren bertsio egokia?) (irteera kodea: %d)
fi: %s epäonnistui kohteessa %s (ehkä urpmi:n versio on liian vanha) (lopetuskoodi %d)
fr: %s a échoué sur l'hôte %s (peut-être n'a-t-il pas la bonne version d'urpmi ?) (code de sortie : %d)
hu: %s hiba a %s gépen (lehet, hogy az urpmi nem jó verziója található a gépen?)(kilépési kód: %d)
is: %s mistókst á hnút %s (er hnútpunkturinn kannski með gallaða útgáfu af urpmi?) (villukóði: %d)
it: %s non riuscito sull'host %s (forse non ha una versione adatta di urpmi) (codice di uscita: %d)
nb: Feil ved %s på verten %s (den har kanskje ikke den rette versjonen av urpmi?). (Avsluttingskode: %d.)
nl: %s mislukt op hostcomputer %s (misschien heeft hij niet de juiste urpmi-versie?) (afsluitcode: %d)
nn: Feil ved %s på verten %s (kanskje har han ikkje rett versjon av urpmi?). (Avsluttingskode: %d.)
pl: %s nie zadziałał na komputerze %s (być może nie ma on odpowiedniej wersji urpmi?) (kod wyjściowy: %d)
pt: %s falhado na máquina %s (talvez não tenha uma versão urpmi correcta?) (código de saída: %d)
pt_br: %s falhou no host %s (talvez ele não tenha a versão ideal do urpmi?) (código de saida: %d)
ro: %s a eșuat la gazda %s (poate nu are versiunea corectă de urpmi?) (cod de eroare: %d)
ru: Сбой %s на хосте %s (возможно он имеет неверную версию urpmi?) (код выхода: %d)
sl: %s je spodletel pri gostitelju %s (mogoče nima prave različice urpmi?) (izhodna koda: %d)
sq: %s dështoj në host %s (ndoshta nuk ka një version të mirë të urpmi?) (kodi dalës: %d)
sv: %s misslyckades på maskin %s (kanske den inte har en korrekt version av urpmi?) (felkod %d)
tr: %s, %s makinesinde başarısız oldu. (belki urpmi' nin iyi bir sürümü değildir?) (çıkış kodu: %d)

source: unable to access medium "%s".
ast: nun puede accedese al mediu "%s".
ca: no s'ha pogut accedir al suport "%s".
cs: nelze přistoupit na zdroj "%s".
cy: methu cael mynediad at gyfrwng. "%s"
da: kunne ikke nå medie "%s".
el: αδυναμία πρόσβασης στο μέσο "%s".
es: no se puede acceder al soporte «%s».
et: ligipääs andmekandjale "%s" nurjus.
eu: ezin da "%s" euskarria atzitu.
fi: Mediaa "%s" ei voitu käyttää.
fr: impossible d'accéder au média « %s ».
gl: non foi posible acceder ó soporte "%s".
he: אין אפשרות לגשת למדיה "%s".
hu: a(z) "%s" adatforrás nem hozzáférhető
is: get ekki lesið miðil "%s".
it: impossibile accedere al supporto "%s".
nb: klarte ikke nå mediet «%s».
nl: kon medium "%s" niet benaderen.
nn: Klarte ikkje lesa mediet «%s».
pl: nie można uzyskać dostępu do nośnika "%s".
pt: não é possível aceder à média "%s".
pt_br: incapaz de acessar a mídia "%s".
ro: nu se poate accesa mediul „%s”
ru: нет доступа к источнику «%s».
sl: do vira »%s« ni mogoče dostopati.
sq: pamundur për të hyrë në medium "%s".
sv: kunde inte komma åt media "%s".
tr: "%s" ortamına erişilemiyor

source: mounting %s
ast: montando %s
ca: s'està muntant %s
cs: připojuji %s
cy: gosod %s
da: monterer %s
el: προσάρτηση του %s
es: montando %s
et: %s haakimine
eu: %s muntatzen
fi: Liitetään %s
fr: montage de %s
gl: montando %s
he: מחבר את %s
hu: %s csatolása
id: me-mount %s
is: tengi %s
it: sto montando %s
nb: monterer %s
nl: %s koppelen...
nn: Monterer «%s».
pl: montowanie %s
pt: a montar %s
pt_br: montando %s
ro: se montează %s
ru: монтируется %s
sl: priklapljanje %s
sq: montimi i %s
sv: monterar %s
tr: %s bağlanıyor

source: unmounting %s
ast: desmontando %s
ca: s'està desmuntant %s
cs: odpojuji %s
cy: dadosod %s
da: afmonterer %s
el: αποπροσάρτηση του %s
es: desmontando %s
et: %s lahutamine
eu: %s desmuntatzen
fi: Irrotetaan %s
fr: démontage de %s
gl: desmontando %s
he: מנתק את %s
hu: %s leválasztása
id: melepas mount %s
is: aftengi %s
it: sto smontando %s
nb: avmonterer %s
nl: %s afkoppelen...
nn: Avmonterer «%s».
pl: odmontowywanie %s
pt: a desmontar %s
pt_br: desmontando %s
ro: se demontează %s
ru: отмонтируется %s
sl: odklapljanje %s
sq: demontimi i %s
sv: avmonterar %s
tr: %s ayrılıyor

source: urpmi was restarted, and the list of priority packages did not change
ast: reaniciose urpmi, y la llista de paquetes prioritarios nun camudó
cs: urpmi bylo znovu spuštěno a seznam prioritních balíčků se nezměnil
cy: ail gychwynnwyd urpmi, ac nid yw'r rhestr prif pecynnau wedi newid
da: Installationsprogrammet urpmi blev startet igen, og listen over prioriterede pakker blev ikke ændret.
el: το urpmi επανανακινήθηκε, και η λίστα με τα πακέτα προτεραιότητας δεν έχει αλλάξει
es: se reinició urpmi, y la lista de paquetes prioritarios no cambió
et: urpmi käivitati uuesti ja prioriteetsete pakettide nimekirja ei muudetud
eu: urpmi berrabiatu egin da, eta lehentasuna duten paketeen zerrenda ez da aldatu
fi: Käynnistettiin urpmi uudelleen, eikä ensisijaisten pakettien lista muuttunut
fr: urpmi a été relancé et la liste des paquetages prioritaires est inchangée
gl: urpmi reiniciouse, e a lista de paquetes prioritarios non cambiou
he: urpmi אותחל ורשימת החבילות הדחופות לא השתנתה
hu: az Urpmi újra lett indítva; a prioritásos csomagok listája nem változott
is: urpmi var endurræst, og listi forgangspakka breyttist ekki
it: urpmi è stato riavviato, ma l'elenco dei pacchetti prioritari non è cambiato
nb: urpmi ble startet på nytt, og listen over prioriterte pakker er uendret
nl: urpmi is herstart en de prioriteitslijst van pakketten is niet gewijzigd
nn: Installasjonsprogrammet urpmi vart starta på nytt, og programprioriteringane vart ikkje endra.
pl: urpmi zostało uruchomione ponownie. Lista pakietów własnościowych nie uległa zmianie.
pt: o urpmi foi reiniciado, e a lista de pacotes prioritários não foi alterada
pt_br: o urpmi foi reiniciado, e a lista de pacotes prioritários não mudou
ro: urpmi a repornit, lista pachetelor prioritare nu s-a modificat
ru: urpmi был перезапущен; список приоритетов пакетов не изменился
sl: urpmi se je ponovno zagnal in seznam prednostnih paketov se ni spremenil
sq: urpmi u rifillua, dhe lista e paketave përparësi nuk u ndryshua
sv: urpmi startades om, och listan av prioriterade paket ändrades inte
tr: urpmi yeniden başlatıldı, önemli paketlerin listesi değişmedi

source: urpmi was restarted, and the list of priority packages did change: %s vs %s
ast: reaniciose urpmi, y la llista de paquetes prioritarios camudó: %s vs. %s
cs: urpmi bylo znovu spuštěno a seznam prioritních balíčků se změnil: %s vs %s
cy: ail gychwynnwyd urpmi, ac mae'r rhestr prif pecynnau wedi newid: %s vs %s
da: Installationsprogrammet urpmi blev startet igen, og listen over prioriterede pakker blev ændret: %s mod %s
el: το urpmi επανανακινήθηκε, και η λίστα με τα πακέτα προτεραιότητας έχει αλλάξει: %s vs %s
es: se reinició urpmi, y la lista de paquetes prioritarios cambió: %s vs. %s
et: urpmi käivitati uuesti ja muudeti prioriteetsete pakettide nimekirja: %s varasema %s asemel
eu: urpmi berrabiatu egin da, eta lehentasuna duten paketeen zerrenda aldatu egin da: %s vs %s
fi: Käynnistettiin urpmi uudelleen ja ensisijaisten pakettien lista muuttui: ennen %s, nyt %s
fr: urpmi a été relancé et la liste des paquetages prioritaires a changé : %s vs %s
gl: urpmi reiniciouse, e a lista de paquetes prioritarios cambiou: %s vs %s
he: urpmi אותחל ורשימת החבילות הדחופות השתנתה: %s לעומת %s
hu: az Urpmi újra lett indítva; a prioritásos csomagok listája változott: %s - %s
is: urpmi var endurræst, og listi forgangspakka breyttist: %s í stað %s
it: urpmi è stato riavviato. L'elenco dei pacchetti prioritari è cambiato da %s a %s
nb: urpmi ble startet på nytt, og listen over prioriterte pakker ble endret: %s mot %s
nl: urpmi is herstart en de prioriteitslijst van pakketten is gewijzigd: %s vs %s
nn: Installasjonsprogrammet urpmi vart starta på nytt, og programprioriteringane vart endra: %s mot %s
pl: urpmi zostało uruchomione ponownie. Lista preferowanych pakietów uległa zmianie: %s vs %s
pt: o urpmi foi reiniciado, e a lista de pacotes prioritários foi alterada: %s vs %s
pt_br: o urpmi foi reiniciado, e a lista de pacotes prioritários mudou: %s vs %s
ro: urpmi a repornit, lista pachetelor prioritare s-a modificat: %s contra %s
ru: urpmi был перезапущен; список приоритетов пакетов изменился: %s против %s
sl: urpmi se je ponovno zagnal in seznam prednostnih paketov se je spremenil: %s <-> %s
sv: urpmi startades om, och listan av prioriterade paket ändrades: %s mot %s
tr: urpmi yeniden başlatıldı ve önemli paketlerin listesi değişti: %s vs %s

source: No package named %s
ast: Dengún paquete nomáu %s
ca: No hi cap paquet anomenat %s
cs: Žádný balíček s názvem %s
cy: Dim pecyn o'r enw %s
da: Ingen pakke kaldet %s
el: Κανένα πακέτο με το όνομα %s
es: Ningún paquete llamado %s
et: Paketti nimega %s ei ole
eu: Ez dago %s izeneko paketerik
fi: Ei pakettia nimeltä %s
fr: Pas de paquetage nommé %s
gl: Non hai ningún paquete que se chame %s
he: לא נמצאה חבילה בשם %s
hu: Nincs ilyen nevű csomag: %s
id: Tidak ada paket bernama %s
is: Enginn pakki heitir %s
it: Nessun pacchetto denominato %s
nb: Ingen pakke med navn %s
nl: Geen pakket genaamd %s
nn: Det finst ingen «%s»-pakke.
pl: Brak pakietu o nazwie %s
pt: Nenhum pacote chamado %s
pt_br: Nenhum pacote de nome %s
ro: Nici un pachet numit %s
ru: Нет пакета с названием %s
sl: Ni paketa poimenovanega %s
sq: Asnjë pako e emruar %s
sv: Inget paket med namn %s
tr: %s adında bir paket yok

source: The following packages contain %s: %s
ast: Los siguientes paquetes caltienen %s: %s
ca: Els paquets següents contenen %s: %s
cs: Následující balíčky obsahují: %s: %s
cy: Mae pecynnau canlynol yn cynnwys %s: %s:
da: Følgende pakker indeholder %s: %s
el: Τα παρακάτω πακέτα περιέχουν %s: %s
es: Los siguientes paquetes contienen %s: %s
et: %s sisaldub järgmistes pakettides: %s
eu: Ondoko paketeek %s dute: %s
fi: Seuraavat paketit sisältävät %s: %s
fr: Les paquetages suivants contiennent %s : %s
gl: Os seguintes paquetes conteñen %s: %s
he: החבילות הבאות מכילות את %s: %s
hu: A következő csomagok tartalmazzák a(z) %s komponenst: %s
id: Paket berikut berisi %s: %s
is: Eftirfarandi pakkar innihalda %s: %s
it: I seguenti pacchetti contengono %s: %s
nb: Følgende pakker inneholder %s: %s
nl: De volgende pakketten bevatten %s: %s
nn: Desse pakkane inneheld «%s»: %s
pl: Następujące pakiety zawierają %s: %s
pt: Os seguintes pacotes contêm %s: %s
pt_br: Os seguintes pacotes contém %s: %s
ro: Următoarele pachete conțin %s: %s
ru: Следующие пакеты содержат %s: %s
sl: Naslednji paketi vsebujejo %s: %s
sq: Pakot e radhitura përmbajnë %s: %s
sv: Följande paket innehåller %s: %s
tr: Bu paketler %s içeriyor: %s

source: You should use "-a" to use all of them
ast: Deberíes usar "-a" pa usalos toos
ca: Heu de fer servir "-a" per a fer-los servir tots
cs: Chcete-li použít všechny, použijte volbu "-a"
cy: Dylech ddefnyddio "-a" i'w defnyddio i gyd
da: Du bør bruge "-a" for at bruge dem alle
el: Θα πρέπει να χρησιμοποιήσεις "-a" για την επιλογή όλων
es: Debería usar "-a" para utilizarlos a todos
et: Kõigi nende kasutamiseks tuleks anda "-a"
eu: "-a" erabili behar zenuke guztiak erabiltzeko
fi: Käytä valitsinta "-a" valitaksesi ne kaikki
fr: Vous pouvez utiliser « -a » pour les sélectionner tous
hu: Használja a "-a" kapcsolót minden kijelöléséhez
is: Til að nota þá alla, ættir þú ættir að nota "-a"
it: Dovresti aggiungere "-a" per usarli tutti
nb: Bruk «-a» for å bruke alle
nl: Gebruik "-a" om ze allemaal te gebruiken
nn: Legg til «-a» for å bruka alle.
pl: Użyj opcji "-a", aby wykorzystać wszystkie
pt: Deve usar a opção "-a" para escolher todos
pt_br: Você deve usar a opção "-a" para o urpmi usar todas
ro: Ar trebui să folosiți „-a” pentru a-i utiliza pe toți
ru: Чтобы выбрать все, используйте параметр «-a»
sl: Da izberete vse, uporabite »-a«
sq: Ju duhet të përdorni "-a" për të përdorur të gjithë ato
sv: Du borde använda "-a" för att använda alla av dem
tr: Tümünü kullanabilmek için "-a" kullanmalısınız

source: found package(s) %s in urpmi db, but none are installed
ast: atopáronse los paquetes %s na base de datos d'urpmi, pero dengún ta instaláu
cs: nalezeny balíčky %s v db urpmi, ale žádný není instalovaný
cy: wedi canfod pecyn(nau) %s yn urpmi db, ond heb eu gosod
da: fandt pakkerne %s i urpmi db, men ingen er installeret
el: τα πακέτα %s βρέθηκαν στην βάση δεδομένων του urpmi, αλλά κανένα τους δεν είναι εγκατεστημένο
es: se encontraron los paquetes %s en la base de datos de urpmi, pero ninguno está instalado
et: Urpmi andmebaasis leiti paketid %s, aga need ei ole paigaldatud
eu: %s paketea(k) aurkitu d(ir)a urpmi db-an, baino ez dago batere instalatuta
fi: Urpmi-tietokannasta löytyi paketit %s, mutta yhtään paketeista ei ole asennettuna
fr: paquetage(s) %s dans la base urpmi mais aucun n'est installé
hu: %s csomagot talált az urpmi db-ben, de ezek nem telepíthetőek
is: fann pakka %s í urpmi gagnagrunni, en enginn er uppsettur
it: trovati i pacchetti %s nel db di urpmi, ma nessuno è installato
nb: fant pakken(e) %s i urpmi-databasen, men ingen er installert
nl: pakket(ten) %s gevonden in urpmi-db, maar geen ervan is geïnstalleerd
nn: Fann pakke/pakkar %s i urpmi-databsen, men ingen av dei er installerte.
pl: odnaleziono pakiet(y) %s w bazie danych urpmi, ale żaden nie jest zainstalowany
pt: encontrado(s) %s pacote(s) na base de dados urpmi, mas nenhum se encontra instalado
pt_br: encontrado(s) o(s) pacote(s) %s na base urpmi, mas nenhum está instalado
ro: s-au găsit pachetele %s în urpmi db, dar nu sînt instalate
ru: в базе данных найдены пакеты %s, но ни один из ни не установлен
sl: v zbirki podatkov za urpmi so bili najdeni paketi %s, a ni noben nameščen
sv: Hittade paket(en) %s i urpmi db, men inget är installerat
tr: Urpmi veritabanında %s paket(ler)i bulundu, fakat hiçbiri kurulmamış

source: Package %s is already installed
ast: El paquete %s yá ta instaláu
ca: El paquet %s ja està instal·lat
cs: Balíček %s je již nainstalován
cy: Pecyn %s wedi ei osod eisoes
da: Pakke %s er allerede installeret
el: Το πακέτο %s είναι ήδη εγκατεστημένο
es: El paquete %s ya está instalado
et: Pakett %s on juba paigaldatud
eu: %s paketea dagoeneko instalatuta dago
fi: Paketti %s on jo asennettu
fr: Le paquetage %s est déjà installé
gl: O paquete %s xa está instalado
he: החבילה %s כבר מותקנת
hu: A(z) "%s" csomag már telepítve van
id: Paket %s telah terinstall
is: Pakki %s er nú þegar kominn inn
it: Il pacchetto %s è già installato
nb: Pakka %s er allerede installert
nl: Pakket %s is reeds geïnstalleerd
nn: Pakken «%s» er alt installert.
pl: Pakiet %s jest już zainstalowany w systemie
pt: O pacote %s já se encontra instalado
pt_br: Pacote %s já está instalado
ro: Pachetul %s este deja instalat
ru: Пакет %s уже установлен
sl: Paket %s je že nameščen
sv: Paket %s är redan installerat
tr: %s paketi kurulu
