Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: Installation failed, some files are missing: %s
ast: Falló la instalación, falten dellos ficheros: %s
ca: La instal·lació ha fallat, no s'han trobat alguns fitxers: %s
cs: Instalace selhala, chybí některé soubory: %s
cy: Methodd y gosod, mae rhai ffiliau ar goll: %s
da: Installation mislykkedes, der mangler nogen filer: %s
el: Η εγκατάσταση απέτυχε, λείπουν μερικά αρχεία : %s
es: Falló la instalación, algunos archivos están ausentes: %s
et: Paigaldamine nurjus, mõned failid on puudu: %s
eu: Instalaketak huts egin du, fitxategi batzuk falta dira: %s
fi: Asennus epäonnistui, joitakin tiedostoja puuttuu: %s
fr: L'installation a échoué, certains fichiers sont manquants : %s
hu: A telepítés nem sikerült, néhány fájl hiányzik: %s
is: Innsetning brást, sumar skrár vantar: %s
it: Installazione fallita, mancano alcuni file: %s
nb: Installasjon mislyktes, noen filer mangler: %s
nl: Installatie mislukt, sommige bestanden ontbreken: %s
nn: Feil ved installering. Nokre filer manglar: %s
pl: Instalacja nie powiodła się. Brak niektórych plików: %s
pt: Instalação falhada, faltam alguns ficheiros: %s
pt_br: A instalação falhou, alguns arquivos faltam: %s
ro: Instalare eșuată, lipsesc cîteva fișiere: %s
ru: Установка не удалась, отсутствуют некоторые файлы: %s
sl: Namestitev ni uspela, ker manjkajo nekatere datoteke: %s
sq: Instalimi dështoi, mungojnë disa kartela: %s
sv: Installationen misslyckades, vissa filer saknas: %s
tr: Kurulum başarısız oldu. Bazı dosyalar kayıp: %s

source: Installation failed:
ast: Falló la instalación:
ca: La instal·lació ha fallat:
cs: Instalace selhala:
cy: Methodd y gosod:
da: Installationen fejlede:
el: Η εγκατάσταση απέτυχε:
es: Falló la instalación:
et: Paigaldamine nurjus:
eu: Instalaketak huts egin du:
fi: Asennus epäonnistui:
fr: L'installation a échoué :
gl: A instalación fallou:
he: ההתקנה כשלה:
hu: A telepítés nem sikerült:
id: Instalasi gagal:
is: Innsetning brást:
it: Installazione fallita:
nb: Installasjon mislyktes:
nl: Installatie mislukt:
nn: Feil ved installering:
pl: Instalacja nie powiodła się:
pt: Instalação falhada:
pt_br: A Instalação falhou:
ro: Instalare eșuată:
ru: Установка не удалась:
sl: Namestitev ni uspela:
sq: Instalimi dështoi:
sv: Installationen misslyckades:
tr: Kurulum başarısız oldu

source: The package(s) are already installed
ast: El(los) paquete(s) ya tan instalaos
ca: Ja està tot instal·lat
cs: Balíčky jsou již nainstalovány
cy: Popeth wedi eu gosod eisoes
da: alting er allerede installeret
el: Το(α) πακέτο(α) είναι ήδη εγκατεστημένα
es: El(los) paquete(s) ya está(n) instalado(s)
et: Kõik on juba paigaldatud
eu: Dena dago instalatuta
fi: Paketit on jo asennettu
fr: Tous les paquetages sont déjà installés
gl: Xa está todo instalado
he: הכל כבר מותקן
hu: A csomag(ok) már telepítve van(nak)
id: Semua paket telah terinstal
is: Allt er nú þegar komið inn
it: È già tutto installato
nb: Pakken(e) er allerede installert
nl: De pakketten zijn reeds geïnstalleerd
nn: Alt er allereie installert.
pl: Wszystko zostało już zainstalowane
pt: O(s) pacote(s) já está(ão) instalado(s)
pt_br: Tudo já está instalado
ro: Totul este deja instalat
ru: Всё уже установлено
sl: Paket(-i) so že nameščeni
sq: Gjdo gjë është veçse e instaluar
sv: Allt är redan installerat
tr: Herşey zaten kurulu

source: Installation finished
ast: Finó la instalación
ca: Instal·lació finalitzada
cs: Instalace dokončena
cy: Cwblhawyd y gosod
da: Installationen færdig
el: Η εγκατάσταση τελείωσε
es: Finalizó la instalación
et: Paigaldus lõpetatud
eu: Instalazioa amaitu da
fi: Asennus on valmis
fr: L'installation est terminée
gl: Instalación rematada
he: ההתקנה הסתיימה
hu: A telepítés befejeződött
id: Instalasi selesai
is: Innsetningu lokið
it: Installazione completata
nb: Installasjon ferdig
nl: Installatie voltooid
nn: Installeringa er fullført
pl: Instalacja zakończona
pt: Instalação finalizada
pt_br: Instalação concluída
ro: Instalare terminată
ru: Установка завершена
sl: Namestitev je končana
sq: Instalimi përfundoi
sv: Installation slutförd
tr: Kurulum tamamlandı

source: removing %s
ast: desaniciando %s
ca: s'està eliminant %s
cs: odstraňuje se %s
cy: tynnu %s
da: fjerner %s
el: αφαίρεση του %s
es: quitando %s
et: %s eemaldamine
eu: %s kentzen
fi: Poistetaan %s
fr: désinstallation de %s
gl: eliminando %s
he: מסיר %s
hu: "%s" eltávolítása
id: menghapus %s
is: fjarlægi %s
it: rimozione di %s
nb: fjerner %s
nl: verwijderen van %s
nn: Fjernar «%s».
pl: usuwanie %s
pt: a remover %s
pt_br: removendo %s
ro: se înlătură %s
ru: удаляется %s
sl: odstranjevanje %s
sq: heqje %s
sv: tar bort %s
tr: %s kaldırılıyor

source: restarting urpmi
ast: reaniciando urpmi
ca: s'esta reiniciant urpmi
cs: restartuje se urpmi
cy: ailgychwyn urpmi
da: genstarter urpmi
el: Επανεκκίνηση urpmi
es: reiniciando urpmi
et: urpmi taaskäivitamine
eu: urpmi berrabiarazten
fi: Käynnistetään urpmi uudelleen
fr: redémarrage de urpmi
gl: reiniciando urpmi
he: מפעיל מחדש את urpmi
hu: az urpmi újraindítása
id: jalankan ulang urpmi
is: endurræsi urpmi
it: Riavvio di urpmi
nb: starter urpmi på nytt
nl: urpmi herstarten
nn: Startar urpmi på nytt.
pl: ponownie uruchamianie urpmi
pt: a reiniciar urpmi
pt_br: reiniciando urpmi
ro: se repornește urpmi
ru: urpmi перезапускается
sl: ponovno zaganjanje urpmi
sq: rifillimi urpmi
sv: startar om urpmi
tr: urpmi yeniden başlatılıyor.

source: usage: %s [options] where [options] are from
ast: usu: %s [opciones] onde [opciones] son dende
ca: sintaxi: %s [opcions] on [opcions] pot ser
cs: použití: %s [volby] kde [volby] jsou tyto
cy: usage: %s [dewisiadau] lle mae [dewisiadau] o
da: brug: %s [tilvalg] hvor [tilvalg] er fra
el: χρήση: %s [επιλογές] όπου [επιλογές] είναι από
es: uso: %s [opciones] donde [opciones] son
et: kasutamine: %s [võtmed] kus [võtmed] on
eu: erabilera: %s [aukerak] [aukerak] hemengoak dira
fi: Käyttö: %s [valitsimet], jossa [valitsimet] ovat:
fr: utilisation : %s [options] où les [options] sont parmi
gl: uso: %s [opcións] onde [opcións] son dende
he: שימוש: %s [options] כאשר [options] הם מתוך
hu: használat: %s [opciók] ahol [opciók] a következők lehetnek:
id: penggunaan: %s [opsi] dimana [opsi] dari
is: notkun: %s [valkostir] þar sem [valkostir] eru eftirfarandi
it: uso: %s [opzioni] dove le [opzioni] sono
nb: bruk: %s [valg] hvor [valg] er fra
nl: gebruik: %s [opties] waarbij [opties] komen uit de volgende
nn: Bruk: %s [val] der [val] er av:
pl: użycie: %s [opcje] gdzie [opcjami] mogą być
pt: uso: %s [opções] onde as [opções] são
pt_br: uso: %s [opções] onde [opções] podem ser
ro: utilizare: %s [opțiuni] unde [opțiunile] sînt de forma
ru: использование: %s [параметры] где [параметры] являются одними из
sl: uporaba: %s [možnosti], kjer so [možnosti] med
sq: përdorim: %s [opcionet] dhe [opcionet] janë nga
sv: användning: %s [flaggor] där [flaggor] är från
tr: kullanımı: %s [seçenekler] ve [seçenekler] de şunlardan biridir

source: -h|--help - print this help message.
ast: -h|--help - imprenta esti mensax d'aida.
ca: -h|--help - mostra aquest missatge d'ajuda.
cs: -h|--help - zobrazí tuto nápovědu
cy: -h|--help - argraffu neges cymorth.
da: -h|--help - udskriv denne hjælpebesked.
el: -h|--help - εμφανίζει αυτο το μήνυμα βοήθειας.
es: -h|--help - imprime este mensaje de ayuda.
et: -h|--help - näitab seda abiteadet.
eu: -h|--help - laguntza-mezu hau inprimatzen du.
fi: -h|--help - tulosta tämä viesti.
fr: -h|--help - afficher ce message d'aide.
gl: -h|--help - amosa esta mensaxe de axuda.
he: -h|--help - הצגת הודעת עזרה זו.
hu: -h|--help - jelen segítség megjelenítése
id: -h|--help - cetak pesan bantuan ini.
is: -h|--help - prenta þetta.
it: -h|--help - stampa questo messaggio di aiuto.
nb: -h|--help – vis denne hjelpeteksten.
nl: -h|--help - geeft deze hulptekst.
nn: -h|--help – Vis denne hjelpeteksten.
pl: -h|--help - wyświetla ten komunikat pomocy.
pt: -h|--help - mostra esta mensagem de ajuda.
pt_br: -h|--help - imprime esta mensagem de ajuda.
ro: -h|--help - afișează acest mesaj de ajutor.
ru: -h|--help - показать эту справку
sl: -h|--help - prikaže to sporočilo s pomočjo.
sq: -h|--help - shtype këtë lajmë ndihmues.
sv: -h|--help - visar det här hjälpmeddelandet.
tr: -h|--help - bu yardım mesajını görüntüler.

source: --root <path> - use the given root instead of /
ast: --root <camín> - usar el camín dáu como raigañu, en llugar de «/»
ca: --root <ruta> - utilitza la ruta donada en comptes de /
cs: --root <cesta> - použije zadaný kořenový adresář místo /
cy: --root <path> - defnyddio'r root hwn yn lle /
da: --root <sti> - brug den angivne sti som root i stedet for /
el: --root <path> - χρήση της root διαδρομής που δόθηκε αντί για την /
es: --root <camino> - usar la ruta dado como raíz, en vez de «/»
et: --root <asukoht> - asukoha / asemel kasutatakse määratud juurkataloogi.
eu: --root <bidea> - erabili emaniko erroa "/" ordez
fi: --root <polku> - käytä annettua juurta oletuksen / sijaan.
fr: --root <chemin> - utiliser l'emplacement spécifié comme racine à la place de « / »
gl: --root <ruta> - usar a ruta dada no canto de /
he: --root <path> - השתמש בשורש המוגדר במקום /
hu: --root <hely> - a megadott útvonal használata gyökérkönyvtárnak a / helyett
id: --root <lokasi> - gunakan root yang diberikan /
is: --root <path> - nota uppgefna rót í stað /
it: --root <percorso> - utilizza la directory root specificata invece di /
nb: --root <sti> – bruk den angitte rota i stedet for /
nl: --root <path> - opgegeven hoofdmap (root) gebruiken in plaats van /
nn: --root <path> – Bruk denne rota i staden for «/».
pl: --root <ścieżka> - używa podanego katalogu głównego zamiast /
pt: --root <localização> - usa a raíz dada em vez de /
pt_br: --root <path> - usar o root informado em vez de /
ro: --root <path> - utilizează administratorul dat în loc de /
ru: --root <путь> - использовать данный корень вместо /
sl: --root <path> - uporabi podano korensko mapo namesto /
sq: --root <path> - përdorni root e dhënë në vend të /
sv: --root <path> - använd angivet rootbibliotek istället för /
tr: --root <yol> - yerine, verilen kökü kullan/

source: -g [group] - restrict results to specified group.
ast: -g [grupu] - restrinxe los resultaos al grupu dáu.
ca: -g [group] - restringeix els resultats al grup donat.
cs: -g [group] - omezí výsledky na danou skupinu
cy: -g [group] - cyfyngu canlyniadau i'r grŵp.
da: -g [group} - begræns resultater til denne gruppe.
el: -g [group] - περιορισμένα αποτελέσματα στην ομάδα που δόθηκε.
es: -g [grupo] - restringe los resultados al grupo dado.
et: -g [grupp] - piirab tulemused määratud grupiga.
eu: -g [taldea] - emaitzak talde jakin batera murrizten ditu.
fi: -g [group] - rajoita tulokset annettuun ryhmään.
fr: -g [groupe] - restreindre les résultats au groupe spécifié.
gl: -g [grupo] - restrinxe os resultados a un grupo dado.
he: -g [group] - הגבלת התוצאות לקבוצה (group) מסויימת.
hu: -g [csoport] - eredmények korlátozása az adott csoportra
id: -g [grup] - batasi hasil ke grup yang ditentukan.
is: -g [group] - takmarka niðurstöður við ákveðinn hóp.
it: -g [gruppo] - restringe i risultati ad un determinato gruppo.
nb: -g [group] – begrens søket til angitt gruppe.
nl: -g [groep] - bepertkt resultaten tot gegeven groep.
nn: -g[roup] – Avgrens søket til denne gruppa.
pl: -g [group] - ogranicza wyniki do zadanej grupy.
pt: -g [grupo] - resultados restritos ao grupo indicado.
pt_br: -g [group] - restringe os resultados ao grupo.
ro: -g [grup] - restricționează rezultatele la grupul dat.
ru: -g [группа] - ограничить результаты до указанной группы
sl: -g [group] - omeji rezultate na podano skupino.
sq: -g [group] - kufizoni rezultatet në një grup të caktuar.
sv: -g [group] - begränsa resultat till aktuell grupp.
tr: -g [group] - belirtilen grup için sonuçları sınırla.

source: defaults to %s.
ast: lo predeterminao ye %s.
ca: el valor per defecte és %s.
cs: výchozí je %s
cy: rhagosodedig yw %s.
da: standard er %s.
el: προκαθορισμένο είναι το %s.
es: lo predeterminado es %s.
et: vaikimisi on %s.
eu: lehenetsia %s da.
fi: - oletus on %s.
fr: valeur par défaut %s.
gl: por defecto é %s.
he: ברירת המחדל היא %s.
hu: alapértelmezés: %s
id: default pada %s.
is: sjálfgefið er %s.
it: predefinito: %s.
nb: standardverdi: %s.
nl: standaard is %s.
nn: Standardverdi: %s.
pl: domyślną wartością jest %s.
pt: predefinir para %s.
pt_br: por padrão é %s.
ro: implicit este %s
ru: по умолчанию %s
sl: privzeto je %s.
sq: parazgjedhur në %s.
sv: standard är %s.
tr: %s için varsayılan.

source: -f - output rpm full name (NVRA)
ast: -f - amosar nome completu de rpm (NVRA)
cs: -f - vypíše plný název RPM balíčku (NVRA)
cy: -f - allbynnu enw llawn rpm (NVRA)
da: -f - Vis fuldt rpm-navn (NVRA).
el: -f - εμφανίζει το πλήρες όνομα του πακέτου (NVRA)
es: -f - mostrar nombre completo de rpm (NVRA)
et: -f - näitab RPM-i täielikku nime (NVRA).
eu: -f - irteeran jarri rpm izen osoa (NVRA)
fi: -f - tulosta koko nimi (NVRA).
fr: -f - afficher le nom complet du paquetage (NVRA)
gl: -f - nome completo do rpm de saída (NVRA)
he: -f - הצג שם מלא של ה-RPM (NVRA).
hu: -f - az RPM-csomag teljes nevének kiírása (NVRA)
id: -f - tampilkan nama lengkap RPM (NVRA)
is: -f - prenta fullt nafn rpm (NVRA).
it: -f - mostra il nome completo del pacchetto (NVRA)
nb: -f – vis fullt rpm-navn (NVRA).
nl: -f - volledige rpm-naam tonen (NVRA).
nn: -f – Vis fullt rpm-namn (NVRA).
pl: -f - wyświetla pełną nazwę pakietu rpm (NVRA).
pt: -f - mostra o nome completo do rpm (NVRA)
pt_br: -f - imprime nome completo do rpm (NVRA).
ro: -f - afișează numele complet al pachetului (NVRA)
ru: -f - показать полное название rpm (NVRA)
sl: -f - izpis polnega imena paketa rpm (NVRA)
sq: -f - output rpm emër të plotë (NVRA)
sv: -f - visa hela rpm namnet (NVRA).
tr: -f - rpm'in tam adı çıktısı (NVRA)

source: Only superuser is allowed to install packages
ast: Sólo'l superusuariu ta autorizáu a instalar paquetes
ca: El superusuari és l'únic autoritzat per a instal·lar paquets
cs: Instalovat balíčky může pouze uživatel root
cy: Dim ond uwch ddefnyddiwr sy'n cael gosod pecynnau
da: Kun superbrugeren har lov til at installere pakker
el: Μόνο ο διαχειριστής επιτρέπεται να εγκαταστήσει πακέτα
es: Sólo el superusuario está autorizado a instalar paquetes
et: Pakette võib paigaldada ainult administraator
eu: Supererabiltzaileak bakarrik du paketeak instalatzeko baimena
fi: Vain pääkäyttäjä voi asentaa paketteja
fr: Seul l'administrateur système (root) peut installer des paquetages
gl: Só o superusuario pode instalar paquetes
he: רק מנהל מערכת מורשה להתקין חבילות
hu: Csomagok telepítéséhez rendszergazdai jogosultság szükséges
id: Hanya superuser yang boleh meng-instal paket
is: Aðeins kerfisstjóri hefur leyfi til að setja inn pakka
it: Solo superuser può installare pacchetti
nb: Bare superbrukeren kan installere pakker
nl: Alleen de beheerder mag pakketten installeren
nn: Berre superbrukaren kan installera pakkar.
pl: Tylko administrator ma prawo instalować pakiety
pt: Apenas o administrador pode instalar pacotes
pt_br: Apenas o superusuário tem permissão para instalar programas
ro: Doar administratorul poate instala pachete
ru: Только суперпользователю разрешается устанавливать пакеты
sl: Samo naduporabnik lahko namešča pakete
sq: Vetëm administratori i sistemin ka mundësi të instalojë pakot
sv: Endast systemadministratörer får installera paket
tr: Paketleri kurmak için sadece sistem yöneticisi yetkilidir

source: Running urpmi in restricted mode...
ast: Llanzando urpmi en mou restrinxíu...
ca: S'està executant urpmi en mode restringit...
cs: Spouštím urpmi v omezeném režimu...
cy: Rhedeg urpmi mewn modd cyfyngedig...
da: Kører urpmi i begrænset tilstand...
el: Εκτέλεση του urpmi σε περιορισμένη λειτουργία...
es: Lanzando urpmi en modo restringido...
et: Urpmi käivitamine piiratud režiimis...
eu: urpmi modu murriztuan exekutatzen...
fi: Suoritetaan urpmi rajoitetussa tilassa...
fr: Exécution d'urpmi en mode restreint...
gl: Executando urpmi en modo restrinxido...
he: הפעלת urpmi באופן עבודה מוגבל...
hu: Az Urpmi indítása korlátozott módban...
id: Menjalankan urpmi dalam mode terbatas...
is: Keyri urpmi í vernduðum ham...
it: Eseguo urpmi in modalità "restricted"...
nb: Kjører urpmi i begrenset modus …
nl: Urpmi uitvoeren in beperkte modus...
nn: Køyrer urpmi i avgrensa modus ...
pl: Uruchamianie urpmi w trybie restrykcyjnym...
pt: A correr o urpmi em modo restrito...
pt_br: Executando o urpmi no modo restrito...
ro: Se rulează urpmi în mod restricționat...
ru: Запуск urpmi в ограниченном режиме...
sl: Poganjanje urpmi v omejenem načinu …
sq: Lësho urpmi në mënyrë të kufizuar...
sv: Kör urpmi i begränsat läge
tr: Urpmi kısıtlı kipte çalışıyor...

source: While some packages may have been installed, there were failures.
ast: Entrín dalgunos paquetes pudieron instalase, hebo fallos.
el: Μερικά πακέτα εγκαταστάθηκαν, αλλά κάποια απέτυχαν.
es: Si bien algunos paquetes podrían haber sido instalados, hubo problemas.
et: Mõned paketid küll paigaldati, aga esines ka vigu.
fr: Certains paquets ont été installés mais d'autres ont échoué.
it: Nonostante qualche pacchetto sia stato installato, si sono verificati dei malfunzionamenti.
nl: Alhoewel sommige pakketten mogelijk geïnstalleerd zijn, hebben er zich ook foutmeldingen voorgedaan.
pt: Enquanto alguns pacotes podem ter sido instalados, houve algumas falhas.
pt_br: Houve falhas enquanto instalava alguns pacotes.
ro: Unele pachete au fost instalate, însă altele au eșuat.
ru: Хоть часть пакетов и могла быть установлена, произошли ошибки.
sl: Nekateri paketi so se mogoče lahko uspešno namestili, a nekaj jih je gotovo spodletelo.
sq: Ndërsa disa paketa mund të jenë instaluar, ka pasur dështime.

source: fail to create directory %s
ast: nun pudó criase'l direutoriu %s
ca: error en crear el directori %s
cs: selhalo vytvoření adresáře %s
cy: methu creu cyfeiriadur %s
da: Kunne ikke oprette katalog %s
el: αδυναμία δημιουργίας του καταλόγου %s
es: no se puede crear el directorio %s
et: kataloogi %s loomine nurjus
eu: %s direktorioa sortzeak huts egin du
fi: Hakemiston %s luonti epäonnistui
fr: échec de création du répertoire %s
gl: fallo ó crear o directorio %s
he: יצירת הספרייה %s נכשלה
hu: nem sikerült a %s könyvtár létrehozása
is: get ekki búið til möppu %s
it: Impossibile creare la directory %s
nb: klarte ikke å opprette %s
nl: aanmaken van map %s mislukt
nn: Klarte ikkje oppretta mappa %s.
pl: utworzenie katalogu %s było niemożliwe
pt: falha ao criar o directório %s
pt_br: falha ao criar diretório %s
ro: nu se poate crea directorul %s
ru: не удалось создать каталог %s
sl: Ustvarjanje mape %s je spodletelo
sq: dështojnë për të krijuar kartelën %s
sv: kan inte skapa katalog %s
tr: %s oluşturulamıyor.

source: invalid owner for directory %s
ast: dueñu nun válidu pal direutoriu %s
ca: propietari invàlid per al directori %s
cs: neplatný vlastník adresáře %s
cy: perchennog annilys cyfeiriadur %s
da: Ugyldig ejer for katalog %s
el: άκυρος ιδιοκτήτης του καταλόγου %s
es: dueño incorrecto del directorio %s
et: kataloogi %s vale omanik
eu: %s direktorioarentzako jabe baliogabea
fi: Hakemiston %s omistaja on virheellinen
fr: propriétaire invalide pour le répertoire %s
gl: dono incorrecto para o directorio %s
hu: érvénytelen tulajdonosa van a %s könyvtárnak
is: ógildur eigandi möppu %s
it: proprietario errato per la directory %s
nb: feil eier av mappe %s
nl: ongeldige eigenaar van map %s
nn: Ugyldig eigar for mappa %s.
pl: nieprawidłowy właściciel katalogu %s
pt: dono inválido para o directório %s
pt_br: dono inválido para diretório %s
ro: proprietar invalid pentru directorul %s
ru: недопустимый владелец каталога %s
sl: Neveljaven lastnik mape %s
sq: pronari i pavlefshëm për kartelën %s
sv: felaktig ägare för katalog %s
tr: %s dizininin sahipliği geçersiz.

source: Can not download packages into %s
ast: Nun pueden baxase los paquetes en %s
ca: No ha estat possible descarregar paquets a %s
cs: Nelze stáhnout balíčky do %s
cy: Methu llwytho pecynnau i lawr i %s
da: Kan ikke hente pakker til %s
el: Αδυναμία λήψης του πακέτου, στο %s
es: No se pueden descargar los paquetes en %s
et: %s pakettide allalaadimine nurjus
eu: Paketeak ezin dira %s-ra jaitsi
fi: Paketteja ei voida ladata hakemistoon %s
fr: Impossible de télécharger dans %s
hu: Nem sikerült letölteni a csomagot a %s tükörről
is: Get ekki sótt pakka í möppu %s
it: Impossibile recuperare i pacchetti in %s
nb: Kan ikke laste ned pakkene til %s
nl: kan pakketten niet naar %s downloaden
nn: Klarte ikkje lasta ned pakkar til %s
pl: Pobranie pakietów do %s było niemożliwe
pt: Não é possível transferir os pacotes para %s
pt_br: Não foi possível fazer o download dos programas em %s
ro: Nu se pot descărca pachetele în %s
ru: Не удаётся загрузить пакеты в %s
sl: V mapo %s ni mogoče prenašati paketov
sq: Nuk mund të shkarkoni paketa në %s
sv: Kan inte ladda ner paket till [%s]
tr: Paketler %s içine indirilemiyor

source: Environment directory %s does not exist
ast: El direutoriu d'entornu %s nun esiste
ca: El directori d'entorn %s no existeix
cs: Adresář prostředí %s neexistuje
cy: Nid yw cyfeiriadur amgylchedd %s yn bodoli
da: Miljøkatalog %s eksisterer ikke
el: Ο κατάλογος του περιβάλλοντος %s δεν υπάρχει
es: El directorio de entorno %s no existe
et: Keskkonna kataloogi %s ei ole olemas
eu: %s ingurune direktorioa ez da existitzen
fi: Ympäristökansiota %s ei ole olemassa
fr: Le répertoire d'environnement %s n'existe pas
gl: O directorio de ambiente %s non existe
hu: "%s" környezeti könyvtár nem létezik
id: Direktori lingkungan %s tidak ada
is: Umhverfismappa %s er ekki til
it: La directory %s, specificata nelle variabili d'ambiente, non esiste
nb: Miljømappen %s finnes ikke
nl: Omgevingsmap %s bestaat niet
nn: Miljømappa «%s» finst ikkje.
pl: Katalog %s nie istnieje
pt: O directório de ambiente %s não existe
pt_br: Diretório de ambiente %s não existe
ro: Directorul %s nu există
ru: Каталог окружения %s не существует
sl: Mapa %s ne obstaja
sq: Mjedisi kartelës %s nuk ekziston
sv: Omgivning sökväg %s existerar inte
tr: Ortam değişkenleri dizini %s mevcut değil.

source: using specific environment on %s
ast: usando un entornu específicu en %s
cs: používá se specifické prostředí na %s
cy: ddefnyddio amgylchedd penodol ar %s
da: bruger særligt miljø på %s
el: χρήση συγκεκριμένου περιβάλλοντος στο %s
es: usando un entorno específico en %s
et: spetsiifilise keskkonna kasutamine %s puhul
eu: %s(e)n ingurune espezifikoa erabiliz
fi: Käytetään määrättyä ympäristöä kohteelle %s
fr: avec environnement spécifique sur %s
gl: usando ambiente específico en %s
he: שימוש בסביבה מסוימת על %s
hu: a következő környezet használata: %s
id: mengunakan lingkungan spesifik pada %s
is: nota tilgreint umhverfi á %s
it: uso le variabili d'ambiente su %s
nb: Bruker selvvalgt miljø på %s
nl: maakt gebruik van aangegeven omgeving op %s
nn: Brukar tilpassa miljø på «%s»
pl: używając określonego środowiska na %s
pt: a usar um ambiente específico em %s
pt_br: usando o ambiente específico em %s
ro: utilizînd mediul specific pe %s
ru: используется специфическое окружение для %s
sl: uporabljam specifično okolje pri %s
sq: përdorim specifik i mjedisit në %s
sv: använder specifik miljö på %s
tr: %s' de belirtilen ortam kullanılıyor
