Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: Some requested packages cannot be installed: %s
ast: Nun pueden instalase dellos paquetes pedíos: %s
ca: Alguns dels paquets demanats no es poden instal·lar: %s
cs: Některé požadované balíčky nebylo možné nainstalovat: %s
cy: Nid oes modd gosod rhai pecynnau gofynnwyd amdanynt: %s
da: Nogen forespurgte pakker kan ikke installeres: %s
el: Ορισμένα πακέτα που ζητήθηκαν δεν μπορούν να εγκατασταθούν: %s
es: No se puede instalar algunos paquetes pedidos: %s
et: Mõnda soovitud paketti ei õnnestu paigaldada: %s
eu: Eskatutako pakete bat ezin da instalatu: %s
fi: Joitakin haluttuja paketteja ei voida asentaa: %s
fr: Certains paquetages demandés ne peuvent pas être installés : %s
gl: Algún dos paquetes solicitados non se puido instalar: %s
he: לא יכול להתקין כמה חבילות מבוקשות: %s
hu: A kért csomagok közül néhányat nem lehet telepíteni: %s
id: Beberapa paket yang diminta tidak dapat diinstall: %s
is: Ekki er hægt að setja inn suma umbeðna pakka: %s
it: Alcuni dei pacchetti richiesti non possono essere installati: %s
nb: Noen av de forespurte pakkene kan ikke installeres: %s
nl: Enkele gevraagde pakketten kunnen niet worden geïnstalleerd: %s
nn: Nokre av pakkane kan ikkje installerast: %s
pl: Niektóre z wybranych pakietów nie mogą zostać zainstalowane: %s
pt: Alguns pacotes pedidos não podem ser instalados: %s
pt_br: Alguns pacotes não puderam ser instalados: %s
ro: Cîteva pachete cerute nu pot fi instalate: %s
ru: Не удаётся установить некоторые из запрошенных пакетов: %s
sl: Nekaterih zahtevanih paketov ni mogoče namestiti: %s
sq: Disa nga pakot e kërkuara nuk mund të instalohen: %s
sv: Vissa begärda paket kan inte installeras: %s
tr: İstenen bazı paketler kurulamaz: %s

source: Some requested packages cannot be installed: %s Continue installation anyway?
ast: Nun puen instalase dellos de los paquetes solicitaos: %s ¿Siguir la instalación de toes toes?
ca: Alguns dels paquets demanats no s'han pogut instal·lar: %s Voleu continuar igualment?
cs: Některé požadované balíčky není možné nainstalovat: %s Pokračovat i přesto v instalaci?
cy: Nid oes modd gosod rhai pecynnau gofynnwyd amdanynt: %s Parhau beth bynnag?
da: Nogen forespurgte pakker kan ikke installeres: %s Skal installationen fortsættes alligevel?
el: Ορισμένα από τα πακέτα που ζητήθηκαν δεν μπορούν να εγκατασταθούν: %s Συνέχιση της εγκατάστασης ;
es: No se puede instalar algunos de los paquetes pedidos: %s ¿Continuar a de todos modos?
et: Mõnda soovitud paketti ei õnnestunud paigaldada: %s Kas siiski jätkata paigaldamist?
eu: Eskatutako pakete batzuk ezin dira instalatu: %s Instalazioarekin jarraitu hala ere?
fi: Joitakin haluttuja paketteja ei voida asentaa: %s Jatka muiden pakettien asentamista?
fr: Certains paquetages demandés ne peuvent pas être installés : %s Continuer quand même l'installation ?
gl: Non se puido instalar algún dos paquetes solicitados: %s Desexa continua-la instalación de tódolos xeitos?
he: חלק מהחבילות המבוקשות לא ניתנות להתקנה: %s האם להמשיך בכל זאת?
hu: A kért csomagok közül néhányat nem lehet telepíteni: %s Kívánja folytatni a telepítést?
id: Beberapa paket yang diminta tidak bisa di install: %s Lanjutkan installasi?
is: Ekki er hægt að setja inn suma umbeðna pakka: %s Halda samt áfram með uppsetningu?
it: Alcuni dei pacchetti richiesti non possono essere installati: %s Continuare comunque?
nb: Noen av de forespurte pakkene kan ikke installeres: %s Fortsette installasjonen?
nl: Bepaalde gevraagde pakketten kunnen niet worden geïnstalleerd: %s Toch verdergaan met installatie?
nn: Nokre av pakkane kan ikkje installerast: %s Vil du likevel halda fram?
pl: Niektóre z wybranych pakietów nie mogą zostać zainstalowane: %s Czy kontynuować mimo to?
pt: Alguns pacotes pedidos não podem ser instalados: %s Deseja continuar a instalação?
pt_br: Alguns programas requeridos não puderam ser instalados: %s Prosseguir com a instalação mesmo assim?
ro: Cîteva din pachete cerute nu pot fi instalate: %s Continuați totuși instalarea?
ru: Некоторые запрошенные пакеты не могут быть установлены: %s Продолжить установку?
sl: Nekaterih paketov ni mogoče namestiti: %s Ali naj se namestitev vseeno nadaljuje?
sq: Disa nga paketat e kërkuara nuk mund të instalohen: %s Vazhdo instalimin gjithsesi?
sv: Vissa begärda paket kan inte installeras: %s Vill du fortsätta ändå?
tr: İstenen bazı paketler kurulamıyor: %s Yine de kuruluma devam edilsin mi?

source: Warning
ast: Avisu
ca: Advertència
cs: Varování
cy: Rhybudd
da: Advarsel
el: Προσοχή
es: Advertencia
et: Hoiatus
eu: Kontuz
fi: Varoitus
fr: Attention
gl: Advertencia
he: אזהרה
hu: Figyelmeztetés
id: Peringatan
is: Aðvörun
it: Attenzione
nb: Advarsel
nl: Waarschuwing
nn: Åtvaring
pl: Ostrzeżenie
pt: Aviso
pt_br: Aviso
ro: Avertisment
ru: Внимание
sl: Opozorilo
sq: Kujdes
sv: Varning
tr: Uyarı

source: (to upgrade)
ast: (p'anovar)
ca: (a actualitzar)
cs: (k aktualizaci)
cy: (uwchraddio)
da: (skal opgraderes)
el: (προς αναβάθμιση)
es: (para actualizar)
et: (uuendus)
eu: (Eguneratu)
fi: (päivitettävä)
fr: (à mettre à jour)
gl: (para actualizar)
he: (לשדרג)
hu: (frissítés)
id: (untuk upgrade)
is: (til að uppfæra)
it: (da aggiornare)
nb: (å oppgradere)
nl: (op te waarderen)
nn: (oppgradering)
pl: (do aktualizacji)
pt: (para actualizar)
pt_br: (para atualizar)
ro: (pentru actualizare majoră)
ru: (обновить)
sl: (za nadgradnjo)
sq: (për të përmirësuar)
sv: (för att uppdatera)
tr: (güncellenecek)

source: (to install)
ast: (pa instalar)
ca: (a instal·lar)
cs: (k instalaci)
cy: (gosod)
da: (skal installeres)
el: (προς εγκατάσταση)
es: (para instalar)
et: (paigaldus)
eu: (instalatu)
fi: (asennettava)
fr: (à installer)
gl: (para instalar)
he: (להתקין)
hu: (telepítés)
id: (untuk menginstal)
is: (til að setja inn)
it: (da installare)
nb: (å installere)
nl: (te installeren)
nn: (installering)
pl: (do zainstalowania)
pt: (para instalar)
pt_br: (para instalar)
ro: (pentru instalare)
ru: (установить)
sl: (za namestitev)
sq: (për të instaluar)
sv: (för att installera)
tr: (yüklenecek)

source: Package choice
ast: Escoyeta de paquetes
ca: Elecció de paquets
cs: Výběr balíčků
cy: Dewis pecyn
da: Pakkevalg
el: Επιλογή πακέτων
es: Elección de paquetes
et: Paketivalik
eu: Paketa aukera
fi: Pakettivalinta
fr: Choix d'un paquetage
gl: Selección de paquetes
he: בחירת חבילות
hu: Csomagválasztás
id: Pilihan paket
is: Pakkaval
it: Scelta dei pacchetti
nb: Pakkevalg
nl: Pakketkeuze
nn: Pakkeval
pl: Wybór pakietów
pt: Escolha de pacotes
pt_br: Escolha de Programas
ro: Alegerea pachetor
ru: Выбор пакета
sl: Izbira paketov
sq: Zgjedhje pakete
sv: Val av paket
tr: Paket seçimi

source: One of the following packages is needed:
ast: Un de los paquetes siguientes ye necesariu:
ca: Cal un dels paquets següents:
cs: Je zapotřebí jeden z následujících balíčků:
cy: Mae angen un o'r pecynnau canlynol:
da: Der er brug for en af de følgende pakker:
el: Ένα εκ των παρακάτω πακέτων απαιτείται:
es: Uno de los paquetes siguientes es necesario:
et: Vajalik on üks järgnevatest pakettidest:
eu: Ondoko paketeetako bat behar da:
fi: Jokin seuraavista paketeista tarvitaan:
fr: Un des paquetages suivants est nécessaire :
gl: Necesítase un dos seguintes paquetes:
he: אחת החבילות הבאות נדרשת:
hu: A következő csomagok valamelyikére szükség van:
id: Salah satu paket berikut dibutuhkan:
is: Krefst einnig eins af af eftirtöldum pökkum:
it: È richiesto uno dei seguenti pacchetti:
nb: En av de følgende pakkene er nødvendige:
nl: Eén van de volgende pakketten is benodigd:
nn: Du treng éin av desse pakkane:
pl: Wymagany jest jeden z następujących pakietów:
pt: É necessário um dos seguintes pacotes:
pt_br: Um seguintes programas é necessário:
ro: Unul din următoarele pachete este necesar:
ru: Нужен один из следующих пакетов:
sl: Potreben je eden od naslednjih paketov:
sq: Një nga pakot e radhitura nevojitet:
sv: Ett av följande paket är nödvändigt:
tr: Aşağıdaki paketlerden birine ihtiyaç var:

source: _Abort
ast: _Albortar
ca: _Avorta
cs: _Přerušit
cy: _Atal
da: _Afbryd
el: _Ματαίωση
es: _Abortar
et: _Katkesta
eu: _Geldiarazi
fi: _Hylkää
fr: _Abandonner
gl: _Abortar
he: _בטל
hu: _Megszakítás
id: _Batal
is: _Hætta við
it: _Interrompi
nb: _Avbryt
nl: _Afbreken
nn: _Avbryt
pl: _Przerwij
pt: _Abortar
pt_br: _Abortar
ro: _Abandonează
ru: _Прервать
sl: _Prekini
sq: _Ndërpre
sv: _Avbryt
tr: D_urdur

source: The following packages have to be removed for others to be upgraded: %s Continue installation anyway?
ast: Desaniciaránse los siguietnes paquetes pa poder anovar otros: %s ¿Siguir de toes maneres?
ca: Els paquets següents s'han d'eliminar per poder actualitzar uns altres: %s Voleu continuar igualment?
cs: Následující balíčky musí být odstraněny, aby bylo možné jiné aktualizovat: %s Pokračovat i přesto v instalaci?
cy: Rhaid i'r pecynnau canlynol gael eu tynnu i eraill gael eu diweddaru. %s Parhau beth bynnag?
da: De følgende pakker skal fjernes for at andre kan opgraderes: %s Skal installationen fortsættes alligevel?
el: Τα παρακάτω πακέτα πρέπει να αφαιρεθούν για να αναβαθμιστούν κάποια άλλα: %s Συνέχεια εγκατάστασης;
es: Se tienen que quitar los siguientes paquetes para poder actualizar otros: %s ¿Continuar de todas maneras?
et: Teiste uuendamiseks tuleb eemaldada järgmised paketid: %s Kas siiski jätkata paigaldamist?
eu: Ondoko paketeak ezabatu egin behar dira besteak berritu ahal izateko: %s Instalazioarekin jarraitu hala ere?
fi: Seuraavat paketit on poistettava, jotta toiset voidaan päivittää: %s Jatka asennusta?
fr: Pour permettre la mise à jour, les paquetages suivants doivent être désinstallés : %s Continuer quand même l'installation ?
gl: Teñen que eliminarse os seguintes paquetes para poder actualizar outros: %s Desexa continuar a instalación de tódolos xeitos?
he: החבילות הבאות יוסרו כדי שניתן יהיה לשדרג חבילות אחרות: %s האם להמשיך בכל זאת?
hu: A következő csomagokat el kell távolítani, hogy más csomagok frissíthetők legyenek: %s Kívánja folytatni a telepítést?
id: Paket berikut harus di hapus agar yang lain dapat di upgrade: %s Lanjutkan installasi?
is: Eftirfarandi pakka þarf að fjarlægja til að geta uppfært aðra: %s Halda samt áfram með uppsetningu?
it: I pacchetti elencati devono essere rimossi per poterne aggiornare altri: %s Continuare l'installazione comunque?
nb: De følgende pakkene må fjernes for at andre skal kunne bli oppgradert: %s Fortsette installasjonen?
nl: De volgende pakketten moeten worden verwijderd om andere te kunnen opwaarderen: %s Toch verdergaan met installatie?
nn: Desse pakkane må fjernast for at andre skal kunna oppgraderast: %s Vil du likevel halda fram?
pl: Poniższe pakiety muszą być usunięte aby zaktualizować inne: %s Czy kontynuować mimo to?
pt: Os seguintes pacotes têm que ser removidos para os outros serem actualizados: %s Continuar a instalação?
pt_br: Estes programas precisam ser removidos para que outros sejam atualizados: %s Prosseguir com a instalação mesmo assim?
ro: Următoarele pachete trebuiesc înlăturate pentru ca celelalte să fie actualizate: %s Continuați totuși instalarea?
ru: Следующие пакеты должны быть удалены для обновления остальных: %s Всё равно продолжить установку?
sl: Naslednji paketi morajo biti odstranjeni, da bo možno nadgraditi druge: %s Naj se namestitev vseeno nadaljuje?
sq: Paketat në vazhdim duhen të hiqen që të tjerat të përmirësohen: %s Vazhdo instalimin gjithsesi?
sv: Följande paket måste tas bort för att andra ska bli uppdaterade: %s Vill du fortsätta ändå?
tr: Diğer paketlerin güncellenmesi için aşağıdaki paketlerin kaldırılması gerekiyor: %s Yine de devam edilsin mi?

source: To satisfy dependencies, the following package is going to be installed:
ast: Pa satisfacer les dependencies, instalaráse'l paquete siguiente
ca: Per complir les dependències, s'instal·larà el següent paquet:
cs: Aby byly splněny závislosti, bude nainstalován následující balíček:
cy: I fodloni dibyniaethau, bydd y pecynnau canlynol yn cael eu gosod
da: For at tilfredsstille afhængigheder vil den følgende pakke blive installeret
el: Για να ικανοποιηθούν οι εξαρτήσεις, θα εγκατασταθεί το παρακάτω πακέτο:
es: Para satisfacer las dependencias, se instalará el paquete siguiente
et: Sõltuvuste lahendamiseks paigaldatakse järgmine pakett:
eu: Mendekotasunak asetzeko, ondorengo paketea instalatuko da:
fi: Riippuvuuksien täyttämiseksi seuraava paketti asennetaan:
fr: Pour satisfaire les dépendances, le paquetage suivant va être installé :
gl: Para satisface-las dependencias, vaise instala-lo seguinte paquete
he: כדי לספק את התלויות, החבילה הבאה הותקן:
hu: A függőségek feloldásához a következő csomag telepítésre kerül:
id: Untuk memenuhi ketergantungan, paket berikut akan diinstall:
is: Til að viðhalda samræmi, verður eftirfarandi pakki settur inn:
it: Per soddisfare le dipendenze, sarà installato il seguente pacchetto:
nb: Denne pakken vil bli installert for å oppfylle avhengigheter:
nl: Om aan afhankelijkheden te voldoen, wordt het volgende pakket geïnstalleerd:
nn: Grunna avhengnader vert denne pakken installert:
pl: W celu spełnienia zależności zostanie zainstalowany następujący pakiet:
pt: Para satisfazer as dependências, o seguinte pacote irá ser instalado:
pt_br: Para satisfazer as dependências, o seguinte pacote será instalado:
ro: Pentru satisfacerea dependențelor, următorul pachet va fi instalat:
ru: Для удовлетворения зависимостей будет установлен следующий пакет:
sl: Za zadovoljitev odvisnosti bo nameščen naslednji paket:
sq: Për të kënaqur varësitë, paketa e mëposhtme do të instalohet:
sv: För att tillfredsställa beroenden, kommer följande paket att installeras:
tr: Bağımlılık sorununu aşabilmek için, aşağıdaki paketin kurulması gerekiyor:

source: To satisfy dependencies, the following packages are going to be installed:
ast: Pa satisfacer les dependencies, instalaránse los paquetes siguientes:
ca: Per complir les dependències, s'instal·laran els paquets següents:
cs: Aby byly splněny závislosti, budou nainstalovány následující balíčky:
cy: I fodloni dibyniaethau, bydd y pecyn canlynol yn cael ei osod
da: For at tilfredsstille afhængigheder vil de følgende pakker blive installeret
el: Για να ικανοποιηθούν οι εξαρτήσεις, θα εγκατασταθούν τα ακόλουθα πακέτα:
es: Para satisfacer las dependencias, se instalarán los paquetes siguientes:
et: Sõltuvuste lahendamiseks paigaldatakse järgmised paketid:
eu: Mendekotasunak asetzeko, ondoko paketeak instalatuko dira:
fi: Riippuvuuksien täyttämiseksi seuraavat paketit asennetaan:
fr: Pour satisfaire les dépendances, les paquetages suivants vont être installés :
gl: Para satisface-las dependencias, vanse instala-los seguintes paquetes
he: כדי לספק את התלויות החבילות הבאות יותקנו:
hu: A függőségek feloldásához a következő csomagok telepítésre kerülnek:
id: Untuk memenuhi ketergantungan, paket-paket berikut juga akan diinstal:
is: Til að viðhalda samræmi, verða eftirtaldir pakkar settir inn:
it: Per soddisfare le dipendenze, saranno installati i seguenti pacchetti:
nb: Disse pakkene vil bli installert for å oppfylle avhengigheter:
nl: Om aan de afhankelijkheden te voldoen worden de volgende pakketten geïnstalleerd:
nn: Grunna avhengnader vert desse pakkane installerte:
pl: W celu spełnienia zależności zostaną zainstalowane następujące pakiety:
pt: Para satisfazer as dependências, os seguintes pacotes irão ser instalados:
pt_br: Para satisfazer as dependências, os seguintes programas serão instalados:
ro: Pentru satisfacerea dependențelor, următoarele pachete vor fi instalate:
ru: Для удовлетворения зависимостей будут установлены следующие пакеты:
sl: Za zadovoljitev odvisnosti bodo nameščeni naslednji paketi:
sq: Për të kënaqur varësitë, paketat e mëposhtme do të instalohen:
sv: För att tillfredsställa beroenden kommer följande paket att installeras:
tr: Bağımlılık sorununu aşabilmek için, aşağıdaki paketlerin kurulması gerekiyor:

source: (%d package, %d MB)
ca: (%d paquet, %d MB)
cs: (%d balíček, %d MB)
cy: (%d pecyn, %d MB)
da: (%d pakke, %d MB)
es: (%d paquete, %d MB)
eu: (pakete %d, %d MB)
fi: (%d paketti, %d Mt)
gl: (%d paquete, %d MB)
he: (חבילה %d, %d MB)
hu: (%d csomag, %d MB)
id: (%d paket, %d MB)
is: (%d pakki, %d MB)
it: (%d pacchetto, %d MB)
nb: (%d pakke – %d MB)
pl: (%d pakiet, %d MB)
pt: (%d pacote, %d MB)
ro: (%d pachet, %d Mo)
sv: (%d paket, %d MB)
tr: (%d paket, %d MB)

source: unable to get source packages, aborting
ast: nun pudieron obtenese los paquetes orixe, albortando
ca: no es poden recuperar els paquets font. S'està interrompent
cs: nelze získat zdrojový balíček, končím
cy: methu estyn pecynnau ffynhonnell, atal
da: kan ikke hente kilde-pakker, afslutter med fejl
el: αδυναμία λήψης των πακέτων πηγαίου κώδικα, ματαίωση
es: no se pueden obtener los paquetes fuente, abortando
et: pakette ei õnnestunud hankida, katkestatakse
eu: ezin dira iturburuko paketeak lortu, abortatzen
fi: Lähdekoodipaketteja ei voida hakea, keskeytetään asennus
fr: impossible de récupérer les paquetages de sources, abandon
gl: Non foi posible consegui-los paquetes fonte, abortando
he: אין אפשרות לקרוא חבילות מהמאגר, הפעולה מתבטלת
hu: a forráscsomagok nem elérhetők, ezért a művelet félbeszakad
id: tidak dapat mengambil paket sumber, dibatalkan
is: Get ekki sótt frumpakka, hætti við
it: impossibile recuperare i pacchetti dalla fonte, interrompo
nb: kunne ikke få tak i kildepakker, avbryter
nl: kan bronpakketten niet ontvangen, bezig met afbreken
nn: Fann ikkje kjeldepakke. Avbryt.
pl: nie można pobrać pakietów źródłowych, zaniechanie
pt: não é possível obter os pacotes fonte, a abortar
pt_br: incapaz de obter pacotes fonte, abortando
ro: nu se pot prelua pachetele sursă, se abandonează
ru: не удаётся получить пакеты с исходными кодами, аварийное завершение
sl: paketov z izvorno kodo ni mogoče dobiti, predčasna prekinitev
sq: e pa mundur marrja e burimit të pakos, ndërpritje
sv: kunde inte läsa källan, avbryter
tr: kaynak paketleri alınamadı, çıkılıyor

source: Preparing...
ast: Tresnando...
ca: S'està preparant...
cs: Připravuji...
cy: Paratoi...
da: Forbereder...
el: Προετοιμασία...
es: Preparando...
et: Valmistumine...
eu: Prestatzen...
fi: Valmistellaan...
fr: Préparation...
gl: Preparando...
he: הכנה...
hu: Előkészítés...
id: Persiapan...
is: Undirbý...
it: In preparazione...
nb: Forbereder …
nl: Voorbereiden...
nn: Førebur ...
pl: Przygotowywanie...
pt: A preparar...
pt_br: Preparando...
ro: Pregătire...
ru: Подготовка...
sl: Priprava …
sq: Përgatitje...
sv: Förbereder...
tr: Hazırlanıyor...

source: Installing package `%s' (%s/%s)...
ast: Instalando paquete `%s' (%s/%s)...
ca: S'està instal·lant el paquet `%s' (%s/%s)...
cs: Instaluji balíček `%s' (%s/%s)...
cy: Gosod pecyn `%s' (%s/%s)...
da: Installerer pakke `%s' (%s/%s)...
el: Εγκατάσταση του πακέτου `%s' (%s/%s)...
es: Instalando paquete `%s' (%s/%s)...
et: Paketi '%s' paigaldamine (%s/%s)...
eu: `%s' paketea instalatzen (%s/%s)...
fi: Asennetaan pakettia %s (%s / %s)...
fr: Installation du paquetage « %s » (%s/%s)...
gl: Instalando o paquete `%s' (%s/%s)...
he: מתקין חבילה `%s' (%s/%s)...
hu: A(z) '%s' (%s/%s) csomag telepítése...
id: Menginstall paket `%s' (%s/%s)...
is: Set inn pakka `%s' (%s/%s)...
it: Sto installando il pacchetto `%s' (%s/%s)...
nb: Installerer pakke «%s» (%s/%s) …
nl: Bezig met installeren van pakket `%s' (%s/%s)...
nn: Installerer pakken «%s» (%s/%s) ...
pl: Instalowanie pakietu "%s" (%s/%s)...
pt: A instalar o pacote `%s' (%s/%s)...
pt_br: Instalando pacote `%s' (%s/%s)...
ro: Se instalează pachetul „%s” (%s/%s)...
ru: Устанавливается пакет «%s» (%s/%s)...
sl: Nameščanje paketa »%s« (%s/%s) …
sq: Instalimi i pakove `%s' (%s/%s)...
sv: Installerar paket "%s" (%s/%s)...
tr: '%s' paketi kuruluyor ( %s/%s )...

source: Please insert the medium named "%s"
ast: Por favor, inxerta'l preséu nomáu «%s»
ca: Inseriu el suport anomenat "%s"
cs: Prosím vložte médium nazvané "%s"
cy: Rhowch gyfrwng "%s" yn y ddyfais
da: Vær venlig at indsætte mediet med navnet %s
el: Παρακαλώ εισήγαγε το μέσο με το όνομα «%s»
es: Por favor, inserte el soporte denominado «%s»
et: Palun sisestage andmekandja nimega "%s"
eu: Mesedez, sartu "%s" izeneko euskarria
fi: Aseta media "%s" asemaan
fr: Veuillez insérer le média nommé « %s »
gl: Insira o soporte chamado "%s"
he: נא להכניס את המדיה בשם "%s"
hu: Kérem helyezze be a(z) "%s" nevű adathordozót
is: Settu inn miðil "%s"
it: Bisogna inserire il supporto denominato "%s"
nb: Sett inn mediet «%s»
nl: Gelieve het medium genaamd "%s" te plaatsen
nn: Set inn mediet «%s»
pl: Włóż nośnik o nazwie "%s"
pt: Por favor insira a média chamada "%s"
pt_br: Por favor insira a mídia chamada "%s"
ro: Inserați mediul numit „%s”
ru: Вставьте носитель под названием «%s»
sl: Vstavite vir imenovan »%s«
sq: Futni një emër për medium "%s"
sv: Lägg i media med namnet "%s"
tr: Lütfen "%s" isimli ortamı yerleştirin

source: Downloading package `%s'...
ast: Baxando'l paquete `%s'...
ca: S'està descarregant el paquet `%s'...
cs: Stahuje se balíček `%s'...
cy: Llwytho pecynnau i lawr ' %s'...
da: Henter pakke %s...
el: Λήψη του πακέτου `%s'...
es: Descargando paquete `%s'...
et: Paketi '%s' allalaadimine...
eu: `%s' paketea deskargatzen...
fi: Ladataan tiedostoa %s...
fr: Téléchargement du paquetage « %s »...
gl: Descargando o paquete `%s'...
he: מוריד חבילה `%s'...
hu: A(z) '%s' csomag letöltése folyik...
id: Mendownload paket `%s'...
is: Sæki pakka `%s'...
it: Recupero del pacchetto `%s'...
nb: Laster ned «%s» …
nl: Downloaden van pakket `%s'...
nn: Lastar ned pakken «%s» ...
pl: Pobieranie pakietu "%s"...
pt: A transferir o pacote `%s'...
pt_br: Baixando o pacote `%s'...
ro: Se descarcă pachetul „%s”...
ru: Загружается пакет «%s»...
sl: Prenos paketa »%s« …
sq: Shkarkimi i pakos `%s'...
sv: Laddar ner paket "%s"...
tr: '%s' paketi indiriliyor...

source: ...retrieving failed: %s
ast: ...falló la recuperación: %s
ca: ...ha fallat la recuperació: %s
cs: ...načítání selhalo: %s
cy: ... methodd ail-lwytho: %s
da: ...hentning mislykkedes: %s
el: ... η ανάκτηση απέτυχε: %s
es: ...falló la recuperación: %s
et: ...tõmbamine nurjus: %s
eu: ...berreskuratzeak huts egin du: %s
fi: ...noutaminen epäonnistui: %s
fr: ... échec de la récupération : %s
gl: ...fallo ó obter: %s
he: ...האיחזור נכשל: %s
hu: ...a behozatal sikertelen: %s
id: ...pengambilan gagal: %s
is: ...mistókst að sækja: %s
it: ...recupero fallito: %s
nb: … mottak mislyktes: %s
nl: ...ontvangst mislukt: %s
nn: ... Feil ved nedlasting: %s
pl: ...pobieranie nie powiodło się: %s
pt: ...transferência falhada: %s
pt_br: ...a busca falhou: %s
ro: ...preluare eșuată: %s
ru: ...извлечение не удалось: %s
sl: …prenos je spodletel: %s
sq: ...rikuperimi dështoi: %s
sv: ...hämtning misslyckades: %s
tr: ...getirme başarısız: [%s]

source: _Done
ast: _Fecho
ca: _Fet
cs: _Hotovo
cy: _Gorffen
da: _Færdig
el: _Ολοκληρώθηκε
es: _Hecho
et: _Tehtud
eu: _Eginda
fi: _Valmis
fr: _Fini
gl: _Feito
he: _סיום
hu: _Kész
id: _Selesai
is: _Lokið
it: _Fatto
nb: _Ferdig
nl: _Klaar
nn: _Ferdig
pl: Gotowe
pt: _Terminado
pt_br: _Pronto
ro: _Gata
ru: _Готово
sl: _Opravljeno
sq: _Bërë
sv: _Klar
tr: _Bitti
