Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: problem reading synthesis file of medium "%s"
ast: problema lleendo'l ficheru de synthesis del mediu "%s"
ca: s'ha trobat un problema llegint el fitxer de síntesi de la font "%s"
cs: problém při čtení souboru se syntézou zdroje "%s"
cy: anhawster darllen synthesis ffeil cyfrwng "%s"
da: problem ved læsning af syntese-fil for medie "%s"
el: πρόβλημα ανάγνωσης του αρχείου σύνθεσης από το μέσο «%s»
es: problema leyendo el archivo de síntesis del soporte «%s»
et: probleem andmekandja "%s" sünteesifaili lugemisel
eu: arazoa "%s" euskarriaren laburpen-fitxategia irakurtzean
fi: Ongelmia luettaessa median "%s" synthesis-tiedostoa
fr: problème de lecture du fichier de synthèse du média « %s »
gl: problema ó ler o ficheiro synthesis do soporte "%s"
he: בעיה בקריאת קובץ מיזוג של מאגר "%s"
hu: probléma a(z) "%s" adatforrás kiterjesztett függőséglistájának olvasásakor
id: masalah membaca file sintesa hdlist untuk media "%s"
is: vandræði við lestur á samantektar-skrá fyrir miðil "%s"
it: problema nel leggere il file synthesis del supporto "%s"
nb: feil ved lesing av syntesefil for mediet «%s»
nl: probleem met lezen van synthesis bestand van medium "%s"
nn: Feil ved lesing av syntesefila til mediet «%s».
pl: wystąpił problem podczas odczytu pliku syntezy dla nośnika "%s"
pt: problema ao ler o ficheiro synthesis da média "%s"
pt_br: problema ao ler arquivo synthesis da mídia "%s"
ro: problemă la citirea fișierului synthesis al mediului „%s”
ru: проблема чтения файла synthesis источника «%s»
sl: težava pri branju datoteke synthesis vira »%s«
sq: problem gjatë leximit të skedares sitezë të burimit "%s"
sv: problem med att läsa synthesis-fil för media "%s"
tr: "%s" ortamının sentezleme dosyasının okunmasında hata

source: copying [%s] for medium "%s"...
ast: copiando [%s] pal mediu "%s"...
cs: kopíruji [%s] pro zdroj "%s"...
cy: copïo [%s] ar gyfer cyfrwng "%s"...
da: kopierer [%s] for medium '%s' ...
el: αντιγραφή [%s] για το μέσο «%s»...
es: copiando [%s] para el soporte «%s»...
et: kopeeritakse [%s] andmekandjale "%s"...
eu: [%s] kopiatzen "%s" euskarriarentzako...
fi: Kopioidaan tiedostoa [%s] medialle "%s"...
fr: copie en cours [%s] pour le média « %s »...
he: מעתיק [%s] עבור המקורר "%s"...
hu: "%s" másolása a(z) "%s" adatforrás számára...
id: menyalin [%s] untuk media "%s"...
is: afrita [%s] fyrir miðil "%s"...
it: copia di [%s] per il supporto "%s"...
nb: kopierer [%s] for mediet «%s» …
nl: Kopiëren van bestand [%s] voor medium "%s"...
nn: Kopierer [%s] for mediet «%s».
pl: kopiowanie [%s] dla nośnika %s...
pt: a copiar [%s] para a média "%s"...
pt_br: copiando [%s] para a mídia "%s"...
ro: se copiază [%s] pentru mediul „%s”...
ru: копируется [%s] для источника «%s»...
sl: kopiranje [%s] za vir »%s« …
sq: kopjimi [%s] për medium "%s"...
sv: kopierar [%s] för media "%s"...
tr: "%s" ortamı için [%s] kopyalanıyor...

source: ...copying failed
ast: ...falló copiando
ca: ..la còpia ha fallat
cs: ...kopírování selhalo
cy: ...methodd y copïo
da: ...kopiering mislykkedes
el: ...η αντιγραφή απέτυχε
es: ...falló la copia
et: ...kopeerimine nurjus
eu: ...ezin izan da kopiatu
fi: ...kopiointi epäonnistui
fr: ... copie impossible
gl: ...fallo ó copiar
he: ...ההעתקה נכשלה
hu: ...a másolás sikertelen
id: ...penyalinan gagal
is: ...afritun brást
it: ...copia fallita
nb: … kopiering mislyktes
nl: ...kopiëren mislukt
nn: ... mislukka kopiering.
pl: ...kopiowanie zakończone niepowodzeniem
pt: ...copia falhada
pt_br: ...falha na cópia
ro: ...copiere eșuată
ru: ...копирование не удалось
sl: … kopiranje je spodletelo
sq: ...kopjimi dështoi
sv: ...kopiering misslyckades
tr: ...kopyalama başarısız

source: copying description file of "%s"...
ast: copiando descripción de ficheru de "%s"...
ca: s'està copiant el fitxer de descripció de "%s"...
cs: kopíruji soubor s popisy pro "%s"...
cy: copïo ffeil disgrifiad o "%s"
da: kopierer beskrivelsesfil for "%s"...
el: αντιγραφή του αρχείου περιγραφής του «%s»...
es: copiando descripción de archivo de «%s»...
et: "%s" kirjelduste faili kopeerimine...
eu: "%s"(r)en deskribapen-fitxategia kopiatzen...
fi: Kopioidaan median "%s" kuvaustiedostoa...
fr: copie du fichier description de « %s »...
gl: copiando o ficheiro de descrición de "%s"...
he: מעתיק תיאור קובץ של "%s"...
hu: "%s" leírásfájljának másolása...
id: file deskripsi "%s" sedang disalin
is: afrita lýsingaskrá fyrir "%s"...
it: copio il file di descrizione di "%s"...
nb: kopierer beskrivelsesfila for «%s» …
nl: bezig met kopiëren omschrijving bestand van "%s"...
nn: Kopierer skildringsfila til «%s» ...
pl: kopiowanie pliku opisowego związanego z "%s"...
pt: a copiar o ficheiro de descrição de "%s"...
pt_br: Copiando o arquivo de descrição de "%s"...
ro: se copiază fișierul cu descrieri pentru „%s”...
ru: копируется файл описания для «%s»...
sl: kopiranje datoteke z opisi »%s« …
sq: kopjimi i skedares përshkruese të "%s"...
sv: kopierar beskrivningsfil för "%s"...
tr: "%s"in açıklama dosyası kopyalanıyor...

source: ...copying done
ast: ...copia fecha
ca: ...còpia feta
cs: ...kopírování ukončeno
cy: ...cwblhau'r copïo
da: ...kopiering færdig
el: ...η αντιγραφή ολοκληρώθηκε
es: ...copia hecha
et: ...kopeerimine tehtud
eu: ...kopiatzea burutu da
fi: ...kopiointi valmis
fr: ... copie effectuée
gl: ...copiado
he: ...ההעתקה הסתיימה
hu: ...másolás megtörtént
id: ...penyalinan selesai
is: ...afritun lokið
it: ...copia terminata
nb: … kopiering fullført
nl: ...kopiëren is klaar
nn: ... kopiering fullført.
pl: ...kopiowanie zakończone
pt: ...copia terminada
pt_br: ..cópia terminada
ro: ...copiere încheiată
ru: ...копирование выполнено
sl: … kopiranje zaključeno
sq: ...kopjimi i bërë
sv: ...kopiering klar
tr: ...kopyalama tamamlandı.

source: copy of [%s] failed (file is suspiciously small)
ast: falló la copia de [%s] (el ficheru ye sospechosamente pequeñu)
ca: la còpia de [%s] ha fallat (el fitxer és sospitosament petit)
cs: kopírování [%s] selhalo (soubor je podezřele malý)
cy: methodd copïo (%s) (Mae'r ffeil yn rhy fach)
da: kopiering af [%s] mislykkedes (filen er mistænkeligt lille)
el: η αντιγραφή του [%s] απέτυχε (το αρχείο είναι ύποπτα μικρό)
es: falló la copia de [%s] (el archivo es sospechosamente pequeño)
et: [%s] kopeerimine nurjus (fail on kahtlaselt väike)
eu: ezin izan da [%s] kopiatu (fitxategia txikiegia da)
fi: Tiedoston [%s] kopiointi epäonnistui (tiedosto on epäilyttävän pieni)
fr: La copie de [%s] a échoué (le fichier est étrangement petit)
gl: fallo ó copiar [%s] (o ficheiro é sospeitosamente pequeno)
he: העתקת [%s] נכשלה (הקובץ קטן מהמצופה)
hu: "%s" másolása sikertelen (a fájl túl kicsi)
id: penyalinan [%s] gagal (file dicurigai terlalu kecil)
is: afrit af [%s] brást (skráin er grunsamlega lítil)
it: copia di [%s] fallita (il file è stranamente piccolo)
nb: mislykket kopiering av [%s] (fila er mistenkelig liten)
nl: kopiëren van [%s] mislukt (bestand is verdacht klein)
nn: Mislukka kopiering av [%s] (fila er mistenkeleg liten).
pl: kopiowanie [%s] zakończone niepowodzeniem (plik jest podejrzanie mały)
pt: cópia de [%s] falhada (o ficheiro é suspeitosamente pequeno)
pt_br: cópia de [%s] falhou (arquivo é suspeitamente pequeno)
ro: copierea fișierului [%s] a eșuat (fișier suspect de mic)
ru: копирование [%s] не удалось (файл подозрительно короткий)
sl: kopiranje [%s] je spodletelo (datoteka je sumljivo majhna)
sv: kopiering av [%s] misslyckades (filen är misstänkligt liten)
tr: [%s] kopyalaması başarısız. (dosya şüphe çekecek kadar ufak)

source: computing md5sum of retrieved source synthesis
ast: calculando md5sum del synthesis orixe baxáu
cs: počítám součet md5 získaného zdrojového souboru se syntézou
cy: cyfrifo md5sum o ffynhonnell synthesis adferwyd (neu synthesis)
da: beregner md5sum på hentet kilde-syntese
el: υπολογισμός του md5sum του ανακτημένου πηγαίου synthesis
es: calculando md5sum del archivo synthesis fuente descargado
et: tõmmatud allika sünteesifaili MD5SUM arvutamine
eu: berreskuratutako iturburu synthesis-en md5sum kalkulatzen
fi: Lasketaan tarkistussumma ladatulle lähteen synthesis-tiedostolle
fr: calcul de la somme de contrôle MD5 du fichier synthesis
he: מחשב חתימות md5sum של קובץ synthesis
hu: a letöltött kiterjesztett függőséglista MD5-ös összegének kiszámítása folyik
is: reikna md5 gátsummu yfir sótta samantektarskrá
it: calcolo md5sum del file synthesis della fonte scaricata
nb: beregner md5sum for mottatt kildeliste
nl: berekenen md5sum van ontvangen bronsynthesis
nn: Reknar ut md5sum til motteken kjeldesyntese.
pl: obliczanie sumy md5 pobranego pliku syntezy
pt: a calcular o md5sum da fonte synthesis transferida
pt_br: computando o md5sum de uma fonte synthesis
ro: se calculează md5sum pentru fișierul synthesis
ru: вычисляется md5-сумма для загруженного synthesis-файла источника
sl: računanje md5sum izvorne datoteke synthesis
sv: beräknar MD5-summa för hämtade syntheses källor
tr: Alınan kaynak sentezi'nin md5sum özeti hesaplanıyor.

source: retrieval of [%s] failed (md5sum mismatch)
ast: falló la baxada de [%s] (md5sum nun concasa)
ca: la recuperació de [%s] ha fallat (l'md5sum no concorda)
cs: načtení [%s] selhalo (chyba v kontrolním součtu md5sum)
cy: methodd estyn (%s) (md5sum gwallus)
da: hentning af [%s] mislykkedes (md5sum-uoverensstemmelse)
el: η ανάκτηση του [%s] απέτυχε (τα md5sum δεν ταιριάζουν)
es: falló la descarga de [%s] (no coincide md5sum)
et: [%s] tõmbamine nurjus (MD5SUM ei klapi)
eu: [%s]-ren berreskuperaketak huts egin du (md5sum ez dator bat)
fi: Tiedoston [%s] haku epäonnistui (tarkistussumma ei täsmää)
fr: échec de la récupération de [%s] (inégalité md5sum)
gl: fallo ó obter [%s] (os md5sum non coinciden)
he: אחזור [%s] נכשל (חתימת md5sum אינה תואמת)
hu: "%s" megszerzése sikertelen (az MD5-ös összegek nem egyeznek)
is: mistókst að sækja [%s] (md5 gátsumma passar ekki)
it: acquisizione di [%s] fallita (md5sum non corretta)
nb: henting av [%s] mislyktes (md5sum stemmer ikke)
nl: ophalen van [%s] mislukt (md5sum onjuist)
nn: Feil ved nedlasting av [%s] (md5summen stemmer ikkje).
pl: pobieranie [%s] zakończone niepowodzeniem (niezgodna suma md5)
pt: obtenção de [%s] falhada (md5sum diferente)
pt_br: baixa de [%s] falhou (md5sum não é igual)
ro: descărcarea lui [%s] a eșuat (eroare de md5sum)
ru: копирование [%s] не удалось (md5-суммы не совпадают)
sl: prenos [%s] je spodletel (md5sum se ne ujema)
sv: hämtning av [%s] misslyckades (md5sum stämmer inte)
tr: [%s] alımı başarısız oldu. (md5sum eşleşmedi.)

source: genhdlist2 failed on %s
ast: falló genhdlist2 en %s
cs: genhdlist2 selhal na %s
cy: methodd genhdlist2 ar %s
da: genhdlist2 mislykkedes på %s
el: αποτυχία του genhdlist2 στο %s
es: falló genhdlist2 en %s
et: genhdlist2 nurjus %s puhul
eu: genhdlist2-k huts egin du %s-rekin
fi: Genhdlist2 epäonnistui paketin %s kohdalla
fr: échec de genhdlist2 sur [%s]
gl: genhdlist2 fallou en %s
he: genhdlist2 כשל על %s
hu: genhdlist2 hibát jelzett "%s"-ben
is: genhdlist2 mistókst á %s
it: genhdlist2 non riuscito per %s
nb: genhdlistfil2 feilet på %s
nl: genhdlist2 mislukt op %s
nn: Feil ved genhdlist2 på %s
pl: polecenie genhdlist2 spowodowało błąd w %s
pt: o genhdlist2 falhou em %s
pt_br: genhdlist2 falhou em %s
ro: genhdlist2 a eșuat pentru %s
ru: ошибка выполнения genhdlist2 для %s
sl: genhdlist2 na %s je spodletel
sq: genhdlist2 dështoj në %s
sv: genhdlist2 misslyckades på %s
tr: %s üzerinde genhdlist2 başarısız oldu.

source: comparing %s and %s
ast: comparando %s y %s
ca: s'està comparant %s i %s
cs: porovnávám %s a %s
cy: cymharu %s ac %s
da: sammenligner %s og %s
el: σύγκριση του %s και του %s
es: comparando %s y %s
et: %s ja %s võrdlemine
eu: %s eta %s parekatzen
fi: Verrataan kohteita %s ja %s
fr: comparaison de %s et de %s
gl: comparando %s e %s...
he: מחשב את %s ואת %s
hu: %s és %s összehasonlítása
is: ber saman %s og %s
it: confronto di %s con %s
nb: sammenligner %s og %s
nl: vergelijken van %s en %s
nn: Samanliknar %s og %s.
pl: porównywanie %s i %s
pt: a comparar %s e %s
pt_br: comparando %s e %s
ro: se compară %s și %s
ru: сравниваются %s и %s
sl: primerjanje %s in %s
sq: krahasuar %s dhe %s
sv: jämför %s och %s
tr: %s ve %s karşılaştırılıyor.

source: invalid hdlist file %s for medium "%s"
ast: ficheru hdlist %s non válidu pal mediu "%s"
cs: neplatný soubor hdlist %s pro zdroj "%s"
cy: ffeil hdlist annilys %s ar gyfer cyfrwng "%s"
da: ugyldig hdlist-fil %s for medie "%s"
el: άκυρο αρχείο hdlist %s για το μέσο «%s»
es: archivo hdlist %s no válido para el soporte «%s»
et: vigane hdlist-fail %s andmekandjale "%s"
eu: %s hdlist fitxategi baliogabea "%s" euskarriarentzat
fi: Virheellinen hdlist-tiedosto %s medialle "%s"
fr: fichier hdlist %s invalide pour le média « %s »
gl: ficheiro hdlist %s incorrecto no soporte "%s"
he: קובץ hdlist %s לא תקף עבור מאגר "%s"
hu: érvénytelen fejléclista-fájl (%s) a(z) "%s" adatforráshoz
id: file hdlist %s untuk media "%s" tidak valid
is: ógild hdlist skrá %s fyrir miðil "%s"
it: il file hdlist %s per il supporto "%s" non è corretto
nb: ugyldig hdlist-fil [%s] for mediet «%s»
nl: ongeldig hdlist-bestand %s voor medium "%s"
nn: Ugyldig «hdlist»-fil [%s] for mediet «%s».
pl: nieprawidłowy plik hdlist %s dla nośnika %s
pt: ficheiro hdlist %s inválido para a média "%s"
pt_br: hdlist inválido %s para a mídia "%s"
ro: fișierul hdlist %s pentru mediul „%s” nu este valid
ru: неверный файл hdlist %s для источника «%s»
sl: neveljavna datoteka hdlist %s za vir »%s«
sq: skedarë pavlefshëm hdlist %s për medium "%s"
sv: felaktig hdlist-fil %s för media "%s"
tr: "%s" ortamı için geçersiz %s hdlist dosyası.

source: copying MD5SUM file of "%s"...
ast: copiando ficheru MD5SUM de "%s"...
ca: s'està copiant el fitxer MD5SUM de "%s"
cs: kopíruji soubor MD5SUM z "%s"...
cy: copïo ffeil MD5SUM o "%s"
da: kopierer MD5SUM-fil for "%s"...
el: αντιγραφή του αρχείου MD5SUM από το "%s"...
es: copiando archivo MD5SUM de «%s»...
et: "%s" MD5SUM-faili kopeerimine...
eu: "%s"-ren MD5SUM fitxategia kopiatzen...
fi: Kopioidaan lähteen "%s" MD5SUM-tiedostoa...
fr: copie du fichier MD5SUM de « %s »...
gl: copiando o ficheiro MD5SUM de "%s"...
he: מעתיק קובץ MD5SUM של "%s"...
hu: "%s" leírásfájljának másolása...
is: afrita MD5SUM fyrir "%s"...
it: copia del file MD5SUM di "%s"...
nb: kopierer MD5SUM-fila for «%s» …
nl: kopiëren MD5SUM-bestand van "%s"...
nn: Kopierer md5sum-fila til «%s» ...
pl: kopiowanie pliku MD5SUM dla "%s"...
pt: a copiar o ficheiro MD5SUM de "%s"...
pt_br: copiando arquivo MD5SUM de "%s"...
ro: se copiază fișierul MD5SUM al „%s”...
ru: копируется файл MD5SUM для «%s»...
sl: kopiranje datoteke MD5SUM od »%s« …
sv: kopierar MD5SUM-fil för "%s"...
tr: "%s"in MD5SUM dosyası kopyalanıyor...

source: invalid MD5SUM file (downloaded from %s)
ast: ficheru MD5SUM non válidu (baxáu dende %s)
cs: neplatný soubor MD5SUM (stažený z %s)
cy: ffeil MD5SUM annilys (llwytho i lawr o %s)
da: ugyldig MD5SUM-fil (hentet fra %s)
el: μη έγκυρο αρχείο MD5SUM (έγινε λήψη από το %s)
es: archivo MD5SUM no válido (descargado desde %s)
et: vigane MD5SUM-fail (alla laaditud asukohast %s)
eu: MD5SUM fitxategi baliogabea (%s-tik jaitsitakoa)
fi: Virheellinen MD5SUM-tiedosto (ladattu osoitteesta %s)
fr: fichier MD5SUM invalide (téléchargé sur %s)
hu: érvénytelen MD5SUM fájl (letöltve a %s tükörről)
is: ógild MD5SUM skrá (sótt frá %s)
it: file MD5SUM non valido (recuperato da %s)
nb: ugyldig MD5SUM-fil (lastet ned fra %s)
nl: ongeldig MD5SUM-bestand (gedownload van %s)
nn: Ugyldig MD5SUM-fil (lasta ned frå %s)
pl: nieprawidłowa suma MD5 pliku (pobrano z %s)
pt: ficheiro MD5SUM inválido (transferido de %s)
pt_br: arquivo MD5SUM inválido (baixado de %s)
ro: fișier MD5SUM invalid (descărcat de la %s)
ru: неверный файл MD5SUM (загружен из %s)
sl: neveljavna datoteka MD5SUM (prenešena z %s)
sv: ogiltig MD5SUM fil (hämtad från %s)
tr: geçersiz MD5SUM dosyası (%s adresinden indirilmiş)

source: no metadata found for medium "%s"
ast: dengún metadáu foi alcontráu pal mediu "%s"
ca: no s'han trobat metadades per al suport "%s"
cs: pro zdroj "%s" nebyla nalezena žádná metadata
cy: dim metadata ar gyfer cyfrwng "%s"
da: ingen metadata fundet for medie "%s"
el: δεν βρέθηκαν μεταδεδομένα για το μέσο "%s"
es: ningún metadado fue encontrado para el medio "%s"
et: andmekandjale "%s" ei leitud metaandmeid
eu: ez da "%s" euskarriaren metadaturik aurkitu
fi: Medialle %s ei löytynyt metadataa
fr: pas de métadonnées trouvées pour le média « %s »
hu: a(z) "%s" adatforrásnak nincs metaadat fájlja
is: engin lýsigögn fundust fyrir miðil "%s"
it: non trovo i metadati per il supporto "%s"
nb: fant ingen metadata for mediet «%s»
nl: geen metadata gevonden voor medium "%s"
nn: Fann ikkje metadata for mediet «%s».
pl: nie znaleziono meta informacji dla nośnika "%s"
pt: nenhum dado meta encontrado para a média "%s"
pt_br: metadados não encontrados para a mídia "%s"
ro: nu s-a găsit fișierul de metadate pentru mediul „%s”
ru: для источника «%s» не найдены метаданные
sl: za vir »%s« ni bilo možno najti metapodatkov
sv: ingen metadata hittad för media "%s"
tr: "%s" ortamı için meta verisi bulunamadı.

source: retrieving source synthesis of "%s"...
ast: baxando orixe de synthesis de "%s"...
cs: načítám zdrojový soubor se syntézou pro "%s"...
cy: adfer ffynhonnell synthesis "%s"...
da: henter kilde-syntese for "%s"...
el: ανάκτηση της πηγαίας synthesis από το "%s"...
es: descargando synthesis fuente de «%s»...
et: "%s" allika sünteesifaili tõmbamine...
eu: "%s"-ren synthesis iturburua berreskuratzen...
fi: Noudetaan synthesis-tiedostoa lähteelle "%s"...
fr: récupération du fichier synthesis de « %s »...
he: מוריד את קובץ synthesis של "%s"...
hu: "%s" forrás-fejléclistájának (illetve kiterjesztett függőséglistájának) behozatala...
is: sæki grunn samantektar-skrá fyrir "%s"...
it: recupero del file synthesis di "%s"...
nb: henter kildefil for «%s» …
nl: bronsynthesis van "%s" ontvangen...
nn: Lastar ned kjeldesyntese for «%s» ...
pl: pobieranie pliku syntezy związanego z "%s"...
pt: a transferir a fonte synthesis de "%s"...
pt_br: obtendo a fonte synthesis de "%s"...
ro: se preia sursa synthesis pentru „%s”...
ru: загружается synthesis-файл источника из «%s»...
sl: prenos izvorne datoteke synthesis od »%s« …
sv: hämtar käll-synthesis för "%s"...
tr: "%s" in kaynak sentezi getiriliyor...

source: examining pubkey file of "%s"...
ast: restolando ficheru de contraseña pública de "%s"...
ca: s'està examinant el fitxer de clau pública de "%s"...
cs: zkoumá se soubor s veřejnými klíči "%s"...
cy: archwilio ffeil pubkey "%s"
da: undersøger pubkey-fil for '%s'
el: Εξέταση του αρχείου δημοσίου κλειδιού από το "%s"...
es: examinando archivo de clave pública de «%s»...
et: "%s" avaliku võtme faili uurimine...
eu: "%s"(r)en gako publikoen fitxategia aztertzen...
fi: Tarkistetaan median "%s" julkista avainta...
fr: examen du fichier de la clé publique de « %s »...
gl: examinando o ficheiro pubkey de "%s"...
he: בודק קובץ מפתחות ציבורי של "%s"...
hu: "%s" nyilvánoskulcs-fájljának vizsgálata...
id: memeriksa file pubkey dari "%s"...
is: athuga lykilskrá "%s"...
it: controllo il file pubkey di "%s"...
nb: undersøker offentlig nøkkel-for «%s» …
nl: onderzoeken van publieke sleutelbestand van "%s"...
nn: Les offentlegnøkkelfila til «%s» ...
pl: sprawdzanie pliku klucza publicznego związanego z "%s"...
pt: a examinar o ficheiro de chaves públicas de "%s"...
pt_br: examinando arquivo de chave pública em "%s"...
ro: se examinează fișierul de cheie publică pentru „%s”...
ru: проверяется файл открытого ключа для «%s»...
sl: preverjanje datoteke z javnimi ključi od »%s« …
sq: verifimi i skedares pubkey të "%s"...
sv: undersöker "pubkey"-fil för "%s"...
tr: "%s" pubanahtarı sınanıyor...

source: ...imported key %s from pubkey file of "%s"
ast: ...importóse contraseña %s dende ficheru de contraseña pública de "%s"
ca: ...s'ha importat la clau %s del fitxer de clau pública de "%s"
cs: ...importuji klíč %s ze souboru veřejných klíčů "%s"
cy: ...allwedd %s wedi ei fewnforio o ffeil pubkey "%s"
da: ...importeret nøgle %s fra pubkey-fil for "%s"
el: ...εισαγωγή του κλειδιού %s από το αρχείο δημοσίου κλειδιού του "%s"
es: ... se importó clave %s desde archivo de clave pública de «%s»
et: ...imporditi võti %s "%s" avaliku võtme failist
eu: ...%s gakoa inportatu da "%s"(r)en gako publikoen fitxategitik
fi: ...tuotiin avain %s median "%s" julkisesta avaimesta
fr: ... clé %s importée à partir du fichier de la clé publique de « %s »
gl: ...importouse a clave %s dende o ficheiro pubkey de "%s"
he: .. מפתח %s מיובא מתוך קובץ ציבורי של "%s"
hu: ...%s kulcs importálva "%s" nyilvánoskulcs-fájljából
id: ...kunci %s terimport dari file pubkey "%s"
is: ...flutti inn lykil %s úr lyklaskrá "%s"
it: ...importata la chiave %s dal file pubkey di "%s"
nb: … importerte nøkkelen %s fra offentlig nøkkelfil for %s
nl: ...sleutel %s uit publiek sleutelbestand van "%s" geïmporteerd
nn: ... Importerer nøkkelen «%s» frå offentlegnøkkelfila til «%s».
pl: ...zaimportowany klucz %s z klucza publicznego związanego z "%s"
pt: ...chave %s importada do ficheiro de chaves públicas de "%s"
pt_br: ...importando chave %s do arquivo de chaves públicas de "%s"
ro: ...cheia %s importată din fișierul de cheie publică al lui „%s”
ru: ...импортирован ключ %s из файла открытого ключа «%s»
sl: … uvožen je ključ %s iz datoteke javnih ključev od »%s«
sq: ...importimi i çelësit %s nga skedarja pubkey e "%s"
sv: ...importerarde nyckel %s från "pubkey"-fil av "%s"
tr: ...%s anahtarı "%s" pubanahtarından içe aktarıldı.

source: unable to import pubkey file of "%s"
ast: nun puede importase ficheru de contraseña pública de "%s"
ca: no s'ha pogut importat el fitxer de clau pública de "%s"
cs: nelze importovat soubor s veřejnými klíči "%s"
cy: methu mewnforio ffeil pubkey "%s"
da: kunne ikke importere pubkey-fil for "%s"
el: αδυναμία εισαγωγής του αρχείου δημοσίου κλειδιού του "%s"
es: no se puede importar archivo de clave pública de «%s»
et: "%s" avaliku võtme faili import nurjus
eu: ezin da "%s"(r)en gako publikoen fitxategia inportatu
fi: Median "%s" julkista avainta ei voitu tuoda
fr: impossible d'importer le fichier de la clé publique de « %s »
gl: non foi posible importar o ficheiro pubkey de "%s"
he: לא יכול לייבוא קובץ של מפתח ציבורי של "%s"
hu: "%s" nyilvánoskulcs-fájlja nem importálható
id: gagal mengimpor file pubkey dari "%s"
is: gat ekki flutt inn lykilskrá "%s"
it: impossibile importare il file pubkey di "%s"
nb: klarte ikke importere offentlig nøkkelfil for «%s»
nl: kon publieke sleutelbestand van "%s" niet importeren
nn: Klarte ikkje importera offentlegnøkkelfila til «%s».
pl: nie można zaimportować pliku klucza publicznego związanego z "%s"
pt: não é possível importar o ficheiro de chaves públicas (pubkey) de "%s"
pt_br: incapaz de importar arquivo de chave pública de "%s"
ro: nu se poate importa fișierul de cheie publică pentru „%s”
ru: не удаётся импортировать файл открытого ключа «%s»
sl: uvoz javnega ključa vira »%s« ni mogoč
sq: është e pa mundur importimi i skedares pubkey të "%s"
sv: kunde inte importera "pubkey"-fil för "%s"
tr: "%s" pubanahtarı içe aktarılamıyor.
