Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: %s database is locked. Waiting...
ast: la base de datos %s ta bloquiada. Esperando...
ca: La base de dades %s està blocada. S'està esperant...
cs: Databáze %s je zamčená, čekám...
cy: Cronfa ddata %s wedi cloi, aros...
da: %s-database er låst, venter...
el: Η βάση δεδομένων %s είναι κλειδωμένη. Αναμονή...
es: la base de datos %s está bloqueada. Aguardando...
et: %s andmebaas on lukus, oodatakse...
eu: %s datubasea giltzatuta dago. Itxoiten...
fi: %s-tietokanta on lukittu. Odotetaan...
fr: la base de donnée %s est verrouillée, mise en attente...
gl: a base de datos de %s está bloqueada. Agardando...
he: בסיס הנתונים %s נעול. ממתין...
hu: a(z) %s adatbázis zárolt - várakozás...
is: %s gagnagrunnur læstur. bíð...
it: Il database %s è bloccato. Attendi...
nb: databasen %s er låst. Venter …
nl: %s-database gesloten. Wachten...
nn: %s-databasen er låst. Ventar ...
pl: %s baza danych zablokowana. Oczekiwanie...
pt: base de dados %s trancada. Por favor aguarde...
pt_br: Base de dados %s está bloqueada. Esperando...
ro: Baza de date %s este blocată. Așteptare...
ru: база данных %s заблокирована, подождите...
sl: Podatkovna zbirka %s je zaklenjena, čakanje …
sq: %s baza e të dhënave është e kyçur. Ne pritje...
sv: %s databas låst. Väntar...
tr: %s veri tabanı kilitlendi. Bekleniyor...

source: aborting
ast: albortando
ca: s'està interrompent
cs: přerušuji
cy: atal
da: afbryder
el: εγκατάλειψη
es: abortando
et: loobutakse
eu: galarazten
fi: Keskeytetään
fr: abandon
gl: abortando
he: נוטש
hu: leállítás
is: hætti við
it: Interruzione
nb: avbryter
nl: afbreken
nn: avbryt
pl: przerywanie
pt: a abortar.
pt_br: cancelando
ro: abandonare
ru: прерывается
sl: prekinjam
sq: ndërprerje
sv: avbryter
tr: iptal ediliyor

source: Retry?
ast: ¿Reintentar?
ca: Tornar a intentar?
cs: Opakovat?
cy: Ceisio eto?
da: Forsøg igen?
el: Νέα προσπάθεια ;
es: ¿Reintentar?
et: Kas proovida uuesti?
eu: Berriz saiatu?
fi: Yritä uudelleen?
fr: Essayer de nouveau ?
hu: Ismét?
is: Reyna aftur?
it: Riprovare?
nb: Prøve på nytt?
nl: Opnieuw proberen?
nn: Prøv på nytt?
pl: Ponowić próbę?
pt: Tentar novamente?
pt_br: Tentar Novamente ?
ro: Reîncercați?
ru: Повторить попытку?
sl: Poskusim znova?
sq: Riprovo?
sv: Försök på nytt?
tr: Yeniden dene?

source: You may need to update your urpmi database.
ast: Pues necesitar anovar la base de datos d'urpmi.
ca: Pot ser necessari actualitzar la base de dades urpmi.
cs: Možná potřebujete aktualizovat vaši databázi urpmi.
cy: Hoffech chi ddiweddaru eich cronfa ddata urpmi?
da: Du ønsker måske at opdatere din urpmi-database.
el: Θα πρέπει να ενημερώσετε τη βάση δεδομένων urpmi.
es: Su base de datos de urpmi puede necesitar de actualización.
et: Te võiksite ehk uuendada urpmi andmebaasi.
eu: Zure urpmi datu-basea eguneratzea komeni da.
fi: Urpmi-tietokanta tulisi päivittää.
fr: Vous devriez mettre à jour votre base de données urpmi.
hu: Érdemes lehet frissíteni az urpmi adatbázist.
is: Þú gætir þurft að uppfæra urpmi gagnagrunninn.
it: Sarebbe utile aggiornare il database urpmi.
nb: Du ønsker antageligvis å oppdatere databasen din.
nl: U kunt proberen de urpmi-database bij te werken.
nn: Du bør oppdatera urpmi-databasen.
pl: Być może konieczna jest aktualizacja bazy urpmi.
pt: Talvez precise actualizar a sua base de dados urpmi.
pt_br: Você deve atualizar a sua base de dados urpmi.
ro: Poate ar trebui să actualizați baza de date urpmi.
ru: Возможно, необходимо обновить базу данных urpmi
sl: Poskusite posodobiti podatkovno zbirko urpmi.
sq: Ju mund të keni nevojë të përditësoni bazën tuaj të të dhënave urpmi.
sv: Du bör försöka uppdatera urpmi-databasen.
tr: Urpmi veritabanı güncellemeniz gerekebilir.

source: Installation failed, bad rpms: %s
ast: Falló la instalación, rpms nun válidos: %s
ca: La instal·lació ha fallat, rpms dolents: %s
cs: Instalace selhala, vadné RPM balíčky: %s
cy: Methodd y gosod, rpm gwallus: %s
da: Installationen fejlede, dårlige rpm-pakker: %s
el: Η εγκατάσταση απέτυχε. Εσφαλμένα rpm: %s
es: Falló la instalación, rpms no válidos: %s
et: Paigaldamine nurjus, vigased RPM-failid: %s
eu: Instalaketak huts egin du, rpm okerrak: %s
fi: Asennus epäonnistui, viallisia paketteja: %s
fr: L'installation a échoué à cause de paquets bogués : %s
gl: Fallou a instalación, rpms incorrectos: %s
he: ההתקנה כשלה, חבילות תקולות: %s
hu: A telepítés nem sikerült, hibás RPM-ek: %s
is: Innsetning brást, gallaðir rpm-pakkar: %s
it: Installazione fallita, rpm difettosi: %s
nb: Installasjon mislyktes, dårlige pakker: %s
nl: Installatie mislukt, onjuiste rpms: %s
nn: Feil ved installering. Ugyldige RPM-pakkar: %s
pl: Instalacja nie powiodła się. Nieprawidłowe pakiety rpm: %s
pt: Instalação falhada, rpm danificado: %s
pt_br: A instalação falhou, rpms ruins: %s
ro: Instalare eșuată, pachete eronate: %s
ru: Не удалось установить; неверные rpm-файлы: %s
sl: Namestitev ni uspela, napaka v paketu rpm: %s
sq: Instalimi dështoi, rpms i keq: %s
sv: Installationen misslyckades, felaktiga rpm: %s
tr: Kurulum başarısız oldu. Hatalı rpm'ler: %s

source: There is not enough space on your filesystem to download all packages (%s needed, %s available). Are you sure you want to continue?
ast: Nun hai suficiente espaciu nel to sistema de ficheros pa baxar tolos paquetes (%s necesario, %s disponible). ¿De xuro que quies siguir?
cs: Na vašem souborovém systému není dost místa pro stažení všech balíčků (je potřeba %s, dostupné je %s). Opravdu chcete pokračovat?
da: Der er ikke nok plads i dit filsystem til at hente alle pakker (%s kræves, %s tilgængelig). Er du sikker på at du vil fortsætte?
el: Δεν υπάρχει αρκετός ελεύθερος χώρος στο σύστημά αρχείων σας για την λήψη όλων των πακέτων (%s χρειάζονται, %s διαθέσιμα). Είστε σίγουροι ότι θέλετε να συνεχίσετε;
es: No hay suficiente espacio en su sistema para descargar todos los paquetes (se necesita: %s, disponible: %s). ¿Esta seguro de continuar?
et: Teie failisüsteemis pole piisavalt ruumi kõigi pakettide allalaadimiseks (vaja on %s, saadaval %s). Kas tõesti jätkata?
eu: Zure fitxategi sisteman ez dago pakete guztiak jaisteko adinako leku (%s beharrezkoa, %s eskuragarri). Ziur zaude jarraitu nahi duzula?
fi: Järjestelmässä ei ole tarpeeksi vapaata tilaa kaikkien pakettien lataamiseksi (%s tarvitaan, %s vapaana). Jatketaanko?
fr: Il n'y a pas assez d'espace sur votre système de fichier pour télécharger tous les paquets (%s sont nécessaires, %s sont disponibles). Êtes-vous sur de vouloir continuer ?
hu: Nincs elég szabad terület a fájlrendszeren a szükséges csomagok letöltéséhez (%s van, %s kellene). Mindenképpen folytatja?
it: Non c'è abbastanza spazio nel filesistem per recuperare tutti i pacchetti (%s necessario, %s disponibile). Desideri comunque continuare?
nb: Det er ikke nok plass på filsystemet til å laste ned alle nødvendige pakker (%s trengs, %s tilgjengelig). Vil du fortsette?
nl: Er is onvoldoende ruimte op uw bestandssysteem om alle pakketten te downloaden (%s nodig, %s beschikbaar). Weet u zeker dat u door wilt gaan?
nn: Du har ikkje nok plass på harddisken til å lasta ned alle pakkane. Du treng %s, men har berre %s ledig. Er du sikker på at du vil halda fram?
pl: Nie ma wystarczającego miejsca na dysku, aby pobrać wszystkie pakiety (%s wymagane, %s dostępne). Czy na pewno chcesz kontynuować?
pt: Não existe espaço suficiente no seu sistema para transferir todos os pacotes (%s needed, %s available). Tem certeza que deseja continuar?
pt_br: Não a espaço suficiente em seu sistema de arquivos para baixar todos os programas (necessário %s, livre %s). Deseja continuar mesmo assim ?
ro: Nu dispuneți de destul spațiu liber pentru a descărca toate pachetele (%s necesari, %s disponibili). Sigur doriți să continuați?
ru: У вас недостаточно места для загрузки всех пакетов (%s необходимо, %s имеется). Вы уверены, что хотите продолжить?
sl: Na razdelku na disku ni dovolj prostora za prenos vseh paketov (potrebno %s, razpoložljivo %s). Ali res želite nadaljevati?
sq: Nuk ka hapësirë të mjaftueshme në skedarët tuaj për të shkarkuar të gjitha programet (%s duhet, %s disponueshëm). Jeni i sigurt se doni të vazhdoni?
sv: Det finns inte tillräckligt med utrymme på ditt filsystem för att ladda ner alla paket (%s behövs, %s tillgängligt). Är du säker du vill fortsätta?
tr: Tüm paketleri indirmek için dosya sisteminizde yeterli boş alan yok. (%s gerekli, %s boş alan var:) Devam etmek istediğinize emin misiniz?

source: The following package has bad signature
ast: El paquete siguiente tien una robla incorreuta
ca: El paquet següent té una signatura incorrecta
cs: Následující balíček má špatnou signaturu
cy: Mae gan y pecyn canlynol lofnod gwallus
da: Den følgende pakke har dårlig signatur
el: Το παρακάτω πακέτο έχει λανθασμένη υπογραφή
es: El siguiente paquete contienen una firma no válida
et: Järgmisel paketil on vigane signatuur
eu: Ondoko paketeak sinadura okerra dauka
fi: Seuraavalla paketilla on virheellinen allekirjoitus
fr: Le paquetage suivant a une signature invalide
gl: O seguinte paquete ten unha sinatura incorrecta
he: לחבילות הבאות יש בעיה בחתימות
hu: A következő csomag helytelen aláírást tartalmaz:
id: Paket berikut memiliki tandatangan yang cacat
is: Eftirfarandi pakki er með gallaða undirskrift
it: Questo pacchetto ha una firma errata
nb: Denne pakken har ugyldig signatur
nl: Het volgende pakket is voorzien van een onjuiste handtekening
nn: Denne pakken har ugyldig signatur
pl: Poniższy pakiet ma niepoprawny podpis
pt: O seguinte pacote tem uma assinatura inválida
pt_br: O seguinte programa contém assinaturas erradas
ro: Pachetul următor are semnătura greșită
ru: Следующий пакет имеет неверную подпись
sl: Naslednji paket ima napačen podpis
sq: Paketa e mëposhtme ka nënshkrimin e keq
sv: Följande paket har felaktig signatur
tr: Sonraki paketler hatalı imza içeriyor

source: The following packages have bad signatures
ast: El paquetes siguientes tienen una robla incorreuta
ca: Els paquets següents tenen signatures incorrectes
cs: Následující balíčky mají špatné signatury
cy: Mae gan y pecynnau canlynol lofnod gwallus
da: De følgende pakker har dårlige signaturer
el: Τα παρακάτω πακέτα έχουν λανθασμένες υπογραφές
es: Los siguientes paquetes contienen firmas no válidas
et: Järgmistel pakettidel on vigane signatuur
eu: Ondoko pakete hauek sinadura okerra dute
fi: Seuraavilla paketeilla on virheellinen allekirjoitus
fr: Les paquetages suivants ont des signatures non valides
gl: Os seguintes paquetes teñen sinaturas incorrectas
he: לחבילות הבאות יש בעיה בחתימות
hu: A következő csomagok helytelen aláírást tartalmaznak:
id: Paket berikut memiliki tandatangan yang cacat
is: Eftirfarandi pakkar eru með gallaðar undirskriftir
it: I seguenti pacchetti hanno delle firme errate
nb: Disse pakkene har ugyldige signaturer
nl: De volgende pakketten bevatten een onjuiste handtekening
nn: Desse pakkane har ugyldige signaturar
pl: Następujące pakiety zawierają niepoprawne podpisy
pt: Os seguintes pacotes têm assinaturas inválidas
pt_br: Os seguintes programas contêm assinaturas erradas
ro: Pachetele următoare au semnături greșite
ru: Следующие пакеты имеют неверные подписи
sl: Naslednji paketi imajo napačen podpis
sq: Pakot a radhitura kanë nënshkrime të pa pranueshëm
sv: Följande paket har felaktiga signaturer
tr: Sonraki paketler hatalı imza içeriyor

source: Do you want to continue installation ?
ast: ¿Quies siguir cola instalación?
ca: Voleu continuar la instal·lació?
cs: Chcete pokračovat v instalaci?
cy: Ydych chi am barhau gosod?
da: Ønsker du at fortsætte installationen?
el: Θέλετε να συνεχίσετε την εγκατάσταση ;
es: ¿Desea continuar con la instalación?
et: Kas jätkata paigaldusega?
eu: Instalatzen jarraitu nahi duzu?
fi: Jatka asennusta?
fr: Voulez-vous continuer l'installation ?
gl: ¿Desexa continuar ca instalación?
he: האם להמשיך בתהליך ההתקנה?
hu: Szeretné folytatni a telepítést?
id: Apakah Anda hendak melanjutkan instalasi ?
is: Viltu halda áfram með uppsetningu ?
it: Vuoi proseguire con l'installazione?
nb: Ønsker du å fortsette installasjonen?
nl: Wilt u doorgaan met de installatie?
nn: Vil du halda fram med å installera?
pl: Czy chcesz kontynuować instalację ?
pt: Deseja continuar a instalação?
pt_br: Você deseja continuar a instalação?
ro: Doriți să continuați instalarea?
ru: Продолжить установку?
sl: Ali želite nadaljevati namestitev?
sq: A dëshironi të vazhdoni me instalimin e tyre ?
sv: Vill du fortsätta installationen?
tr: Kuruluma devam etmek istiyor musunuz ?

source: Installation failed
ast: Falló la instalación
ca: La instal·lació ha fallat
cs: Chyba při instalaci
cy: Methodd y gosod
da: Installationen fejlede
el: Η εγκατάσταση απέτυχε
es: Falló la instalación
et: Paigaldamine nurjus
eu: Instalazioak huts egin du
fi: Asennus epäonnistui
fr: L'installation a échoué
gl: A instalación fallou
he: ההתקנה נכשלה
hu: A telepítés nem sikerült
id: Instalasi gagal
is: Innsetning brást
it: Installazione non riuscita
nb: Installasjon mislyktes
nl: Installatie mislukt
nn: Feil ved installering
pl: Instalacja nie powiodła się
pt: Instalação falhada
pt_br: A Instalação falhou
ro: Instalare eșuată
ru: Установка не удалась
sl: Namestitev ni uspela
sq: Instalimi dështio
sv: Installationen misslyckades
tr: Kurulum başarısız oldu.

source: removing installed rpms (%s)
ast: desaniciando rpms instalaos (%s)
ca: S'estan suprimint els rpms instal·lats (%s)
cs: odstraňují se instalované RPM balíčky (%s)
cy: tynnu rpm wedi eu gosod (%s)
da: fjerner installerede rpm'er (%s)
el: αφαίρεση των εγκατεστημένων rpm (%s)
es: quitando rpms instalandos (%s)
et: paigaldatud RPM-failide (%s) eemaldamine
eu: instalatutako rpm-ak ezabatzen (%s)
fi: Poistetaan asennetut paketit (%s)
fr: suppression des paquetages installés (%s)
gl: eliminando os rpms instalados (%s)
he: מסיר חבילות מותקנות (%s)
hu: telepített RPM-csomagok eltávolítása (%s)
is: fjarlægi uppsett rpm (%s)
it: rimozione degli rpm installati (%s)
nb: Fjerner installerte pakker (%s)
nl: verwijderen van geïnstalleerde rpms (%s)
nn: Fjernar installerte rpm-pakkar (%s).
pl: usuwanie zainstalowanych pakietów rpm (%s)
pt: a remover rpms instalados (%s)
pt_br: removendo rpms instalados (%s)
ro: se înlătură pachetele instalate (%s)
ru: удаляются установленные rpm-файлы (%s)
sl: odstranjevanje nameščenih rpm-jev (%s)
sq: heqja e rpms së instaluar (%s)
sv: tar bort installerade rpms (%s)
tr: kurulu rpm'ler (%s) kaldırılıyor.

source: Try to continue anyway?
ast: ¿Quies siguir de toes formes?
ca: Intentar continuar de totes maneres?
cs: Přesto zkusit pokračovat?
cy: Ymlaen beth bynnag?
da: Prøv at fortsætte alligevel?
el: Να προσπαθήσω να συνεχίσω ;
es: ¿Intentar continuar de todas maneras? (S/N)
et: Kas proovida siiski jätkata?
eu: Hala ere jarraitzen saiatu?
fi: Yritä joka tapauksessa?
fr: Essayer de continuer néanmoins ?
hu: Menjen mindenféleképp?
is: Reyna samt að halda áfram?
it: Proseguire comunque?
nb: Fortsette likevel?
nl: Toch proberen om door te gaan?
nn: Vil du prøva å halda fram likevel?
pl: Czy po mimo to chcesz kontynuować?
pt: Deseja continuar a tentar?
pt_br: Continuar mesmo assim?
ro: Continuați totuși?
ru: Попробовать в любом случае?
sl: Ali želite vseeno nadaljevati?
sq: Mundohuni të vazhdoni gjithsesi?
sv: Försök fortsätta ändå?
tr: Yine de devam edilsin mi?

source: installing %s from %s
ast: instalando %s dende %s
ca: s'està instal·lant %s des de %s
cs: instaluji %s z %s
cy: gosod %s o %s
da: installerer %s fra %s
el: εγκατάσταση %s από %s
es: instalando %s desde %s
et: %s paigaldamine andmekandjalt %s
eu: %s %s-tik instalatzen
fi: Asennetaan %s sijainnista %s
fr: installation de %s depuis %s
gl: instalando %s dende %s
he: מתקין את %s מתוך %s
hu: %s telepítése innen: %s
id: menginstall %s dari %s
is: set inn %s frá %s
it: installazione di %s da %s
nb: Installerer %s fra %s
nl: installeren van %s vanaf %s
nn: Installerer %s frå %s.
pl: instalowanie %s z %s
pt: a instalar %s de %s
pt_br: instalando %s a partir de %s
ro: se instalează %s din %s
ru: устанавливается %s из %s
sl: nameščanje %s iz %s
sq: Instalimi %s nga %s
sv: installerar %s från %s
tr: %s, %s konumundan kuruluyor

source: installing %s
ast: instalando %s
ca: s'està instal·lant %s
cs: instaluji %s
cy: gosod %s
da: installerer %s
el: εγκατάσταση %s
es: instalando %s
et: %s paigaldamine
eu: %s instalatzen
fi: Asennetaan %s
fr: installation de %s
gl: instalando %s
he: מתקין %s
hu: %s telepítése folyik
id: menginstall %s
is: Set inn %s
it: installazione di %s
nb: Installerer %s
nl: installeren van %s
nn: Installerer %s.
pl: instalowanie %s
pt: a instalar %s
pt_br: instalando %s
ro: se instalează %s
ru: устанавливается %s
sl: nameščanje %s
sq: instalimi i %s
sv: installerar %s
tr: %s kuruluyor

source: distributing %s
ast: distribuyendo %s
ca: s'està distribuint %s
cs: distribuuji %s
cy: dosbarthu %s
da: distribuerer %s
el: κατανομή %s
es: distribuyendo %s
et: %s jaotamine
eu: %s banatzen
fi: Levitetään %s
fr: distribution de %s
gl: distribuíndo %s
he: מפיץ %s
hu: %s elosztása
id: sebarkan %s
is: miðla %s
it: distribuzione di %s
nb: fordeler %s
nl: distribueren van %s
nn: Fordeler %s.
pl: rozpowszechnianie %s
pt: a distribuir %s
pt_br: distribuindo %s
ro: se distribuie %s
ru: распределяется %s
sl: porazdeljevanje %s
sq: shpërndarje e %s
sv: distribuerar %s
tr: %s dağıtılıyor

source: Try installation without checking dependencies?
ast: ¿Intentar instalar ensin verificar les dependencies?
ca: Intentar la instal·lació sense comprovar dependències?
cs: Pokusit se o instalaci bez kontroly závislostí?
cy: Ceisio gosod heb wirio dibyniaethau?
da: Prøv installation uden at tjekke afhængigheder?
el: Προσπάθεια για εγκατάσταση χωρίς έλεγχο των εξαρτήσεων ;
es: ¿Intentar la instalación sin verificar las dependencias? (S/N)
et: Kas proovida paigaldust ilma sõltuvusi kontrollimata?
eu: Mendekotasunak egiaztatu gabe instalatzen saiatu nahi duzu?
fi: Yritetäänkö asentaa tarkistamatta riippuvuuksia (k/E)?
fr: Essayer d'installer sans vérifier les dépendances ?
hu: Próbáljam meg a telepítést a függőségek ellenőrzése nélkül?
is: Prófa innsetningu án þess að athuga hvaða skrár þarf?
it: Provo l'installazione senza controllare le dipendenze?
nb: Prøve å installere uten å sjekke avhengigheter?
nl: Proberen te installeren zonder de afhankelijkheden te controleren?
nn: Vil du installera utan å kontrollera avhengnader?
pl: Próbować instalować bez sprawdzania zależności?
pt: Tentar instalação sem verificar dependências?
pt_br: Tentar instalar sem checar as dependências?
ro: Se încearcă instalarea fără verificarea dependențelor?
ru: Попробовать установить без проверки зависимостей?
sl: Poskusim z namestitvijo brez preverjanj odvisnosti?
sq: Provoni të instaloni pa kontrolluar varësitë?
sv: Prova att installera utan att kontrollera behov av andra filer?
tr: Paket bağımlılıklarını denetlemeksizin kurulum denensin mi?

source: Try harder to install (--force)?
ast: ¿Intentar instalar en mou forciáu (--force)?
cs: Pokusit se o instalaci razantněji (--force)?
cy: Mwy o orfodaeth gyda'r gosod? (--force)?
da: Prøv endnu hårdere at installere (--force)?
el: Προσπάθεια για εξαναγκαστική εγκατάσταση (--force);
es: ¿Forzar la instalación (--force)? (S/N)
et: Kas proovida paigaldust veel jõulisemalt (--force)?
eu: Instalaketa behartu (--force)?
fi: Yritetäänkö pakottaa asennus (--force) (k/E)?
fr: Essayer de forcer l'installation (--force) ?
hu: Ha problémát okozhat, akkor is legyen telepítés (--force)?
is: Prófa sterkari innsetningu (--force)?
it: Provo l'installazione in modo ancora più forzato (--force)?
nb: Prøve ennå hardere å installere (--force)?
nl: Installatie trachten te forceren (--force)?
nn: Vil du prøva endå sterkare å installera («--force»)?
pl: Czy chcesz spróbować wymusić instalację (--force)?
pt: Tentar forçar a instalação (--force)?
pt_br: Forçar instalação (--force)?
ro: Se încearcă instalarea forțată (--force)?
ru: Попробовать принудительную установку (--force)?
sl: Poskusim s prisilno namestitvijo (--force)?
sq: Provo më shumë për ta instaluar (--force)?
sv: Försök ännu hårdare att installera (--force)?
tr: Belki daha zorlayıcı bir seçenek gerekebilir (--force)?

source: Packages are up to date
ast: Los paquetes tan anovaos
ca: Els paquets estan actualitzats
cs: Balíčky jsou aktuální
cy: Mae'r pecynnau'n rhai diweddaraf
da: Pakkerne er af nyeste version
el: Τα πακέτα είναι ενημερωμένα
es: Los paquetes están actualizados
et: Pole ühtegi paketti uuendada
eu: Paketeak egunean daude
fi: Paketit ovat ajantasalla
fr: Les paquetages sont à jour
gl: Os paquetes están actualizados
he: החבילות עדכניות
hu: A csomagok naprakészek
id: Paket-paket sudah update
is: Pakkar eru uppfærðir
it: I pacchetti sono aggiornati
nb: Pakkene er i siste versjon
nl: Pakketten zijn bijgewerkt
nn: Pakkane er alt i nyaste versjon.
pl: Oprogramowanie jest zaktualizowane
pt: Os pacotes estão actualizados
pt_br: Pacotes estão atualizados
ro: Pachetele sînt actualizate
ru: Пакеты находятся в актуальном состоянии
sl: Paketi so posodobljeni
sq: Paketat janë të përditësuara
sv: Paket är uppdaterade
tr: Paketler güncel

source: Installation is possible
ast: Ye posible la instalación
ca: La instal·lació és possible
cs: Instalace je možná
cy: Gosod yn bosibl
da: Installation er mulig
el: Η εγκατάσταση είναι δυνατή
es: Es posible la instalación
et: Paigaldamine on võimalik
eu: Instalazioa posible da
fi: Asennus on mahdollinen
fr: L'installation est possible
gl: A instalación é viable
he: ניתן לבצע את ההתקנה
hu: A telepítés elvégezhető
id: Installasi dimungkinkan
is: Innsetning er möguleg
it: L'installazione è possibile
nb: Installasjon er mulig
nl: Installatie is mogelijk
nn: Det går an å installera.
pl: Instalacja jest możliwa
pt: A instalação é possível
pt_br: Instalação é possível
ro: Instalarea este posibilă
ru: Установка возможна.
sl: Namestitev je mogoča
sq: Instalimi është i mundur
sv: Installation är möjlig
tr: Kurulum mümkün

source: warning: md5sum for %s unavailable in MD5SUM file
ast: avisu: md5sum pa %s nun ta disponible nel ficheru MD5SUM
ca: atenció: l'md5sum de %s no està disponible al fitxer MD5SUM
cs: varování: kontrolní součet md5sum pro %s není k dispozici v souboru MD5SUM
cy: rhybudd: nid yw md5sum ar gyfer %s ar gael yn ffeil MD5SUM
da: advarsel: md5sum for %s er ikke tilgængelig i MD5SUM-fil
el: προειδοποίηση: μη διαθέσιμο md5sum για %s στο αρχείο MD5SUM
es: atención: md5sum para %s no está disponible en el fichero MD5SUM
et: hoiatus: MD5SUM failis puudub %s MD5 kontrollsumma
eu: oharra: %s-rentzako md5sum ezin da eskuratu MD5SUM fitxategian
fi: Varoitus: MD5SUM-tiedostosta ei löydy tarkistussummaa kohteelle %s
fr: attention : le MD5 pour %s est indisponible dans le fichier MD5SUM
gl: advertencia: o md5sum para %s non está dispoñible no ficheiro MD5SUM
he: אזהרה: חתימת md5sum עבור %s לא זמינה בקובץ MD5SUM
hu: figyelmeztetés: a(z) %s ellenőrzőösszege nincs benne az MD5SUM fájlban
id: peringatn: md5sum untuk %s tidak tersedia pada file MD5SUM
is: aðvörun: md5 gátsumma fyrir %s ekki til í MD5SUM skrá
it: attenzione: il file MD5SUM non fornisce la md5sum per %s
nb: advarsel: md5sum for %s er ikke tilgjengelig i fila MD5SUM
nl: waarschuwing: md5sum voor %s niet beschikbaar in MD5SUM-bestand
nn: Åtvaring: md5summen for «%s» er ikkje tilgjengeleg i MD5SUM-fila.
pl: ostrzeżenie: md5sum dla %s jest niedostępna w pliku MD5SUM
pt: aviso: md5sum para %s não disponível no ficheiro MD5SUM
pt_br: aviso: o arquivo MD5SUM não contém o md5sum para %s
ro: atenție: md5sum pentru %s este indisponibil în fișierul MD5SUM
ru: предупреждение: в файле MD5SUM нет md5-суммы для %s
sl: opozorilo: vsote MD5 za %s ni v datoteki MD5SUM
sq: paralajmërim: md5sum për %s i pa-disponueshëm në skedarin MD5SUM
sv: varning: md5sum för %s finns ej i MD5SUM filen
tr: uyarı: %s için md5sum, MD5SUM dosyasında mevcut değil.
