Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/u/urpmi/po/*.po
Languages: ast, ca, cs, cy, da, el, es, et, eu, fi, fr, gl, he, hu, id, is, it, nb, nl, nn, pl, pt, pt_br, ro, ru, sl, sq, sv, tr

source: --downloader - program to use to retrieve distant files. known programs: %s
ast: --downloader - programa pa baxar ficheros remotos. programes conocíos: %s
cs: --downloader - použít program pro čtení vzdálených souborů. známé programy: %s
cy: --downloader - rhaglen i'w defnyddio ar gyfer estyn ffeiliau pell. rhaglenni hysbys: %s
da: --downloader - program som skal bruges for at hente filer over nettet. kendte programmer: %s
el: --downloader - χρήση προγράμματος για λήψη απομακρυσμένων αρχείων. γνωστά προγράμματα: %s
es: --downloader - programa a usar para descargar archivos remotos. programas conocidos: %s
et: --downloader - programm võrgufailide tõmbamiseks. saadaolevad programmid: %s
eu: --downloader - urruneko fitxategiak berreskuratzeko erabili beharreko programa. programa ezagunak: %s
fi: --downloader - etätiedostojen hakemiseen käytettävä ohjelma. tunnetut ohjelmat: %s
fr: --downloader - programme à utiliser pour le téléchargement. programmes connus : %s
gl: --downloader - programa a usar para obter ficheiros distantes. programas coñecidos: %s
hu: --downloader - program a szükséges fájlok letöltéséhez. ismert programok: %s
is: --downloader - forrit sem á að nota til að sækja fjarlægar skrár. þekkt forrit: %s
it: --downloader - programma da usare per recuperare i file remoti. programmi noti: %s
nb: --downloader - program som skal brukes for hente fjerntliggende filer. Kjente program: %s
nl: --downloader - programma voor het ophalen van bestanden op afstand. bekende programma's: %s
nn: --downloader – Program for å lasta ned filer. Kjende program: %s
pl: --downloader - program wykorzystywany do pobierania zdalnych plików. programy do wyboru: %s
pt: --downloader - programa a usar para transferir ficheiros distantes. programas conhecidos: %s
pt_br: --downloader - programa para baixar arquivos remotos. programas conhecidos: %s
ro: --downloader - programul utilizat pentru descărcarea fișierelor distante. programe cunoscute: %s
ru: --downloader - программа для загрузки файлов доступные программы: %s
sl: --downloader - program za prenos oddaljenih datotek. znani programi: %s
sv: --downloader - program för hämtning av fjärr-filer. kända program: %s
tr: --downloader - dosyaları indirmek için kullanılacak yazılım. bilinen yazılımlar: %s

source: --curl-options - additional options to pass to curl
ast: --curl-options - opciones adicionales pa pasar a curl
cs: --curl-options - další volby k programu curl
cy: --curl-options - dewis ychwanegol wrth ddefnyddio curl
da: --curl-options - ekstra valg som skal gives til curl
el: --curl-options - πρόσθετες επιλογές για πέρασμα στο curl
es: --curl-options - opciones adicionales para curl
et: --curl-options - curl'i lisavõtmed
eu: --curl-options - curl-i aukera gehiago pasatzeko
fi: --curl-options - välitä ohjelmalle curl lisävalintoja.
fr: --curl-options - options supplémentaires à passer à curl
gl: --curl-options - opcións adicionais para pasarlle a curl
hu: --curl-options - további opciók a Curl program számára
id: --curl-options - opsi tambahan untuk dikirimkan ke curl
is: --curl-options - aukalegir valkostir fyrir curl forritið
it: --curl-options - opzioni aggiuntive da passare a curl
nb: --curl-options – tilleggsvalg som gis til curl
nl: --curl-options - extra opties om aan curl door te geven
nn: --curl-options – Tilleggsval som skal sendast til «curl».
pl: --curl-options - dodatkowe opcje dla curl
pt: --curl-options - opções adicionais para passar para curl
pt_br: --curl-options - opções adicionais para passar ao curl
ro: --curl-options - opțiuni adiționale de plasat lui curl
ru: --curl-options - дополнительные параметры, передаваемые в программу curl
sl: --curl-options - dodatne možnosti za curl
sv: --curl-options - tilläggsparametrar åt curl
tr: --curl-options - curl için ek özellikler

source: --rsync-options- additional options to pass to rsync
ast: --rsync-options - opciones adicionales pa pasar a rsync
cs: --rsync-options- další volby k programu rsync
cy: --rsync-options- dewis ychwanegol wrth ddefnyddio rsync
da: --rsync-options- ekstra valg som skal gives til rsync
el: --rsync-options- πρόσθετες επιλογές για πέρασμα στο rsync
es: --rsync-options - opciones adicionales para pasar a rsync
et: --rsync-options- rsync'i lisavõtmed
eu: --rsync-options- rsync-i aukera gehigarriak pasatzeko
fi: --rsync-options- välitä ohjelmalle rsync lisävalintoja.
fr: --rsync-options- options supplémentaires à passer à rsync
gl: --rsync-options- opcións adicionais para pasarlle a rsync
hu: --rsync-options- további opciók az Rsync program számára
id: --rsync-options - opsi tambahan untuk dikirimkan ke rsync
is: --rsync-options- aukalegir valkostir fyrir rsync forritið
it: --rsync-options - opzioni aggiuntive da passare ad rsync
nb: --rsync-options – tilleggsvalg som gis til rsync
nl: --rsync-options- extra opties om aan rsync door te geven
nn: --rsync-options– Tilleggsval som skal sendast til «rsync».
pl: --rsync-options- dodatkowe opcje dla rsync
pt: --rsync-options - opções adicionais para passar para rsync
pt_br: --rsync-options- opções adicionais para passar ao rsync
ro: --rsync-options- opțiuni adiționale de plasat lui rsync
ru: --rsync-options- дополнительные параметры, передаваемые в программу rsync
sl: --rsync-options- dodatne možnosti za rsync
sv: --rsync-options- tilläggsparametrar åt rsync
tr: --rsync-options- rsync için ek özellikler

source: --wget-options - additional options to pass to wget
ast: --wget-options - opciones adicionales pa pasar a wget
cs: --wget-options - další volby k programu wget
cy: --wget-options - dewis ychwanegol wrth ddefnyddio wget
da: --wget-options - ekstra valg som skal gives til wget
el: --wget-options - πρόσθετες επιλογές για να περάσετε στο wget
es: --wget-options - opciones adicionales para pasar a wget
et: --wget-options - wget'i lisavõtmed
eu: --wget-options - wget-i aukera gehigarriak pasatzeko
fi: --wget-options - välitä ohjelmalle wget lisävalintoja.
fr: --wget-options - options supplémentaires à passer à wget
gl: --wget-options - opcións adicionais para pasarlle a wget
hu: --wget-options - további opciók a Wget program számára
id: --wget-options - opsi tambahan untuk dikirimkan ke wget
is: --wget-options - aukalegir valkostir fyrir wget forritið
it: --wget-options - opzioni aggiuntive da passare a wget
nb: --wget-options – tilleggsvalg som gis til wget
nl: --wget-options - extra opties om aan wget door te geven
nn: --wget-options – Tilleggsval som skal sendast til «wget».
pl: --wget-options - dodatkowe opcje dla wget
pt: --wget-options - opções adicionais para passar para wget
pt_br: --wget-options - opções adicionais para passar ao wget
ro: --wget-options - opțiuni adiționale de plasat lui wget
ru: --wget-options - дополнительные параметры, передаваемые в программу wget
sl: --wget-options - dodatne možnosti za wget
sv: --wget-options - tilläggsparametrar åt wget
tr: --wget-options - wget için ek özellikler

source: --prozilla-options - additional options to pass to prozilla
ast: --prozilla-options - opciones adicionales pa pasar a prozilla
cs: --prozilla-options - další volby k programu prozilla
cy: --cprozilla-options - dewis ychwanegol wrth ddefnyddio prozilla
da: --prozilla-options - ekstra valg som skal gives til prozilla
el: --prozilla-options - πρόσθετες επιλογές για να περάσετε στο prozilla
es: --prozilla-options - opciones adicionales para pasar a prozilla
et: --prozilla-options - prozilla lisavõtmed
eu: --prozilla-options - prozilla-i aukera gehiago pasatzeko
fi: --prozilla-options - välitä ohjelmalle prozilla lisävalintoja.
fr: --prozilla-options - options supplémentaires à passer à prozilla
gl: --prozilla-options - opcións adicionais para pasarlle a prozilla
hu: --prozilla-options - további opciók a Prozilla program számára
id: --prozilla-options - opsi tambahan untuk dikirimkan ke prozilla
is: --prozilla-options - aukalegir valkostir fyrir prozilla forritið
it: --prozilla-options - opzioni aggiuntive da passare a prozilla
nb: --prozilla-options – tilleggsvalg som gis til prozilla
nl: --prozilla-options - extra opties om aan prozilla door te geven
nn: --prozilla-options – Tilleggsval som skal sendast til «prozilla».
pl: --prozilla-options - dodatkowe opcje prozilli
pt: --prozilla-options - opções adicionais para passar para o prozilla
pt_br: --prozilla-options - opções adicionais para passar ao prozilla
ro: --prozilla-options - opțiuni adiționale de plasat lui prozilla
ru: --prozilla-options - дополнительные параметры, передаваемые в программу prozilla
sl: --prozilla-options - dodatne možnosti za prozilla
sv: --prozilla-options - tilläggsalternativ för prozilla
tr: --prozilla-options - prozilla için ek özellikler

source: --aria2-options - additional options to pass to aria2
ast: --aria2-options - opciones adicionales pa pasar a aria2
cs: --aria2-options - další volby předané programu aria2
cy: --aria2-options -dewis ychwanegol i'w estyn i aria2
da: --aria2-options - ekstra valg som skal gives til aria2
el: --aria2-options - πρόσθετες επιλογές για να περάσετε στο aria2
es: --aria2-options - opciones adicionales para pasar a aria2
et: --aria2-options - aria2 lisavõtmed
eu: --aria2-options - aria2-ri pasatzeko aukera osagarriak
fi: --aria2-options - välitä ohjelmalle aria2 lisävalintoja.
fr: --aria2-options - options supplémentaires à passer à aria2
gl: --aria2-options - opcións adicionais para pasarlle a aria2
hu: --aria2-options - további opciók az aria2 program számára
is: --aria2-options - aukalegir valkostir fyrir forritið aria2
it: --aria2-options - opzioni aggiuntive da passare ad aria2
nb: --aria2-options – tilleggsvalg som kan gis til aria2
nl: --aria2-options - extra opties om aan aria2 door te geven
nn: --aria2-options – Tilleggsval å senda til aria2.
pl: --aria2-options - dodatkowe opcje aby przejść do aria2
pt: --aria2-options - opções adicionais para passar para o aria2
pt_br: --aria2-options - opções adicionais para passar ao aria2
ro: --aria2-options - opțiuni adiționale de plasat lui aria2
ru: --aria2-options- дополнительные параметры, передаваемые в программу aria2
sl: --aria2-options - dodatne možnosti za aria2
sv: --aria2-options - tilläggsalternativ för aria2
tr: --aria2-options - aria2 için ek özellikler

source: --limit-rate - limit the download speed.
ast: --limit-rate - llimitar la velocidá de baxada.
ca: --limit-rate - limita la velocitat de descàrrega.
cs: --limit-rate - omezení rychlosti stahování
cy: --limit-rate - cyfyngu cyflymder y llwytho i lawr.
da: --limit-rate - begræns hastighed på hentning.
el: --limit-rate - περιόρισε την ταχύτητα λήψης.
es: --limit-rate - limitar la velocidad de descarga.
et: --limit-rate - piirab allalaadimiskiirust.
eu: --limit-rate - deskarga-abiadura mugatzen du.
fi: --limit-rate - rajoita latausnopeutta.
fr: --limit-rate - limiter la vitesse de téléchargement.
gl: --limit-rate - limita a velocidade de descarga.
hu: --limit-rate - a letöltési sebesség korlátozása
id: --limit-rate - batasi kecepatan download.
is: --limit-rate - takmarka hraða niðurhals.
it: --limit-rate - limita la velocità di recupero.
nb: --limit-rate – begrens nedlastningshastighet.
nl: --limit-rate - de download snelheid begrenzen.
nn: --limit-rate – Avgrens nedlastingsfart.
pl: --limit-rate - ogranicza szybkość pobierania.
pt: --limit-rate - limita a velocidade de transferência.
pt_br: --limit-rate - limita a velocidade do download.
ro: --limit-rate - limitează viteza de descărcare.
ru: --limit-rate - ограничить скорость загрузки
sl: --limit-rate - omeji hitrost prenašanja.
sq: --limit-rate - kyfizimi i shpëjtësisë së shkarkimit.
sv: --limit-rate - begränsa nedladdningshastigheten.
tr: --limit-rate - indirme hızını kısıtla.

source: --resume - resume transfer of partially-downloaded files (--no-resume disables it, default is disabled).
ast: --resume - resumir tresferencia de ficheros baxaos parcialmente (--no-resume lo desactiva, que ye lo predetermináu).
cs: --resume - obnoví přenos částečně stažených souborů (--no-resume obnovení zakáže, ve výchozím stavu zakázáno)
cy: --verify-rpm - gwirio llofnod rpm cyn gosod (--no-verify-rpm analluogi, galluogi yw'r rhagosodedig)
da: --resume - genoptag overførsel af delvist hentede filer (--no-resume deaktiverer det, standard er deaktiveret).
el: --resume - ανάκτηση της λήψης ελλιπών αρχείων (--no-resume το απενεργοποιεί, από προεπιλογή είναι απενεργοποιημένο).
es: --resume - resumir transferencia de archivos descargados parcialmente (--no-resume lo deshabilita, que es lo predeterminado).
et: --resume - taasalustatakse osaliselt alla tõmmatud failide tõmbamist (--no-resume tühistab selle, vaikimisi on väljas).
eu: --resume - partzialki deskargatutako fitxategien transferentziari berriro ekiten dio ('--no-resume'-k hori desgaitzen du; lehenetsia desgaituta da).
fi: --resume - jatka osittain noudettujen tiedostojen noutamista (--no-resume poistaa käytöstä, vakiona ei käytössä).
fr: --resume - reprendre le transfert des fichiers incomplets (--no-resume le désactive, il est désactivé par défaut).
gl: --resume - recomezar a transferencia de ficheiros descargados parcialmente (--no-resume desactívaa, por defecto está desactivada).
he: --resume - המשך בהורדת קבצים שהורדו חלקית מנקודת ההפסקה (--no-resume מנטרל זאת, ברירת המחדל היא "מנוטרל").
hu: --resume - részlegesen letöltött fájlok átvitelének folytatása (a --no-resume kikapcsolja; alapértelmezésben kikapcsolt)
id: --resume - lanjutkan transfer dari file yang sudah didownload (--no-resume menonaktifkannya, defaultnya nonaktif).
is: --resume - halda áfram að sækja skrár sem hafa verið sóttar að hluta (--no-resume - sem er sjálfgefið - aftengir þetta).
it: ..--resume - riprende il trasferimento dei file parzialmente recuperati (--no-resume lo disabilita, questa è l'opzione predefinita).
nb: --resume – gjenoppta overføring av delvis nedlastede filer. (bruk --no-resume for å slå av, standard er avslått.
nl: --resume -laden hervatten van gedeeltelijk geladen bestand (--no-resume schakelt dit uit, standaard uitgeschakeld).
nn: --resume – Ta opp att delvis nedlasta filer. (Bruk «--no-resume» for å slå av. Standard er avslått.)
pl: --resume - wznawia przesyłanie częściowo pobranych plików (--no-resume wyłącza funkcję, domyślnie wyłączoną).
pt: --resume - resume a transferência dos ficheiros parcialmente transferidos (--no-resume desactiva o resumo, activo por predefinição).
pt_br: --resume - reinicia a transferência de arquivos parcialmente baixados (--no-resume desabilita isso, o padrão é desabilitado).
ro: --resume - reia transferul fișierelor descărcate parțial. (--no-resume o dezactivează, implicit este dezactivată).
ru: --resume - возобновить загрузку частично загруженных файлов (--no-resume отключает её; по умолчанию отключена)
sl: --resume - nadaljuj prenos delno prenesenih datotek (privzeto je onemogočeno, --no-resume to onemogoči).
sv: --resume - återuppta nedladdning av delvis nedladdade filer (--no-resume inaktiverar det, som standard är det inaktiverat).
tr: --resume - kısmen indirilmiş dosyaların aktarımına devam eder. (--no-resume bunu devre dışı bırakır. Varsayılan devre dışı'dır.)

source: --proxy - use specified HTTP proxy, the port number is assumed to be 1080 by default (format is <proxyhost[:port]>).
ast: --proxy - usar proxy HTTP especificáu, asume que'l puertu ye 1080 por defeutu (formatu <hostproxy[:puertu]>).
ca: --proxy - utilitza el proxy HTTP especificat, el número de port s'assumeix que és el 1080 per defecte (el format és <ordinadorcentralproxy[:port]>).
cs: --proxy - použij zadanou HTTP proxy, číslo portu se předpokládá 1080, jako výchozí (formát je <proxyhost[:port]>)
cy: --proxy - defnyddio'r dirprwy HTTP enwyd, rhif y porth trwy rhagosodiad yw 1080 (fformat yw <proxyhost[:port]>).
da: --proxy - brug den angivne HTTP proxy, portnummeret antages at være 1080 som standard (formatet er <proxyvært[:port]>).
el: --proxy - χρήση καθορισμένου HTTP proxy, ο αριθμός της θύρας θεωρείται ότι είναι από προεπιλογή ο 1080 (η μορφή είναι <proxyhost[:port]>).
es: --proxy - usar proxy HTTP especificado, se asume que el puerto es 1080 por defecto (formato <hostproxy[:puerto]>).
et: --proxy - kasutatakse määratud HTTP-puhverserverit, pordinumber on eeldatavalt vaikimisi 1080 (vorming on <puhverserver[:port]>).
eu: --proxy - HTTP proxy espezifikoa erabiltzen du, ataka-zenbakiak 1080 izan behar du lehenespenez (formatua hau da: <proxy-ostalaria[:ataka]>).
fi: --proxy - käytä määriteltyä HTTP-välityspalvelinta, oletusportti on 1080 (muodossa <välityspalvelin[:portti]>).
fr: --proxy - utiliser le proxy HTTP indiqué, le n° de port étant 1080 à défaut d'indication (format <proxy[:port]>).
gl: --proxy - usa o proxy HTTP especificado, e asúmese que o número de porto é o 1080 por defecto (o formato é <máquinaproxy[:porto]>).
hu: --proxy - a megadott HTTP proxy használata; a portszám alapértelmezés szerint 1080 (formátum: <proxygép[:port]>)
id: --proxy - gunakan proxy HTTP tertentu, nomor port dianggap 1080 secara standar (format <hostproxy[:port]>).
is: --proxy - nota tilgreindan HTTP staðgengil, portið er sjálfgefið 1080 (sniðið er <staðgengill[:port]>).
it: --proxy - usa il proxy HTTP specificato, il numero di porta predefinito è1080 (formato: <proxyhost[:port]>).
nb: --proxy – bruk spesifisert HTTP-mellomtjener, portnummeret antas å være 1080 som standard (format er <tjenernavn[:port]>).
nl: --proxy - gebruik specifieke HTTP proxy, het standaard poort nummer is 1080 (formaat is <proxyhost[:poort]>).
nn: --proxy – Bruk valt HTTP-mellomtenar. Standard portnummer: 1080. (Format: <tenarnamn[:port]>.)
pl: --proxy - używa wybranego pośrednika HTTP, domyślnym portem jest port 1080 (format <serwerproxy[:port]>).
pt: --proxy - usa o 'proxy' HTTP indicado, por predefinição assume-se que o numero do porto seja 1080 (o formato é <maquinaproxy[:porto]>).
pt_br: --proxy - usa o proxy HTTP especificado, o número da porta é 1080 por padrão (o formato é <máquinaproxy[:porta]>).
ro: --proxy - utilizează proxyul HTTP specificat, numărul portului este considerat a fi implicit 1080 (formatul este <gazdăproxy[:port]>).
ru: --proxy - использовать указанный HTTP-прокси; по умолчанию используется порт 1080 (формат - <хост_прокси[:порт]>)
sl: --proxy - uporabi naveden HTTP posredniški strežnik, vrata so privzeto 1080 (oblika je <posredniški_strežnik[:vrata]>).
sq: --proxy - përdore proxy HTTP, numri i portës është i supozuar të jetë 1080 në marrëveshje (forma është <proxyhost[:port]>).
sv: --proxy - använd specificerad HTTP-proxy, portnumret antas vara 1080 som standard (formatet är <proxydator[:port]>).
tr: --proxy - belirli HTTP vekil sunucusu kullan, port numarası varsayılan olan 1080 kabul edilecek (biçim <vekilsunucu[:port]>).

source: --proxy-user - specify user and password to use for proxy authentication (format is <user:password>).
ast: --proxy-user - especificar usuariu y contraseña pa usar na autenticación del proxy (formatu <usuariu:contraseña>).
ca: --proxy-user - especifica l'usuari i la contrasenya per a utilitzar l'autenticació del proxy (el format és <usuari:contrasenya>).
cs: --proxy-user - uživatel a heslo, které se má použít u ověření proxy (formát je <uživatel:heslo>)
cy: --proxy-user - enwi defnyddiwr a chyfrinair i'w ddefnyddio fel y dilysiad dirprwy (fformat yw <user:password>).
da: --proxy-user - angiv bruger og adgangskode til brug for kontrol af proxy (formatet er <bruger:adgangskode>).
el: --proxy-user - καθορίζει τον χρήστη και τον κωδικό πρόσβασης που θα χρησιμοποιηθεί για την ταυτοποίηση στον διαμεσολαβητή (η μορφή είναι <user:password>).
es: --proxy-user - especificar usuario y contraseña para utilizar en la autenticación del proxy (formato <usuario:contraseña>).
et: --proxy-user - kasutajanime ja parooli määramine puhverserveri autentimiseks (vorming: <kasutajanimi:parool>).
eu: --proxy-user - zehaztu proxy-aren autentifikazioan erabiltzeko erabiltzailea eta pasahitza (formatua hau da: <erabiltzailea:pasahitza>).
fi: --proxy-user - määrittele välityspalvelimen todentamisessa käytettävä käyttäjätunnus ja salasana (muodossa <tunnus:salasana>).
fr: --proxy-user - spécifier l'utilisateur et le mot de passe pour l'authentification sur le proxy (<utilisateur:motdepasse>).
gl: --proxy-user - especifica o usuario e o contrasinal que se usará para autenticarse no proxy (o formato é <usuario:contrasinal>).
hu: --proxy-user - proxyhoz használandó felhasználónév és jelszó (formátum: <felhasználónév:jelszó>)
id: --proxy-user - tentukan user dan katakunci untuk otentikasi proxy (format <user:katakunci>).
is: --proxy-user - skilgreindu staðgengils-notanda og lykilorð fyrir auðkenningu (snið er <user:password>).
it: --proxy-user - specifica utente e password da utilizzare per l'autenticazione col proxy (formato: <utente:password>).
nb: --proxy-user – spesifiser bruker og passord til bruk for mellomtjener autentisering (format er <bruker:passord>).
nl: --proxy-user - specificeer gebruikersnaam en wachtwoord voor proxy- aanmelding (formaat is <gebruiker:wachtwoord>).
nn: --proxy-user – Vel brukar og passord for mellomtenar- autentisering. (Format: <brukar:passord>.)
pl: --proxy-user - określa użytkownika i hasło używane do uwierzytelnienia na serwerze pośredniczącym (format <użytkownik:hasło>)
pt: --proxy-user - indica o utilizador e a senha para usar na autenticação do 'proxy' (o formato é <utilizador:senha>).
pt_br: --proxy-user - especifica usuário e senha para usar na autenticação do proxy (o formato é <usuário:senha>).
ro: --proxy-user - specificați utilizatorul și parola pentru autentificarea pe proxy (formatul este <utilizator:parolă>).
ru: --proxy-user - пользователь и пароль для аутентификации на прокси (формат - <пользователь:пароль>)
sl: --proxy-user - določi uporabnika in geslo za uporabo overitve pri posredniškem strežniku (format je <uporabnik:geslo>).
sq: --proxy-user - specifiko përdoruesin dhe parullën për përdorimin e proxy me vërtetim (forma është <user:password>).
sv: --proxy-user - ange användare och lösenord för proxy- autentisering (formatet är <användare:lösenord>).
tr: --proxy-user - vekil sunucu kimlik denetimi için kullanıcı adı ve parola belirtin (biçim <kullanıcıadı:parola>).
