Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/L/Liveman/i18n/Liveman.*.po
Languages: ru_en

source: Liveman - компиллятор из markdown в тесты и документацию
ru_en: Liveman - compiler from Markdown to tests and documentation

source: Файл lib/Example.md:
ru_en: File lib/Example.md:

source: Тест:
ru_en: Test:

source: Проблема современных проектов в том, что документация оторвана от тестирования. Это значит, что примеры в документации могут не работать, а сама документация может отставать от кода.
ru_en: The problem of modern projects is that the documentation is torn from testing. This means that the examples in the documentation may not work, and the documentation itself can lag behind the code.

source: Liveman компилирует файлы `lib/**.md` в файлы `t/**.t` и добавляет документацию в раздел `__END__` модуля к файлам `lib/**.pm`.
ru_en: LiveMan compiles `Lib/**.md` to files `t/**.t` And adds the documentation to the `__END__` module to the files `lib/**.pm`.

source: Используйте команду `liveman` для компиляции документации к тестам в каталоге вашего проекта и запускайте тесты:
ru_en: Use the `Liveman 'command to compilation of documentation for tests in the catalog of your project and start tests:

source: Запустите его с покрытием.
ru_en: Run it with a coating.

source: Опция `-o` открывает отчёт о покрытии кода тестами в браузере (файл отчёта покрытия: `cover_db/coverage.html`).
ru_en: The `-o` option opens a report on covering code with tests in a browser (coating report file:` cover_db/coverage.html`).

source: Liveman заменяет `our $VERSION = "...";` в `lib/**.pm` из `lib/**.md` из секции **VERSION** если она существует.
ru_en: Liveman replaces the `our $VERSION = "...";` in `lib/**.pm` from `lib/**.md` from the section **VERSION** if it exists.

source: Если файл **minil.toml** существует, то Liveman прочитает из него `name` и скопирует файл с этим именем и расширением `.md` в `README.md`.
ru_en: If the ** minil.toml ** file exists, then Liveman will read `NAME` from it and copy the file with this name and extension` .md` in `readme.md`.

source: Если нужно, чтобы документация в `.md` была написана на одном языке, а `pod` – на другом, то в начале `.md` нужно указать `!from:to` (с какого на какой язык перевести, например, для этого файла: `!ru:en`).
ru_en: If you need the documentation in `.md` to be written in one language, and` pod` is on the other, then at the beginning of `.md` you need to indicate`!from:to` (from which language to translate, for example, for this file: `!ru:en`).

source: Заголовки (строки на #) – не переводятся. Так же не переводятя блоки кода. А сам перевод осуществляется по абзацам.
ru_en: Headings (lines on #) - are not translated. Also, without translating the code blocks. And the translation itself is carried out by paragraphs.

source: Файлы с переводами складываются в каталог `i18n`, например, `lib/My/Module.md` -> `i18n/My/Module.ru-en.po`. Перевод осуществляется утилитой `trans` (она должна быть установлена в системе). Файлы переводов можно подкорректировать, так как если перевод уже есть в файле, то берётся он.
ru_en: Files with transfers are added to the `i18n` catalog, for example, `lib/My/Module.md` -> `i18n/My/Module.ru-en.po`. Translation is carried out by the `Trans` utility (it should be installed in the system). Translation files can be adjusted, because if the transfer is already in the file, then it is taken.

source: **Внимание!** Будьте осторожны и после редактирования `.md` просматривайте `git diff`, чтобы не потерять подкорректированные переводы в `.po`.
ru_en: **Attention!** Be careful and after editing `.md` look at `git diff` so as not to lose corrected translations in `.po`.

source: **Примечание:** `trans -R` покажет список языков, которые можно указывать в **!from:to** на первой строке документа.
ru_en: **Note:** `trans -R` will show a list of languages that can be indicated in **!from:to** on the first line of the document.

source: Предшественником `liveman` является [miu](https://github.com/darviarush/miu).
ru_en: The predecessor of `liveman` is [miu](https://github.com/darviarush/miu).

source: Коды секций без указанного языка программирования или с `perl` записываются как код в файл `t/**.t`. А комментарий со стрелкой (# -> )превращается в тест `Test::More`.
ru_en: Section codes without a specified programming language or with `perl` are written as code in the file `t/**.t`. And a comment with an arrow (# -> ) turns into a `Test::More` test.

source: Поддерживаемые тесты:
ru_en: Supported tests:

source: * `->`, `→` – сравнение скаляров; * `-->`, `⟶` – сравнение структур; * `=>`, `⇒` – сравнение c интерполируемой строкой; * `\>`, `↦` – сравнение с неинтерполируемой строкой; * `^=>`, `⤇` – сравнение начала скаляра с интерполируемой строкой; * `$=>`, `➾` – сравнение конца скаляра с интерполируемой строкой; * `*=>`, `⥴` – сравнение середины скаляра с интерполируемой строкой; * `^->`, `↣` – сравнение начала скаляра с неинтерполируемой строкой; * `$->`, `⇥` – сравнение конца скаляра с неинтерполируемой строкой; * `*->`, `⥵` – сравнение середины скаляра с неинтерполируемой строкой; * `~>`, `↬` – сопоставление скаляра с регулярным выражением (`$code =~ /.../`); * `<~`, `↫` – отрицательное сопоставление скаляра с регулярным выражением (`$code !~ /.../`); * `@->`, `↯` – сравнение начала исключения с неинтерполируемой строкой; * `@=>`, `⤯` – сравнение начала исключения с интерполируемой строкой; * `@~>`, `⇝` – сопоставление исключения с регулярным выражением (`defined $@ && $@ =~ /.../`); * `<~@`, `⇜` – отрицательное сопоставление исключения с регулярным выражением (`defined $@ && $@ !~ /.../`);
ru_en: * `->`, `→` – comparison of scalars; * `-->`, `⟶` – comparison of structures; * `=>`, `⇒` – comparison with the interpolated string; * `\>`, `↦` – comparison with a non-interpolated string; * `^=>`, `⤇` – comparison of the beginning of the scalar with the interpolated string; * `$=>`, `➾` – comparison of the end of the scalar with the interpolated string; * `*=>`, `⥴` – comparison of the middle of the scalar with the interpolated string; * `^->`, `↣` – comparison of the beginning of a scalar with a non-interpolated string; * `$->`, `⇥` – comparison of the end of a scalar with a non-interpolated string; * `*->`, `⥵` – comparison of the middle of a scalar with a non-interpolated string; * `~>`, `↬` – matching a scalar with a regular expression (`$code =~ /.../`); * `<~`, `↫` – negative matching of a scalar with a regular expression (`$code !~ /.../`); * `@->`, `↯` – comparison of the beginning of the exception with a non-interpolated string; * `@=>`, `⤯` – comparison of the beginning of the exception with the interpolated string; * `@~>`, `⇝` – matching an exception with a regular expression (`defined $@ && $@ =~ /.../`); * `<~@`, `⇜` – negative matching of an exception with a regular expression (`defined $@ && $@ !~ /.../`);

source: Сравнить два эквивалентных выражения:
ru_en: Compare two equivalent expressions:

source: Сравнить два выражения для структур:
ru_en: Compare two expressions for structures:

source: Сравнить выражение с экстраполированной строкой:
ru_en: Compare the expression with an extrapolated line:

source: Сравнить выражение с неэкстраполированной строкой:
ru_en: Compare the expression with an unexpected line:

source: Скаляр должен быть сопостовим с регулярным выражением:
ru_en: The scalar must be comparable to a regular expression:

source: В скаляре не должно быть совпадения с регулярным выражением:
ru_en: The scalar must not match the regular expression:

source: Скаляр должен начинаться экстраполированой срокой:
ru_en: The scalar must begin with an extrapolated term:

source: Скаляр должен заканчиваться экстраполированой срокой:
ru_en: The scalar must end with an extrapolated term:

source: Скаляр должен содержать экстраполированую сроку:
ru_en: The scalar must contain the extrapolated term:

source: Скаляр должен начинаться неэкстраполированой срокой:
ru_en: The scalar must begin with a non-extrapolated term:

source: Скаляр должен заканчиваться неэкстраполированой срокой:
ru_en: The scalar must end with a non-extrapolated term:

source: Скаляр должен содержать неэкстраполированую сроку:
ru_en: The scalar must contain a non-extrapolated term:

source: Исключение должно начинаться с неэкстраполированой сроки:
ru_en: The exception must start with the non-extrapolated term:

source: Исключение должно начинаться с экстраполированой сроки:
ru_en: The exception must start with the extrapolated timing:

source: Исключение должно быть сопостовимо с регулярным выражением:
ru_en: The exception must be matched to the regular expression:

source: Исключение не должно быть сопостовимо с регулярным выражением (но оно должно иметь место):
ru_en: The exception doesn't have to be matched by the regular expression (but it should be):

source: Каждый тест выполняется во временном каталоге, который удаляется и создается при запуске теста.
ru_en: Each test is performed in a temporary catalog, which is removed and created when starting the dough.

source: Формат этого каталога: /tmp/.liveman/*project*/*path-to-test*/.
ru_en: The format of this catalog: /tmp/.liveman/*project*/*path-to-test*/.

source: Раздел кода в строке с префиксом md-файла **File `path`:** запишется в файл при тестировании во время выполнения.
ru_en: The code section in the line with the MD-file prefix **File `path`:** is written to the file when testing during execution.

source: Раздел кода в префиксной строке md-файла **File `path` is:** будет сравниваться с файлом методом `Test::More::is`.
ru_en: The code section in the md file prefix line **File `path` is:** will be compared to the file using the `Test::More::is` method.

source: Файл experiment/test.txt:
ru_en: experiment/test.txt file:

source: Файл experiment/test.txt является:
ru_en: experiment/test.txt file is:

source: **Внимание!** Пустая строка между префиксом и кодом не допускается!
ru_en: **Attention!** An empty line between the prefix and the code is not allowed!

source: Эти префиксы могут быть как на английском, так и на русском (`File [path](https://metacpan.org/pod/path):` и `File [path](https://metacpan.org/pod/path) is:`).
ru_en: These prefixes can be both in English and in Russian (`File [path] (https://metacpan.org/pod/path):` and `File [path] (https://metacpan.org/pod/path) is:`).

source: Конструктор. Имеет аргументы:
ru_en: Constructor. Has arguments:

source: 1. `files` (array_ref) — список md-файлов для методов `transforms` и `tests`. 1. `open` (boolean) — открыть покрытие в браузере. Если на компьютере установлен браузер **opera**, то будет использоватся команда `opera` для открытия. Иначе — `xdg-open`. 1. `force_compile` (boolean) — не проверять время модификации md-файлов. 1. `options` — добавить параметры в командной строке для проверки или доказательства. 1. `prove` — использовать доказательство (команду `prove` для запуска тестов), а не команду `yath`.
ru_en: 1. `Files` (array_ref)-a list of MD files for the` transforms` and `tests`. 1. `open` (boolean) - open the coating in the browser. If the computer is installed on the computer **Opera**, the `Opera` command will be used to open. Otherwise-`xdg-open`. 1. `force_compile` (boolean)-do not check the time of modification of MD files. 1. `options` - Add the parameters on the command line for verification or evidence. 1. `prove` - use the proof (team `prove` to start tests), and not the `yath` command.

source: Получить путь к `t/**.t`-файлу из пути к `lib/**.md`-файлу:
ru_en: Get the way to `t/**.t`-file from the way to`lib/**.md`-file:

source: Компилирует `lib/**.md`-файл в `t/**.t`-файл.
ru_en: Compiles `lib/**.md`-file in` t/**.t`-file.

source: А так же заменяет **pod**-документацию в секции `__END__` в `lib/**.pm`-файле и создаёт `lib/**.pm`-файл, если тот существует, а иначе – создаёт файл`lib/**.pod`.
ru_en: It also replaces the **pod** documentation in the `__END__` section in the `lib/**.pm` file and creates a `lib/**.pm` file if it exists, otherwise it creates a `lib/**.pod` file.

source: При вызове `transform` в `SYNOPSYS` был создан файл `lib/Example.pod`.
ru_en: When `transform` was called in `SYNOPSYS`, a file `lib/Example.pod` was created.

source: Файл lib/Example.pod является:
ru_en: The lib/Example.pod file is:

source: Создадим `lib/Example.pm` и вызовем `transform`:
ru_en: Let's create `lib/Example.pm` and call `transform`:

source: Файл lib/Example.pm является:
ru_en: The lib/Example.pm file is:

source: Компилировать `lib/**.md`-файлы в `t/**.t`-файлы.
ru_en: Compile `lib/**.md` files into `t/**.t` files.

source: Все, если `$self->{files}` не установлен, или `$self->{files}`.
ru_en: That's all, if `$self->{files}` is not installed, or `$self->{files}`.

source: Запустить тесты (`t/**.t`-файлы).
ru_en: Launch tests (`t/**.t`-files).

source: Все, если `$self->{files}` не установлен, или `$self->{files}` только.
ru_en: That's all, if `$self->{files}` is not installed, or `$self->{files}` only.

source: Считывает po-файл.
ru_en: Reads the PO-file.

source: Сохраняет po-файл.
ru_en: Saves the PO-file.

source: Функция переводит текст с одного языка на другой используя утилиту trans.
ru_en: The function translates the text from one language to another using the Trans utility.

source: Так же разбивает по параграфам.
ru_en: It also breaks through paragraphs.

source: В своей библиотеке, которую вы будете тестировать Liveman-ом, нужно будет указать дополнительные зависимости для тестов в **cpanfile**:
ru_en: In your library, which you will test Liveman, you will need to indicate additional dependencies for tests in **cpanfile**:

source: Так же неплохо будет указать и сам **Liveman** в разделе для разработки:
ru_en: It will also be good to indicate and the **Liveman** in the development section:
