Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/R/RT-Extension-TicketLocking/po/*.po
Languages: fr

source: %1 has been locked by %2 for %3
fr: %1 a été verrouillé par %2 depuis %3

source: Break lock
fr: Supprimer le verrou

source: Expires in
fr: Expire dans

source: Lock
fr: Verrouiller

source: Subject
fr: Sujet

source: There is a lock with a higher priority on this ticket.
fr: Il y a un verrou avec une priorité supérieure sur ce ticket.

source: This ticket
fr: Ce ticket

source: This ticket was not locked.
fr: Ce ticket n'a pas été verrouillé

source: Ticket #%1
fr: Ticket n°%1

source: Tickets locked by you
fr: Tickets verrouillés par vous

source: Time Locked
fr: Verrouillé depuis

source: Unlock
fr: Déverrouiller

source: Unlock All
fr: Tout déverrouiller

source: You cannot unlock a ticket locked by another user.
fr: Vous ne pouvez pas déverrouillé un tiket verrouillé par quelqu'un d'autre.

source: You had %1 locked for %2. It is now unlocked
fr: Vous aviez %1 verrouillé depuis %2. Il est maintenant déverrouillé.

source: You have broken the lock on this ticket
fr: Vous avez supprimer le verrou sur ce ticket

source: You have had %1 locked for %2
fr: Vous avez verrouillé %1 depuis %2

source: You have locked %1
fr: Vous avez verrouillé %1

source: You have unlocked this ticket. It was locked for %1 seconds.
fr: Vous avez déverrouillé ce ticket. Il était verrouillé depuis %1 secondes.

source: You now have a lock on this ticket
fr: Vous avez maintenant un verrou sur ce ticket

source: Your attempt to lock this ticket failed
fr: Votre tentative pour verrouiller ce ticket a échoué

source: this ticket
fr: ce ticket
