Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-Ecliptic/share/locale/Padre__Plugin__Ecliptic-*.po
Languages: ja, nl_nl, tr

source: Open Resource Ctrl-Shift-R
ja: リソースを開く Ctrl-Shift-R
nl_nl: Open Bron CTRL-Shift-R

source: Quick Assist Ctrl-Shift-L
ja: クイックアシスタント Ctrl-Shift-L
nl_nl: Snel Bijstand Ctrl-Shift-L
tr: Hızlı Yardım Ctrl-Shift-L

source: Quick Menu Access Ctrl-3
ja: クイックメニューアクセス Ctrl-3
nl_nl: Snel Menu Toegang CTRL-3

source: Quick Outline Access Ctrl-4
ja: クイックアウトラインアクセス Ctrl-4
nl_nl: Snel Uitlijning Toegang CTRL-3
tr: Hızlı Taslak Erişimi Ctrl-4

source: Quick Module Access Ctrl-5
ja: クイックモジュールアクセス Ctrl-5
nl_nl: Snel Module Toegang CTRL-3
tr: Hızlı Modül Erişimi Ctrl-5

source: Open in Explorer Ctrl-6
ja: エクスプローラで開く Ctrl-6

source: Quick Fix Ctrl-Shift-1
ja: クイックフィックス Ctrl-Shift-1
nl_nl: Snel Herstellen Ctrl-Shift-1

source: About
ja: このプラグインについて
nl_nl: Betreft
tr: Hakkında

source: Provides Eclipse-like useful features to Padre.
ja: PadreにExlipse的な便利機能を追加します。
nl_nl: Levert Eclipse-achtige nuttige kenmerken aan Padre
tr: Padre için Eclipse-türü kullanışlı özellikler sağlar

source: Failed to execute process
ja: プロセスの実行に失敗しました
nl_nl: Gefaald bij het uitvoeren proces

source: No filename
ja: ファイル名がありません
nl_nl: Geen bestandsnaam

source: Error
ja: エラー
nl_nl: Fout

source: Open Resource
ja: リソースを開く
nl_nl: Open Bron

source: &Select an item to open (? = any character, * = any string):
ja: 開くアイテムを選択(&S) (? = 任意の文字, * = 任意の文字列):
nl_nl: &Selecteer een te openen item (? = willekeurig karakter, * = willekeurige karakterreeks):

source: Ignore CVS/.svn/.git/blib folders
ja: CVS/.svn/.git/blibフォルダは無視

source: &Matching Items:
ja: マッチするアイテム(&M)
nl_nl: Overeenste&mmende Items:

source: Current Search Directory:
ja: 現在の検索ディレクトリ:

source: items selected
ja: アイテム選択しました

source: Reading items. Please wait...
ja: アイテムを読み込んでいます。お待ちください...

source: Finished Searching
ja: 検索終了
nl_nl: Klaar met zoeken
tr: Arama Bitti

source: item(s) found
ja: アイテム見つかりました
nl_nl: Gevonden item(s)
tr: unsur(lar) bulundu

source: No items found
ja: 見つかりませんでした
nl_nl: Geen items gevonden
tr: Hiçbirşey bulunamadı

source: Quick Assist
ja: クイックアシスト
nl_nl: Snel Assistentie
tr: Hızlı Yardım

source: Quick Fix
ja: クイックフィックス
nl_nl: Snel Herstellen

source: No suggestions
ja: 修正案はありません
nl_nl: Geen suggesties

source: Quick Menu Access
ja: クイックメニューアクセス
nl_nl: Snelmenu Toegang

source: &Type a menu item name to access:
ja: アクセスしたいメニュー項目名(&T):
nl_nl: &Type de te selecteren menu item naam

source: &Matching Menu Items:
ja: マッチするメニュー項目(&M):
nl_nl: Overeenste&mmende Menu Items:

source: Quick Module Access
ja: クイックモジュールアクセス
nl_nl: Snel Module Toegang
tr: Hızlı Modül Erişimi

source: &Type a module name to access:
ja: アクセスしたいモジュール名(&T):
nl_nl: &Type een te openen module naam:
tr: Erişmek için bir modül adı &girin:

source: &Matching modules:
ja: マッチするモジュール(&M):
nl_nl: Overeenste&mmende modules:
tr: Eşleşen &modüller:

source: Reading modules. Please wait...
ja: モジュールを読み込んでいます。お待ちください...
nl_nl: Bezig met het inlezen van de modules. Gelieve te wachten.
tr: Modüller okunuyor. Lütfen bekleyin...

source: Quick Outline Access
ja: クイックアウトラインアクセス
nl_nl: Snel Uitlijning Toegang
tr: Hızlı Taslak Erişimi

source: &Type a Outline item name to access:
ja: アクセスしたいアウトライン項目名(&T):
nl_nl: &Type de te selecteren Uitlijningsitem naam
tr: Erişim için bir &taslak unsur adı girin:

source: &Matching Outline Items:
ja: マッチするアウトライン項目(&T):
nl_nl: Overeenste&mmende UitlijningsItems:
tr: &Eşleşen Taslak Unsurları

source: Open in File Browser Ctrl-6
nl_nl: Open in Bestandsverkenner

source: Current Directory:
nl_nl: Huidige Map:

source: Skip VCS files
nl_nl: Sla VCS bestanden over

source: Skip using MANIFEST.SKIP
nl_nl: Sla het gebruik van MANIFEST.SKIP over

source: Error while trying to perform Padre action
nl_nl: Fout tijdens de poging om een Padre actie uit te voeren
