Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion.*.po
Languages: ru_en

source: Aion - постмодернистская объектная система для Perl 5, такая как «Mouse», «Moose», «Moo», «Mo» и «M», но с улучшениями
ru_en: Aion - a postmodern object system for Perl 5, such as “Mouse”, “Moose”, “Moo”, “Mo” and “M”, but with improvements

source: Aion — ООП-фреймворк для создания классов с **фичами**, имеет **аспекты**, **роли** и так далее.
ru_en: Aion is OOP-framework for creating classes with **features**, has **aspects**, **roles** and so on.

source: Свойства, объявленные через has, называются **фичами**.
ru_en: The properties declared through HAS are called **features**.

source: А `is`, `isa`, `default` и так далее в `has` называются **аспектами**.
ru_en: And `is`,` isa`, `default`, and so on in` has` are called **aspects**.

source: Помимо стандартных аспектов, роли могут добавлять свои собственные аспекты с помощью подпрограммы **aspect**.
ru_en: In addition to standard aspects, roles can add their own aspects using the **aspect** subprogram.

source: Сигнатура методов может проверяться с помощью атрибута `:Isa(...)`.
ru_en: The signature of the methods can be checked using the attribute `:Isa(...)`.

source: `use Aion` импортирует типы из модуля `Aion::Types` и следующие подпрограммы:
ru_en: `Use Aion` imports types from the module`Aion::Types` and the following subprograms:

source: Создаёт метод для получения/установки функции (свойства) класса.
ru_en: Creates a method for obtaining/setting the function (properties) of the class.

source: Файл lib/Animal.pm:
ru_en: lib/Animal.pm file:

source: Добавляет в модуль роли. Для каждой роли вызывается метод `import_with`.
ru_en: Adds to the module of the role. For each role, the `import_with` method is called.

source: Файл lib/Role/Keys/Stringify.pm:
ru_en: File lib/Role/Keys/Stringify.pm:

source: Файл lib/Role/Values/Stringify.pm:
ru_en: File lib/Role/Values/Stringify.pm:

source: Файл lib/Class/All/Stringify.pm:
ru_en: File lib/Class/All/Stringify.pm:

source: Проверяет, что `$package` — это суперкласс для данного или сам этот класс.
ru_en: Checks that `$package` is a super class for a given or this class itself.

source: Реализацию метода `isa` Aion не меняет и она находит как суперклассы, так и роли (так как и те и другие добавляются в `@ISA` пакета).
ru_en: Aion does not change the implementation of the `isa` method and it finds both superclasses and roles (since both are added to the `@ISA` package).

source: Проверяет, что `$package` — это роль, которая используется в классе или другой роли.
ru_en: Checks that `$package` is a role that is used in a class or another role.

source: Добавляет аспект к `has` в текущем классе и его классам-наследникам или текущей роли и применяющим её классам.
ru_en: Adds the aspect to `has` in the current class and its classroom classes or the current role and applies its classes.

source: Аспект вызывается каждый раз, когда он указан в `has`.
ru_en: The aspect is called every time it is indicated in `has`.

source: Создатель аспекта имеет параметры:
ru_en: The creator of the aspect has the parameters:

source: * `$value` — значение аспекта. * `$feature` — метаобъект описывающий фичу (`Aion::Meta::Feature`). * `$aspect_name` — наименование аспекта.
ru_en: * `$value` — aspect value. * `$feature` - meta-object describing the feature (`Aion::Meta::Feature`). * `$aspect_name` — aspect name.

source: Расширяет класс другим классом/классами. Он вызывает из каждого наследуемого класса метод `import_extends`, если он в нём есть.
ru_en: Expands the class with another class/classes. It causes from each inherited class the method of `import_extends`, if it is in it.

source: Конструктор.
ru_en: The constructor.

source: * Устанавливает `%param` для фич. * Проверяет, что параметры соответствуют фичам. * Устанавливает значения по умолчанию.
ru_en: * Installs `%param` for features. * Checks that the parameters correspond to the features. * Sets default values.

source: Проверяет, что в классах, использующих эту роль, есть указанные подпрограммы или фичи.
ru_en: Checks that classes using this role have the specified routines or features.

source: Проверяет, что в классах, использующих эту роль, есть указанные фичи с указанными аспектами.
ru_en: Checks that classes using this role have the specified features with the specified aspects.

source: `use Aion` включает в модуль следующие аспекты для использования в `has`:
ru_en: `use Aion` includes the following aspects in the module for use in `has`:

source: * `ro` — создать только геттер. * `wo` — создать только сеттер. * `rw` — создать геттер и сеттер.
ru_en: * `ro` - create only a gutter. * `wo` - create only a setter. * `rw` - Create getter and setter.

source: По умолчанию — `rw`.
ru_en: By default - `rw`.

source: Дополнительные разрешения:
ru_en: Additional permits:

source: * `+` — фича обязательна в параметрах конструктора. `+` не используется с `-`. * `-` — фича не может быть установлена через конструктор. '-' не используется с `+`. * `*` — не инкрементировать счётчик ссылок на значение (применить `weaken` к значению после установки его в фичу). * `?` – создать предикат. * `!` – создать clearer.
ru_en: * `+` - the feature is required in the constructor parameters. `+` is not used with `-`. * `-` - the feature cannot be installed via the constructor. '-' is not used with `+`. * `*` - do not increment the value's reference counter (apply `weaken` to the value after installing it in the feature). * `?` – create a predicate. * `!` – create clearer.

source: Функция с `*` не удерживает значение:
ru_en: The function with `*` does not hold the meaning:

source: Указывает тип, а точнее – валидатор, фичи.
ru_en: Indicates the type, or rather - a validator, feature.

source: Список валидаторов см. в [Aion::Types](https://metacpan.org/pod/Aion::Types).
ru_en: For a list of validators, see [Aion::Types](https://metacpan.org/pod/Aion::Types).

source: Включает преобразования типов.
ru_en: Includes type conversions.

source: Значение по умолчанию устанавливается в конструкторе, если параметр с именем фичи отсутствует.
ru_en: The default value is set in the designer if there is no parameter with the name of the feature.

source: Если `$value` является подпрограммой, то подпрограмма считается конструктором значения фичи. Используется ленивое вычисление, если нет атрибута `lazy`.
ru_en: If `$value` is a subroutine, then the subroutine is considered the feature's value constructor. Lazy evaluation is used if there is no `lazy` attribute.

source: Аспект `lazy` включает или отключает ленивое вычисление значения по умолчанию (`default`).
ru_en: The `lazy` aspect enables or disables lazy evaluation of the default value (`default`).

source: По умолчанию он включен только если значение по умолчанию является подпрограммой.
ru_en: By default it is only enabled if the default is a subroutine.

source: С помощью аспекта `eon` реализуется паттерн **Dependency Injection**.
ru_en: The `eon` aspect implements the **Dependency Injection** pattern.

source: Он связывает свойство с сервисом из контейнера `$Aion::pleroma`.
ru_en: It associates a property with a service from the `$Aion::pleroma` container.

source: Значением аспекта может быть ключ сервиса или 1, тогда ключём будет пакет в `isa => Object['Packet']`
ru_en: The aspect value can be the service key or 1, then the key will be the package in `isa => Object['Packet']`

source: Пример с 1-й:
ru_en: Example from 1st:

source: `$sub` вызывается после установки свойства в конструкторе (`new`) или через сеттер.
ru_en: `$sub` is called after setting the property in the constructor (`new`) or via a setter.

source: Этимология `trigger` – впустить.
ru_en: The etymology of `trigger` is to let in.

source: `$sub` вызывается перед возвратом свойства из объекта через геттер.
ru_en: `$sub` is called before returning a property from an object via a getter.

source: Этимология `release` – выпустить.
ru_en: The etymology of `release` is to release.

source: Меняет имя свойства в конструкторе.
ru_en: Changes the property name in the constructor.

source: Меняет имя акцессора.
ru_en: Changes the accessor name.

source: Создаёт сеттер с именем `$name` для свойства.
ru_en: Creates a setter named `$name` for a property.

source: Создаёт геттер с именем `$name` для свойства.
ru_en: Creates a getter named `$name` for a property.

source: Создаёт предикат с именем `$name` для свойства. Создать предикат со стандартным именем можно так же через `is => '?'`.
ru_en: Creates a predicate named `$name` for a property. You can also create a predicate with a standard name using `is => '?'`.

source: Создаёт очиститель с именем `$name` для свойства. Создать очиститель со стандартным именем можно так же через `is => '!'`.
ru_en: Creates a cleaner named `$name` for a property. You can also create a cleaner with a standard name using `is => '!'`.

source: `$sub` вызывается при вызове декструктора или `$object->clear_feature`, но только если свойство имеется (см. `$object->has_feature`).
ru_en: `$sub` is called when the destructor or `$object->clear_feature` is called, but only if the feature is present (see `$object->has_feature`).

source: Данный аспект принудительно создаёт предикат и clearer.
ru_en: This aspect forces the creation of a predicate and a clearer.

source: `Aion` добавляет в пакет универсальные атрибуты.
ru_en: `Aion` adds universal attributes to the package.

source: Атрибут `Isa` проверяет сигнатуру функции.
ru_en: The attribute `Isa` checks the signature of the function.

source: Атрибут Isa позволяет объявить требуемые функции:
ru_en: The Isa attribute allows you to declare the required functions:
