Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-Catalyst/share/locale/Padre__Plugin__Catalyst-*.po
Languages: ar, es_es, fr_fr, ja, nl_nl, pt_br, tr

source: New Catalyst Application
ar: تطبيق Catalyst جديد
es_es: Nueva aplicación Catalyst
fr_fr: Nouvelle application Catalyst
ja: 新しいCatalystアプリケーション
nl_nl: Nieuwe Catalyst Toepassing
pt_br: Novo Aplicativo Catalyst
tr: Yeni Catalyst Uygulaması

source: Create new...
ar: انشاء جديد...
es_es: Crear nuevo...
fr_fr: Créer un nouveau...
ja: 新しい...
nl_nl: Maak een nieuwe...
pt_br: Criar um novo...
tr: Yeni oluştur...

source: Model
ar: نموذج - Model
es_es: Modelo
fr_fr: Modèle
ja: モデル
pt_br: Modelo

source: View
ar: مشهد - View
es_es: Vista
fr_fr: Vue
ja: ビュー
nl_nl: Weergave
pt_br: Vista
tr: Görünüm

source: Controller
ar: مراقب - Controller
es_es: Controlador
fr_fr: Contrôleur
ja: コントローラ
pt_br: Controlador
tr: Denetletici

source: Start Web Server
ar: تشغيل خادم الويب
es_es: Iniciar servidor web
fr_fr: Démarrer le serveur web
ja: サーバを起動する
nl_nl: Stat Web Server
pt_br: Iniciar Servidor Web
tr: Ağ Sunucusunu Çalıştır

source: Stop Web Server
ar: ايقاف خادم الويب
es_es: Detener servidor web
fr_fr: Arrêter le serveur web
ja: サーバを停止する
pt_br: Parar Servidor Web
tr: Ağ Sunucusunu Durdur

source: Catalyst Online References
ar: مراجع Catalyst على الانترنت
es_es: Referencias en línea de Catalyst
fr_fr: Références Catalyst en ligne
ja: Catalystオンラインリファレンス
nl_nl: Catalyst Online Referenties
pt_br: Referências do Catalyst Online
tr: Catalyst Çevrimiçi Başvuru Kaynakları

source: Beginner's Tutorial
ar: دروس المبتدئ
es_es: Tutorial para principiantes
fr_fr: Tutorial pour débuter
ja: 初心者向けチュートリアル
nl_nl: Beginners Gids
pt_br: Tutorial para Iniciantes
tr: Yeni Başlayanlar İçin Eğitsel

source: Overview
ar: نظرة عامة
es_es: Descripción general
fr_fr: Aperçu
ja: 概要
nl_nl: Overzicht
pt_br: Visão Geral
tr: Genel Bakış

source: 1. Introduction
ar: 1. مقدمة
es_es: 1. Introducción
ja: 1. はじめに
nl_nl: 1. Inleiding
pt_br: 1. Introdução
tr: 1. Giriş

source: 2. Catalyst Basics
ar: 2. أساسيات Catalyst
es_es: 2. Conceptos básicos sobre Catalyst
fr_fr: 2. Les bases de Catalyst
ja: 2. Catalystの基本
nl_nl: 2. Catalyst Beginselen
pt_br: 2. Catalyst Básico
tr: 2. Catalyst Temelleri

source: 3. More Catalyst Basics
ar: 3. المزيد من أساسيات Catalyst
es_es: 3. Más conceptos básicos sobre Catalyst
fr_fr: 3. Autres bases de Catalyst
ja: 3. 続・Catalystの基本
nl_nl: 3. Meer Catalyst Beginselen
pt_br: 3. Mais Catalyst Básico
tr: 3. Daha Fazla Catalyst Temelleri

source: 4. Basic CRUD
ar: 4. مبدأ CRUD
es_es: 4. CRUD básico
fr_fr: 4. CRUD basique
ja: 4. 基本のCRUD
nl_nl: 4. Basis CRUD
pt_br: 4. CRUD Básico
tr: 4. Basit CRUD (Oluştur-Oku-Güncelle-Sil)

source: 5. Authentication
ar: 5. التأكد من الهوية
es_es: 5. Autenticación
fr_fr: 5. Authentification
ja: 5. 認証
nl_nl: 5. Authenticatie
pt_br: 5. Autenticação
tr: 5. Kimlik Doğrulama

source: 6. Authorization
ar: 6. السماح بالدخول
es_es: 6. Autorización
fr_fr: 6. Autorisation
ja: 6. 認可
nl_nl: 6. Authorisatie
pt_br: 6. Autorização
tr: 6. Yetkilendirme

source: 7. Debugging
ar: 7. تصحيح الأخطاء
es_es: 7. Depuración
fr_fr: 7. Débuggage
ja: 7. デバッグ
nl_nl: 7. Fouten oplossen
pt_br: 7. Depurando
tr: 7. Hata Ayıklama

source: 8. Testing
ar: 8. الاختبار
es_es: 8. Pruebas
fr_fr: 8. Test
ja: 8. テスト
nl_nl: 8. Testen
pt_br: 8. Testando
tr: 8. Sınamalar

source: 9. Advanced CRUD
ar: 9. CRUD متقدم
es_es: 9. CRUD avanzado
fr_fr: 9. CRUD avancé
ja: 9. 高度なCRUD
nl_nl: 9. Gevorderd CRUD
pt_br: 9. CRUD Avançado
tr: 9. Gelişmiş CRUD (Oluştur-Oku-Güncelle-Sil)

source: 10. Appendices
ar: 10. الملحقات
es_es: 10. Apéndices
fr_fr: 10. Annexes
ja: 10. 付録
nl_nl: 10. Bijlagen
pt_br: 10. Apêndices
tr: 10. Ekler

source: Catalyst Cookbook
ar: كتاب طهي Catalyst
es_es: Libro de recetas de Catalyst
fr_fr: Livre de recettes Catalyst
ja: Catalystクックブック
pt_br: Livro de Receitas do Catalyst
tr: Catalyst Pişirme Kitabı

source: Recommended Plugins
ar: البرامج الملحقه الموصى بها
es_es: Complementos recomendados
fr_fr: Greffons recommendés
ja: おすすめのプラグイン
nl_nl: Aanbevolen Plugins
pt_br: Plugins Recomendados
tr: Önerilen Eklentiler

source: Catalyst Community Live Support
ar: دعم مجتمع Catalyst المباشر
es_es: Soporte en línea de la comunidad Catalyst
fr_fr: Support en direct pour Catalyst
ja: Catalystコミュニティライブサポート
pt_br: Suporte Online da Comunidade Catalyst
tr: Catalyst Topluluk Canlı Desteği

source: Examples
ar: أمثلة
es_es: Ejemplos
fr_fr: Exemples
ja: 例
nl_nl: Voorbeelden
pt_br: Exemplos
tr: Örnekler

source: Catalyst Wiki
ar: ويكي Catalyst
es_es: Wiki de Catalyst
fr_fr: Wiki Catalyst
pt_br: Wiki Catalyst

source: Catalyst Website
ar: موقع Catalyst الاكتروني
es_es: Sitio web de Catalyst
fr_fr: Site web Catalyst
ja: Catalystウェブサイト
pt_br: Site do Catalyst
tr: Catalyst Sitesi

source: Update Application Scripts
ar: تحديث برامج التطبيق النصية
es_es: Actualizar scripts de la aplicación
fr_fr: Mettre à jour les scripts d'application
ja: アプリケーションのスクリプトを更新する
nl_nl: Bijwerken Toepassingsscripts
pt_br: Atualizar Script da Aplicação
tr: Uygulama Betiklerini Güncelle

source: About
ar: عن
es_es: Acerca de
fr_fr: A propos
ja: このプラグインについて
nl_nl: Betreft
pt_br: Sobre
tr: Hakkında

source: Open Template '%s'
ar: فتح القالب '%s'
es_es: Abrir plantilla '%s'
fr_fr: Ouvrir le modèle '%s'
pt_br: Abrir Template '%s'
tr: '%s' Şablonunu Aç

source: Template '%s' not found in '%s'
ar: القالب '%s' غير موجود في '%s'
es_es: No se encontró la plantilla '%s' en '%s'
fr_fr: Modèle '%s' non trouvé dans '%s'
nl_nl: Template '%s' niet gevonden in '%s'
pt_br: Template '%s' não encontrado em '%s'
tr: '%s' şablonu '%s' içinde bulunamadı

source: Error
ar: خطأ
fr_fr: Erreur
nl_nl: Fout
pt_br: Erro
tr: Hata

source: Catalyst development web server not found at %s Please make sure the active document is from your Catalyst project.
ar: لا يمكن العثور على خادم الويب التطويري لCatalyst %s الرجاء التأكد من أن الوثيقة الحالية هي من مشروع Catalyst الخاص بك.
es_es: No se encontró el servidor web de desarrollo en %s Compruebe que el documento activo forma parte del proyecto Catalyst.
fr_fr: Server web de développement Catalyst non trouvé à %s Merci de vérifier que le document actif appartient bien à votre projet Catalyst.
ja: Catalystの開発用サーバが見つかりません。 %s このドキュメントがCatalystプロジェクト内にあるかご確認ください。
nl_nl: Catalyst development web server niet gevonden op %s Gelieve te controleren dat het actieve document van uw Catalyst project is.
pt_br: Servidor web de desenvolvimento não encontrado em %s Por favor certifique-se de que o documento ativo faz parte de seu projeto Catalyst.
tr: Catalyst geliştirim ağ sunucusu şu adreste bulunamadı %s Lütfen geçerli belgenin Catalyst projenize ait olduğundan emin olun.

source: Server not found
ar: الخادم غير موجود
es_es: No se encontró el servidor
fr_fr: Serveur non trouvé
ja: サーバが見つかりません
nl_nl: Server niet gevonden
pt_br: Servidor não encontrado
tr: Sunucu bulunamadı

source: Web server appears to be running. Launch web browser now?
ar: يبدو ان خادم الويب مشغل. هل تريد تشغيل متصفح الويب الآن؟
es_es: Parece que el servidor web se está ejecutando. ¿Desea iniciar el navegador web ahora?
fr_fr: Le serveur web semble démarré. Lancer un navigateur web maintenant ?
ja: サーバは起動しているようです。ブラウザを起動しますか?
nl_nl: Web server lijkt te draaien. Web browser nu opstarten?
pt_br: Servidor web parece estar em execução. Iniciar navegador web agora?
tr: Ağ sunucusu çalışıyor olarak gözüküyor. Tarayıcı şimdi başlatılsın mı?

source: Start Web Browser?
ar: هل تريد تشغيل متصفح الويب؟
es_es: ¿Desea iniciar el navegador web?
fr_fr: Démarrer le navigateur web ?
ja: ブラウザを起動しますか?
nl_nl: Web Browser opstarten?
pt_br: Iniciar Navegador Web?
tr: Ağ Tarayıcısını Başlat?

source: Wx::Perl::ProcessStream is version %s which is known to cause problems. Get at least 0.20 by typing cpan Wx::Perl::ProcessStream
ar: الوحدة Wx::Perl::ProcessStream نسخة %s معروف عنها انها تسبب المشاكل. احصل على نسخة 0.20 على الأقل بطباعة الأمر cpan Wx::Perl::ProcessStream
es_es: Se sabe que la versión %s de Wx::Perl::ProcessStream causa problemas. Debe usar como mínimo la versión 0.20. Para ello, escriba cpan Wx::Perl::ProcessStream
fr_fr: La version de Wx::Perl::ProcessStream, %s, est connue pour poser problème. Récupérer au minimum la 0.20 en lançant cpan Wx::Perl::ProcessStream
nl_nl: Wx::Perl::ProcessStream is versie %s en is gekend als oorzaak van problemen. Verkrijg tenminste 0.20 door het typen van cpan Wx::Perl::ProcessStream
pt_br: O Wx::Perl::ProcessStream versão %s é conhecido por causar problemas. Por favor obtenha o 0.20 ou superior digitando cpan Wx::Perl::ProcessStream
tr: Wx::Perl::ProcessStream sürümünüz %s için bilinen uyumluluk sorunları mevcut. Şu komutu kullanarak en azından 0.20 sürümünü kurun cpan Wx::Perl::ProcessStream

source: Failed to start server via '%s'
ar: فشل تشغيل الخادم ب '%s'
es_es: No se pudo iniciar el servidor a través de '%s'
fr_fr: Impossible de démarrer le serveur via '%s'
nl_nl: Gefaald in het starten van de server via '%s'
pt_br: Erro ao iniciar servidor via '%s'
tr: Sunucuyu '%s' yoluyla başlatma girişimi başarısız oldu

source: Web server stopped successfully.
ar: تم ايقاف خادم الويب بنجاح
es_es: Se detuvo correctamente el servidor web.
fr_fr: Serveur web arrêté.
nl_nl: Web server succesvol gestopt.
pt_br: Servidor web interrompido com sucesso.
tr: Ağ sunucusu başarıyla durduruldu

source: Catalyst support for Padre
ar: دعم Catalyst لPadre
es_es: Soporte de Catalyst para Padre
fr_fr: Support Catalyst pour Padre
nl_nl: Catalyst ondersteuning voor Padre
pt_br: Suporte Catalyst para o Padre
tr: Padre için Catalyst desteği

source: This system is running Catalyst version
ar: هذا النظام يقوم بتشغيل Catalyst اصدار
es_es: Versión de Catalyst instalada en este sistema:
fr_fr: Ce système utilise Catalyst version
nl_nl: Dit systeem draait Catalyst versie
pt_br: O sistema possui Catalyst versão
tr: Bu dizgede çalıştırılan Catalyst sürümü

source: Create New Component
ar: انشاء مركب جديد
es_es: Crear componente nuevo
fr_fr: Créer un nouveau Composant
ja: 新規コンポーネントの作成
nl_nl: Creëer Nieuw Component
pt_br: Criar Novo Componente
tr: Yeni Bileşen Oluştur

source: Model Name:
ar: اسم النموذج Model:
es_es: Nombre del modelo:
fr_fr: Nom du modèle :
ja: モデル名:
nl_nl: Model Naam:
pt_br: Nome do Modelo:
tr: Model Adı:

source: Type
ar: نوع
es_es: Tipo
ja: 種別
pt_br: Tipo
tr: Tür

source: Additional Parameters:
ar: باراميترات اضافية:
es_es: Parámetros adicionales:
fr_fr: Paramètres additionnels :
ja: 追加のパラメータ:
nl_nl: Extra Parameters:
pt_br: Parâmetros adicionais:
tr: Ek Parametreler:

source: View Name:
ar: اسم المشهد View:
es_es: Nombre de vista:
fr_fr: Nom de la vue :
ja: ビュー名:
nl_nl: Toon Naam:
pt_br: Nome da Vista:
tr: Görüntü Adı:

source: force
ar: مجبر
es_es: forzar
fr_fr: forcer
ja: 強制
nl_nl: forceer
pt_br: forçar
tr: zorla

source: Controller Name:
ar: اسم المراقب Controller:
es_es: Nombre de controlador:
fr_fr: Nom du contrôleur :
ja: コントローラ名:
nl_nl: Controller Naam:
pt_br: Nome do Controlador:
tr: Denetleyici Adı:

source: [none]
ar: [بلا]
es_es: [ninguno]
fr_fr: [aucun]
ja: [なし]
nl_nl: [geen]
pt_br: [nenhum]
tr: [hiçbiri]

source: You must provide a name for your %s module
ar: يجب أن توفر اسما لوحدتك %s
es_es: Debe especificar un nombre para el módulo %s
fr_fr: Vous devez fournir un nom pour votre module %s
ja: %sモジュールの名前を指定してください
nl_nl: U dient een naam te geven voor uw %s module
pt_br: Você deve fornecer um nome para seu módulo %s
tr: %s modülünüz için bir ad belirtmelisiniz

source: Module name required
ar: اسم الوحدة مطلوب
es_es: Nombre de módulo requerido
fr_fr: Nom de module requis
ja: モジュール名が必要です
nl_nl: Module naam vereist
pt_br: Nome para módulo é obrigatório
tr: Modül adı gerekli

source: Catalyst helper script not found at %s Please make sure the active document is from your Catalyst project.
ar: لا يمكن العثور على برنامج Catalyst النصي %s الرجاء التأكد من أن الوثيقة الحالية هي من مشروع Catalyst الخاص بك.
es_es: No se encontró el script auxiliar de Catalyst en %s Compruebe que el documento activo forma parte del proyecto Catalyst.
fr_fr: Script d'aide Catalyst non trouvé à %s Merci de vérifier que le document actif appartient bien à votre projet Catalyst.
ja: Catalystのヘルパースクリプトが見つかりません %s このドキュメントがCatalystプロジェクト内にあるかご確認ください。
nl_nl: Catalyst helper script niet gevonden op %s Gelieve te controleren dat het actieve document van uw Catalyst project is.
pt_br: Script auxliar do Catalyst não encontrado em %s Por favor certifique-se de que o documento ativo faz parte de seu projeto Catalyst.
tr: Catalyst yardımcı betiği şu adreste bulunamadı %s Lütfen geçerli belgenizin Catalyst projenize ait olduğundan emin olun.

source: Helper not found
ar: المساعد غير موجود
es_es: No se encontró el script auxiliar
fr_fr: Aide non trouvée
ja: ヘルパーが見つかりません
nl_nl: Helper niet gevonden
pt_br: Auxiliar não encontrado
tr: Yardımcı bulunamadı

source: running:
ar: مشغل:
es_es: ejecutando:
fr_fr: en cours :
ja: 実行中:
nl_nl: draaiend:
pt_br: executando:
tr: çalıştırılıyor:

source: Catalyst helper script ended.
ar: انهى برنامج Catalyst النصي المساعد عمله.
es_es: Finalizó la ejecución del script auxiliar de Catalyst.
fr_fr: Script d'aide Catalyst terminé.
ja: ヘルパースクリプトの実行が終了しました。
nl_nl: Catalyst helper script geëindigd.
pt_br: Script auxiliar do Catalyst concluído.
tr: Catalyst yardımcı betiği sona erdi.

source: %s apparently created. Do you want to open it now?
ar: تم كما يبدو انشاء%s . هل تريد فتح الملف الان؟
es_es: Parece que %s se ha creado correctamente. ¿Desea abrirlo ahora?
fr_fr: %s semble créé. Voulez-vous l'ouvrir maintenant ?
ja: %sが作成されたようです。開きますか?
nl_nl: %s blijkbaar gecreëerd. Wenst U het nu te openen?
pt_br: %s aparentemente criado. Gostaria de abri-lo agora?
tr: %s oluşturuldu. Şimdi açmak istiyor musunuz?

source: Done
ar: تم
es_es: Listo
fr_fr: Terminé
ja: 完了
nl_nl: Klaar
pt_br: Concluido
tr: Bitti

source: Error creating %s. Please check the error output and try again
ar: حدث خطأ خلال انشاء %s. الرجاء التأكد من نتائج الخطأ والمحاولة مرة أخرى
es_es: Error al crear %s. Compruebe la salida de error e inténtelo de nuevo
fr_fr: Erreur lors de la création de %s. Vérifiez la sortie d'erreur et essayez à nouveau
nl_nl: Fout bij het maken van %s. Gelieve de fout uitvoer te controleren en vervolgens opnieuw te proberen.
pt_br: Erro criando %s. Por favor verifique a saída do erro e tente novamente
tr: %s oluşturulurken hata alındı. Lütfen hata çıktısını inceleyin ve tekrar deneyin.

source: To use the Catalyst development tools including catalyst.pl and the generated script/myapp_create.pl you need Catalyst::Helper, which is part of the Catalyst-Devel distribution. Please install this via a vendor package or by running one of - perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'
ar: لاستعمال أدوات تطوير Catalyst التي تشمل catalyst.pl و generated script/myapp_create.pl تحتاج إلى Catalyst::Helper وهو جزء من توزيعة Catalyst-Devel distribution. الرجاء التثبيت عن طريق رزمة من البائع أو تشغيل واحد من هذه الأوامر - perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'
es_es: Para usar las herramientas de desarrollo de Catalyst, como catalyst.pl o el archivo script/myapp_create.pl generado, necesita Catalyst::Helper, que forma parte de la distribución Catalyst-Devel. Instálelo a través de un paquete de un proveedor o ejecute uno de los comandos siguientes: perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'
fr_fr: Pour utiliser les outils de développement Catalyst incluant catalyst.pl et le script généré script/myapp_create.pl vous avez besoin de Catalyst::Helper, qui fait partie de la distribution Catalyst-Devel. Veuillez l'installer via un package vendeur ou en lançant l'une de ces commandes : perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'
ja: catalyst.plやscript/myapp_create.plのような開発ツールを使うには Catalyst-Develディストリビューションに付属のCatalyst::Helperが 必要になります。ベンダのパッケージ管理ツールでインストールするか 下記のいずれかのコマンドを実行してください。 perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'
nl_nl: Om de Catalyst ontwikkelaar tools te gebruiken, inclusief catalyst.pl en het gegenereerde script/myapp_create.pl, heeft u Catalyst::Helper nodig. Deze module maakt deel uit van de Catalyst-Devel distributie. Gelieve dit te installeren via een vendor package of door middel van ofwel: perl -MCPAN -e 'install Catalyst::Devel' ofwel: perl -MCPANPLUS -e 'install Catalyst::Devel'
pt_br: Para usar as ferramentas de desenvolvimento do Catalyst, inclusive o catalyst.pl e o script/myapp_create.pl gerado, você precisa do Catalyst::Helper, parte da distribuição Catalyst-Devel. Por favor, instale-a via pacote para seu sistema ou executando uma das formas abaixo: perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'
tr: script/myapp_create.pl ve catalyst.pl'yi de içeren Catalyst geliştirim araçlarını kullanabilmek için, Catalyst-Devel dağıtımıyla gelen Catalyst::Helper yüklü olmalıdır. Lütfen bunu, bir sağlayıcı aracıyla veya şu komutlardan birisini çalıştırarak, kurun: perl -MCPAN -e 'install Catalyst::Devel' perl -MCPANPLUS -e 'install Catalyst::Devel'

source: Application Name:
ar: اسم التطبيق:
es_es: Nombre de la aplicación:
fr_fr: Nom de l'application :
ja: アプリケーション名:
nl_nl: Toepassing Naam:
pt_br: Nome do Aplicativo
tr: Uygulama Adı:

source: Parent Directory:
ar: الدليل الأصل:
es_es: Directorio principal:
fr_fr: Répertoire parent :
ja: 親ディレクトリ:
nl_nl: Bovenliggende map:
pt_br: Diretório Pai:
tr: Üst Dizin:

source: Pick parent directory
ar: اختر الدليل الأب
es_es: Seleccionar el directorio principal
fr_fr: Choisir le répertoire parent
ja: 親ディレクトリを選択してください
nl_nl: Kies bovenliggende map:
pt_br: Escolha diretório pai
tr: Üst dizini seçin

source: short names
ar: اسماء قصيرة
es_es: nombres cortos
fr_fr: noms raccourcis
ja: 短縮名
nl_nl: korte namen
pt_br: nomes curtos
tr: kısa adlar

source: Invalid Application name
ar: اسم التطبيق خاطئ
es_es: El nombre de la aplicación no es válido
fr_fr: Nom d'application invalide
ja: アプリケーション名が不正です
nl_nl: Incorrecte Toepassingsnaam
pt_br: Nome de aplicativo inválido
tr: Geçersiz Uygulama adı

source: missing field
ar: حقل مفقود
es_es: falta un campo
fr_fr: Champ manquant
ja: 入力されていないフィールドがあります
nl_nl: ontbrekend veld
pt_br: campo não preenchido
tr: eksik alan

source: You need to select a base directory
ar: يجب اختيار دليل الأصل
es_es: Debe seleccionar un directorio base
fr_fr: Vous devez choisir un répertoire de base
ja: ベースディレクトリを選択してください
nl_nl: U dient een basis directory te kiezen
pt_br: Você precisa selecionar um diretório base
tr: Bir taban dizini seçmelisiniz

source: Start Server
ar: تشغيل خادم الويب
es_es: Iniciar servidor
fr_fr: Démarrer le serveur
nl_nl: Stat Server
pt_br: Iniciar Servidor
tr: Sunucuyu Başlat

source: auto-restart
ar: اعادة تشغيل تلقائي
es_es: reinicio automático
fr_fr: redémarrage automatique
nl_nl: herstart automatisch
pt_br: auto-reiniciar
tr: otomatik-yeniden-başlat

source: Catalyst Dev Server
ar: تشغيل خادم الويب للتطوير
es_es: Servidor de desarrollo de Catalyst
fr_fr: Serveur Catalyst de développement
pt_br: Servidor Desenv. Catalyst
tr: Catalyst Geliştirim Sunucusu

source: Stop Server
ar: ايقاف الخادم
es_es: Detener servidor
fr_fr: Arrêter le serveur
pt_br: Parar Servidor
tr: Sunucuyu Durdur

source: &Catalyst
ar: برنامج &Catalyst
