package PDK::Firewall::Element::Interface::Asa;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 引用 PDK::Firewall::Element::Interface::Role 角色
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::Interface::Role';

__PACKAGE__->meta->make_immutable;
1;
