package PDK::Firewall::Element::Interface::Fortinet;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 引用 PDK::Firewall::Element::Interface::Role 角色
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::Interface::Role';

#------------------------------------------------------------------------------
# PDK::Firewall::Element::Interface::Fortinet 通用方法
#------------------------------------------------------------------------------
has vdom => (is => 'ro', isa => 'Str', default => 'root',);

__PACKAGE__->meta->make_immutable;
1;
