package PDK::Firewall::Element::Interface::Paloalto;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 继承 PDK::Firewall::Element::Interface::Role 角色 方法属性
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::Interface::Role';

__PACKAGE__->meta->make_immutable;
1;
