package PDK::Firewall::Element::Interface::Srx;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 引用 PDK::Firewall::Element::Interface::Role 角色
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::Interface::Role';

#------------------------------------------------------------------------------
# PDK::Firewall::Element::Interface::Srx 通用属性
#------------------------------------------------------------------------------
has routeInstance => (is => 'ro', isa => 'Str', default => 'default',);

__PACKAGE__->meta->make_immutable;
1;
