{
  "version": "https://jsonfeed.org/version/1",
  "title": "Allen Pike",
  "home_page_url": "https://www.allenpike.com/",
  "feed_url": "http://www.allenpike.com/feed.json",
  "author": {
    "name": "Allen Pike"
  },
  "items": [
    {
      "id": "/2019/podcast-episode-numbers",
      "url": "http://www.allenpike.com/2019/podcast-episode-numbers",
      "title": "325: Podcast Episode Numbers",
      "date_published": "2019-02-28T21:10:10+00:00",
      "content_html": "<p>In iOS 11, Apple  made a variety of <a href=\"https://developer.apple.com/videos/play/wwdc2017/512\">changes and improvements</a> to the Apple Podcasts app and spec. Among other things, they added support for a new show format: serial podcasts. Finally, narrative-driven shows could request be shown in strict chronological order.</p>\n\n<p>As part of this change, Apple added support for an “episode number” tag, and recommended that podcasters stop including episode numbers directly in the title of each episode. <em>Sure whatever, metadata best practices blah blah.</em></p>\n\n<p>Smash cut to yesterday, when we all received a mass email from Apple Podcasts about ensuring our show isn’t “rejected or removed from Apple Podcasts” by “optimizing your show’s metadata”. While much of it was just about not being spammy, they asked more firmly this time for podcasters to stop including episode numbers in titles:</p>\n\n<blockquote>\n  <p><strong>Adding episode numbers in titles.</strong> For example, show titles like “The Very Hungry Tourists Episode 01” or episode titles like “01 Broken Heirloom.”</p>\n</blockquote>\n\n<p>I was a bit surprised by this. <em>Everybody</em> includes episode numbers in their titles… don’t they? Though come to think of it, why do we? Why do I do it for <a href=\"https://funfact.fm/\">Fun Fact</a>? We don’t number our blog posts; why podcasts? Am I being sucked into a deeply pedantic rabbit hole, never to return?</p>\n\n<h2 id=\"no-why-why-do-you-care-about-this-allen\">No, why, why do you care about this Allen</h2>\n\n<p>According to historians, podcasters have included episode numbers in titles since the late Cretaceous Period. There are a few benefits, but the primary two are:</p>\n\n<ol>\n  <li>Give people an easy handle to find or refer back to to a specific episode</li>\n  <li>Make it easier to play through episodes from the beginning in a podcast client</li>\n</ol>\n\n<p>While the introduction of “serial” shows has made playing from the beginning easy for certain kinds of podcasts, apps still make the assumption that all shows are either <strong>strictly</strong> linear and need to be listened to in order (a crime investigation in 10 parts), or that each episode is <strong>completely</strong> unrelated and you would never want to start from the beginning (a daily news briefing).</p>\n\n<p>This is a pain in the ass for shows where the episodes are <em>loosely</em> ordered, kind of like a sitcom. The episodes make sense on their own, so new viewers probably want to check out the latest one first – but there are back-references and follow-up items that can make it appealing to listen from the beginning. Without episode numbers, this can be annoying to actually do.</p>\n\n<p>In an <em>ideal world</em>, Apple would support a third type of show, something like <code class=\"highlighter-rouge\">episodic-series</code>, for shows where playing from either end is desirable. It could then prioritize the newest episodes, but still surface episode numbers and accommodate users who want to start at the beginning.</p>\n\n<p>Back in the <em>actual world</em>, Apple wants you to decide if your show is linear or ephemeral, and stop trying to hedge that classification.</p>\n\n<p>Still though, why do they care? Is it truly awful to have semi-episodic podcasts putting numbers in their episode titles?</p>\n\n<p>As is often the case, you can indeed find something truly awful by exploring iTunes:</p>\n\n<p><img src=\"https://www.allenpike.com/images/2019/itunes-numbers.png\" /></p>\n\n<p>Yes that’s right, on the desktop iTunes will number your numbered episodes <em>as if the latest episode was episode 1</em>, followed mind-bendingly by the episode number you’ve included in the title. While this is horrific, it actually makes podcasters <em>want</em> to keep including their episode numbers right in the title, since otherwise the presentation makes it look like the newest episode was actually your first, which is even more horrific and I just can’t even with this thing.</p>\n\n<p>Thankfully, most people do not listen to podcasts in desktop iTunes. The big show, the app that we – and Apple – are concerned about is Podcasts on iOS. So let’s take a look at how episode numbers show up there.</p>\n\n<h2 id=\"045-the-why-do-you-care-about-this-allen-show-ne\">045: The Why Do You Care About This Allen Show – Ne…</h2>\n\n<p>With iOS 11 and the new metadata, Apple built accommodations for episode numbers into the UI, allowing them to cleanly and consistently show numbers in contexts where it matters – such as serial shows – and <em>not</em> show episode numbers in contexts where it doesn’t matter. For an example, let’s take a look at the Top Episodes list.</p>\n\n<p><img src=\"https://www.allenpike.com/images/2019/podcasts-top-episodes.jpg\" style=\"float: right; width: 300px\" /></p>\n\n<p>Now, £1 says that Jony Ive would be rather cross if he saw this list with <strong>5</strong> different formats for showing episode numbers. With title data this noxious, there’s not much Apple can do to present a nice, clear list of episodes.</p>\n\n<p>Consistency aside, in this context the episode numbers aren’t even useful. While the Top Episodes list should in theory be a gentle entry point for somebody new to podcasting, it is currently weird and intimidating.</p>\n\n<p>If they can get podcasters to provide title and episode number metadata separately, Apple Podcasts can show the numbers where relevant, and style the them thoughtfully in different contexts, rather than being forced to serve up the the dog’s breakfast that is episode title metadata today.</p>\n\n<p>And while numbers in titles is a time-honoured tradition, I have to admit that episodes of newer shows that follow Apple’s guidelines look pretty nice amongst their metadata-laden peers.</p>\n\n<p><a href=\"https://www.allenpike.com/images/2019/podcast-player-numbers.jpg\"><img src=\"https://www.allenpike.com/images/2019/podcast-player-numbers.jpg\" /></a></p>\n\n<p>The more I look at these screenshots, the more sympathetic I am to the ideal of relegating the episode numbers to metadata, and having player apps take the responsibility of showing those numbers where they’re useful. In fact, when it comes to finding specific episodes or playing “episodic” shows chronologically, modern podcast apps already have some helpful features that make episode numbers less important than they once were.</p>\n\n<p>For example, in Overcast you can tell a smart playlist to sort by “Oldest to Newest by Podcast”. Then, if you go into a show’s back catalog and add a horde of early episodes, they’ll automatically stay together in chronological order. It’s pretty hidden, but in Castro you can also queue up a show chronologically by subscribing to a show, then going to Library → <em>That Show</em>, then dragging “All” to your queue.</p>\n\n<p>While neither of these approaches are as nice as a simple UI for playing a show from the beginning, I think they can bridge the gap if shows start to move episode numbers into metadata and players get smarter about it.</p>\n\n<p>Similarly with episode discovery, instead of scrolling to find a numbered show, you can type an episode title into Apple Podcasts and it will come right up. In Overcast you need to search for the show first and then the episode title, but the functionality is still there.</p>\n\n<p>Unfortunately, there is still a gap between the web and podcast players when it comes to linking an episode. As far as I know, there’s no way yet for your podcast’s website to predict the URL for “Open Episode X in Player Y”, which would make it easier to go from a Google search or a shownotes link right to listening to an episode. With luck this will come.</p>\n\n<h2 id=\"i-get-it-you-care-what-are-you-going-to-do-about-it\">I get it, you care, what are you going to do about it</h2>\n\n<p>Regardless of what any 3rd party podcast apps are doing, the reality is that Apple runs the biggest podcast directory and app in the world. They’ve told us to give them a clean title and episode tag in <code class=\"highlighter-rouge\">&lt;itunes:title&gt;</code> and <code class=\"highlighter-rouge\">&lt;itunes:episode&gt;</code>. In return, they’ll be more likely to feature our show, Jony will be placated, and they’ll stop maybe-implying that our podcast may be “rejected or removed”. So, a pretty easy call there, I think.</p>\n\n<p>A more interesting question remains though: for semi-episodic shows like Fun Fact where people may want to start at the beginning, should we keep the episode number in the <code class=\"highlighter-rouge\">&lt;title&gt;</code> tag for 3rd party clients like Overcast and Castro? Certainly some people with opinions on the internet <a href=\"https://twitter.com/apike/status/1100837204346032128\">think so</a>.</p>\n\n<p>But I have to admit: I can’t unsee what I’ve seen. I’ve beheld the clean and clear presentation of numberless episode titles. I’ve heard from the listeners who are scared off from trying out podcasts where every title advertises how many episodes they’ve missed. I’ve come to terms with the fact that for our show – even a few months in – starting with the most recent episode is the way to go. And most dangerously of all, I’ve come to the conclusion that It Would Be Nice™ if podcast players directly used the episode meta tag to only show numbers where it matters.</p>\n\n<p>So, as of today, our episode titles are clean and number-free. It was difficult and emotionally taxing, but I have made peace with my decision.</p>\n\n<p>May the the era of clean podcast titles one day come to pass.</p>\n\n<hr />\n\n<p><em>Update</em>: Apple just sent a followup email clarifying that “Your Show Won’t Be Removed for Having Episode Numbers in Episode Titles”. It then goes on to say:</p>\n\n<blockquote>\n  <p>We encourage you to use the tag to send us your episode numbers. If you decide to include episode numbers in your episode</p>\n</blockquote>\n\n<p>The email then ends mid-sentence. We can only speculate on the fate of the Apple Podcasts employee who attempted to send this missive. Our thoughts are with their family tonight.</p>\n"
    },{
      "id": "/2019/navigation-should-be-boring",
      "url": "http://www.allenpike.com/2019/navigation-should-be-boring",
      "title": "Navigation Should Be Boring",
      "date_published": "2019-01-31T21:10:10+00:00",
      "content_html": "<p>When launching a product, especially a consumer-oriented one, you want it to be interesting. A novel, bold, or distinctive UI can make an app stand out from the crowd, be memorable, and inspire curiosity. Plus, it’s cool.</p>\n\n<p>Luckily, there are a lot of ways you can make an interface interesting. You can use striking colours, intriguing illustrations, or thoughtful copywriting. You can add whimsical touches of animation or sound. You can make the feature set brilliantly simple, or awesomely powerful. Almost any part of an app can be a good place to add novelty, except for one: navigation. Navigation is different.</p>\n\n<p>Navigation should be boring.</p>\n\n<p><a href=\"https://twitter.com/lukew/status/1037763082863312896\"><img src=\"https://www.allenpike.com/images/2019/lukew-bottombars.jpg\" /></a></p>\n\n<p>With a delightfully boring navigation scheme, users don’t need to learn how to explore your app. Their “attention span budget” can thus be spent considering how your new thing can fit into their lives, rather than trying to recall how many fingers they’re supposed to drag from the left side of the screen in order to pull out the Alternate Quick Access Wheel.</p>\n\n<p>While experienced design and development teams will usually tamp down on the worst navigation fever dreams in short order, there is often still an allure, or even explicit pressure, to build out novel navigation patterns. It’s just so damn satisfying to transcend the standard fare. “Would it be <em>so</em> bad if we just tried just a little horizontal scroll here, and <em>just one</em> two-finger gesture there..?” One thing leads to another, and your app’s first-run experience is a screen filled with goofy arrows and hand-written tips like “insert tab A into slot B to view next photo”.</p>\n\n<p>If you’re weird-navigation skeptic, then take heart: the data is on your side. The A/B tests and other success metrics I’ve seen almost always support clear, familiar navigation approaches. <a href=\"https://twitter.com/lukew/status/968240144296787969?lang=en\">Tab bars</a> get better engagement than hamburger menus, many users don’t even find gestures, and simple menus works better than a whiz-bang feature dashboards. Boring navigation affordances lead to more navigation, and faster navigation, than clever ones do. As the nobly helmeted interaction designer Luke Wroblewski likes to say, “<a href=\"https://www.lukew.com/ff/entry.asp?1945\">Obvious always wins.</a>”</p>\n\n<p>Of course, metrics aren’t everything, and there are examples of products that have implemented novel navigation schemes that were very well received. Even ignoring the obvious exception of games, a lot of the most interesting apps released over the years – from <a href=\"http://blog.jaredsinclair.com/post/75555794917/designing-unread\">Jared Sinclair’s Unread</a> and Q Branch’s Vesper on the indie side, to Snapchat and <a href=\"https://www.youtube.com/watch?v=Zq6-b9_V9lA\">Facebook’s Paper</a> at other end of the spectrum – invested in novel navigation patterns and styles that made them truly distinctive.</p>\n\n<p>Which is super cool. But also kind of sad, since this type of investment doesn’t typically pay off.</p>\n\n<h2 id=\"the-high-price-of-failure\">The high price of failure</h2>\n<p>Notwithstanding the usability pitfalls, there is a bigger reason why a new app shouldn’t have an experimental navigation scheme: the cost is too damn high.</p>\n\n<p>We know that building good products is all about iteration. And typically, the parts of your product that need the most iteration are the novel ones. The neat stuff, the distinctive bits. That’s no problem if you’re iterating a sound effect, a button asset, or even better a core user-facing feature. It gets expensive and wasteful fast though if you’re thrashing around how your screens are organized, divided, and connected. God help you if you’re halfway through a wild navigation experiment and an iOS update breaks your custom UINavigationController wallhacks before you’ve even been able to market-test them. It’s no fun.</p>\n\n<p>Once you ship, things go from bad to worse. Overhauling the navigation of a living app is even more time-consuming, and is also usually poorly received by existing users – even if the new scheme is objectively better. Just ask Snapchat: after they concluded their wacky navigation scheme was inhibiting long-term growth, they launched a reworked UI that was easier to use – and monetize – but suffered <a href=\"https://www.theverge.com/2018/2/21/17037100/snapchat-update-redesign-petition-response\">a huge backlash from users</a> who were used to the old UI. Perhaps if they’d tracked towards clear navigation a little earlier, Instagram wouldn’t be eating their lunch as badly today.</p>\n\n<p>Of course, it doesn’t matter what’s good for Snapchat or anybody else. What matters is what’s good for your product and its customers. The app you’re building today. And if your goal is to make a distinctive app, then dollar for dollar, sprint for sprint, novel navigation schemes are one of the worst ways to achieve that.</p>\n\n<p>So do your app a favour: keep the navigation boring. At least at first. Use colour, typography, and the many other tools in your tickle trunk to make your product interesting and appealing while you prove out your business model. Invest in navigation, sure – but invest in making it clear, fast, and good.</p>\n\n<p>That is to say: make it boring.</p>\n\n<p><a href=\"https://twitter.com/lukew/status/1059518636187181056?lang=en\"><img src=\"https://www.allenpike.com/images/2019/lukew-translate.jpg\" /></a></p>\n"
    },{
      "id": "/2019/fun-fact",
      "url": "http://www.allenpike.com/2019/fun-fact",
      "title": "Fun Fact",
      "date_published": "2019-01-12T16:00:00+00:00",
      "content_html": "<p>A new podcast where every other Friday, Arik Devens and I discuss a variety of fun facts. They range from historical, to practical, to garburetor-related. It’s fun.</p>\n\n<p><em>This year, in addition to my typical longer articles, I’ll also post some simple links from time to time. This is one of those.</em></p>\n"
    }
  ]
}