{
    "version": "https://jsonfeed.org/version/1",
    "title": "News from Flying Meat",
    "home_page_url": "http://flyingmeat.com/blog/",
    "feed_url": "http://flyingmeat.com/blog/feed.json",
    "description": "News from your friends at Flying Meat.",
    "author": {
        "name": "Gus Mueller"
    },
    "items": [
        {
            "id": "http://flyingmeat.com/blog/archives/2017/6/new_acorn_plugins_from_observatory.html",
            "title": "New Acorn Plugins from Observatory",
            "content_html": "<p>The folks behind Code Obsession, creators of Observatory, <a href=\"http://codeobsession.com/observatory/doc/acorn.html\">just put out some new plugins for Acorn</a> to read FITS, XISF and SBIG images:</p>\n<blockquote>\n<p>&quot;Code Obsession’s Acorn Plugins add FITS, XISF and SBIG image support to Acorn. After installing the plugins, you can open any such image as easy as a JPEG or TIFF.</p>\n<p>&quot;Calibrate, align and stack your images in Observatory, export as 32 bits FITS, open in Acorn and start post-processing. Add layers, annotations, watermarks. The options are endless.&quot;</p>\n</blockquote>\n<p>I wrote the plugin api to do this years ago, but except for a few small examples it was never really used. However, earlier this week Sander Berents from Code Obsession contacted me about it since Acorn&#39;s ability to save 64 and 128 bit images with non destructive filters (ie- curves and levels) was perfect for astronomical data. Acorn 5.6.5 was just about to go out and I made a couple of tweaks to the API for him, and that was that.</p>\n",
            "date_published": "2017-06-17T14:19:46-07:00",
            "url": "http://flyingmeat.com/blog/archives/2017/6/new_acorn_plugins_from_observatory.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2017/6/acorn_6_public_beta.html",
            "title": "Acorn 6 Public Beta",
            "content_html": "<p>It&#39;s been a long time since we&#39;ve done a public beta of a major app release. In fact, we&#39;ve <em>never</em> done this before for Acorn. But we feel now is a great time to open up Acorn 6&#39;s beta to the public.</p>\n<p>So we&#39;re happy to say that we&#39;ve got <a href=\"http://flyingmeat.com/download/6/\">Acorn 6 in public beta</a> for you to try out today.</p>\n<p>We&#39;re introducing some great new features and refinements, including text on a path, cloning across layers and images, improvements to web export and smart layer export, and new shape stroke options.</p>\n<p>We&#39;ve also added some great new tools for working with color profiles and wide gamut images, which is becoming more important every day for iPhone and pro photographers alike. You can now load and export color profiles from the Image ▸ Color Profile… menu. And when you&#39;re exporting for the web, you can highlight the areas of your DP3 or wide gamut image which are out of the range of sRGB.</p>\n<p>And there&#39;s more of course, <a href=\"http://flyingmeat.com/download/6/\">so why not grab the beta</a>?</p>\n<p>We&#39;re doing something new with trials in Acorn 6. The direct version will get its usual 14 day trial, but after that&#39;s up you&#39;ll be able to still use Acorn to view your images. The only change will be that the tools are disabled if you choose not to purchase it. We&#39;re also doing this for the App Store version in Acorn 6. When Acorn officially ships you&#39;ll be able to download it for free and &quot;purchase&quot; a 14 day trial for $0.00. When that&#39;s up you can keep on using Acorn to view your images, or you can unlock Acorn at the usual price. This will make it really easy for App Store customers to download Acorn and try it out.</p>\n<p>Finally- one of the reasons we&#39;re doing a public beta, and one of the reasons that we still love working on Acorn, is hearing about what you like and what you think needs improvement. So if you like something- <a href=\"mailto:support@flyingmeat.com\">let us know</a>! And if there&#39;s something you&#39;d like to see better- <a href=\"mailto:support@flyingmeat.com\">let us know</a>! And if you hate it- <a href=\"mailto:support@flyingmeat.com\">let us know that too</a>. The feedback we get from our customers is the main driver for changes in Acorn.</p>\n<p><a href=\"http://flyingmeat.com/download/6/\">So go grab the Acorn 6 beta already</a>.</p>\n<p><strong>Mini FAQ</strong>:<br>If you purchase Acorn 5 directly from us between now and Acorn 6&#39;s release, you&#39;ll be emailed an Acorn 6 license when it ships. We aren&#39;t able to do this for the App Store however (sorry).<br>Acorn 6 requires 10.11.4 or later, including MacOS 10.12 Sierra. Acorn will of course support 10.13 when it comes out in the fall.</p>\n<p>P.S., I&#39;m also using this as an opportunity to kick off our new forums, which you can find at <a href=\"https://forums.flyingmeat.com\">https://forums.flyingmeat.com</a>.</p>\n",
            "date_published": "2017-06-20T13:50:33-07:00",
            "url": "http://flyingmeat.com/blog/archives/2017/6/acorn_6_public_beta.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2017/7/acorn_6.html",
            "title": "Acorn 6",
            "content_html": "<center><img src=\"https://s3.amazonaws.com/flyingmeat/acorn6/newsletter_6_header.jpeg\" width=\"549\" height=\"254\" /></center>\n\n<p>So we <a href=\"http://flyingmeat.com/acorn/\">released Acorn 6</a> today. 🎉</p>\n<p>It&#39;s been a lot of work and it shipped a little later in the year than we planned, but we&#39;re really happy to have something awesome for everyone to use. And in addition to that, we&#39;ve currently got it on sale for 50% off. <a href=\"http://flyingmeat.com/acorn/\">Go grab it</a> for cheap while you can.</p>\n<p>What&#39;s new and awesome?</p>\n<p>For a number of years, text on a path has been our number one feature request and we finally got to deliver it with version 6. Acorn has always had great text support; it handles unicode effortlessly, and you can have multiple font faces and weights in a single text block. You can even have emoji as part of your text block. All of these same features work perfectly with text on a path. Inline editing, selection, etc- it just works. And it was a ton of fun to code on as well. Buy me a beer someday and I&#39;ll spill the details on how I coded it.</p>\n<p>We also implemented our number two feature request, clone tool improvements. You can now select any layer as a clone source (bitmap layers, a group of layers, even shape layers) and then clone to any other layer, or even another image. We also added stamping to the clone tool, which works by holding down the shift key when you click on your image.</p>\n<p>Wide gamut images are all around us now thanks to newer iPhones and DSLRs, and we wanted to find a way in Acorn to show you where the colors in your image may fall out of the range of sRGB (which is pretty much the current standard color profile these days). We did that by adding an extra option in the web export window, which shows up when your image is wider than sRGB. When turning it on, you&#39;ll get a nice view of your image with areas highlighted that fall out of the range of sRGB. There are also options to convert your image to sRGB at that point, either by perceptually matching colors or just by assigning the sRGB profile to your image without touching the source pixels.</p>\n<p>What else is cool? Inner and outer stroke for vector shapes! New boolean options for shapes! Smart Layer Export things! Much improved interactions when cropping, transforming, or other things that used to be modal operations. And more. Full <a href=\"http://flyingmeat.com/acorn/releasenotes.html\">release notes are available</a> (actually- that statement is only partially true. There are a lot of little things we didn&#39;t include in the official notes).</p>\n<p>And as mentioned in a previous post, we&#39;re doing something new with trials in Acorn 6. The direct version will get its usual 14 day trial, but after that&#39;s up you can still use Acorn to view your images. The only change will be that the tools are disabled if you choose not to purchase it. We&#39;re also doing this for the App Store version in Acorn 6. You can download it for free and &quot;purchase&quot; a 14 day trial for $0.00. When that&#39;s up you can keep on using Acorn to view your images, or you can unlock Acorn at the usual price. This will make it really easy for App Store customers to download Acorn and try it out. We&#39;re really curious as to how this is going to work out in the long run, and if you choose this option- let us know how you like it.</p>\n<p>And finally, I should mention that Acorn improvements mostly come from ideas from our customers. So if there&#39;s something you&#39;d like to see, <a href=\"mailto:support@flyingmeat.com\">let us know</a>.</p>\n<p>Now off to work on the inevitable 6.0.1 release…</p>\n",
            "date_published": "2017-07-10T13:55:17-07:00",
            "url": "http://flyingmeat.com/blog/archives/2017/7/acorn_6.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2017/8/acorn_5.6.6_updated.html",
            "title": "Acorn 5 Updated",
            "content_html": "<p>Just because <a href=\"https://flyingmeat.com/acorn/\">Acorn 6</a> is out, doesn&#39;t mean we&#39;ve forgotten about Acorn 5. We&#39;ve just released Acorn 5.6.6, which you can get via the Acorn ▸ Check for Updates… menu, or via the App Store updates tab.</p>\n<p>This release has bug fixes (including specific fixes for 10.13), and accepts Acorn 6 registration numbers as well.</p>\n",
            "date_published": "2017-08-24T10:19:18-07:00",
            "url": "http://flyingmeat.com/blog/archives/2017/8/acorn_5.6.6_updated.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2017/9/acorn_and_10.13.html",
            "title": "Acorn and 10.13",
            "content_html": "<p>Happy Mac OS High Sierra release day everyone.</p>\n<p>I&#39;m happy to say that there are no known issues with <a href=\"https://flyingmeat.com/acorn/\">Acorn</a> 6.0.3 or Acorn 5.6.6 when running on Mac OS 10.13 High Sierra. In fact, you might even notice that some things are actually faster and it can now open HEIF images. How awesome is that?</p>\n<p>I&#39;m also working on some 10.13 goodies for Acorn 6 folks later this year. I can&#39;t wait to share that with you, but you&#39;ll have to wait just a little bit.</p>\n",
            "date_published": "2017-09-25T14:27:27-07:00",
            "url": "http://flyingmeat.com/blog/archives/2017/9/acorn_and_10.13.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2018/2/acorn_6.1_is_out.html",
            "title": "Acorn 6.1 Is Out",
            "content_html": "<p><a href=\"https://flyingmeat.com/acorn/\">Acorn 6.1 has been released</a>.</p>\n<p>You can <a href=\"http://shapeof.com/archives/2018/2/acorn_6.1_is_out.html\">read a longer post about it</a> over on Gus&#39;s blog, but the short of it is: Better, faster, smoother, stronger. And now with Metal 2 support.</p>\n",
            "date_published": "2018-02-16T09:59:11-08:00",
            "url": "http://flyingmeat.com/blog/archives/2018/2/acorn_6.1_is_out.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2018/6/a_pair_of_updates.html",
            "title": "A Pair of Updates",
            "content_html": "<p>Happy summer solstice everybody! (at least for folks in the northern hemisphere, and for folks in the south… sorry. It&#39;s going to start getting brighter for you though).</p>\n<p>Today I&#39;ve got a pair of minor app updates to annouce for you.</p>\n<p>First up is <a href=\"https://flyingmeat.com/acorn/\">Acorn 6.1.3</a>, which <a href=\"https://flyingmeat.com/acorn/releasenotes.html\">fixes a number of bugs</a> including one that stemmed from trying to use QuickLook on a file that was created with Acorn 1.0. For the one or two of you that this was affecting, hurray!</p>\n<p>Next up is <a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch</a>, which also <a href=\"https://flyingmeat.com/retrobatch/releasenotes.html\">includes some bug fixes</a>, the beginnings of Voice Over support, performance improvements, and more.</p>\n<p>What&#39;s next for these apps? Work on Acorn 6.2 will begin shortly, as will Retrobatch 1.1. WWDC introduced some great new APIs that I want to take advantage of (cool new machine learning things), so that&#39;ll be a focus- as well as Dark Mode for Acorn and one other major thing I&#39;ve got planned. Retrobatch will probably also get the Dark Mode treatment, but not until I&#39;ve done it for Acorn first.</p>\n<p>So it&#39;s going to be a busy summer, but I&#39;m looking forward to it.</p>\n",
            "date_published": "2018-06-21T10:18:46-07:00",
            "url": "http://flyingmeat.com/blog/archives/2018/6/a_pair_of_updates.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2018/9/retrobatch_1.1_is_out.html",
            "title": "Retrobatch 1.1 Is Out",
            "content_html": "<p>Here&#39;s something new for your lazy <strike>August</strike> September* morning: <a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch 1.1 is out</a>.</p>\n<p>What&#39;s new and awesome? Well, <a href=\"https://flyingmeat.com/retrobatch/\">Retrobatch</a> now has some great scripting goodness in the form of a new Automator action which will run a workflow for you (and create Automator droplets), a new JavaScript node*, and the ability to run Retrobatch workflows from the terminal.</p>\n<p>We&#39;ve added a handful of new nodes such as Dither, Auto Enhance, Instant Alpha, and Color Posterize. New options to existing nodes have also shown up, such as &quot;Only scale smaller&quot; for the Scale node.</p>\n<p>And an interesting idea that I&#39;ve had folks ask about a number of times- it&#39;s now possible to run an image through a machine learning classifier, and then have the classification written to metadata such as the image title, or keywords. This was done by adding token support to the Set Specific Metadata node. This also means you can use other tokens such as the Current Year in metadata fields. Awesome? We think so.</p>\n<p>The <a href=\"https://flyingmeat.com/retrobatch/releasenotes.html\">full release notes are available</a>, and if you have ideas or questions- make sure to <a href=\"https://forums.flyingmeat.com/\">poke around on the forums</a> or write us: <a href=\"mailto:support@flyingmeat.com\">support@flyingmeat.com</a>. We&#39;ve got lots of ideas for future releases, but if you&#39;d like something specific in there make sure to let us know.</p>\n<p><br/></p>\n<div style=\"color:#666\">\n<em> Whoa, it&#39;s September already?<br/><br/>\n\n*</em>I&#39;m calling the JavaScript node a &quot;preview&quot;. It works very well, but I&#39;m not 100% sold on the API that I&#39;ve provided to folks. So this is a disclaimer that it might change a little bit in the future.</div>",
            "date_published": "2018-09-07T09:43:10-07:00",
            "url": "http://flyingmeat.com/blog/archives/2018/9/retrobatch_1.1_is_out.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2018/9/acorn_6.2_with_mojave_dark_mode_is_out.html",
            "title": "Acorn 6.2 With Mojave Dark Mode Is Out",
            "content_html": "<p>On Monday I flipped some switches on the FM servers and <a href=\"https://flyingmeat.com/acorn/\">Acorn 6.2</a> was released to the universe. You might also remember that Monday a little known operating system from Apple was updated, which includes a neat new feature known as Dark Mode.</p>\n<center><img src=\"https://shapeof.com/archives/2018/media/acorn62.jpeg\" width=\"800\" style=\"\" /></center>\n\n<p>I think Acorn looks pretty good in Dark Aqua, especially the icon refresh from <a href=\"http://www.matthewskiles.com/\">Matthew Skiles</a>.</p>\n<p>To celebrate the new release, we&#39;ve put <a href=\"https://flyingmeat.com/store/\">Acorn on sale for 50% off</a>. So go grab it at the insanely low price of $14.99. If you haven&#39;t already upgraded from previous versions of Acorn, now is a good time to do so.</p>\n<p>We&#39;ve also packed a bunch of little changes, bug fixes, and compatibility with Mojave in there. And of course, there&#39;s more to come in the future as always.</p>\n",
            "date_published": "2018-09-27T14:37:21-07:00",
            "url": "http://flyingmeat.com/blog/archives/2018/9/acorn_6.2_with_mojave_dark_mode_is_out.html"
        },
        {
            "id": "http://flyingmeat.com/blog/archives/2019/1/acorn_6.3_is_out.html",
            "title": "Acorn 6.3 Is Out",
            "content_html": "<p><a href=\"https://flyingmeat.com/acorn/\">Acorn 6.3 is available</a>, and the full <a href=\"https://flyingmeat.com/acorn/releasenotes.html\">release notes</a> are up as well.</p>\n<p>Here&#39;s what I think is awesome in this release:</p>\n<p><strong>Portrait Mask Support</strong>. If you have an iPhone running iOS 12 (and can take Portrait photos), Acorn will now detect the Portrait Matte from those images and turn it into a layer mask. The Portrait Matte is the image data which enables blurring in the background, or other fancy camera tricks. This means you can use this matte to erase and add fancy backgrounds or custom blurs for your image, all within Acorn.</p>\n<p><strong>Other Mask Features</strong>. You can now drag and drop masks from the layers list into another layer, or copy it out as a new layer. When exporting layers you now have an option to apply the mask on export, or just write it as an additional image along with everything else. There are a number of new shortcuts when dealing with layer masks as well.</p>\n<p><strong>Brush Stuff</strong>. If you&#39;re running MacOS 10.13 or later, you get a performance boost when brushing (painting, smudging, cloning, etc…). This is especially noticeable when brusing on deep color images.</p>\n<p>I&#39;ve also added options to the brush palette for adjusting flow, softness and blending. In addition to all this, there&#39;s a bunch of new brushes under the &quot;Basic Round&quot; category which are designed for the new brush engine.</p>\n<p><strong>Other Stuff</strong>. There&#39;s other good things including improved PDF export, various MacOS Mojave UI fixes, additional speed improvements with with deep images, and more. And as always, it&#39;s a free upgrade for anyone who has already purchased Acorn 6.</p>\n",
            "date_published": "2019-01-09T13:00:07-08:00",
            "url": "http://flyingmeat.com/blog/archives/2019/1/acorn_6.3_is_out.html"
        }
    ]
}