{
    "version": "https://jsonfeed.org/version/1",
    "title": "Maybe Pizza?",
    "home_page_url": "https://maybepizza.com/",
    "feed_url": "https://maybepizza.com/feed.json",
    "description": "Gus's experiments in making pizza with very hot ovens.  And Pizza reviews, why not?.",
    "author": {
        "name": "Gus Mueller"
    },
    "items": [
        {
            "id": "https://maybepizza.com/archives/2016/11/another_new_pizza_oven.html",
            "title": "Another New Pizza Oven",
            "content_html": "<p>I bought a <a href=\"http://www.webstaurantstore.com/waring-wpo500-single-deck-countertop-pizza-oven-120v/929WPO500.html\">Waring WPO500</a> pizza oven for my birthday. It&#39;s a piece of junk, you shouldn&#39;t get one.</p>\n<p>The elements are so weak that I was never able to get it up to its max temperature. There is no way to adjust the bottom heat temp versus the top, so you end with burnt pizzas on the bottom. And the amount of insulation it comes with is a complete joke.</p>\n<p>I wasn&#39;t surprised though, I kind of figured this would be the case. My intention when buying this, was to beef up any insulation if it need it, add another element or two, and use my own stones in the oven. And that is exactly what I&#39;ve done.</p>\n<center><img class=\"bb\" src=\"https://maybepizza.com//images/2016/img_4608.jpeg\" alt=\"Pizza #3\"  width=\"660\" /><div style=\"color: #666; padding-top: 2px;\">Pizza #3</div></center>\n\n<p>With my improvements, I&#39;m seeing around a 30 minute warm up time and bakes that are a little less than 2 minutes. This is about double the amount of time it would take to cook my pizzas in <a href=\"http://maybepizza.com/archives/2014/6/rocket.html\">Rocket</a>, but they are still coming out great. In fact there&#39;s a certain… quality to the pizzas that I&#39;m not quite able to put into words yet, but they seem to be coming out even better than they would in Rocket. I think it might have to do with using a more starter to get the dough going, but there&#39;s also a lot more volume in the oven chamber of the Waring oven, which might be contributing to the difference.</p>\n<p>I haven&#39;t thought of a name yet, as it hasn&#39;t quite settled on a personality. But I&#39;ll keep on hacking on it, and eventually come up with something.</p>\n",
            "date_published": "2016-11-19T16:11:14-08:00",
            "url": "https://maybepizza.com/archives/2016/11/another_new_pizza_oven.html"
        },
        {
            "id": "https://maybepizza.com/archives/2017/1/youre_going_to_fuck_up_some_pizzas.html",
            "title": "You're going to fuck up some pizzas.",
            "content_html": "<p>You need to <a href=\"https://twitter.com/tomdale/status/814616894762323968\">follow the link to read the whole image</a>, but here&#39;s a neat passage from an unknown (to me) pizza book. </p>\n<p><a href=\"https://twitter.com/tomdale/status/814616894762323968\">Profunctor Optics on Twitter</a>:</p>\n<blockquote>\n<p>&quot;We wish someone sat us down, looked us in the eye and told us that before we went on this journey. There were a couple times when, propelled into a fit of rage, pizza peel thrown across the room, tomato sauce splattered against the kitchen floor, we honestly regretted ever even trying to make homemade pizza. The failure of a single pie extended to our entire existence.&quot;</p>\n</blockquote>\n<p>Update: Apparently this is from <a href=\"http://make.pizza\">make.pizza</a>.</p>\n<!--\nHere's the ocr'd text:\nYou're going to fuck up some pizzas. \n\nWe wish someone sat us down, looked us in the eye and told us that before we went on this journey. There were a couple times when, propelled into a fit of rage, pizza peel thrown across the room, tomato sauce splattered against the kitchen floor, we honestly regretted ever even trying to make homemade pizza. The failure of a single pie extended to our entire existence. \n\nWhat is it about the simple act of dropping a pizza that can cause an existential crisis? \n\nAQ had a particularly harrowing encounter with imperfection. He carefully made the dough, waited patiently for several days, did all the necessary prep work, and had a plan for a perfect meal. Then disaster struck: the pizza ended up lying half-folded over on the black and white checkered kitchen tile, and all of AQs hopes for success collapsed into that half-baked mozzarella inferno. Disappointment wasn't the root feeling. The inability to conquer the making of a simple pizza somehow was a sign of a deeper intrinsic weakness. He thought: \"I am a failure:' \n\nSo AQ got angry. He started yelling, throwing his hands up, and tossing his tools around. He was angry at his own feelings of inadequacy, but he blamed those feelings on everyone and everything around him. \n\nIt took a while to recover and make pizza again, but the urge to try crept back and the next time AQ made pizza it came out better. \n\nThat wasn't the last time either of us screwed up. Over the past eight years it's happened more times than we would like to admit, and it even happened while we made the pizzas for the photos in this book. \n\nWhat we learned along the way is that messing up is not actually a sign that we are shitty bakers (or worse). These incidents are reminders that sometimes you fail (we're guessing that people who play competitive sports as kids learn this lesson sooner, but we will admit that we were more indoor kids). Failure isn't something that you need to con-quer and \"defeat,\" rather failure is part of being successful at whatever you're trying to do, especially when there are many variables involved beyond your control. \n\nOver time our pizza disasters have become fewer and far between. Practice makes us better. Our higher success rates stem from observation. We've learned to document every detail of the process. Our goal is to try to share as many of those details with you, but we know your pizza making success will come from becoming aware of all of the subtle aspects of the craft. You're going to fail at least a couple of times no matter what, and we're here to tell you that not only is that OK but it means you're on your way to learning more. \n\nEnough with being sappy, let's go make some pizza. \n-->",
            "date_published": "2017-01-02T20:43:11-08:00",
            "url": "https://maybepizza.com/archives/2017/1/youre_going_to_fuck_up_some_pizzas.html"
        },
        {
            "id": "https://maybepizza.com/archives/2017/1/a_couple_of_dough_tips.html",
            "title": "A Couple of Dough Tips",
            "content_html": "<p>A couple of tips for you, dear reader.</p>\n<center><img class=\"bb\" src=\"https://maybepizza.com//images/2017/01/mason.jpg\" alt=\"This is a large image, showing my hand and some questionable liquid.\"  width=\"660\" /><div style=\"color: #666; padding-top: 2px;\">This is a large image, showing my hand and some questionable liquid.</div></center>\n\n<p>If you have a large mason jar (as seen above) it can be a time saver to add all your liquid soluble ingredients (water, salt, oil, yeast/starter, etc) into said mason jar, shake it all around, and then pour everything together on top of your flour before handing everything off to your mixer.</p>\n<p>I first started doing this a few months ago when feeding my starter (but with smaller mason jars). I found the workflow of mixing old starter with 50% water, shaking everything up quite a bit so it&#39;s as above, and then stirring in my 50% flour to be a cleaner process. It also more evenly distributes the older starter among the new flour. Turns out it&#39;s also a great process for making dough.</p>\n<p>OK, onto the second tip.</p>\n<center><img class=\"bb\" src=\"https://maybepizza.com//images/2017/01/rubbermaid.jpg\" alt=\"\"  width=\"660\" /><div style=\"color: #666; padding-top: 2px;\"></div></center>\n\n<p>I found when <a href=\"http://maybepizza.com/archives/2016/11/another_new_pizza_oven.html\">hacking up my new oven</a> that it was annoying to make pizza dough every other night when I wanted to test something out. Especially since I only wanted one or two pies for my tests.</p>\n<p>Now, this isn&#39;t exactly new information (sorry). You can make your dough ahead of time, ball it up, put it slightly oiled <a href=\"http://amzn.to/2hMrV6N\">containers</a> (as seen above), then you can have &quot;overnight&quot; dough or even keep it a week or a bit more in the fridge. If you want to have pizza later on, you&#39;ll take your dough out ~12 hours ahead of time to give it ample time to warm up, activate, and raise. Then you get to have pizza. Yum.</p>\n<p>OK now here&#39;s the new information.</p>\n<p>Small containers are awesome if you don&#39;t have a lot of room in your fridge, but it can complicate things when raising. You&#39;ll notice in the above images that there isn&#39;t much room for the dough to expand. In fact, if you try to do that with the lids on, then you&#39;re going to blow them right off (because of expansion of the gas in the dough) and if you&#39;re not around to catch that, you&#39;re going to have funky dry dough.</p>\n<p>Nobody likes funky dry dough.</p>\n<p>Instead, you&#39;ll need to transfer it into a larger container or do something like this:</p>\n<center><img class=\"bb\" src=\"https://maybepizza.com//images/2017/01/containers_in_containers.jpg\" alt=\"Containers in containers\"  width=\"660\" /><div style=\"color: #666; padding-top: 2px;\">Containers in containers</div></center>\n\n<p>Since there&#39;s more room for expansion, and the lid of the outer container isn&#39;t super tight- things aren&#39;t going to explode and dry out.</p>\n<p>But wait there&#39;s more.</p>\n<p>Using the above technique, and using starter, I&#39;ve found that I can even go 3 to 4 weeks with this dough in the fridge (this may or may not work with active dry yeast). But that 12 hour planning ahead kind of sucks. What if I&#39;m really really hungry and I want that pizza an hour or two after removing it from the fridge?</p>\n<p>This takes a bit more planning, but it&#39;s doable. Let your dough raise as described above, and still in the little container. Let it double in size so it raises just to the top of your smaller container, and then put the lid back on and shove it in the fridge.</p>\n<p>When cooling down in the fridge, you&#39;re stopping (or slowing down by a lot) the activity which was raising your dough. It&#39;s frozen in time, just about ready to be put in the oven.</p>\n<p>Then when future you is hungry you can pull your raised dough out of the fridge and just let it warm up. It&#39;ll still turn out great. Here&#39;s an example <a href=\"https://www.instagram.com/p/BOvWpFdBgLz/?taken-by=ccgus\">pie made just that way</a>.</p>\n<p>That&#39;s it! Except- Happy New Year. Let&#39;s make a lot of pizza in 2017.</p>\n",
            "date_published": "2017-01-02T21:00:41-08:00",
            "url": "https://maybepizza.com/archives/2017/1/a_couple_of_dough_tips.html"
        },
        {
            "id": "https://maybepizza.com/archives/2017/7/the_mythos_of_sourdough_starter.html",
            "title": "The Mythos of Sourdough Starter",
            "content_html": "<p>Cale Weissman: <a href=\"http://www.tastecooking.com/mythos-sourdough-starter/\">The Mythos of Sourdough Starter</a></p>\n<blockquote>\n<p>&quot;Here you begin to see the mythos of sourdough. It’s not just about following the right steps to make a crusty loaf of bread—it’s about cultivating and maturing a substance that is a part of you. Stick your hands in some water and add flour to it. If it takes off, your bacteria is the stuff of future bread—bread that only you could have made, no matter how closely another person follows the same recipe.&quot;</p>\n</blockquote>\n<p>I&#39;ve said a number of times that there are no secrets in pizza making. There is however, the ability to have a starter that nobody else does. My own starter recently turned one year old.</p>\n",
            "date_published": "2017-07-17T12:44:09-07:00",
            "url": "https://maybepizza.com/archives/2017/7/the_mythos_of_sourdough_starter.html"
        },
        {
            "id": "https://maybepizza.com/archives/2017/9/roccbox.html",
            "title": "Roccbox",
            "content_html": "<p>When the <a href=\"https://www.roccbox.com/\">Roccbox</a> first showed up last year on <a href=\"https://www.indiegogo.com/projects/roccbox-the-portable-stone-bake-pizza-oven-food-cooking#/\">Indiegogo</a>, the campaign price was about $300 USD. It looked interesting to me, but there were a rash of interesting new pizza ovens popping up, and they weren&#39;t all that great. The Roccbox also seemed a bit expensive for the size, and I wanted to wait for some real world reviews to come in before I was willing to commit that much money on it.</p>\n<p>The Roccbox eventually shipped and the reviews came in, and it looked genuinely good. The price also jumped up to $600 USD. There was no way I was going to pay that much money for one since I already had a couple of good little homemade pizza ovens.</p>\n<p>Then over on the <a href=\"https://www.pizzamaking.com\">Pizza Making</a> forums, I saw that someone in southern Washington (~200 miles away) was selling their lightly used Roccbox for the original campaign price of $300. I sent off some emails and as luck would have it my neighbors were currently in the area (thanks Ryan and Heather!), and a few days later the Roccbox was at my house.</p>\n<p>A few hours after it arrived, this happened:</p>\n<center><img class=\"bb\" src=\"https://maybepizza.com//images/2017/roccbox1.jpeg\" alt=\"\"  width=\"660\" /><div style=\"color: #666; padding-top: 2px;\"></div></center>\n\n<p>Every pizza since then has come out of the Roccbox, and I couldn&#39;t be happier with it. In fact, if it broke today, I&#39;d easily spend the $600 to get a new one ASAP.</p>\n<p>If you&#39;re into neapolitan style pizza and are looking for a nice little propane powered oven, I can&#39;t recommend anything better than a Roccbox.</p>\n<p><strong>What&#39;s to love about it?</strong></p>\n<p>Super fast startup. It only takes about 20-25 minutes getting the Roccbox up to temperature. You just turn it on, and walk away. My old wood fired oven (WFO) would take between 6-8 hours of babysitting and feeding it wood to get it up to the right temperature. My latest homemade electric oven takes about 40 minutes, and I had to always keep an eye on it.</p>\n<p>The Roccbox is super portable. At about 45lbs, it feels a little heavy, but that doesn&#39;t mean it can&#39;t come out with you easily. The legs fold up and it&#39;s pretty compact. You&#39;ll still have to lug around a gas canister, but compared to a WFO it&#39;s a dream to move.</p>\n<p>The Roccbox is very forgiving. Unlike a WFO you can easily adjust the flame, adjusting the temperature to your dough needs. Has your dough not quite proofed enough? You can easily dial back the heat to compensate. And comparing it to my electric oven- well it only had an on and off switch. It was either 900° or off.</p>\n<p>You can cook other things in it. When the green beans were growing in our garden we would pick a handful, throw them in a stainless steel pan with some olive oil, salt, and sliced cherry tomatoes. 8 minutes later we had an awesome side dish to go with our dinner, and we didn&#39;t even have to warm up the Roccbox first.</p>\n<p>It also has a pretty active <a href=\"https://www.facebook.com/groups/209238466271248/\">community</a> doing some pretty interesting things with it. Including Adam Atkins of <a href=\"http://peddlingpizza.co.uk\">Peddling Pizza</a>, who carts around a pizza stand via a custom bicycle trailer.</p>\n<p><strong>What&#39;s bad about it?</strong></p>\n<p>The Roccbox might be a bit pricy for you. But when comparing it to a WFO, it&#39;s a fraction of the cost (I spent around 5k on mine). If you want neapolitan style pizza at home, it&#39;s a good value.</p>\n<p>The wood burner. It&#39;s horrible. I know some people have had success with it, but I haven&#39;t even come close. I&#39;ve tried kiln dried kindling, a couple of different types of hardwood, and I&#39;ve even taken a metal cutting tool to the wood burner to try and get some more airflow into it.</p>\n<p>The main problem with the wood burner in my experience is that it fills up with ash too quickly, and there&#39;s no way to get rid of that ash without detaching it from the main unit. It seems like it should work, but in practice it doesn&#39;t. It&#39;s a very common complaint from Roccbox owners. And because of that, I can only recommend that you use the gas burner it comes with.</p>\n<p><strong>What would I change?</strong></p>\n<p>I would ship it with a turning peel in addition to launching peel it comes with. Don&#39;t get me wrong, the peel it ships with is very good. But having to take the pizza away from the flame for any amount of time, even to just turn it, is going to make for a worse bake. I got around this problem by cutting down one of my <a href=\"http://amzn.to/2wWYP9d\">WFO turning peels</a>, but that&#39;s an expensive operation and you can probably get away with <a href=\"http://amzn.to/2wX8mgl\">one like this</a>.</p>\n<p>There is a learning curve if you don&#39;t already know how to use a turning peel. But flour is cheap, and you can make lots and lots of test pizzas.</p>\n<p><strong>The Roccbox is an awesome oven</strong></p>\n<p>So in the end, I&#39;m super happy with my Roccbox. I&#39;d even go far as to say it&#39;s one of my favorite things ever.</p>\n<p>Want to see more of my pizza pics from the Roccbox? Currently the <a href=\"https://www.instagram.com/ccgus/\">top 14 pizza pics on my instagram page</a> came out of it.</p>\n",
            "date_published": "2017-09-27T12:06:00-07:00",
            "url": "https://maybepizza.com/archives/2017/9/roccbox.html"
        },
        {
            "id": "https://maybepizza.com/archives/2017/11/one_year_of_using_roccbox.html",
            "title": "One Year of Using Roccbox",
            "content_html": "<p>The Pizza Bike: <a href=\"http://thepizzabike.co.uk/news/one-year-of-using-roccbox/\">One Year of Using Roccbox</a></p>\n<blockquote>\n<p>&quot;We started using Roccbox in The Pizza Bike in August 2016 and 10 000 pizza later  the ovens are working flawlessly without any problems. They do exactly what’s written on the box – heat up in 20-30 minutes, cook  amazing pizzas in 90 seconds and are built to last for ages.&quot;</p>\n</blockquote>\n",
            "date_published": "2017-11-29T09:21:13-08:00",
            "url": "https://maybepizza.com/archives/2017/11/one_year_of_using_roccbox.html"
        },
        {
            "id": "https://maybepizza.com/archives/2018/1/secrets_of_sourdough.html",
            "title": "Secrets of Sourdough",
            "content_html": "<p>Gastropod: <a href=\"https://gastropod.com/secrets-of-sourdough/\">Secrets of Sourdough</a></p>\n<p>If sourdough interests you at all, you&#39;ll enjoy this episode from the Gastropod podcast. They talk with experts about it, theories as to where the the bacteria come from, and it&#39;s just a generally fun episode for folks who make bread. And pizza. That&#39;s me.</p>\n",
            "date_published": "2018-01-22T09:27:27-08:00",
            "url": "https://maybepizza.com/archives/2018/1/secrets_of_sourdough.html"
        },
        {
            "id": "https://maybepizza.com/archives/2018/4/una_pizza_napoletana_and_anthony_mangieri_ride_again.html",
            "title": "Una Pizza Napoletana and Anthony Mangieri Ride Again",
            "content_html": "<p>Eater: <a href=\"https://ny.eater.com/2018/4/25/17280100/una-pizza-napoletana-photos-nyc\">Una Pizza Napoletana Returns to NYC, All Grown Up</a></p>\n<blockquote>\n<p>&quot;Then, at the height of his success and pomposity in 2009, Mangieri decamped to the more relaxed, outdoor San Francisco lifestyle, bringing Una Pizza Napoletana with him. He again grew a fervent following in SF for his relentless commitment to perfection, in which he rests the naturally leavened, double zero flour dough overnight, sources impeccable toppings, and makes every single 12-inch pie — 130 a night — himself.&quot;</p>\n</blockquote>\n<p>I went to Una Pizza a couple of times when it was in San Francisco. It&#39;s great pizza, if a bit pricy. It was really fun to visit the restaurant though, and it looks like his new space is even better.</p>\n<p>Mangieri was also recently featured on a <a href=\"https://www.smartpizzamarketing.com/spm-177-anthony-mangieri-una-pizza-napoletana/\">pizza marketing podcast</a>. </p>\n",
            "date_published": "2018-04-30T14:54:00-07:00",
            "url": "https://maybepizza.com/archives/2018/4/una_pizza_napoletana_and_anthony_mangieri_ride_again.html"
        },
        {
            "id": "https://maybepizza.com/archives/2019/3/tokyo_neapolitan.html",
            "title": "Tokyo Neapolitan",
            "content_html": "<p>Eater: <a href=\"https://www.eater.com/2017/2/21/14670944/best-pizza-tokyo-guide\">Tokyo Neapolitan: The New Wave of Japanese Pizza</a></p>\n<blockquote>\n<p>Inoue believes that because a pizza is not perfectly symmetrical in terms of ingredient distribution, each slice is inevitably a little different; there&#39;s no way to cut a pizza in a way that  perfectly captures its entire essence in a single slice. His ideal is for one person to eat an entire pie on their own, ensuring they experience the full spectrum of flavors. Reluctantly, Inoue will cut his pies, but only for customers he thinks will have a hard time cutting it themselves. &quot;There&#39;re a lot of old folks in Kamakura,&quot; he explained.</p>\n</blockquote>\n<p>This article is must-read for anyone who&#39;s interested in the Japanese pizza scene (it&#39;s been a fascination of mine recently).</p>\n",
            "date_published": "2019-03-01T21:56:33-08:00",
            "url": "https://maybepizza.com/archives/2019/3/tokyo_neapolitan.html"
        }
    ]
}