Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-PerlTidy/share/locale/Padre__Plugin__PerlTidy-*.po
Languages: ar, pl

source: Perl Tidy
ar: ترتيب ملفات Perl

source: Tidy the active document Alt+Shift+F
ar: ترتيب الوثيقة الحالية Alt+Shift+F
pl: Oczyść aktywny dokument Alt+Shift+F

source: Tidy the selected text Alt+Shift+G
ar: ترتيب النص المختار Alt+Shift+G
pl: Oczyść zaznaczony tekst Alt+Shift+G

source: Export active document to HTML file
ar: تصدير الوثيقة الحالية إلى ملف HTML
pl: Eksportuj aktywny dokument do pliku HTML

source: Export selected text to HTML file
ar: تصدير النص المختار إلى ملف HTML
pl: Eksportuj zaznaczony tekst do pliku HTML

source: Document is not a Perl document
ar: الوثيقة ليست وثيقة Perl
pl: Bieżący dokument nie jest dokumentem Perl

source: PerlTidy Error
ar: خطأ PerlTidy
pl: Błąd PerlTidy

source: Save file as...
ar: حفظ الملف ك...
pl: Zapisz plik jako...

source: File already exists. Overwrite it?
ar: Le fichier existe déjà. Le remplacer ?
pl: Plik istnieje. Czy go zastąpić?

source: Exist
ar: موجود
pl: Istnieje

source: Error
pl: Błąd
