Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Storage path information
ca: Informació de ruta d'emmagatzemament
de: Speicherpfad Informationen
es: Información de ruta de almacenamiento
fr: Dossiers de stockage
it: Destinazione dei salvataggi
sr: Информације о путањи за складиштење
sr@latn: Informacije o putanji za skladištenje

source: Project name
ca: Nom del projecte
de: Projektname
es: Nombre del proyecto
fr: Nom du projet
it: Nome del progetto
sr: Име пројекта
sr@latn: Ime projekta

source: This is a short name for the project. All generated files are named like this.
ca: Aquest és un nom curt per al projecte. Tots els fitxers generats s'anomenaran com aquest.
de: Das ist der Kurzname für dieses Projekt. Alle Dateinamen werden vom Projektnamen abgeleitet.
es: Este es un nombre corto para el proyecto. Todos los archivos generados se llamarán como este.
fr: Ceci est le nom abrégé du projet. tous les fichiers générés sont nommés de la même façon.
it: Questo è un nome identificativo per il progetto. Tutti i file generati hanno questo nome.
sr: Ово је кратко име пројекта. Све генерисане датотеке добијају име изведено из овог.
sr@latn: Ovo je kratko ime projekta. Sve generisane datoteke dobijaju ime izvedeno iz ovog.

source: VOB directory
ca: Directori per als VOB
de: VOB Verzeichnis
es: Directorio para VOB
fr: Dossier pour les VOB
it: Directory VOB
sr: VOB директоријум
sr@latn: VOB direktorijum

source: DVD VOB files are stored here.
ca: Els fiters VOB del DVD es desaran aquí.
de: Die DVD VOB Dateien weden hier abgelegt.
es: Archivos VOB del DVD se almacenan aquí.
fr: Les fichiers VOB du DVD sont stockés ici.
it: I file DVD VOB sono memorizzati qui.
sr: Датотеке ДВД VOB се смештају овде.
sr@latn: Datoteke DVD VOB se smeštaju ovde.

source: AVI directory
ca: Directori per als AVI
de: AVI Verzeichnis
es: Directorio para AVI
fr: Dossier pour les AVI
it: Directory AVI
sr: AVI директоријум
sr@latn: AVI direktorijum

source: For transcoded AVI, MPEG and OGM files.
ca: Per als fitxers AVI, MPEG i OGM codificats.
de: Für die transkodierten AVI, MPEG und OGM Zieldateien.
es: Para archivos AVI, MPEG y OGM codificados.
fr: Pour les fichiers AVI, MPEG et OGM transcodés.
it: Per file AVI, MPEG e OGM codificati
sr: За транскодиране AVI, MPEG и OGM датотеке.
sr@latn: Za transkodirane AVI, MPEG i OGM datoteke.

source: Temporary directory
ca: Directori temporal
de: Temporäres Verzeichnis
es: Directorio temporal
fr: Dossier temporaire
it: Directory temporanea
sr: Привремени директоријум
sr@latn: Privremeni direktorijum

source: For temporary files
ca: Per a fitxers temporals
de: Für temporäre Dateien
es: Para archivos temporales
fr: Pour les fichiers temporaires
it: Per file temporanei
sr: За привремене датотеке
sr@latn: Za privremene datoteke

source: Create project
ca: Crea projecte
de: Erzeuge Projekt
es: Crear proyecto
fr: Créer le projet
it: Crea un nuovo progetto
sr: Направи пројекат
sr@latn: Napravi projekat

source: This asks for a project filename and creates the neccessary filesystem structure
ca: Demana un nom de projecte i creat l'estructura dels sistema de fitxers necessària
de: Geben Sie den Projektdateinamen an, daraufhin wird dann das Datenverzeichnis für das Projekt angelegt
es: Pide un nombre de archivo de proyecto y crea la estructura del sistema de ficheros necesaria
fr: Ceci permet de choisir le nom du projet et de créer les dossiers nécessaires.
it: Questo chiede il nome del progetto e crea la necessaria struttura nel filesystem
sr: Ово тражи име пројекта и прави потребну структуру у систему датотека
sr@latn: Ovo traži ime projekta i pravi potrebnu strukturu u sistemu datoteka

source: Data source selection
ca: Selecció de l'origen de les dades
de: Auswahl der Videodatenquelle
es: Selección de la fuente de datos
fr: Sélection de la source de données
it: Selezione della sorgente dei dati
sr: Избор извора података
sr@latn: Izbor izvora podataka

source: Select a DVD device or an image directory for input
ca: Seleccioneu una unitat de DVD o un directori imatge com a entrada
de: Wählen Sie ein DVD Gerät oder ein DVD-Abbild-Verzeichnis als Videodatenquelle
es: Seleccionar una unidad de DVD o un directorio imagen como entrada
fr: Choisissez le lecteur DVD ou un dossier contenant les fichiers à traiter
it: Scegli un dispositivo DVD oppure una directory con l'immagine per l'input.
sr: Изаберите ДВД уређај или датотеку са отиском за улаз
sr@latn: Izaberite DVD uređaj ili datoteku sa otiskom za ulaz

source: Choose DVD device
ca: Seleccioneu la unitat de DVD
de: DVD Gerät auswählen
es: Elige la unidad de DVD
fr: Choisissez le périphérique DVD
it: Scegli il dispositivo DVD
sr: Избор ДВД уређаја
sr@latn: Izbor DVD uređaja

source: or
ca: o
de: oder
es: o
fr: ou
it: o
sr: или
sr@latn: ili

source: Choose DVD image directory
ca: Seleccioneu el directori imatge del DVD
de: DVD Abbildverzeichnis auswählen
es: Elige el directorio imagen del DVD
fr: Choisissez le dossier contenant le DVD
it: Scelta della directory per l'immagine del DVD
sr: Изаберите директоријум за одраз ДВДа
sr@latn: Izaberite direktorijum za odraz DVDa

source: Or enter by hand
ca: O introduïu l'origen a mà
de: Oder per Hand eingeben
es: O introduce a mano
fr: ou tapez le vous-même
it: O inserisci a mano
sr: Или унесите ручно
sr@latn: Ili unesite ručno

source: dvd::rip uses this location for DVD input. Either it's the filename of a physical DVD device or the path of a full DVD image copy.
ca: El dvd::rip usa aquesta ubicació com a entrada de DVD. És el nom de fitxer d'una unitat de DVD física o bé el camí d'una còpia de DVD completa.
de: dvd::rip benutzt diesen Pfad als DVD Videoquelle. Entweder ist dies der Dateiname einer Gerätedatei oder der Pfad zu einem vollständigen DVD Abbild.
es: dvd::rip usa esta localización como entrada de DVD. O es el nombre de archivo de una unidad de DVD física o la ruta de una copia de DVD completa.
fr: dvd::rip utilise cet emplacement pour atteindre le DVD. Cela peut être le fichier périphériquedu lecteur DVD ou le chemin d'une copie complète d'un DVD.
it: dvd::rip utilizza questa locazione per l'input DVD. Può essere sia il nome del file di un lettore DVD fisico, sia il percorso per un'immagine completa di un DVD.
sr: двд::рип користи ово одредиште као улаз за ДВД. То може бити или име физичког ДВД уређаја или стаза до отиска ДВДа.
sr@latn: dvd::rip koristi ovo odredište kao ulaz za DVD. To može biti ili ime fizičkog DVD uređaja ili staza do otiska DVDa.

source: Choose a ripping mode
ca: Escolliu un mode d'extracció
de: Wählen Sie einen Ripping-Modus
es: Elige un modo de extracción
fr: Choisissez un mode d'extraction
it: Scegli un sistema di estrazione
sr: Изаберите начин риповања
sr@latn: Izaberite način ripovanja

source: Copy data from DVD to harddisk before encoding
ca: Còpia de les dades del DVD al disc dur abans de codificar
de: DVD Daten vor dem Transkodieren auf die Festplatte kopieren
es: Copir los datos del DVD al disco duro antes de codificar
fr: Copier le contenu du DVD sur l'ordinateur avant d'encoder
it: Copia i dati dal DVD al disco rigido prima di codificare
sr: Умножавање података са DVDа на диск пре кодирања
sr@latn: Umnožavanje podataka sa DVDa na disk pre kodiranja

source: Use this mode if you have enough diskspace for a complete copy of the DVD contents. It's the fastest and most flexible DVD mode.
ca: Useu aquest mode si teniu prou espai en disc per a una còpia completa del contingut del DVD. És el mode més ràpid i flexible.
de: Dieser Modus ist der schnellste und empfohlene Modus zum Kopieren einer DVD, belegt allerdings viel Speicher auf der Festplatte, da der Film vor der Verarbeitung komplett auf die Festplatte kopiert wird.
es: Usa este modo si tienes suficiente espacio en disco para una copia completa de los contenidos del DVD. Es el modo más rápido y flexible.
fr: Utilisez ce mode si vous avez assez d'espace pour stocker une copie complète du DVD.C'est le mode le plus rapide et le plus flexible.
it: Usa questa modlità se hai abbastanza spazio per una copia completa dei contenuti del DVD. E` la modalità DVD più veloce e più flessibile.
sr: Користите овај начин ако имате довољно места на диску за умножак целог ДВДа. То је најбржи и најфлексибилнији начин рада.
sr@latn: Koristite ovaj način ako imate dovoljno mesta na disku za umnožak celog DVDa. To je najbrži i najfleksibilniji način rada.

source: Encode DVD on the fly
ca: Codificació del DVD al vol
de: DVD ohne Zwischenspeichern transkodieren
es: Codificar DVD al vuelo
fr: Encoder le DVD à la volée
it: Codifica il DVD al volo
sr: Кодирај DVD у лету
sr@latn: Kodiraj DVD u letu

source: No DVD contents are copied to harddisk.
ca: No es copia el contingut del DVD al disc dur.
de: Keine DVD Inhalte werden auf die Festplatte kopiert.
es: No se copia ninguno contenido del DVD al disco duro.
fr: Le contenu du DVD n'est pas copié sur l'ordinateur
it: Nessun contenuto del DVD viene copiato sul disco rigido.
sr: Садржај ДВДа се не умножава на диск.
sr@latn: Sadržaj DVDa se ne umnožava na disk.

source: Copying DVD(-image) data to harddisk before encoding is the recommended mode, because it's faster and doesn't stress your DVD reader that much. Additionally some interesting features are available only with this mode, due to internal transcode restrictions: - Cluster transcoding - Subtitle rendering - Faster preview grabbing and frame range transcoding - transcode's PSU core for optimized A/V sync with NTSC video
ca: "Còpia de les dades del DVD al disc dur abans de codificar" és el mode recomanat, perquè és més ràpid i no usa excessivament la lectora de DVD. A més, hi ha algunes característiques interessants que només estan disponibles en aquest mode, ateses les restriccions internes del transcode: - Codificació en clúster - Incrustació de subtítols - Captura de vistes prèvies més ràpida i codificació d'un rang de fotogrames - Nucli PSU del transcode per a la sincronització A/V optimitzada amb vídeo NTSC
de: Es ist empfohlen die DVD(-Abbild) Daten vor der Verarbeitung auf die Festplatte zu kopieren. Das ist schneller und belastet das DVD Lesegerät weniger. Weiterhin sind einige interessante Funktionen nur in diesem Modus verfügbar, aufgrund von internen transcode Restriktionen: - Transkodieren im Cluster - Untertitel auf den Film zeichnen - Schnellere Vorschaubilderzeugung - transcode's PSU Core Modus für optimierte A/V Synchronisation für NTSC
es: Copiar los datos del DVD al disco duro antes de codificar es el modo recomendado, porque es más rápido y no usa mucho tu lectora de DVD. Adicionalmente hay algunas características interesantes que solo estan disponibles en este modo, debido a las restricciones internas de transcode: - Codificación en cluster - Incrustar subtítulos - Captura de previsualizaciones más rápida y codificación de un rango de fotogramas - Núcleo PSU de transcode para sincronización A/V optimizada con video NTSC
fr: Il est recommandé de copier le contenu du DVD sur l'ordinateur avant l'encodage pour aller plus vite et pour soulager votre lecteur DVD. De plus, certaines fonctions utiles ne sont disponibles que de cette façon : - le transcodage en cluster - l'inclusion de sous-titres - La capture d'images d'aperçu et le transcodage d'intervalles - La synchro A/V optimisée pour les vidéos NTSC (mode PSU core)
it: Copiare i dati del DVD(-immagine) sul disco rigido prima di codificarli è la modalità raccomandata, perché è più veloce e non utilizza molto il tuo lettore DVD. Inoltre, alcune funzionalità addizionali sono utilizzabili soltanto in questa modalità, a causa di alcune restrizioni interne di transcode: - Codifica cluster - Codifica dei sottotitoli - Acquisizione rapida dell'anteprima e codifica per intervallo di fotogrammi - Modalità PSU di transcode per sincronizzazione ottimale con materiale NTSC
sr: Умножавање ДВДа на диск пре кодирања се препоручује јер је брже и не оптерећује толико ДВД читач. Поврх тога неке занимљиве могућности доступне су само у овом начину рада, због ограничења програма transcode: - транскодирање у роју - уграђивање титлова - брзи преглед и транскодирање опсега - PSU језгро програма transcode за оптимизовано A/V усклађивање са NTSC видеом
sr@latn: Umnožavanje DVDa na disk pre kodiranja se preporučuje jer je brže i ne opterećuje toliko DVD čitač. Povrh toga neke zanimljive mogućnosti dostupne su samo u ovom načinu rada, zbog ograničenja programa transcode: - transkodiranje u roju - ugrađivanje titlova - brzi pregled i transkodiranje opsega - PSU jezgro programa transcode za optimizovano A/V usklađivanje sa NTSC videom

source: Selected directory is no DVD image directory. It has no VIDEO_TS folder.
ca: El directori seleccionat no és una imatge de DVD. No té un directori VIDEO_TS.
de: Der ausgewählte Ordner enthält kein DVD Abbild. Der Ordner muss einen VIDEO_TS Unterordner haben.
es: El directorio seleccionado no es una imagen de DVD. No tiene un directorio VIDEO_TS.
fr: Le dossier choisi n'est pas une copie de DVD. Il n'y a aucun dossier VIDEO_TS.
it: La directory selezionata non contiene un'immagine DVD. Al suo interno non è presente la directory VIDEO_TS.
sr: Изабрани директоријум не садржи отисак ДВДа. Није нађен директоријум VIDEO_TS.
sr@latn: Izabrani direktorijum ne sadrži otisak DVDa. Nije nađen direktorijum VIDEO_TS.

source: Clip & Zoom
ca: Retallat i zoom
es: Recortar y Zoom
fr: Découpage et zoom
sr: Исеци и Увеличај
sr@latn: Iseci i Uveličaj

source: Preview images
ca: Previsualitza imatges
de: Vorschaubilder
es: Previsualizar imágenes
fr: Images d'aperçu
it: Anteprima delle immagini
sr: Преглед слика
sr@latn: Pregled slika

source: Grab preview frame #
ca: Previsualitza el fotogr. #
de: Hole Frame #
es: Previsualizar fotograma #
fr: Capturer l'image numéro :
it: Cattura fotogramma d'anteprima #
sr: Ухвати кадар за преглед #
sr@latn: Uhvati kadar za pregled #

source: Force slow grabbing
ca: Força la captura lenta
de: Langsame Methode verwenden
es: Forzar la captura lenta
fr: Forcer une extraction lente
it: Forza la cattura lenta
sr: Принуди на спору обраду
sr@latn: Prinudi na sporu obradu

source: Grab frame
ca: Captura fotograma
de: Hole Frame
es: Capturar fotograma
fr: Capturer l'image
it: Cattura fotogramma
sr: Ухвати кадар
sr@latn: Uhvati kadar

source: Show video from here
ca: Mostra vídeo des d'aquí
de: Video ab hier anzeigen
es: Mostrar video desde aquí
fr: Afficher la vidéo depuis cette image
it: Mostra il video da qui
sr: Прикажи видео одавде
sr@latn: Prikaži video odavde

source: Adjust clip and zoom parameters
ca: Ajusta paràmetres de retallat i zoom
de: Beschnitt- und Zoom-Einstellungen
es: Ajustar parámetros de recorte y zoom
fr: Paramètres de découpage et de zoom
it: Aggiusta i parametri dello zoom e del clip
sr: Подеси параметре сечења у увеличања
sr@latn: Podesi parametre sečenja u uveličanja

source: Presets
ca: Ajusts predefinits
de: Vorlage
es: Ajustes predefinidos
fr: Réglages prédéfinis
it: Impostazioni predefinite
sr: Унапред постављено
sr@latn: Unapred postavljeno

source: Apply preset values
ca: Aplica ajust predefinit
de: Vorlagenwerte übernehmen
es: Aplicar ajuste predefinido
fr: Appliquer ce réglage prédéfini
it: Applica i valori predefiniti
sr: Примени унапред постављене вредности
sr@latn: Primeni unapred postavljene vrednosti

source: Overwrites all Clip & Zoom settings from the selected preset and regenerates the preview images.
ca: Sobreescriu totes les configuracions de retallat i zoom de l'ajust predefinit seleccionat i regenera les imatges previsualitzades.
de: Überschreibt alle Clip & Zoom Einstellungen mit den Werten der ausgewählten Vorlage und erzeugt die Vorschaubilder neu.
es: Sobreescribe todas las configuraciones de Recorte y Zoom del ajuste predefinido seleccionado y regenera las imágenes previsualizadas.
fr: Écrase tous les réglages de Découpe & Zoom avec le réglage choisi et régénère les images d'aperçu
it: Sovrascrive tutte le impostazioni di Taglia & Zoom del profilo selezionato e rigenera le immagini di anteprima.
sr: Препосује сва подешавања за сечење и зумирање и поново прави слике за преглед.
sr@latn: Preposuje sva podešavanja za sečenje i zumiranje i ponovo pravi slike za pregled.

source: Top
ca: Amunt
de: Oben
es: Arriba
fr: Haut
it: Alto
sr: Врх
sr@latn: Vrh

source: Bottom
ca: Avall
de: Unten
es: Abajo
fr: Bas
it: Basso
sr: Дно
sr@latn: Dno

source: Left
ca: Esquerra
de: Links
es: Izquierda
fr: Gauche
it: Sinistra
sr: Лево
sr@latn: Levo

source: Right
ca: Dreta
de: Rechts
es: Derecha
fr: Droite
it: Destra
sr: Десно
sr@latn: Desno

source: 1st clipping
ca: 1r retall
de: 1. Beschnitt
es: 1er recorte
fr: 1er découpage
it: Primo clipping
sr: Прво сечење
sr@latn: Prvo sečenje

source: Generate preview images
ca: Genera vistes prèvies
de: Vorschaubilder erzeugen
es: Generar previsualizaciones
fr: Générer les images d'aperçu
it: Genera le immagini d'anteprima
sr: Направи слике за преглед
sr@latn: Napravi slike za pregled

source: Generates new preview images based on the actual settings
ca: Genera noves imatges previsualitzades basades en les configuracions actuals
de: Erzeugt neue Vorschaubilder mit den aktuellen Einstellungen.
es: Generar nuevas imágenes previsualizadas basadas en las configuraciones actuales
fr: Génère de nouvelles images d'aperçu à partir des réglages actuels
it: Genera nuove immagini di anteprima basandosi sulle impostazioni attuali
sr: Прави нове слике за преглед на основу тренутних подешавања
sr@latn: Pravi nove slike za pregled na osnovu trenutnih podešavanja

source: 2nd clipping
ca: 2n retall
de: 2. Beschnitt
es: 2º recorte
fr: 2ème découpage
it: Secondo clipping
sr: Друго сечење
sr@latn: Drugo sečenje

source: Move 2nd clipping to 1st
ca: Mou el 2n retall al 1r
de: Mache 2. zum 1. Beschnitt
es: Mover 2º recorte al 1º
fr: Déplacer le 2ème découpage vers le 1er
it: Sposta il secondo clipping al primo
sr: Помери друго сечење у прво
sr@latn: Pomeri drugo sečenje u prvo

source: Turns second clipping into first clipping. This is possible only with high quality scaling.
ca: Canvia el segon retall al primer. Això només és possible amb escalat d'alta qualitat.
de: Eliminiert den zweiten Beschnitt, indem die Werte für den ersten Beschnitt entsprechend umgerechnet werden.
es: Cambia el segundo recorte al primer recorte. Sólo es posible con escalado de alta calidad.
fr: Transforme la découpe 2 en découpe 1. Ceci n'est possible qu'avec le redimensionnement de haute qualité
it: Imposta il secondo taglio sul primo. Questo è possibile soltanto riscalando in alta qualità.
sr: Претвара друго сечење у прво. Ово је могуће само са висококвалитетним скалирањем.
sr@latn: Pretvara drugo sečenje u prvo. Ovo je moguće samo sa visokokvalitetnim skaliranjem.

source: Width
ca: Amplada
de: Breite
es: Anchura
fr: Largeur
it: Larghezza
sr: Ширина
sr@latn: Širina

source: Height
ca: Alçària
de: Höhe
es: Altura
fr: Hauteur
it: Altezza
sr: Висина
sr@latn: Visina

source: V-Rate
ca: Taxa bits v.
es: Tasa-V
fr: Rafraîchiss Vertical
sr: V-однос
sr@latn: V-odnos

source: Calc height
ca: Calcula alçària
de: Höhe ber.
es: Calcular altura
fr: Calculer la hauteur
it: Calcola altezza
sr: Израчунај висину
sr@latn: Izračunaj visinu

source: Calculates the height based on the given width with correct aspect ratio
ca: Calcula l'alçària en base a l'amplada donada i a la relació d'aspecte correcta
de: Berechnet die Höhe anhand der gegebenen Breite, bei korrektem Seitenverhältnis.
es: Calcula la altura basada en la anchura dada con el ratio de aspecto correcto
fr: Calcule la hauteur à partir de la largeur et du rapport d'aspect
it: Calcola l'altezza basandosi sulla larghezza impostata e mantenendo l'aspetto corretto
sr: Прорачунава висину на основу дате ширине и тачног односа ширине и висине
sr@latn: Proračunava visinu na osnovu date širine i tačnog odnosa širine i visine

source: Calc width
ca: Calcula amplada
de: Breite ber.
es: Calcular anchura
fr: Calculer la largeur
it: Calcola larghezza
sr: Израчунај ширину
sr@latn: Izračunaj širinu

source: Calculates the width based on the given height with correct aspect ratio
ca: Calcula l'amplada en base a l'alçària donada i a la relació d'aspecte correcta
de: Berechnet die Breite anhand der gegebenen Höhe, bei korrektem Seitenverhältnis.
es: Calcula la anchura basada en la altura dada con el ratio de aspecto correcto
fr: Calcule la largeur à partir de la hauteur et du rapport d'aspect
it: Calcola la larghezza basandosi sull'altezza impostata e mantenendo l'aspetto corretto
sr: Прерачунава ширину на основу дате висине и тачног односа ширине и висине
sr@latn: Preračunava širinu na osnovu date visine i tačnog odnosa širine i visine

source: Use fast resizing
ca: Usa redimensionat ràpid
de: Schnelles Skalieren
es: Usar redimensionado rápido
fr: Redimensionnement rapide
it: Usa ridimensionamento veloce
sr: Користи брзо мењање величине
sr@latn: Koristi brzo menjanje veličine

source: Open zoom calculator
ca: Obre calculadora de zoom
de: Zoom Kalkulator öffnen
es: Abrir calculadora de zoom
fr: Calculatrice de zoom...
it: Apri calcolatore zoom
sr: Отвори калкулатор за увеличање
sr@latn: Otvori kalkulator za uveličanje

source: Preview image: {type}
ca: Vista prèvia: {type}
de: Vorschaubild: {type}
es: Previsualización: {type}
fr: Image d'aperçu : {type}
it: Immagine di anteprima: {type}
sr: Прегледна слика: {type}
sr@latn: Pregledna slika: {type}

source: This function is only avaiable for ripped DVD's.
ca: Aquesta funció només està disponible per a DVD extrets.
de: Diese Funktion ist nur verfügbar bei DVDs, die auf die Festplatte kopiert wurden.
es: Esta función sólo esta disponible para DVD extraídos.
fr: Cette fonction n'est disponible que pour les DVD extraits
it: Questa funzione è disponibile solo per DVD già estratti.
sr: Ово дејство је доступно само за прочитане ДВДове.
sr@latn: Ovo dejstvo je dostupno samo za pročitane DVDove.

source: Illegal frame number. Maximum is
ca: Núm. de fotograma il·legal. El màxim és
de: Ungültige Frame Nummer. Maximum ist
es: Número de fotograma ilegal. El máximo es
fr: Numéro d'image incorrect. Le Maximum est
it: Il numero di fotogrammi è illegale. Il massimo è
sr: Неисправан број кадра. Максимум је
sr@latn: Neispravan broj kadra. Maksimum je

source: Executing command for video preview: {command}
ca: S'està executant l'ordre per previsualitzar el vídeo: {command}
de: Führe Befehl für Video Vorschau aus: {command}
es: Ejecutando comando para previsualizar el video: {command}
fr: Lancement de la commande pour l'apercu vidéo : {command}
it: Sto eseguendo il comando per l'anteprima video: {command}
sr: Изврши команду за преглед видеа: {command}
sr@latn: Izvrši komandu za pregled videa: {command}

source: This is not possible because fast resizing is enabled.
ca: Això no és possible perquè el redimensionat ràpid està activat.
de: Dies ist nicht möglich, weil die schnelle Skalierung aktiviert ist.
es: Esto no es posible porque el redimensionado rápido esta activado.
fr: Ceci est impossible car le redimensionnement rapide est activé.
it: Questa scelta non è possibile perché si è abilitato il ridimensionamento veloce.
sr: Ово није могуће зато што је укључено брзо мењање величине.
sr@latn: Ovo nije moguće zato što je uključeno brzo menjanje veličine.

source: Logging
ca: Registre
de: Protokoll
es: Registro
fr: Journal
it: Registrazione
sr: Бележење
sr@latn: Beleženje

source: Log messages
ca: Registraments
de: Protokoll Nachrichten
es: Registro
fr: Journal des messages
it: Log dei messaggi
sr: Поруке дневника
sr@latn: Poruke dnevnika

source: Nuke log file
ca: Buida el registre
de: Protokolldatei löschen
es: Vaciar el registro
fr: Vider le journal
it: Azzera il file di log
sr: Уништи фајл дневника
sr@latn: Uništi fajl dnevnika

source: Log filename
ca: Nom de fitxer de registre
de: Log Dateiname
es: Nombre de archivo de registro
fr: Fichier journal
it: Nome del file di log
sr: Име дневника
sr@latn: Ime dnevnika
