Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: With this option the dvd::rip GUI may be tweaked to fit even on small screens by adding scrollbars to the notebook pages. dvd::rip needs to be restarted to take effect
ca: Amb aquesta opció es pot ajustar la interfície gràfica (GUI) del dvd::rip perquè s'acomodi fins i tot a les pantalles petites, tot afegint barres de desplaçament a les pàgines de la pantalla del "bloc de notes". Caldrà, però, reiniciar el dvd::rip perquè aquest ajustament sigui efectiu.
de: Mit dieser Option kann die dvd::rip Oberfläche für kleine Bildschirmauflösungen optimiert werden, indem Scrollbalken zu den einzelnen Notizbuchseiten hinzugefügt werden. dvd::rip muss neu gestartet werden, damit sich Änderungen hieran auswirken.

source: Basic settings
ca: Configuracions bàsiques
de: Grundeinstellungen
es: Configuraciones básicas
it: Impostazioni di base
sr: Основне поставке
sr@latn: Osnovne postavke

source: Commands
ca: Ordres
de: Befehle
es: Comandos
fr: Commandes
it: Comandi
sr: Наредбе
sr@latn: Naredbe

source: Cluster options
ca: Opcions de clúster
de: Cluster
es: Opciones de cluster
fr: Options du cluster
it: Opzioni del cluster
sr: Опције скупине
sr@latn: Opcije skupine

source: Miscellaneous options
ca: Opcions diverses
de: Verschiedenes
es: Otras opciones
fr: Options diverses
it: Opzioni varie
sr: Разне опције
sr@latn: Razne opcije

source: - No Modifications (anamorph) -
ca: - Sense modificacions (anamòrfic)-
de: - Nichts verändern (anamorph) -

source: Autoadjust, Clipping only (anamorph)
ca: Autoajust, només retallat (anamòrfic)
de: Autom. Beschnitt ohne Skalierung (anamorph)

source: Autoadjust, Big Frame Size, HQ Resize
ca: Autoajust, mida gran, redimensionat HQ
de: Autom. Beschnitt, Großes Bild, Skal. mit hoher Qualität
es: Autoajuste, Tamaño Grande, Redimensionado AC
fr: Ajustement automatique, Grande Taille, Redimensionnement HQ
it: Autoaggiusta, Dimensione fotogramma grande, Ridimensionamento Alta Qualità
sr: Аутоматско подешавање, Велики кадрови, HQ мењање величине
sr@latn: Automatsko podešavanje, Veliki kadrovi, HQ menjanje veličine

source: Autoadjust, Medium Frame Size, HQ Resize
ca: Autoajust, mida mitjana, redimensionat HQ
de: Autom. Beschnitt, Mittl. Bildgröße, Skal. mit hoher Qualität
es: Autoajuste, Tamaño Medio, Redimensionado AC
fr: Ajustement automatique, Taille Moyenne, Redimensionnement HQ
it: Autoaggiusta, Dimensione fotogramma media, Ridimensionamento Alta Qualità
sr: Аутоматско подешавање, Средњи кадрови, HQ мењање величине
sr@latn: Automatsko podešavanje, Srednji kadrovi, HQ menjanje veličine

source: Autoadjust, Small Frame Size, HQ Resize
ca: Autoajust, mida petita, redimensionat HQ
de: Autom. Beschnitt, Kleine Bildgröße, Skal. mit hoher Qualität
es: Autoajuste, Tamaño Pequeño, Redimensionado AC
fr: Ajustement automatique, Petite Taille, Redimensionnement HQ
it: Autoaggiusta, Dimensione fotogramma piccola, Ridimensionamento Alta Qualità
sr: Аутоматско подешавање, Мали кадрови, HQ мењање величине
sr@latn: Automatsko podešavanje, Mali kadrovi, HQ menjanje veličine

source: Autoadjust, Big Frame Size, Fast Resize
ca: Autoajust, mida gran, redimensionat ràpid
de: Autom. Beschnitt, Großes Bild, Schnelle Skal.
es: Autoajuste, Tamaño Grande, Redimensionado Rápido
fr: Ajustement automatique, Grande Taille, Redimensionnement Rapide
it: Autoaggiusta, Dimensione fotogramma grande, Ridimensionamento veloce
sr: Аутоматско подешавање, Велики кадрови, Брзо мењање величине
sr@latn: Automatsko podešavanje, Veliki kadrovi, Brzo menjanje veličine

source: Autoadjust, Medium Frame Size, Fast Resize
ca: Autoajust, mida mitjana, redimensionat ràpid
de: Autom. Beschnitt, Mittl. Bildgröße, Schnelle Skal.
es: Autoajuste, Tamaño Medio, Redimensionado Rápido
fr: Ajustement automatique, Taille Moyenne, Redimensionnement Rapide
it: Autoaggiusta, Dimensione fotogramma media, Ridimensionamento veloce
sr: Аутоматско подешавање, Средњи кадрови, Брзо мењање величине
sr@latn: Automatsko podešavanje, Srednji kadrovi, Brzo menjanje veličine

source: Autoadjust, Small Frame Size, Fast Resize
ca: Autoajust, mida petita, redimensionat ràpid
de: Autom. Beschnitt, Kleine Bildgröße, Schnelle Skal.
es: Autoajuste, Tamaño Pequeño, Redimensionado Rápido
fr: Ajustement automatique, Petite Taille, Redimensionnement Rapide
it: Autoaggiusta, Dimensione fotogramma piccola, Ridimensionamento veloce
sr: Аутоматско подешавање, Мали кадрови, Брзо мењање величине
sr@latn: Automatsko podešavanje, Mali kadrovi, Brzo menjanje veličine

source: SVCD anamorph, PAL
ca: SVCD anamòrfic, PAL
es: SVCD anamórfico, PAL
fr: SVCD anamorphe, PAL
it: SVCD anamorfico, PAL

source: XSVCD anamorph, PAL
ca: XSVCD anamòrfic, PAL
es: XSVCD anamórfico, PAL
fr: XSVCD anamorphe, PAL
it: XSVCD anamorfico, PAL

source: CVD anamorph, PAL
ca: CVD anamòrfic, PAL
es: CVD anamórfico, PAL
fr: CVD anamorphe, PAL
it: CVD anamorfico, PAL

source: SVCD anamorph, NTSC
ca: SVCD anamòrfic, NTSC
es: SVCD anamórfico, NTSC
fr: SVCD anamorphe, NTSC
it: SVCD anamorfico, NTSC

source: XSVCD anamorph, NTSC
ca: XSVCD anamòrfic, NTSC
es: XSVCD anamórfico, NTSC
fr: XSVCD anamorphe, NTSC
it: XSVCD anamorfico, NTSC

source: CVD anamorph, NTSC
ca: CVD anamòrfic, NTSC
es: CVD anamórfico, NTSC
fr: CVD anamorphe, NTSC
it: CVD anamorfico, NTSC

source: {file} executable : Ok
ca: {file} és executable: Bé
de: {file} ausführbar : Ok
es: {file} ejecutable : Bien
fr: {file} est exécutable : correct
it: {file} eseguibile : OK
sr: {file} извршни : У реду
sr@latn: {file} izvršni : U redu

source: {file} not found : NOT Ok
ca: {file} no s'ha trobat: Error
de: {file} nicht gefunden : NICHT Ok
es: {file} no encontrado : Mal
fr: {file} est introuvable : ERREUR
it: {file} non trovato: NON OK
sr: {file} није пронађен : НИЈЕ у реду
sr@latn: {file} nije pronađen : NIJE u redu

source: {file} not executable : NOT Ok
ca: {file} no és executable: Error
de: {file} nicht ausführbar : NICHT Ok
es: {file} no ejecutable : Mal
fr: {file} n'est pas exécutable : ERREUR
it: {file} non eseguibile : NON OK
sr: {file} није извршни : НИЈЕ у реду
sr@latn: {file} nije izvršni : NIJE u redu

source: has whitespace : NOT Ok
ca: té espais en blanc: Error
de: hat Leerzeichen: NOT Ok
es: tiene espacios en blanco : Mal
fr: présence de caractère d'espacement : ERREUR
it: Ha spazi bianchi: NON OK
sr: садржи размаке : НИЈЕ у реду
sr@latn: sadrži razmake : NIJE u redu

source: is no absolute path : NOT Ok
ca: no és un camí absolut: Error
de: kein absoluter Phad : NOT Ok
es: no es una ruta absoluta : Mal
fr: n'est pas un chemin absolu : ERREUR
it: Non è un percorso assoluto: NON OK
sr: није апсолутна стаза : НИЈЕ у реду
sr@latn: nije apsolutna staza : NIJE u redu

source: {file} not writable : NOT Ok
ca: {file} no és escribible : Error
de: {file} nicht schreibbar : NICHT Ok
es: {file} no escribible : Mal
fr: {file} est en lecture seule : ERREUR
it: {file} non è scrivibile: NON OK
sr: {file} није уписив : НИЈЕ у реду
sr@latn: {file} nije upisiv : NIJE u redu

source: {file} writable : Ok
ca: {file} és escribible : Bé
de: {file} schreibbar : Ok
es: {file} escribible : Bien
fr: {file} est en lecture/écriture : correct
it: {file} è scrivibile : OK
sr: {file} уписив : У реду
sr@latn: {file} upisiv : U redu

source: {value} is numeric : Ok
ca: {value} és numèric: Bé
de: {value} ist numerisch : Ok
es: {value} es numérico : Bien
fr: {value} est numérique : correct
it: {value} è un valore numerico: OK
sr: {value} је нумеричка : У реду
sr@latn: {value} je numerička : U redu

source: {value} isn't numeric : NOT Ok
ca: {value} no és numèric: Error
de: {value} nicht nicht numerisch : NICHT Ok
es: {value} no es numérico : Mal
fr: {value} n'est pas numérique : ERREUR
it: {value} non è un valore numerico : NON OK
sr: {value} није нумеричка : НИЈЕ у реду
sr@latn: {value} nije numerička : NIJE u redu

source: is empty : Ok
ca: és buit : Bé
de: ist leer : Ok
es: está vacío : Bien
fr: est vide : correct
it: è vuoto: OK
sr: је празан : У реду
sr@latn: je prazan : U redu

source: {value} exists : Ok
ca: {value} existeix: Bé
de: {value} existiert : Ok
es: {value} existe : Bien
fr: {value} existe : correct
it: {value} esiste : OK
sr: {value} постоји : У реду
sr@latn: {value} postoji : U redu

source: {value} doesn't exist : NOT Ok
ca: {value} no existeix: Error
de: {value} existiert nicht : NOT Ok
es: {value} no existe : Mal
fr: {value} n'existe pas : ERREUR
it: {value} non esiste : NON OK
sr: {value} не постоји : НИЈЕ у реду
sr@latn: {value} ne postoji : NIJE u redu

source: '{value}' is known : Ok
ca: '{value}' és conegut: Bé
de: '{value}' ist gültig : Ok
es: '{value}' es válido : Bien
fr: '{value}' est connu : correct
it: '{value}' è noto : OK
sr: „{value}“ је позната : У реду
sr@latn: „{value}“ je poznata : U redu

source: '{value}' unknown: NOT Ok
ca: '{value}' és desconegut: Error
de: '{value}' unbekannt : NOT Ok
es: '{value}' no es válido : Mal
fr: '{value}' inconnu : ERREUR
it: '{value}' è sconosciuto: NON OK
sr: „{value}“ није позната: НИЈЕ у реду
sr@latn: „{value}“ nije poznata: NIJE u redu

source: Project file saved to '{filename}'
ca: El fitxer de projecte s'ha desat a '{filename}'
de: Projektdatei wurde nach '{filename}' gespeichert
es: Archivo de proyecto guardado a '{filename}'
fr: Fichier de projet enregistré comme '{filename}'
it: Il progetto è stato salvato come '{filename}'
sr: Фајл пројекта снимљен као „{filename}“
sr@latn: Fajl projekta snimljen kao „{filename}“

source: Project temporary dir '{dir}' created
ca: S'ha creat el directori temporal de projecte '{dir}'
de: Temporäres Projektverzeichnis '{dir}' erzeugt
es: Directorio temporal del proyecto '{dir}' creado
fr: Dossier temporaire '{dir}' créé pour le projet
it: Directory temporanea del progetto '{dir}' creata
sr: Направљен је привремени директоријум за пројекат: „{dir}‟
sr@latn: Napravljen je privremeni direktorijum za projekat: „{dir}‟

source: no filename set
ca: No s'ha definit un nom de fitxer
de: Kein Dateiname gesetzt
es: No se ha definido un nombre de archivo
fr: ancun nom de fichier défini
it: non è stato impostato alcun nome di file
sr: није постављено име датотеке
sr@latn: nije postavljeno ime datoteke

source: can't read {filename}
ca: No es pot llegir {filename}
de: Konnte Datei '{filename}' nicht lesen
es: No puedo leer {filename}
fr: Impossible de lire le fichier {filename}
it: non posso leggere {filename}
sr: не могу да прочитам {filename}
sr@latn: ne mogu da pročitam {filename}

source: File is no dvd::rip file
ca: El fitxer no és un fitxer de dvd::rip
de: Datei ist keine dvd::rip Projektdatei
es: El archivo no es un archivo de dvd::rip
fr: Ce fichier n'est pas un fichier dvd::rip
it: Il file non appartiene a dvd::rip
sr: Фајл није dvd::rip фајл
sr@latn: Fajl nije dvd::rip fajl

source: Can't load {filename}, wrong data format
ca: No es pot carregar {filename}. el format de dades és incorrecte
de: Konnte Datei '{filename}' nicht laden, falsches Datenformat
es: No puedo cargar {filename}. formato de datos incorrecto
fr: chargement du fichier {filename} impossible. Mauvais format de données
it: Non riesco a caricare {filename}, formato dei dati errato
sr: не могу да учитам {filename}, формат података је неисправан
sr@latn: ne mogu da učitam {filename}, format podataka je neispravan

source: can't load {filename}. Perl error: {error}
ca: No es pot carregar {filename}. L'error del Perl és: {error}
de: Konnte Datei '{filename}' nicht laden. Es traten Perl Fehler auf: {error}
es: No puedo cargar {filename}. Error de Perl: {error}
fr: chargement du fichier {filename} impossible. Erreur Perl : {error}
it: non posso caricare {filename}. Errore Perl: {error}
sr: не могу да учитам {filename}. Perl грешка: {error}
sr@latn: ne mogu da učitam {filename}. Perl greška: {error}

source: WARNING: no IFO files found - vobsub feature disabled.
ca: ATENCIÓ: no s'han trobat fitxers IFO - s'ha desactivat el vobsub
de: WARNUNG: keine IFO Dateien gefunden - vobsub Funktion wird abgeschaltet.
es: ATENCIÓN: no se han encontrado archivos IFO - vobsub desactivado.
fr: ATTENTION : aucun fichier IFO trouvé - fonction vobsub désactivée.
it: ATTENZIONE: non è stato trovato alcun file IFO - la caratteristica vobsub è stata disabilitata.
sr: УПОЗОРЕЊЕ: нису пронађени IFO фајлови - vobsub карактеристика искључена.
sr@latn: UPOZORENJE: nisu pronađeni IFO fajlovi - vobsub karakteristika isključena.

source: Copying IFO files from {src_dir} to {dir}
ca: S'estan copiant fitxers IFO de {src_dir} a {dir}
de: Kopiere IFO Dateien von '{src_dir}' nach '{dir}'
es: Copiando archivos IFO de {src_dir} a {dir}
fr: Copie des fichiers IFO depuis {src_dir}·vers·{dir}
it: Copio i file IFO da {src_dir} a {dir}
sr: Умножавам IFO датотеке из {src_dir} у {dir}
sr@latn: Umnožavam IFO datoteke iz {src_dir} u {dir}

source: Mounting DVD at {mount_point}
ca: S'està muntant el DVD a {mount_point}
de: Hänge DVD ein auf Mount-Punkt '{mount_point}'
es: Montando DVD en {mount_point}
fr: Montage du DVD dans le dossier {mount_point}
it: Monto il DVD su {mount_point}
sr: Монтирам DVD у {mount_point}
sr@latn: Montiram DVD u {mount_point}

source: Failed to mount DVD at {mount_point} ({mount_error})
ca: Ha fallat el muntatge del DVD a {mount_point} ({mount_error})
de: Konnte DVD nicht einhängen auf Mount-Punkt '{mount_point} ({mount_error})
es: Error montando el DVD en {mount_point} ({mount_error})
fr: Échec de montage du DVD dans {mount_point} ({mount_error})
it: Non è possibile montare il DVD su {mount_point} ({mount_error})
sr: Нисам успео да монтирам DVD у {mount_point} ({mount_error})
sr@latn: Nisam uspeo da montiram DVD u {mount_point} ({mount_error})

source: Umount {mount_point}:
ca: Desmunta {mount_point}:
es: Desmontar {mount_point}:
fr: Démonter {mount_point} :
it: Smonto {mount_point}:

source: Warning: filter {filter} removed from title #{nr} because this transcode installation doesn't provide it anymore
ca: Atenció: el filtre {filter} ha estat eliminat del títol #{nr} perquè aquesta instal·lació del transcode ja no el proporciona.
de: Warnung: Filter {filter} wurde vom Titel #{nr} entferne, weil diese transcode Installation den Filter nicht enthält.
es: Atención: filtro {filter} eliminado del título #{nr} porque esta instalación de transcode ya no lo proporciona.
fr: Attention : filtre {filter} retiré du titre n°{nr} car cette installation de transcode ne la fournit plus
it: Attenzione: il filtro {filter} è stato rimosso dal titolo #{nr} perché questa installazione di transcode non lo fornisce più
sr: Упозорење: филтер {filter} је уклоњен из наслова бр. {nr} јер га инсталација програма transcode више не подржава
sr@latn: Upozorenje: filter {filter} je uklonjen iz naslova br. {nr} jer ga instalacija programa transcode više ne podržava

source: Error executing a transcode socket command:
ca: S'ha produït un error en executar una ordre de connexió del transcode:
de: Fehler bei der Ausführung eines transcode Socket Befehls:
es: Error ejecutando un comando de conexión de transcode:
fr: Erreur d'exécution d'une commande socket de transcode :
it: Si è verificato un errore eseguendo il comando socket di transcode:
sr: Грешка при извршавању наредбе transcode сокета:
sr@latn: Greška pri izvršavanju naredbe transcode soketa:

source: Not tested yet
ca: Encara no s'ha comprovat
de: Noch nicht getestet
es: No comprobado todavía
fr: Pas encore testé
it: Ancora non testato
sr: Још није проверено
sr@latn: Još nije provereno

source: dvd::rip - Edit cluster node
ca: dvd::rip - Edita node del clúster
de: dvd::rip - Cluster Knoten bearbeiten
es: dvd::rip - Editar nodo del cluster
fr: dvd::rip - Modifier le noeud du cluster
it: dvd::rip - Modifica il nodo del cluster
sr: двд::рип - Уреди чвор из роја
sr@latn: dvd::rip - Uredi čvor iz roja

source: Edit node properties
ca: Edita propietats del node
de: Bearbeite Knoten Eigenschaften
es: Editar propiedades del nodo
fr: Modification des propriétés du noeud
it: Modifica le proprietà del nodo
sr: Уреди особине чвора
sr@latn: Uredi osobine čvora

source: Name
ca: Nom
es: Nombre
fr: Nom
it: Nome
sr: Име
sr@latn: Ime

source: Hostname
ca: Nom de la màquina
de: Rechnername
es: Nombre de la máquina
fr: Nom de machine
it: Nome del progettoThis is the mount point of the dvd::rip data master directory on this node, e.g. connected via NFS or Samba
sr: Име рачунара
sr@latn: Ime računara

source: Network hostname of this node. Defaults to node name.
ca: Nombre de xarxa d'aquest node. Per defecte és el nom del node.
de: Netzwerk Hostname von diesem Knoten. Ist per Default gleich dem Knotennamen.
es: Nombre de red de este nodo. Por defecto el nombre del nodo.
fr: Nom d'hôte de ce noeud. Par défaut le nom du noeud.
it: Nome host di rete di questo nodo. Prestabilito: nome del nodo.
sr: Мрежно име овог чвора. Подразумева се име чвора.
sr@latn: Mrežno ime ovog čvora. Podrazumeva se ime čvora.

source: No valid hostname
ca: Nombre de la màquina no vàlid
de: Kein gültiger Knotenname
es: Nombre de la máquina no válido
fr: Aucun nom d'hôte valide
it: Non è un nome host valido
sr: Име рачунара није исправно
sr@latn: Ime računara nije ispravno

source: Local data directory
ca: Directori de dades local
de: Lokales Datenverzeichnis
es: Directorio de datos local
fr: Dossier local des données
it: Directory dei dati locale
sr: Локални директоријум за податке
sr@latn: Lokalni direktorijum za podatke

source: This is the mount point of the dvd::rip data master directory on this node, e.g. connected via NFS or Samba
ca: Aquest és el punt de muntatge del directori de dades mestre del dvd::rip en aquest node, e.g. connectat via NFS o Samba
de: Das ist der Einhängepunkt des dvd::rip Datenhauptverzeichnisses auf diesem Knoten, z.B. verbunden über das Netzwerk mit NFS oder Samba
es: Este es el punto de montaje del directorio maestro de datos de dvd::rip en este nodo, e.g. conectado via NFS o Samba
fr: Ceci est le point de montage du dossier principal de données de dvd::rip sur ce noeud, par ex. connecté par NFS ou Samba
it: Questo è il punto di montaggio della directory principale dei dati di dvd::rip su questo nodo, per esempio connesso tramite NSF o Samba
sr: Ово је тачка о коју се качи главни директоријум овог рачунара за двд::рип, нпр. употребом NFSа или Самбе.
sr@latn: Ovo je tačka o koju se kači glavni direktorijum ovog računara za dvd::rip, npr. upotrebom NFSa ili Sambe.

source: Speed index
ca: Índex de velocitat
de: Geschwindigkeitsindex
es: Índice de velocidad
fr: Index de vitesse
it: Indice di velocità
sr: Индекс брзине
sr@latn: Indeks brzine

source: Enter an integer value indicating the speed of this node. The higher the value the faster it is. Faster nodes are preferred over slower nodes.
ca: Introduïu un valor enter que indiqui la velocitat del node. Com més alt sigui el valor, més ràpid serà. Es prefereixen els nodes més ràpids sobre els més lents.
de: Geben Sie einen ganzahligen Wert als Indikator für die Geschwindigkeit dieses Knotens an. Je höher der Wert, desto schneller ist dieser Knoten. Schnelle Knoten werden gegenüber langsamen bevorzugt.
es: Introduce un valor entero indicando la velocidad del nodo. Cuanto mayor es el valor más rápido es. Nodos más rápidos son preferidos a los nodos más lentos.
fr: Entrez une valeur entière indiquant la vitesse de ce noeud. La vitesse est proportionnelle à cette valeur.Les noeuds rapides sont prioritaires sur les noeuds lents.
it: Inserisci un valore intero che indichi la velocità di questo nodo. Più alto è il valore, più veloce è il nodo. I nodi più veloci vengono preferiti ai nodi più lenti.
sr: Унесите целобројну вредност која одређује брзину овог чвора. Што је број већи, брзина је већа. Бржи чворови користе се радије него спорији.
sr@latn: Unesite celobrojnu vrednost koja određuje brzinu ovog čvora. Što je broj veći, brzina je veća. Brži čvorovi koriste se radije nego sporiji.

source: Additional transcode options
ca: Opcions addicionals del transcode
de: Zusätzliche transcode Optionen
es: Opciones de transcode adicionales
fr: Options additionnelles de transcode
it: Opzioni aggiuntive per transcode
sr: Додатна подешавања програма transcode
sr@latn: Dodatna podešavanja programa transcode

source: You can specify additional transcode options for this node, e.g. -u 4,2 to increase the performance on a two processor machine
ca: Podeu especificar opcions del transcode addicionals per a aquest node, e.g. -u 4,2 per incrementar les prestacions en una màquina de dos processadors.
de: Hier können zusätzliche transcode Optionen für diesen Knoten angegeben werden, z.B. -u 4,2 um die Geschwindigkeit bei einem Zwei-Prozessor-System zu erhöhen
es: Puedes especificar opciones de transcode adicionales para este nodo, e.g. -u 4,2 para incrementar las prestaciones en una máquina de dos procesadores
fr: Vous pouvez préciser des options supplémentaires de transcode pour ce noeud, par ex. -u 4,2pour améliorer les performances sur une machine bi-pro ou dualcore
it: Puoi specificare opzioni addizionali di transcode per questo nodo,per esempio -u 4,2 per incrementare le prestazioni su una macchina biprocessore
sr: Можете да поставите додатна подешавања за transcode за овај чвор, нпр. -u 4,2 како бисте побољшали перформансе на двопроцесорском рачунару
sr@latn: Možete da postavite dodatna podešavanja za transcode za ovaj čvor, npr. -u 4,2 kako biste poboljšali performanse na dvoprocesorskom računaru

source: Node has dvd::rip data harddrive?
ca: El node, té el disc dur de dades del dvd::rip?
de: Hat dieser Knoten die dvd::rip Datenfestplatte?
es: ¿El nodo tiene el disco duro de datos de dvd::rip?
fr: Ce noeud a le disque de données dvd::rip ?
it: Il nodo possiede il disco rigido dei dati di dvd::rip?
sr: Да ли чвор има хард диск за податке за двд::рип?
sr@latn: Da li čvor ima hard disk za podatke za dvd::rip?

source: If this node has the dvd::rip data hardrive locally connected, I/O intensive jobs are executed on this node with higher priority
ca: Si aquest node té el disc dur de dades del dvd::rip connectat localment, les tasques intensives en E/S s'executaran en aquest node amb prioritat més alta.
de: Wenn an diesen Knoten die dvd::rip Datenfestplatte angeschlossen ist werden Jobs mit viel Daten Ein/Ausgabe bevorzugt auf diesem Knoten ausgeführt
es: Si este nodo tiene el disco duro de datos de dvd::rip conectado localmente, los trabajos intensivos en E/S se ejecutan en este nodo con mayor prioridad.
fr: Si le disque de données dvd::rip est branché sur ce noeud, les travaux d'échange disque y sont exécutés avec une plus haute priorité
it: Se questo nodo possiede il disco rigido dei dati di dvd::rip connesso localmente,i lavori con I/O intensivo sono eseguiti su questo nodo con priorità più alta
sr: Ако чвор има локално прикључен диск за податке за двд::рип, послови који траже интензиван рад са дисковима извршавају се на овом рачунару са повишеним приоритетом.
sr@latn: Ako čvor ima lokalno priključen disk za podatke za dvd::rip, poslovi koji traže intenzivan rad sa diskovima izvršavaju se na ovom računaru sa povišenim prioritetom.

source: Node runs Cluster Control Daemon?
ca: El node, executa el dimoni de control de clúster?
de: Läuft der Cluster Master Daemon hier?
es: ¿El nodo ejecuta el Demonio de Control de Cluster?
fr: Le noeud contrôle le cluster ?
it: Il demone di controllo del cluster è su questo nodo?
sr: Чвор покреће демона за управљање јатом?
sr@latn: Čvor pokreće demona za upravljanje jatom?
