Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Usage: dvdrip [-c] [-d level] [-p file] [-f function [-t title-nr]] [file] dvdrip --version | -version | -v -c open cluster control window -d set debugging level -f execute one of the following functions (needs filename) transcode transcode the selected title transcode_split transcode and split the selected title -t title-nr to which the function above should apply (Default: last selected title) -p preferences filename (Default: ~/.dvdriprc) A new file is created, if it doesn't exist.
ca: Sintaxi: dvdrip [-c] [-d nivell] [-p fitxer] [-f funció [-t núm-títol]] [fitxer] dvdrip --version | -version | -v -c obre la finestra de control de clúster -d defineix el nivell de depuració -f executa una de les següents funcions (li cal un nom de fitxer) transcode codifica el títol seleccionat transcode_split codifica i divideix el títol seleccionat -t núm-títol al qual s'hauria d'aplicar la funció de dalt (Valor predeterminat: últim títol seleccionat) -p nom del fitxer de preferències (Valor predeterminat: ~/.dvdriprc) Si no existeix se'n crea un de nou.
de: Aufruf: dvdrip [-c] [-d Stufe] [-p Datei] [-f Funktion [-t Titel-Nr]] [Datei] dvdrip --version | -version | -v -c Cluster Control Fenster öffnen -d Debugging Level setzen -f Ausführen einer dieser Funktionen (Dateiname muss angegeben werden) transcode ausgewählten Titel transkodieren transcode_split ausgewählten Titel transkodieren und aufteilen -t Titelnummer auf die die Funktion angewendet werden soll (Default: letzter ausgewählter Titel im Projekt) -p Dateiname für die Voreinstellungen (Default: ~/.dvdriprc) Eine neue Datei wird angelegt, wenn diese noch nicht existiert
es: Uso: dvdrip [-c] [-d nivel] [-p archivo] [-f función [-t num-título]] [archivo] dvdrip --version | -version | -v -c abrir ventana de control de cluster -d definir nivel de depuración -f ejecutar una de las siguientes funciones (necesita un nombre de archivo) transcode codificar el título seleccionado transcode_split codificar y dividir el título seleccionado -t num-título al que se debería aplicar la función de arriba (Por defecto: último título seleccionado) -p nombre de archivo de preferencias (Por defecto: ~/.dvdriprc) Si no existe se crea un archivo nuevo.
fr: Usage : dvdrip [-c] [-d niveau] [-p fichier] [-f fonction [-t num-titre]] [fichier] dvdrip --version | -version | -v -c ouvre la fenêtre de contrôle du cluster -d niveau de déboguage -f exécute une des fonctions suivantes (requiert un nom de fichier) transcode transcode le titre sélectionné transcode_split encode et découpe le titre sélectionné -t numéro du titre auquel la fonction ci-dessus doit s'appliquer (par défaut : dernier titre sélectionné) -p fichier de préférences (par défaut: ~/.dvdriprc) Un nouveau fichier est créé s'il n'existe pas.
it: Uso: dvdrip [-c] [-d livello] [-p file] [-f funzione [-t num-titolo]] [file] dvdrip --version | -version | -v -c apre la finestra di controllo del cluster -d imposta il livello di debug su livello -f esegue una delle seguenti funzioni (richiede un nome di file) transcode codifica il titolo selezionato transcode_split codifica e divide il titolo selezionato -t num-titolo titolo al quale la funzione di cui sopra sarà applicata (Prestabilito: ultimo titolo selezionato) -p nome del file delle preferenze (Prestabilito: ~/.dvdriprc) Sarà creato un nuovo file se non ne esiste alcuno.
sr: Употреба: dvdrip [-c] [-d ниво] [-p фајл] [-f функција [-t наслов-nr]] [фајл] dvdrip --version | -version | -v -c отвара прозор за контролу скупине -d поставља ниво за исправљање грешака -f извршава једну од следећих функција (потребно је име фајла) transcode кодира изабрани наслов transcode_split кодира и раздваја изабрани наслов -t наслов-nr на који би требало применити функцију изнад (Подразумевано: последњи изабрани наслов) -p име фајла са поставкама (Подразумевано: ~/.dvdriprc) Прави нови фајл, ако већ не постоји.
sr@latn: Upotreba: dvdrip [-c] [-d nivo] [-p fajl] [-f funkcija [-t naslov-nr]] [fajl] dvdrip --version | -version | -v -c otvara prozor za kontrolu skupine -d postavlja nivo za ispravljanje grešaka -f izvršava jednu od sledećih funkcija (potrebno je ime fajla) transcode kodira izabrani naslov transcode_split kodira i razdvaja izabrani naslov -t naslov-nr na koji bi trebalo primeniti funkciju iznad (Podrazumevano: poslednji izabrani naslov) -p ime fajla sa postavkama (Podrazumevano: ~/.dvdriprc) Pravi novi fajl, ako već ne postoji.

source: Usage: dvdrip-master [-w [-W port] ] [loglevel] loglevel logs messages to stdout 1 - basic logging, no details 2 - log actual jobs 3 - log all executed commands also -w start webserver service -W port port for webserver (default: 8888)
ca: Sintaxi: dvdrip-master [-w [-W port] ] [nivell_log] nivell_log registra missatges a la sortida estàndard 1 - registre bàsic, sense detalls 2 - registra els treballs reals 3 - registra també totes les ordres executades -w inicia el servei de servidor web -W port port per al servidor web (predeterminat: 8888)
de: Aufruf: dvdrip-master [-w [-W Port] ] [Protokollstufe] Protokollstufe: Meldungen werden auf STDOUT ausgegeben 1 - Standardmeldungen, keine Details 2 - Jobs protokollieren 3 - Alle ausgeführten Befehle protokollieren -w Webserver Dienst starten -W port TCP Port des Webservers (Default: 8888)
es: Uso: dvdrip-master [-w [-W puerto] ] [nivel_log] nivel_log registra mensajes a la salida estándar 1 - registro básico, sin detalles 2 - registrar los trabajos reales 3 - registrar también todos los comandos ejecutados -w iniciar el servicio de servidor web -W puerto puerto para el servidor web (predeterminado: 8888)
fr: Usage : dvdrip-master [-w [-W port] ] [niveau_de_log] niveau_de_log envoie des messages vers la sortie standard 1 - basique, pas de détail 2 - montre les travaux actuels 3 - montre en plus toutes les commandes exécutées -w démarre le serveur web -W port port du serveur web (defaut : 8888)
it: Uso: dvdrip-master [-w [-W porta] ] [livello_log] livello_log registra i messaggi sullo stdout 1 - registrazione di base, nessun dettaglio 2 - registrazione lavori attivi 3 - registrazione anche di tutti i comandi eseguiti -w avvia il servizio webserver -W port porta per il webserver (prestabilita: 8888)
sr: Употреба: dvdrip-master [-w [-W порт] ] [ниво] ниво запис порука на стандардни излаз 1 - основни запис, без детаља 2 - записује послове 3 - записује и све извршене команде -w покретање веб сервера -W порт порт за веб сервер (изворно: 8888)
sr@latn: Upotreba: dvdrip-master [-w [-W port] ] [nivo] nivo zapis poruka na standardni izlaz 1 - osnovni zapis, bez detalja 2 - zapisuje poslove 3 - zapisuje i sve izvršene komande -w pokretanje veb servera -W port port za veb server (izvorno: 8888)

source: splash.en.png
ca: splash.ca.png
de: splash.de.png
es: splash.es.png
fr: splash.fr.png
it: splash.it.png
sr: splash.sr.png
sr@latn: splash.sr@Latn.png

source: '{function}' not supported
ca: '{function}' no està disponible
de: '{function}' unbekannt
es: '{function}' no soportada
fr: '{function}' non pris en charge
it: la funzione '{function}' non è supportata
sr: „{function}“ није подржана
sr@latn: „{function}“ nije podržana

source: Video
ca: Vídeo
fr: Vidéo
it: Vista
sr: Видео

source: Audio
ca: Àudio
sr: Аудио

source: Yes
ca: Sí
de: Ja
es: Sí
fr: Oui
it: Sì
sr: Да
sr@latn: Da

source: Node '{node}' stopped
ca: S'ha aturat el node '{node}'
de: Knoten '{node}' gestoppt
es: Nodo '{node}' parado
fr: Le noeud '{node}' a été arrêté
it: Ho fermato il nodo '{node}'
sr: Чвор „{node}“ заустављен
sr@latn: Čvor „{node}“ zaustavljen

source: Node '{node}' started
ca: S'ha iniciat el node '{node}'
de: Knoten '{node}' gestartet
es: Nodo '{node}' arrancado
fr: Le noeud '{node}' a été démarré
it: Ho avviato il nodo '{node}'
sr: Чвор „{node}“ покренут
sr@latn: Čvor „{node}“ pokrenut

source: Node {name} finished tests
ca: El node {name} ha acabat les proves
de: Knoten {name} hat die Tests durchlaufen
es: Nodo {name} terminó las pruebas
fr: Le noeud {name} a fini ses tests
it: Il nodo {name} ha completato i test
sr: Нод {name} је завршио тестове
sr@latn: Nod {name} je završio testove

source: execute command: {command} (timeout={timeout})
ca: executa ordre: {command} (temps d'expera={timeout})
de: Befehlsausführung: {command} (Timeout={timeout})
es: ejecutar comando: {command} (tiempo de espera={timeout})
fr: Exécution de la commande : {command} (délai={timeout})
it: esegui il comando: {command} (tempo massimo={timeout})
sr: изврши наредбу: {command} (пауза={timeout})
sr@latn: izvrši naredbu: {command} (pauza={timeout})

source: Command cancelled due to timeout
ca: L'ordre ha estat cancel·lada en vèncer el temps d'espera
de: Befehl abgebrochen wegen Zeitüberschreitung
es: Comando cancelado debido a expiración del tiempo de espera
fr: Commande annulé (dépassement du délai)
it: Il comando è stato annullato perché è trascorso troppo tempo
sr: Наредба је поништена због паузе
sr@latn: Naredba je poništena zbog pauze

source: Job has PID {pid}
ca: La tasca té el PID {pid}
de: Job hat Prozess ID {pid}
es: El trabajo tiene PID {pid}
fr: N° de processus de la tâche : {pid}
it: Il lavoro ha il PID {pid}
sr: Посао има PID {pid}
sr@latn: Posao ima PID {pid}

source: Aborting command. Sending signal 1 to PID {pid}...
ca: S'està cancel·lant l'ordre. S'envia el senyal 1 al PID {pid}...
de: Befehl wird abgebrochen. Sende Signal 1 zur PID {pid}...
es: Abortando comando. Enviando la señal 1 al PID {pid}...
fr: Annulation de la commande. Envoi du signal 1 au processus n°{pid}...
it: Annullo il comando. Sto inviando il segnale 1 al PID {pid}...
sr: Гасим наредбу. Шаљем сигнал 1 PID-у {pid}...
sr@latn: Gasim naredbu. Šaljem signal 1 PID-u {pid}...

source: Master daemon activated
ca: S'ha activat el dimoni mestre
de: Master Daemon aktiviert
es: Demonio maestro activado
fr: Contrôleur maître activé
it: E` stato attivato il demone di controllo del cluster principale
sr: Главни демон покренут
sr@latn: Glavni demon pokrenut

source: Got signal {signal}.
ca: S'ha rebut el senyal {signal}.
de: Signal {signal} empfangen.
es: Señal {signal} recibida.
fr: Signal {signal} reçu.
it: Ricevuto segnale {signal}.
sr: Примљен сигнал {signal}.
sr@latn: Primljen signal {signal}.

source: Node check watcher disabled
ca: El sentinella de comprovació de nodes està desactivat
de: Knotenbeobachter abgeschaltet
es: Vigía de comprobación de nodos desactivado
fr: Surveillance de noeud désactivée
it: Il controllo del nodo è stato disabilitato
sr: Искључен прегледач за проверу чвора
sr@latn: Isključen pregledač za proveru čvora

source: Warning: node check fping reported nothing
ca: Atenció: la comprovació de node amb fping no ha informat res
de: Warnung: fping Knotentest lieferte keine Ergebnisse.
es: Atención: comprobación de nodo con fping no informó nada
fr: Attention : la surveillance de noeud par fping n'a rien donné
it: Attenzione: la prova con fping non riporta nulla riguardo al nodo
sr: Упозорење: провера чвора fping није ништа пријавила
sr@latn: Upozorenje: provera čvora fping nije ništa prijavila

source: Node '{node_name}' is now online.
ca: El node '{node_name}' és ara en línia.
de: Knoten '{node_name}' is jetzt online.
es: El nodo '{node_name}' está ahora en línea.
fr: Le noeud '{node_name}' est maintenant en ligne
it: Il nodo '{node_name}' ora è in linea.
sr: Чвор „{node_name}“ је сада на вези.
sr@latn: Čvor „{node_name}“ je sada na vezi.

source: Node '{node_name}' is still reachable. Will be online in 5 seconds.
ca: El node '{node_name}' encara és accessible. Estarà en línia d'aquí a 5 segons.
de: Knoten '{node_name}' ist immer noch erreichbar. Wird online geschaltet in 5 Sekunden.
es: Todavía se puede contactar con el nodo '{node_name}'. Estará en línea dentro de 5 segundos.
fr: Le noeud '{node_name}' est encore joignable. Il sera en ligne dans 5 secondes.
it: Il nodo '{node_name}' è ancora raggiungibile. Sarà in linea entro 5 secondi.
sr: Чвор „{node_name}“ је још увек доступан. Биће на вези за 10 секунди.
sr@latn: Čvor „{node_name}“ je još uvek dostupan. Biće na vezi za 10 sekundi.

source: Node '{node_name}' is now reachable. Will be online in 10 seconds.
ca: El node '{node_name}' és accessible ara. Estarà en línia d'aquí a 10 segons.
de: Knoten '{node_name}' ist jetzt erreichbar. Wird online geschaltet in 10 Sekunden.
es: Todavía se puede contactar con el nodo '{node_name}'. Estará en línea dentro de 10 segundos.
fr: Le noeud '{node_name}' est maintenant joignable. Il sera en ligne dans 10 secondes.
it: Il nodo '{node_name}' è ora raggiungibile. Sarà in linea entro 10 secondi.
sr: Чвор „{node_name}“ је сада доступан. Биће на вези за 20 секунди.
sr@latn: Čvor „{node_name}“ je sada dostupan. Biće na vezi za 20 sekundi.

source: Node '{node_name}' is Ok again
ca: El node '{node_name}' torna a estar bé.
de: Knoten '{node_name}' ist wieder verfügbar.
es: Nodo '{node_name}' está bien otra vez.
fr: Le noeud '{node_name}' est de nouveau OK
it: Il nodo '{node_name}' è nuovamente OK
sr: Чвор „{node_name}“ је опет у реду
sr@latn: Čvor „{node_name}“ je opet u redu

source: Warning: Node '{node_name}' is unreachable
ca: Atenció: No es pot contactar amb el node '{node_name}'
de: Warnung: Knoten '{node_name}' ist nicht erreichbar
es: Atención: No se puede contactar con el nodo '{node_name}'
fr: Attention : le noeud '{node_name}' n'est pas joignable
it: Attenzione: il nodo '{node_name}' non è raggiungibile
sr: Упозорење: Чвор „{node_name}“ није доступан
sr@latn: Upozorenje: Čvor „{node_name}“ nije dostupan

source: Warning: Node '{node_name}' possibly offline
ca: Atenció: Pot ser que el node '{node_name}' estigui desconnectat.
de: Warnung: Knoten '{node_name}' ist möglicherweise offline
es: Atención: El nodo '{node_name}' posiblemente esté desconectado.
fr: Attention : le noeud '{node_name}' est probablement déconnecté
it: Attenzione: è probabile che il nodo '{node_name}' sia fuori linea
sr: Упозорење: Чвор „{node_name}“ вероватно није на вази
sr@latn: Upozorenje: Čvor „{node_name}“ verovatno nije na vazi

source: Loading node file '{file}'
ca: S'està carregant el fitxer de node '{file}'
de: Lade Knotendatei '{file}'
es: Cargando archivo de nodo '{file}'
fr: Chargement du fichier de noeud '{file}'
it: Carico il file di nodo '{file}'
sr: Учитавам фајл чвора „{file}“
sr@latn: Učitavam fajl čvora „{file}“

source: Loading project file '{filename}'
ca: S'està carregant el fitxer de projecte '{filename}'
de: Lade Projektdatei '{filename}'
es: Cargando archivo de proyecto '{filename}'
fr: Chargement du fichier de projet '{filename}'
it: Carico il file di progetto '{filename}'
sr: Учитавам фајл пројекта „{filename}“
sr@latn: Učitavam fajl projekta „{filename}“

source: Node must have a name
ca: Un node ha de tenir un nom
de: Ein Knoten muss einen Namen haben
es: Un nodo debe tener un nombre
fr: Le noeud doit avoir un nom
it: Un nodo deve avere un nome
sr: Чвор мора имати име
sr@latn: Čvor mora imati ime

source: Node with this name already exists
ca: Ja existeix un node amb aquest nom
de: Ein Knoten mit diesem Namen existiert bereits
es: Ya existe un nodo con ese nombre
fr: Ce nom est déjà utilisé par un noeud
it: Esiste già un nodo con questo nome
sr: Чвор са овим именом већ постоји
sr@latn: Čvor sa ovim imenom već postoji

source: Node '{node_name}' saved to '{filename}'
ca: El node '{node_name}' s'ha desat a '{filename}'
de: Datei des Knotens '{node_name}' wurde nach '{filename}' gespeichert
es: Nodo '{node_name}' guardado a '{filename}'
fr: Le noeud '{node_name}' enregistré dans '{filename}'
it: Il nodo '{node_name}' è stato salvato come '{filename}'
sr: Чвор „{node_name}“ снимљен у „{filename}“
sr@latn: Čvor „{node_name}“ snimljen u „{filename}“

source: Project with filename '{filename}' added
ca: S'ha afegit un projecte amb el nom de fitxer '{filename}'
de: Projekt wurde hinzugefügt, Dateiname '{filename}'
es: Añadido un proyecto con nombre de archivo '{filename}'
fr: Le projet nommé '{filename}' a été ajouté
it: E` stato aggiunto il progetto chiamato '{filename}
sr: Пројекат са именом фајла „{filename}“ додат
sr@latn: Projekat sa imenom fajla „{filename}“ dodat

source: Project {project} removed
ca: S'ha eliminat el projecte {project}
de: Projekt {project} wurde entfernt.
es: Proyecto {project} eliminado
fr: Le projet {project} a été supprimé
it: Il progetto {project} è stato rimosso
sr: Пројекат {project} уклоњен
sr@latn: Projekat {project} uklonjen

source: Master shutdown. Stopping active jobs.
ca: S'està aturant el mestre. S'aturen les tasques actives.
de: Der Master wird heruntergefahren. Stoppe aktive Jobs.
es: Apagando el maestro. Parando trabajos activos.
fr: Extinction du maître. Arrêt des travaux actifs.
it: Spegnimento del nodo principale. Arresto di tutti i lavori attivi.
sr: Угашен главни рачунар. Активни послови заустављени.
sr@latn: Ugašen glavni računar. Aktivni poslovi zaustavljeni.

source: Master shutdown
ca: S'està aturant el mestre.
de: Der Master wird heruntergefahren.
es: Apagando el maestro
fr: Extinction du maître
it: Arresto del nodo principale
sr: Главни рачунар је угашен
sr@latn: Glavni računar je ugašen

source: Cluster control daemon will shutdown in 2 seconds...
ca: El dimoni de control del clúster s'aturarà en 2 segons...
de: Der Master wird in zwei Sekunden heruntergefahren...
es: Demonio de control del cluster se cerrará en 2 segundos...
fr: Le contrôleur du cluster sera arrêté dans 2 secondes...
it: Il demone di controllo del cluster sarà disattivato tra 2 secondi...
sr: Демон за контролу скупине ће се угасити за 2 секунде...
sr@latn: Demon za kontrolu skupine će se ugasiti za 2 sekunde...

source: Start job '{name}'
ca: Comença la tasca '{name}'
de: Starte Job '{name}'
es: Iniciando trabajo '{name}'
fr: Démarrage de la tâche '{name}'
it: Avvio il lavoro '{name}'
sr: Почни посао „{name}‟
sr@latn: Počni posao „{name}‟

source: Job '{name}' exited with error: {error}
ca: La tasca '{name}' ha sortir amb l'error: {error}
de: Job '{name}' wurde fehlerhaft beendet: {error}
es: El trabajo '{name}' salió con el error: {error}
fr: La tâche '{name}' s'est terminée avec une erreur : {error}
it: Il lavoro '{name}' è terminato con errore: {error}
sr: Посао „{name}‟ је завршио уз грешку: {error}
sr@latn: Posao „{name}‟ je završio uz grešku: {error}

source: Job '{name}' warning: {warning}
ca: Avís de la tasca '{name}': {warning}
de: Job '{name}' Warnung: {warning}
es: Trabajo '{name}' aviso: {warning}
fr: Avertissement du job '{name}' : {warning}
it: Lavoro '{name} warning: {warning}
sr: Упозорење за посао „{name}‟: {warning}
sr@latn: Upozorenje za posao „{name}‟: {warning}

source: Job '{name}' cancelled
ca: La tasca '{name}' ha estat cancel·lada
de: Job '{name}' abgebrochen
es: Trabajo '{name}' cancelado
fr: Job '{name}' annulé
it: Lavoro '{name}' annullato
sr: Посао је отказан: „{name}‟
sr@latn: Posao je otkazan: „{name}‟

source: Job '{name}' finished
ca: La tasca '{name}' ha acabat
de: Job '{name}' fertig
es: Trabajo '{name}' terminado
fr: Job '{name}' fini
it: Il lavoro '{name}' è terminato
sr: Посао је завршен: „{name}‟ finished
sr@latn: Posao je završen: „{name}‟ finished

source: All running cluster projects
ca: Tots els projectes que s'executen en el clúster
de: Alle laufenden Cluster Projekte
es: Todos los proyectos ejecutándose en el cluster
fr: Tous les projets en cours du cluster
it: Tutti i progetti del cluster in esecuzione
sr: Сви активни ројевски пројекти
sr@latn: Svi aktivni rojevski projekti

source: Process all PSU's - title #{nr}
ca: Processa totes les PSU - títol #{nr}
de: Verarbeite alle PSUs - Titel #{nr}
es: Procesar todas las PSUs - título #{nr}
fr: Traite tous les PSU - titre n°{nr}
it: Elabora tutte le PSU - title #{nr}
sr: Обради све PSUове - наслов бр. {nr}
sr@latn: Obradi sve PSUove - naslov br. {nr}

source: Move PSU #0 file to final destination
ca: Mou el fitxer de la PSU #0 a la destinació final
de: Verschiebe PSU #0 Datei in das Zielverzeichnis
es: Mover el archivo de la PSU #0 al destino final
fr: Déplace le fichier PSU n°0 vers la destination finale
it: Sposta il file PSU #0 sulla destinazione finale
sr: Помери PSU бр. 0 на коначно одредиште
sr@latn: Pomeri PSU br. 0 na konačno odredište

source: Merge all audio tracks - title #{nr}, PSU #{psu}
ca: Incorpora totes les pistes d'àudio - títol #{nr}, PSU #{psu}
de: Alle Audiospuren verbinden - Titel #{nr}, PSU #{psu}
es: Incorporando todas las pistas de audio - título #{nr}, PSU #{psu}
fr: Fusionne toutes les pistes audio - titre·n°{nr},·PSU·n°{psu}
it: Unisci tutte le tracce audio - titolo #{nr}, PSU #{psu}
sr: Спој све аудио траке - наслов #{nr}, PSU #{psu}
sr@latn: Spoj sve audio trake - naslov #{nr}, PSU #{psu}

source: Multipass video transcoding - title #{nr}, PSU #{psu}, chunk #{chunk}
ca: Codificació del vídeo amb diverses passades - títol #{nr}, PSU #{psu}, part #{chunk}
de: Multipass Video Transkodieren - Titel #{nr}, PSU #{psu}, Abschnitt #{chunk}
es: Codificando el video con varias pasadas - título #{nr}, PSU #{psu}, parte #{chunk}
fr: Transcodage vidéo multi-passe - title·n°{nr},·PSU·n°{psu},·tranche·n°{chunk}
it: Codifica multipassata - titolo #{nr}, PSU #{psu}, blocco #{chunk}
sr: Вишепролазно транскодирање - наслов #{nr}, PSU #{psu}, комад #{chunk}
sr@latn: Višeprolazno transkodiranje - naslov #{nr}, PSU #{psu}, komad #{chunk}

source: Process all video chunks - title #{nr}, PSU #{psu}
ca: Processa totes les parts del vídeo - títol #{nr}, PSU #{psu}
de: Alle Video Abschnitte verarbeiten - Titel #{nr}, PSU #{psu}
es: Procesar todas las partes de video - título #{nr}, PSU #{psu}
fr: Traitement de toutes les tranches vidéo·-·titre·n°{nr},·PSU·n°{psu}
it: Elaborazione di tutti i blocchi bideo - titolo #{nr}, PSU #{psu}
sr: Обрада свих видео комада - наслов #{nr}, PSU #{psu}
sr@latn: Obrada svih video komada - naslov #{nr}, PSU #{psu}

source: Merge video chunks - title #{nr}, PSU #{psu}
ca: Incorpora parts de vídeo - títol #{nr}, PSU #{psu}
de: Video Abschnitte zusammenführen - Titel #{nr}, PSU #{psu}
es: Incorporar partes de video - título #{nr}, PSU #{psu}
fr: Fusion de toutes les tranches vidéo -·titre·n°{nr},·PSU·n°{psu}
it: Unisci i blocchi video - titolo #{nr}, PSU #{psu}
sr: Спајање видео комада - наслов #{nr}, PSU #{psu}
sr@latn: Spajanje video komada - naslov #{nr}, PSU #{psu}

source: Merge all PSU files - title #{nr}
ca: Incorpora tots els fitxers PSU - títol #{nr}
de: Alle PSU Dateien zusammenführen - Titel #{nr}
es: Incorporar todos los archivos PSU - título #{nr}
fr: Fusion de tous les fichiers PSU·-·titre·n°{nr}
it: Unisci tutti i file PSU - titolo #{nr}
sr: Састављање свих PSU датотека - наслов #{nr}
sr@latn: Sastavljanje svih PSU datoteka - naslov #{nr}

source: can't send command to transcode
ca: No es pot enviar l'ordre al transcode
de: Kann Befehl nicht zu transcode senden
es: No puedo enviar el comando a transcode
fr: Impossible d'envoyer la commande à Transcode
it: non posso inviare il comando a transcode
sr: не могу да пошаљем наредбу transcode-у
sr@latn: ne mogu da pošaljem naredbu transcode-u

source: Unknown preview command '{command}'
ca: Ordre de previsualització desconeguda '{command}'
de: Unbekannter Vorschau Befehl '{command}'
es: Comando de previsualización desconocido '{command}'
fr: Commande de prévisualisation '{command}' inconnue
it: Il comando d'anteprima '{command}' è sconosciuto
sr: Непозната наредба за преглед „{command}“
sr@latn: Nepoznata naredba za pregled „{command}“

source: All internal command files
ca: Tots els fitxers d'ordres internes
de: Alle internen Befehlskommandos
es: Todos los archivos internos
fr: Tous les fichiers de commandes internes
it: Tutti i file dei comandi interni
sr: Све интерне командне датотеке
sr@latn: Sve interne komandne datoteke
