Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Deinterlace mode
ca: Mode de desentrellaçat
de: Deinterlace Modus
es: Modo de desentrelazado
fr: Mode de désentrelacement
it: Modalità deinterlacciamento
sr: Режим расплитања
sr@latn: Režim rasplitanja

source: Choose a deinterlacer algorithm here if the movie is interlaced, otherwise the transcoded movie is likely to have many artefacts. The 'Smart deinterlacing' setting is recommended.
ca: Escolliu aquí un algorisme de desentrellaçat si el vídeo esta entrellaçat, altrament el vídeo codificat probablement tindrà molts defectes. Es recomana el "Desentrellaçat intel·ligent".
de: Hier kann ein Deinterlacer Algorithmus eingestellt werden, falls derFilm im Zeilensprungverfahren aufgezeichnet wurde. Andererseitswird das Endergebnis viele Artefakte, z.B. Kammstrukturen beihorizontalen Bewegungen aufweisen. Der "Smart Deinterlacer"kann hierfür empfohlen werden.
es: Elige un algoritmo de desentrelazado aquí si el video está entrelazado, de otro modo el video codificado probablemente tendrá muchos defectos. Se recomienda el 'Desentrelazado inteligente'.
fr: Si le film est entrelacé, choisissez un algorithme de désentrelacement,sinon de nombreux artefacts apparaîtront. Le réglage recommandé est « désentrelacement intelligent ».
it: Scegli un algoritmo di deinterlacciamento se il filmato è interlacciato, altrimenti il filmato codificato probabilmente mostrerà molte imperfezioni. L'impostazione raccomandata è 'Deinterlacciamento intelligente'.
sr: Изаберите алгоритам са расплитањем ако је филм са преплитањем, јер у супротном филм ће имати пуно артефаката. Препоручује се паметно расплитање.
sr@latn: Izaberite algoritam sa rasplitanjem ako je film sa preplitanjem, jer u suprotnom film će imati puno artefakata. Preporučuje se pametno rasplitanje.

source: Filters
ca: Filtres
de: Filter
es: Filtros
fr: Filtres
it: Filtri
sr: Филтери
sr@latn: Filteri

source: Configure filters & preview...
ca: Configura filtres i previsualitzacions...
de: Filter Einstellungen / Vorschau
es: Configurar filtros y previsualizaciones...
fr: Configurer les filtres et l'aperçu...
it: Configura filtri & anteprima...
sr: Подеси филтере и преглед...
sr@latn: Podesi filtere i pregled...

source: This opens a dialog which gives you access all filters transcode supports.
ca: Obre un diàleg que us dóna accés a tots els filtres que admet el transcode.
de: Diese Schaltfläche öffnet einen Dialog mit dem alle Filter von transcodeim Detail eingestellt werden können.
es: Abre un diálogo que te da acceso a todos los filtros que soporta transcode.
fr: Ceci ouvre une fenêtre qui vous donne accès à tous les filtres pris en charge par transcode.
it: Apre una sezione riguardante tutti i filtri supportati da transcode.
sr: Ово отвара прозор који Вам даје приступ свим филтерима које transcode подржава
sr@latn: Ovo otvara prozor koji Vam daje pristup svim filterima koje transcode podržava

source: Audio options
ca: Opcions d'àudio
de: Audio Einstellungen
es: Opciones de audio
fr: Options audio
it: Opzioni audio
sr: Аудио опције
sr@latn: Audio opcije

source: Select track
ca: Selecciona pista
de: Spur auswählen
es: Seleccionar pista
fr: Choisissez une piste
it: Scegli traccia
sr: Избор траке
sr@latn: Izbor trake

source: Quality
ca: Qualitat
de: Qualität
es: Calidad
fr: Qualité
it: Qualità
sr: Квалитет
sr@latn: Kvalitet

source: Use quality mode
ca: Usa mode qualitat
de: Qualitätsmodus
es: Usar modo calidad
fr: Utiliser le mode de qualité
it: Usa la modalità qualità
sr: Користи режим квалитета
sr@latn: Koristi režim kvaliteta

source: {ac3_or_pcm} sound is passed through. Bit- and samplerate are detected from source, so you can't change them here.
ca: El so {ac3_or_pcm} no es modifica. La taxa de bits i la freqüència es prenen de l'origen, per la qual cosa aquí no es poden canviar.
de: {ac3_or_pcm} Ton wird 1:1 übernommen. Bit- und Samplerate wird automatisch erkannt, diese können hier nicht verändert werden.
es: El sonido {ac3_or_pcm} no se modifica. La tasa de bits y la frecuencia se toman del origen, por lo que no se pueden cambiar aquí.
fr: Le son {ac3_or_pcm} est laissé inchangé. Le débit et le taux d'échantillonnage sont ceux de la source, donc vous ne pouvez pas les modifier.
it: Il suono {ac3_or_pcm} è lasciato così com'è. Il bitrate e il samplerate sono rilevati dalla sorgente perciò non puoi cambiarli qui.
sr: {ac3_or_pcm} звук се пропушта. Битски и одбирачки проток су одређени извором тако да их не можете мењати одавде.
sr@latn: {ac3_or_pcm} zvuk se propušta. Bitski i odbirački protok su određeni izvorom tako da ih ne možete menjati odavde.

source: Filter
ca: Filtre
es: Filtro
fr: Filtre
it: Filtri
sr: Филтери
sr@latn: Filteri

source: Volume rescale
ca: Reescala volum
de: Lautst. max.
es: Reescalar volumen
fr: Facteur d'amplification
it: Aggiusta il volume
sr: Поновно скалирање јачине
sr@latn: Ponovno skaliranje jačine

source: Scan value
ca: Valor escanejat
de: Wert emitteln
es: Valor escaneado
fr: détecter
it: Analizza il valore
sr: Вредност претраге
sr@latn: Vrednost pretrage

source: Bit-/Samplerate
ca: Taxa bits/Freqüència
es: Frecuencia/Tasa de bits
fr: Bit-/Échantillonnage
sr: Битски/одбирачки проток
sr@latn: Bitski/odbirački protok

source: Video bitrate calculation
ca: Càlcul de la taxa de bits de vídeo
de: Video Bitraten-Berechnung
es: Calculo de tasa de bits de video
fr: Débit et taille de la vidéo
it: Calcolo del bitrate video
sr: Израчунавање учесталости бита видеа
sr@latn: Izračunavanje učestalosti bita videa

source: By target size
ca: Per la mida del medi
de: Nach Zielgröße
es: Por tamaño del medio
fr: Par taille cible
it: Per dimensione della destinazione
sr: Према крајњој величини
sr@latn: Prema krajnjoj veličini

source: Target media
ca: Medi de destinació
de: Ziel Medium
es: Medio de destino
fr: Nombre et taille des CDs
it: Media di destinazione
sr: Циљни медијум
sr@latn: Ciljni medijum

source: Choose the desired number of discs here. dvd::rip computes the target size from it and optionally splits the result file accordingly.
ca: Escolliu aquí el nombre de discos desitjat. El dvd::rip calcula la mida final i opcionalment divideix el fitxer resultant en conseqüència.
de: Wählen Sie die gewünschte Anzahl Rohlinge aus. dvd::rip errechnet dann die passende Zielgröße und teilt die Zieldatei entsprechend auf.
es: Elige aquí el número deseado de discos. dvd::rip calcula el tamaño final y opcionalmente divide el archivo resultante como corresponda.
fr: Choisissez le nombre de disques souhaité. dvd::rip en déduira la taille finale et découpera le fichier de manière appropriée.
it: Scegli il numero di dischi che desideri. dvd::rip calcola la dimensione richiesta in base a questo e opzionalmente divide il file dei risultati.
sr: Изаберите овде жељени број дискова. двд::рип одатле рачуна циљну величину датотеке и по потреби дели излазну датотеку.
sr@latn: Izaberite ovde željeni broj diskova. dvd::rip odatle računa ciljnu veličinu datoteke i po potrebi deli izlaznu datoteku.

source: Select the size of your media here (several CD and DVD form factors). The unit is a true megabyte (1024KB). You may enter an arbitrary value if the preset don't fit your needs.
ca: Escolliu aquí la mida del medi (entre diverses mides de CD i DVD). La unitat es un megabyte real (1024 KB). Podeu introduir-hi un valor arbitrari si els predeterminats no s'ajusten a les vostres necessitats.
de: Hier können Sie Größe der Zielmedien einstellen. Die Liste bietet diverse Standard CD und DVD Größen an. Die Einheit sind "echte" Megabyte (1024 KB).Der Wert kann auch manuell eingestellt werden.
es: Elige aquí el tamaño del medio (varios tamaños de CD y DVD). La unidad es un megabyte real (1024 KB). Puedes introducir un valor arbitrario si los predeterminados no encajan con tus necesidades.
fr: Choisissez la taille des media (plusieurs tailles de CD et DVD). L'unité est le mégaoctet (1024ko). Vous pouvez taper une valeur arbitraire si les choix disponibles ne suffisent pas.
it: Scegli la dimensione dei tuo supporti (molti CD e DVD sono differenti). L'unità di misura è un megabyte reale (1024KB). Puoi inserire un valore arbitrario se i valori predefiniti non ti soddisfano.
sr: Изаберите величину медијума (неколико ЦД и ДВД формата). Јединица је прави мегабајт (1024KB). Можете да унесете произвољну вредност ако Вам поставка не одговара.
sr@latn: Izaberite veličinu medijuma (nekoliko CD i DVD formata). Jedinica je pravi megabajt (1024KB). Možete da unesete proizvoljnu vrednost ako Vam postavka ne odgovara.

source: This entry is computed based on the settings above, but you may enter an arbitrary value as well.
ca: Aquesta entrada es calcula en base a les configuracions anteriors, però podeu introduir-hi també un valor arbitrari.
de: Dieses Feld wird aufgrund der obigen Einstellungen automatisch berechnet. Es kann aber auch manuell ein eigener Wert eingegeben werden.
es: Esta entrada se calcula basada en las configuraciones de arriba, pero puedes introducir un valor arbitrario también.
fr: Cette valeur est calculée à partir des réglages ci-dessus, mais vous pouvez aussi taper la valeur de votre choix.
it: Questo valore è determinato dal computer basandosi sulle impostazioni precedenti, ma puoi comunque inserire un valore arbitrario.
sr: Овај унос се рачуна зависно од горњих подешавања, али можете такође да унесете и произвољну вредност.
sr@latn: Ovaj unos se računa zavisno od gornjih podešavanja, ali možete takođe da unesete i proizvoljnu vrednost.

source: Consider frame range
ca: Considera rang de fotogrames
de: Für Frame-Bereich
es: Considerar rango de fotogramas
fr: Envisagez un intervalle de trames
it: Considera intervallo di fotogrammi
sr: Обради опсег кадрова
sr@latn: Obradi opseg kadrova

source: If you specified a frame range in the 'General options' section activate this checkbutton if the video bitrate calculation should be based on this frame range, and not on the full title length. You need this if you entered the frame range not just for testing purposes but also for the final transcoding, e.g. for cutting off credits.
ca: Si especifiqueu un rang de fotogrames en la secció 'Opcions generals', activeu aquesta opció si el càlcul de la taxa de bits de vídeo hauria d'estar basat en aquest rang, i no pas en la llargària total del títol. Necessiteu aquesta opció si vau introduir el rang no només per a les proves, sinó també per a la codificació final, com per ex., per tallar els crèdits.
de: Wenn ein Frame-Bereich bei den "Allgemeinen Einstellungen" eingegeben wurde, so kann mit diesem Knopf eingestellt werden, ob die Video-Bitraten-Berechnung nur für diesen Bereich oder den gesamten Film gelten soll. Das ist sinnvoll, wenn der Bereich nicht nur zum Testen gesetzt wurde, sondern weil damit z.B. die Credits o.ä. herausgeschnitten werden sollen.
es: Si especifics un rango de fotogramas en la sección 'Opciones generales' activa esta opción si el cálculo de la tasa de bits de video debería estar basado en ese rango, y no en la longitud total del título. Necesitas esto si introdujiste el rango no sólo para pruebas sino también para la codificación final, e.g. para cortar los créditos.
fr: Activez ce bouton si vous avez précisé un intervalle de trames dans les « options générales », et si le calcul du débit vidéo doit être basé sur cet intervalle plutôt que sur la longueur totale du titre.Ceci est valable si vous avez choisi l'intervalle pour autre chose que des tests, c'est à dire pour le transcodage final, par exemple pour supprimer le générique de fin.
it: Se hai specificato un intervallo di fotogrammi nella sezione 'Opzioni generali', attiva questa opzione se il calcolo del bitrate video dev'essere basato su questo intervallo e non sull'intera lunghezza del titolo. Questo ti serve se hai inserito l'intervallo di fotogrammi non a scopo di test, ma anche per la codifica finale, ad esempio per tagliare i titoli di coda.
sr: Ако сте навели опсег кадрова у Општим подешавањима, изаберите ову могућност ако обрачун видео битског протока треба да се заснива на опсегу кадрова, а не на пуној дужини наслова. Ово је потребно ако сте опсег кадрова унели не само за пробу већ за коначно транскодирање, рецимо за опсецање шпица.
sr@latn: Ako ste naveli opseg kadrova u Opštim podešavanjima, izaberite ovu mogućnost ako obračun video bitskog protoka treba da se zasniva na opsegu kadrova, a ne na punoj dužini naslova. Ovo je potrebno ako ste opseg kadrova uneli ne samo za probu već za konačno transkodiranje, recimo za opsecanje špica.

source: By quality
ca: Per qualitat
de: Nach Qualität
es: Por calidad
fr: Par qualité
it: Per qualità
sr: По квалитету
sr@latn: Po kvalitetu

source: BPP value
ca: Valor de BPP
de: BPP Wert
es: Valor de BPP
fr: Valeur BPP
it: Valore BPP
sr: Вредност BPP
sr@latn: Vrednost BPP

source: BPP stands for Bits Per Pixel and is a measure for the video quality. Values around 0.25 give fair results (VHS quality), 0.4-0.5 very good quality near DVD.
ca: BPP vol dir 'bits per píxel', i és una mesura de la qualitat del vídeo. Els valors al voltant de 0.25 donen resultats regulars (qualitat de VHS), i en el rang que va de 0.4 a 0.5 donen molt bona qualitat, propera a la de DVD.
de: BPP steht für "Bits per Pixel" und ist eine Einheit für die Videoqualität.Werte im Bereich 0.25 geben in etwa VHS Qualität, 0.4 bis 0.5 sehr gute Qualität mit DVD vergleichbar.
es: BPP significa Bits Por Pixel y es una medida de la calidad del video. Valores alrededor de 0.25 dan resultados justos (calidad VHS), 0.4-0.5 dan muy buena calidad, cercana a DVD.
fr: BPP signifie « Bits Par Pixel », c'est une mesure de la qualité de la vidéo. Des valeurs autour de 0.25 donnent des résultats corrects (qualité VHS), et des valeurs autour de 0.4-0.5 permettent d'approcher la qualité du DVD.
it: BPP sta per Bits Per Pixel ed è una misura della qualità del video. Valori intorno a 0.25 portano a risultati accettabili (qualità VHS), 0.4-0.5 qualità molto buona prossima ai DVD.
sr: BPP значи „бита по пикселу‟ и представља меру квалитета слике. Вредности око 0.25 дају добре резултате (VHS квалитет), 0.4-0.5 дају квалитет веома близу ДВДу.
sr@latn: BPP znači „bita po pikselu‟ i predstavlja meru kvaliteta slike. Vrednosti oko 0.25 daju dobre rezultate (VHS kvalitet), 0.4-0.5 daju kvalitet veoma blizu DVDu.

source: Manually
ca: Manualment
de: Manuell
es: Manualmente
fr: Manuel
it: Manuale
sr: Ручно
sr@latn: Ručno

source: Video bitrate
ca: Taxa de bits de vídeo
es: Tasa de bits de video
fr: Débit vidéo
it: Bitrate video
sr: Учесталост бита видеа
sr@latn: Učestalost bita videa

source: If you don't want a calculated video bitrate just enter an arbitrary value here.
ca: Si no desitgeu una taxa de bits de vídeo calculada, introduïu aquí un valor arbitrari.
de: Wenn die Video-Bitrate nicht berechnet werden soll, so können Sie hiereine beliebige Rate per Hand eingeben.
es: Si no quieres una tasa de bits de video calculada, introduce aquí un valor arbitrario.
fr: Si vous ne voulez pas d'une valeur de débit vidéo calculée, tapez votre propre valeur ici.
it: Se non vuoi un bitrate video precalcolato inserisci un valore arbitrario qui.
sr: Ако не желите да користите прерачунат видео битски проток, унесите овде вредност по жељи.
sr@latn: Ako ne želite da koristite preračunat video bitski protok, unesite ovde vrednost po želji.

source: General options
ca: Opcions generals
de: Allgemeine Optionen
es: Opciones generales
fr: Options générales
it: Opzioni generali
sr: Опште опције
sr@latn: Opšte opcije

source: Frame range
ca: Rang de fotogrames
de: Frame-Bereich
es: Rango de fotogramas
fr: Intervalle d'images
it: Intervallo di fotogrammi
sr: Опсег кадрова
sr@latn: Opseg kadrova

source: Movie has only {number} frames
ca: La pel·lícula només té {number} fotogrames
de: Der Film hat nur {number} Frames.
es: La película sólo tiene {number} fotogramas
fr: Le film n'a que {number} trames
it: Il filmato ha solo {number} fotogrammi
sr: Филм има само оволико кадрова: {number}
sr@latn: Film ima samo ovoliko kadrova: {number}

source: Start frame number must be smaller than end frame number
ca: El fotograma inicial ha de ser anterior al fotograma final
de: Die Start-Frame-Nummer muß kleiner sein als die Ende-Frame-Nummer.
es: El fotograma inicial debe ser anterior al fotograma final
fr: Le trame initiale doit être antérieure à la trame finale
it: Il numero di fotogramma iniziale deve essere minore del numero di fotogramma finale
sr: Број почетног кадра мора бити мањи од броја крајњег кадра
sr@latn: Broj početnog kadra mora biti manji od broja krajnjeg kadra

source: End frame number must be greated than start frame number
ca: El fotograma final ha de ser posterior al fotograma inicial
de: Die Ende-Frame-Nummer muss größer sein also die Start-Frame-Nummer.
es: El fotograma final debe ser mayor que el fotograma inicial
fr: La trame finale doit être postérieure à la trame initiale
it: Il numero di fotogramma finale deve essere maggiore del numero difotogramma iniziale
sr: Број крајњег кадра мора бити већи од броја почетног кадра
sr@latn: Broj krajnjeg kadra mora biti veći od broja početnog kadra

source: transcode options
ca: Opcions del transcode
de: transcode Optionen
es: Opciones de transcode
fr: Options de Transcode
it: opzioni di transcode
sr: опције transcode-а
sr@latn: opcije transcode-a

source: Process nice level
ca: Prioritat del procés
de: Prozess nice Wert
es: Prioridad del proceso
fr: Niveau de priorité (nice)
it: Livello nice del processo
sr: Обради лепи ниво
sr@latn: Obradi lepi nivo

source: Preview window
ca: Vista prèvia
de: Vorschaufenster
es: Previsualizar
fr: Fenêtre d'aperçu
it: Finestra d'anteprima
sr: Прозор за преглед
sr@latn: Prozor za pregled

source: Use PSU core
ca: Usa nucli PSU
de: PSU Core
es: Usar núcleo PSU
fr: Utiliser le PSU core
it: Usa core PSU
sr: Користи PSU језгро
sr@latn: Koristi PSU jezgro

source: Execute afterwards
ca: Executa en acabar
de: Nachher ausführen
es: Ejecutar al terminar
fr: Exécuter après
it: Successivamente esegui
sr: Изврши после
sr@latn: Izvrši posle

source: and exit
ca: i surt
de: und beenden
es: y salir
fr: puis quitter
it: ed esci
sr: и изађи
sr@latn: i izađi

source: Operate
ca: Executa
de: Ausführen
es: Ejecutar
fr: Exécution
it: Operazioni
sr: Дејства
sr@latn: Dejstva

source: View
ca: Visualitza
de: Ansehen
es: Ver
fr: Visionner
it: Vista
sr: Приказ
sr@latn: Prikaz

source: Add to cluster
ca: Afegeix a clúster
de: Zum Cluster
es: Añadir a cluster
fr: Ajouter au cluster
it: Aggiungi al cluster
sr: Додај у скупину
sr@latn: Dodaj u skupinu

source: Split files on transcoding
ca: Divideix els fitxers en codificar
de: Datei nach dem Transkodieren aufteilen
es: Dividir archivos al codificar
fr: découper les fichiers après transcodage
it: Divido i file dopo la codifica
sr: Подели датотеку при кодирању
sr@latn: Podeli datoteku pri kodiranju

source: Calculated storage
ca: Mida calculada
de: Speicherplatzberechnung
es: Tamaño calculado
fr: Taille estimée du fichier encodé
it: Spazio calcolato
sr: Израчунај простор
sr@latn: Izračunaj prostor

source: V-Rate:
ca: Taxa bits v.:
es: Tasa-V:
fr: Rafraîchiss. Vertical :
sr: V-однос:
sr@latn: V-odnos:

source: Video size:
ca: Mida del vídeo:
de: Video Größe:
es: Tamaño de video:
fr: Taille de la piste vidéo :
it: Dimensione Video:
sr: Величина видеа:
sr@latn: Veličina videa:

source: Audio size:
ca: Mida de l'àudio:
de: Audio Größe:
es: Tamaño de audio:
fr: Taille de la bande son :
it: Dimensione Audio:
sr: Величина аудиа:
sr@latn: Veličina audia:

source: Other size:
ca: Mida d'altres:
de: Andere:
es: Otros tamaños:
fr: Autre :
it: Altro:
sr: Остале величине
sr@latn: Ostale veličine

source: Details...
ca: Detalls...
es: Detalles...
fr: Détail...
it: Dettagli...
sr: Детаљи...
sr@latn: Detalji...

source: Total size:
ca: Mida total:
de: Gesamtgröße:
es: Tamaño total:
fr: Taille totale :
it: Dimensione totale:
sr: Укупна величина:
sr@latn: Ukupna veličina:

source: Titles in chapter mode are not supported
ca: No es permeten els títols en mode per capítols
de: Titel mit Kapitel-Modus werden nicht unterstützt
es: No están soportados los títulos en modo por capítulos
fr: Il n'y a pas de titres quand les chapitres sont séparés
it: I titoli in modalità capitolo non sono supportati
sr: Наслови нису подржани у режиму поглавља
sr@latn: Naslovi nisu podržani u režimu poglavlja

source: PSU core mode currently not supported
ca: El mode nucli PSU actualment no es permet
de: PSU Core Modus derzeit nicht unterstützt.
es: Núcleo PSU actualmente no soportado
fr: Le mode PSU Core n'est actuellement pas pris en charge
it: La modalità core PSU non è al momento supportata
sr: Режим PSU језгра тренутно није подржан
sr@latn: Režim PSU jezgra trenutno nije podržan

source: Cluster mode is only supported for ripped DVD's.
ca: El mode clúster només es permet per a DVD extrets.
de: Der Cluster Modus kann nur für DVDs verwendet werden, die auf die Festplatte kopiert wurden.
es: Modo cluster sólo está soportado para DVD extraídos.
fr: Le calcul en cluster n'est possible que pour des DVD extraits.
it: La modalità cluster è supportata solo per DVD estratti.
sr: Режим скупине је подржан само за ишчупане DVD-ове.
sr@latn: Režim skupine je podržan samo za iščupane DVD-ove.

source: MPEG processing is not supported for cluster mode.
ca: El processament de MPEG no està permès en mode clúster.
de: MPEG Generierung wird vom Cluster Modus nicht unterstützt.
es: Procesar MPEG no está soportado en modo cluster.
fr: La compression MPEG n'est pas prise en charge pour le calcul en cluster
it: L'elaborazione MPEG non è supportata per la modalità cluster.
sr: MPEG обрада није подржана за режим скупине.
sr@latn: MPEG obrada nije podržana za režim skupine.

source: Transcoding without audio in an OGG container isn't supported in cluster mode.
ca: La codificació sense àudio en un contenidor OGG no està permesa en mode clúster.
de: Das Tanskodieren von Titeln ohne Tonspur im OGG Container ist im Cluster nicht möglich.
es: Codificar sin audio en un contenedor OGG no está soportado en el modo cluster.

source: WARNING: your frame range setting is ignored in cluster mode
ca: ATENCIÓ: la configuració de rang de fotogrames s'ignora en mode clúster
de: WARNUNG: die Frame-Bereich Einstellung wird beim Cluster Modus ignoriert
es: ATENCIÓN: la configuración de rango de fotogramas se ignora en modo cluster
fr: ATTENTION : l'intervalle d'images est ignoré pour le calcul en cluster
it: ATTENZIONE: l'impostazione del tuo intervallo di fotogrammi è ignorata in modalità cluster
sr: УПОЗОРЕЊЕ: Ваше поставке опсега кадрова се игноришу у режиму скупине
sr@latn: UPOZORENJE: Vaše postavke opsega kadrova se ignorišu u režimu skupine

source: Choose DVD device file
ca: Escolliu el dispositiu de gravació
de: Wählen Sie eine DVD Gerätedatei
es: Elige el dispositivo de la grabadora
fr: Fichier périphérique du DVD
it: Scegli il file di device del DVD
sr: Избор ДВД уређаја
sr@latn: Izbor DVD uređaja

source: Press this button to open a file chooser dialog
ca: Premeu aquest botó per obrir un diàleg de selecció de fitxers
de: Klicken Sie diese Schaltfäche zum Öffnen eines Dateiauswahldialogs
es: Pulsa este botón para abrir un diálogo de selección de archivos
fr: Cliquez sur ce bouton pour faire votre choix
it: Premi questo pulsante per aprire una finestra di scelta dei file
sr: Притисните ово дугме да отворите прозор за избор датотеке
sr@latn: Pritisnite ovo dugme da otvorite prozor za izbor datoteke

source: Storage
ca: Emmagatzemament
de: Speicherung
es: Almacenamiento
fr: Stockage
it: Immagazzinamento
sr: Складиште
sr@latn: Skladište
