Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: dvd::rip - Manage multiple audio tracks
ca: dvd::rip - Gestiona múltiples pistes d'àudio
de: dvd::rip - Verwaltung mehrerer Tonspuren
es: dvd::rip - Gestionar múltiples pistas de audio
fr: dvd::rip - Gestion des pistes audio multiples
it: dvd::rip - Gestisci tracce audio multiple
sr: двд::рип - Управљање вишеструким аудио тракама
sr@latn: dvd::rip - Upravljanje višestrukim audio trakama

source: Manage multiple audio tracks
ca: Gestiona múltiples pistes d'àudio
de: Mehrere Tonspuren verwalten
es: Gestionar múltiples pistas de audio
fr: Gestion des pistes audio multiples
it: Gestisci tracce audio multiple
sr: Управљање вишеструким аудио тракама
sr@latn: Upravljanje višestrukim audio trakama

source: Source tracks
ca: Pistes d'origen
de: Quell Tonspuren
es: Pistas fuentes
fr: Pistes sources
it: Tracce sorgenti
sr: Изворне траке
sr@latn: Izvorne trake

source: Target tracks
ca: Pistes destinació
de: Ziel Tonspuren
es: Pistas destino
fr: Pistes cibles
it: Tracce destinazione
sr: Циљне траке
sr@latn: Ciljne trake

source: dvd::rip - Dependency check
ca: dvd::rip - Comprovació de dependències
de: dvd::rip - Abhängigkeitsprüfung
es: dvd::rip - Comprobar dependencias
fr: dvd::rip - Vérification des dépendances
it: dvd::rip - Controllo delle dipendenze
sr: двд::рип - Провера зависности
sr@latn: dvd::rip - Provera zavisnosti

source: Required tools
ca: Eines requerides
de: Benötigte Programme
es: Herramientas requeridas
fr: Outils nécessaires
it: Componenti richiesti
sr: Потребни алати
sr@latn: Potrebni alati

source: Text version
ca: Versió textual
es: Versión textual
fr: Version texte
it: Versione testuale
sr: Текстуално издање
sr@latn: Tekstualno izdanje

source: Text version, suitable for bug reports
ca: Versió textual, adient per a informes d'errors
de: Textversion, geeignet für Fehlerberichte
es: Versión textual, adecuada para informes de errores
fr: Version texte, utile pour les rapports de bogues
it: Versione testuale, utile per segnalare problemi
sr: Текстуално издање подесно за извештаје о грешкама
sr@latn: Tekstualno izdanje podesno za izveštaje o greškama

source: Ok
ca: Bé
es: Aceptar
sr: У реду
sr@latn: U redu

source: Comment
ca: Comentari
de: Kommentar
es: Comentario
fr: Commentaires
it: Commento
sr: Коментар
sr@latn: Komentar

source: Mandatory
ca: Obligatòria
de: Notwendig
es: Obligatoria
fr: Obligatoire
it: Obbligatorio
sr: Обавезно
sr@latn: Obavezno

source: Suggested
ca: Suggerida
de: Empfohlen
es: Sugerida
fr: Suggéré
it: Suggerito
sr: Препоручено
sr@latn: Preporučeno

source: Minimum
ca: Mínima
es: Mínima
it: Minimo
sr: Најмање
sr@latn: Najmanje

source: Maximum
ca: Màxima
es: Máxima
it: Massimo
sr: Највише
sr@latn: Najviše

source: Installed
ca: Instal·lada
de: Installiert
es: Instalada
fr: Installé
it: Installato
sr: Инсталирано
sr@latn: Instalirano

source: Ok
ca: Bé
es: Aceptar
sr: У реду
sr@latn: U redu

source: - Mandatory tools must be present with the minimum version listed. - Non mandatory tools may be missing or too old - features are disabled then. - Suggested numbers are the versions the author works with, so they are well tested.
ca: - Ha d'estar instal·lada la versió mínima indicada de les eines obligatòries. - Les eines no obligatòries poden mancar o ser massa antigues, però es desactivaran algunes característiques. - Les versions suggerides són les que utilitza l'autor, i per consegüent, estan ben provades.
de: - Benötigte Programme müssen in der Minimum Version installiert sein. - Empfohlene Programme dürfen fehlen oder zu alt sein - die dazugehörigen dvd::rip Funktionen werden dann automatisch abgeschaltet. - Die empfohlenen Versionsnummern sind die, mit denen der Autor arbeitet Diese sind also in der Regel gut getestet.
es: - Debe estar instalada la versión mínima indicada de las herramientas obligatorias. - Pueden faltar herramientas no obligatorias o ser demasiado viejas, en ese caso se desactivarán algunas características. - Las versiones sugeridas son las que usa el autor, por lo que están bien probadas.
fr: - les outils obligatoires doivent être présents dans la version minimale mentionnée. - les outils optionnels peuvent être absents ou obsolètes. Dans ce cas, certaines fonctions sont désactivées. Les versions suggérées sont utilisées par l'auteur et donc mieux testées.
it: - I componenti obbligatori devono essere installati e la versione deve essere almeno quella mostrata. - I componenti non obbligatori possono essere mancanti o troppo vecchi - le caratteristiche saranno allora disabilitate. - I numeri suggeriti sono le versioni con cui lavora l'autore e sono quindi ben testate.
sr: - Обавезни алати морају бити присутни минимум у верзији која је наведена. - Необавезни алати не морају бити присутни или могу бити престари - тада су неке опције искључене. - Препоручени бројеви су верзије са којима ради аутор, тако да су добро тестиране.
sr@latn: - Obavezni alati moraju biti prisutni minimum u verziji koja je navedena. - Neobavezni alati ne moraju biti prisutni ili mogu biti prestari - tada su neke opcije isključene. - Preporučeni brojevi su verzije sa kojima radi autor, tako da su dobro testirane.

source: Installed tools
ca: Eines instal·lades
de: Installierte Programme
es: Herramientas instaladas
fr: Outils installé
it: Programmi installati
sr: Присутни алати
sr@latn: Prisutni alati

source: This task needs about {needed} MB, {free} MB are free.
ca: Aquesta tasca requereix aproximadament {needed} MB, hi ha {free} MB lliures.
de: Diese Aufgabe benötigt {needed} MB, {free} MB sind noch frei.
es: Esta tarea necesita aproximadamente {needed} MB, hay {free} MB libres.
fr: Cette tâche nécessite environ {needed} Mo. Il reste {free} Mo.
it: Questo compito richiede circa {needed} MB, ci sono {free} MB liberi.
sr: За овај задатак је потребно око {needed} MB, {free} MB је слободно.
sr@latn: Za ovaj zadatak je potrebno oko {needed} MB, {free} MB je slobodno.

source: Warning: diskspace is low. This task needs about {needed} MB, but only {free} MB are available. Do you want to continue anyway?
ca: Atenció: hi ha poc espai lliure. Aquesta tasca requereix uns {needed} MB, però només hi ha {free} MB disponibles. Voleu continuar malgrat tot?
de: Warnung: der Speicherplatz wird knapp. Diese Aufgabe benötigt etwa {needed} MB, aber es sind nur noch {free} MB verfügbar. Soll trotzdem fortgesetzt werden?
es: Atención: hay poco espacio libre. Esta tarea necesita {needed} MB, pero sólo hay disponibles {free} MB. ¿Deseas continuar a pesar de todo?
fr: ATTENTION : il manque de l'espace disque. Cette tâche nécessite environ {needed} Mo, mais seulement {free} Mo sont disponibles. Désirez vous quand même continuer ?
it: Attenzione: lo spazio disponibile su disco è scarso. Questo compito richiede circa {needed} MB ma sono disponibili solo {free} MB. Vuoi continuare comunque?
sr: Упозорење: мало простора на диску. За овај задатак је потребно око {needed} MB, али је само {free} MB доступно. Да ли свеједно желите да наставите?
sr@latn: Upozorenje: malo prostora na disku. Za ovaj zadatak je potrebno oko {needed} MB, ali je samo {free} MB dostupno. Da li svejedno želite da nastavite?

source: dvd::rip - Storage and bitrate calculation details
ca: dvd::rip - Detalls del càlcul de l'ocupació i la taxa de bits
de: dvd::rip - Details zur Bitratenberechnung
es: dvd::rip - Detalles del cálculo del almacenamiento y tasa de bits
fr: dvd::rip - Détail des calculs de stockage et de débit
it: dvd::rip - Dettagli del calcolo dello spazio necessario e del bitrate
sr: двд::рип - Детаљи израчунавања простора и битског протока
sr@latn: dvd::rip - Detalji izračunavanja prostora i bitskog protoka

source: Description
ca: Descripció
de: Beschreibung
es: Descripción
it: Descrizione
sr: Опис
sr@latn: Opis

source: Operator
ca: Operador
es: Operador
fr: Opérateur
it: Operatore
sr: Оператор

source: Value
ca: Valor
de: Wert
es: Valor
fr: Valeur
it: Valore
sr: Вредност
sr@latn: Vrednost

source: Unit
ca: Unitat
de: Einheit
es: Unidad
fr: Unité
it: Unità
sr: Јединица
sr@latn: Jedinica

source: Status
ca: Estat
de: Zustand
es: Estado
fr: État
it: Stato
sr: Стање
sr@latn: Stanje

source: Show job plan and progress details
ca: Mostra detalls del pla de treball i progrés
de: Job-Plan und Fortschrittsdetails anzeigen
es: Mostrar detalles del plan de trabajo y progreso
fr: Afficher le plan des travaux et les détails sur l'avancement
it: Mostra l'elenco del lavoro ed i dettagli d'avanzamento
sr: Прикажи план послова и детаљан напредак
sr@latn: Prikaži plan poslova i detaljan napredak

source: Pause and resume processing
ca: Atura i reprèn el processament
de: Verarbeitung Pausieren und Fortsetzen
es: Pausar y continuar el proceso
fr: Pause et reprise du traitement
it: Pausa e riprendi l'elaborazione
sr: Паузирање и наставак обраде
sr@latn: Pauziranje i nastavak obrade

source: Cancel processing
ca: Cancel·la el processament
de: Verarbeitung abbrechen
es: Cancel el proceso
fr: Annuler le traitement
it: Annulla elaborazione
sr: Откажи обраду
sr@latn: Otkaži obradu

source: Free diskspace: {free} MB
ca: Espai lliure: {free} MB
de: Freier Festplattenspeicher: {free} MB
es: Espacio libre: {free} MB
fr: Espace disque libre : {free} Mo
it: Spazio libero su disco: {free} MB
sr: Слободан простор на диску: {free} MB
sr@latn: Slobodan prostor na disku: {free} MB

source: dvd::rip - Job plan and progress details
ca: dvd::rip - Detalls del pla de treball i progrés
de: dvd::rip - Job Plan und Fortschrittsanzeige
es: dvd::rip - Detalles del plan de trabajo y progreso
fr: dvd::rip - Détail du plan de travaux et de l'avancement
it: dvd::rip - Elenco lavori e dettagli di avanzamento
sr: двд::рип - План и напредак послова
sr@latn: dvd::rip - Plan i napredak poslova

source: Hide window
ca: Oculta finestra
de: Fenster verstecken
es: Ocultar ventana
fr: Fermer la fenêtre
it: Nascondi la finestra
sr: Сакриј прозор
sr@latn: Sakrij prozor

source: Hide details window
ca: Oculta finestra de detalls
de: Detail-Fenster ausblenden
es: Ocultar ventana de detalles
fr: Cacher la fenêtre de détail
it: Nascondi la finestra dei dettagli
sr: Сакриј прозор са детаљима
sr@latn: Sakrij prozor sa detaljima

source: Pause jobs
ca: Atura tasques
de: Jobs pausieren
es: Pausar trabajos
fr: Mettre les tâches en pause
it: Pausa lavori
sr: Паузирај послове
sr@latn: Pauziraj poslove

source: Resume
ca: Reprèn
de: Pausierung aufheben
es: Continuar
fr: Reprise
it: Riprendi
sr: Настави
sr@latn: Nastavi

source: Cancel jobs
ca: Cancel·la tasques
de: Jobs abbrechen
es: Cancelar trabajos
fr: Annuler les travaux
it: Annulla lavori
sr: Поништи послове
sr@latn: Poništi poslove

source: Cancel all running jobs
ca: Cancel·la totes les tasques que s'executen
de: Alle laufenden Jobs abbrechen
es: Cancelar todos los trabajos ejecutándose
fr: Annuler tous les travaux en cours
it: Annulla tutti i lavori in corso
sr: Откажи све текуће послове
sr@latn: Otkaži sve tekuće poslove

source: dvd::rip - Preferences
ca: dvd::rip - Preferències
de: dvd::rip - Voreinstellungen
es: dvd::rip - Preferencias
fr: dvd::rip - Préférences
it: dvd::rip - Preferenze
sr: двд::рип - Поставке
sr@latn: dvd::rip - Postavke

source: Global preferences
ca: Preferències globals
de: Globale Voreinstellungen
es: Preferencias globales
fr: Préferences générales
it: Preferenze globali
sr: Глобалне поставке
sr@latn: Globalne postavke

source: Create directory
ca: Crea directori
de: Anlegen
es: Crear directorio
it: crea directory
sr: Направи директоријум
sr@latn: Napravi direktorijum

source: Can't create directory: {dir}
ca: No es pot crear el directori: {dir}
de: Kann Verzeichnis nicht anlegen: {dir}
es: No puedo crear el directorio: {dir}
it: Non posso creare la directory: {dir}
sr: Није могуће направити директоријум: {dir}
sr@latn: Nije moguće napraviti direktorijum: {dir}

source: This is a list of connected DVD drives found in your system
ca: Aquesta és una llista d'unitats de DVD connectades que s'han trobat en el sistema
de: Dies ist eine Liste der DVD Geräte, die im System gefunden wurden
es: Esta es una lista de unidades de DVD conectadas encontradas en el sistema
fr: Voici une liste des lecteurs DVD connectés à votre système
it: Questa è una lista dei lettori DVD trovati sul tuo sistema
sr: Ово је списак ДВД уређаја повезаних на Ваш рачунар
sr@latn: Ovo je spisak DVD uređaja povezanih na Vaš računar

source: Check all settings
ca: Comprova-ho tot
de: Alle Einstellungen überprüfen
es: Comprobar todo
fr: Vérifier tout
it: Controlla tutte le impostazioni
sr: Провери сва подешавања
sr@latn: Proveri sva podešavanja

source: Cancel
ca: Cancel·la
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
sr: Поништи
sr@latn: Poništi

source: Check results
ca: Resultats de la comprovació
de: Prüfergebnisse
es: Resultados de la comprobación
fr: Résultat des tests
it: Controlla i risultati
sr: Провери резултате
sr@latn: Proveri rezultate

source: not tested : Ok
ca: no comprovat: Bé
de: nicht geprüft : Ok
es: no comprobado : Bien
fr: Non testé.
it: non testato: OK
sr: није тестирано : У реду
sr@latn: nije testirano : U redu

source: No fast resizing
ca: Sense redimensionat ràpid
de: Keine Schnellskalierung
es: Sin redimensionado rápido
fr: Pas de redimensionnement rapide
it: Nessun ridimensionamento veloce
sr: Без брзе промене величине
sr@latn: Bez brze promene veličine

source: Using clip2
ca: S'està usant el retall 2
de: anhand 2. Beschnitt
es: Usando recorte 2
fr: Utilisation du découpage 2
it: Usando clip2
sr: Користим исечак 2
sr@latn: Koristim isečak 2

source: Using zoom
ca: S'està usant el zoom
de: anhand Skalierung
es: Usando zoom
fr: Utilisation du zoom
it: Usando lo zoom
sr: Користим увеличање
sr@latn: Koristim uveličanje

source: Yes - use clip1
ca: Sí - usa el retall 1
de: Ja - anhand 1. Beschnitt
es: Sí - usar recorte 1
fr: Oui - utiliser le découpage 1
it: Si - usa clip1
sr: Да - користи исечак 1
sr@latn: Da - koristi isečak 1

source: Yes - use clip2
ca: Sí - usa el retall 2
de: Ja - anhand 2. Beschnitt
es: Sí - usar recorte 2
fr: Oui - utiliser le découpage 2
it: Si - usa clip2
sr: Да - користи исечак 2
sr@latn: Da - koristi isečak 2

source: No - take existent clip1
ca: No - pren el retall 1 existent
de: Nein - nehme 1. Beschnitt
es: No - tomar recorte 1 existente
fr: Non - prendre le découpage 1 existant
it: No - prendi il clip1 esistente
sr: Не - узми постојећи исечак 1
sr@latn: Ne - uzmi postojeći isečak 1

source: dvd::rip - Zoom Calculator
ca: dvd::rip - Calculadora de zoom
de: dvd::rip - Zoom Kalkulator
es: dvd::rip - Calculadora de Zoom
fr: dvd::rip - Calculatrice de Zoom
it: dvd::rip - Calcolatore dello zoom
sr: двд::рип - Прорачун увеличања
sr@latn: dvd::rip - Proračun uveličanja

source: Apply Clip & Zoom settings
ca: Aplica configuracions de retallat i zoom
de: Clip & Zoom Einstellungen anwenden
es: Aplicar configuraciones de Recorte y Zoom
fr: Appliquer les réglages de Découpe & Zoom
it: Applica le impostazioni di Clip & Zoom
sr: Примени поставке за опсецање и увећање
sr@latn: Primeni postavke za opsecanje i uvećanje

source: Parameters
ca: Paràmetres
de: Parameter
es: Parámetros
fr: Paramètres
it: Parametri
sr: Параметри
sr@latn: Parametri

source: Fast resize align
ca: Alineació de redimensionat ràpida
de: Schnellskalierung Größe
es: Alineación de redimensionado rápido
fr: Alignement rapide du redimensionnement
it: Allineamento di ridimensionamento veloce
sr: Поравнање за брзо мењање величине
sr@latn: Poravnanje za brzo menjanje veličine

source: Result frame align
ca: Alineació de fotograma resultant
de: Größe Zielbild teilbar durch
es: Alineación de fotograma final
fr: Alignement de l'image résultante
it: Allinea sul fotogramma risultante
sr: Поравнање резултујућих кадрова
sr@latn: Poravnanje rezultujućih kadrova

source: Achieve result align
ca: Obté alineació resultant
de: Zielbildgröße erreichen
es: Lograr alineación resultante
fr: Obtenir l'alignement du résultat
it: Allinea sul risultato ottenuto
sr: Постигни резултујуће поравнање
sr@latn: Postigni rezultujuće poravnanje

source: Auto clipping
ca: Auto retall
de: Autom. Beschnitt
es: Auto recorte
fr: Découpe automatique
sr: Аутоматско сечење
sr@latn: Automatsko sečenje

source: V-Rate:
ca: Taxa bits v.:
es: Tasa-V:
fr: Rafraîchiss.-Vertical :
sr: V-однос:
sr@latn: V-odnos:

source: Total size:
ca: Mida total:
de: Gesamtgröße:
es: Tamaño total:
fr: Taille totale :
it: Dimensione totale:
sr: Укупна величина:
sr@latn: Ukupna veličina:

source: Zoom calculations
ca: Càlcul de zoom
de: Zoom Berechnungen
es: Cálculos de Zoom
fr: Calculs du zoom
it: Calcoli dello zoom
sr: Прорачуни увеличања
sr@latn: Proračuni uveličanja

source: Result size
ca: Mida final
de: Endgröße
es: Tamaño final
fr: Taille résultante
it: Dimensione risultante
sr: Коначна величина
sr@latn: Konačna veličina

source: Eff. AR
ca: RA Ef.
es: RA Ef.
sr: Еф. AR
sr@latn: Ef. AR

source: AR error
ca: Error RA
de: AR Fehler
es: Error RA
fr: Erreur AR
it: Errore AR
sr: AR грешка
sr@latn: AR greška

source: Clip1 (t/b/l/r)
ca: Retall 1 (am/av/es/dr)
de: Clip1 (o/u/l/r)
es: Recorte1 (ar/ab/i/d)
fr: Découpe1 (h/b/g/d)
it: Clip1 (c/f/s/d)
sr: Опсецање1 (в/д/л/д)
sr@latn: Opsecanje1 (v/d/l/d)

source: Zoom size
ca: Mida del zoom
de: Zoom Größe
es: Tamaño de zoom
fr: Taille du zoom
it: Dimensione zoom
sr: Величина увећања
sr@latn: Veličina uvećanja

source: Clip2 (t/b/l/r)
ca: Retall 2 (am/av/es/dr)
de: Clip2 (o/u/l/r)
es: Recorte2 (ar/ab/i/d)
fr: Découpe2 (h/b/g/d)
it: Clip2 (c/f/s/d)
sr: Опсецање2 (в/д/л/д)
sr@latn: Opsecanje2 (v/d/l/d)

source: Overwrite existing file '{filename}'?
ca: Voleu sobreescriure el fitxer '{filename}'?
de: Datei {filename} überschreiben?
es: ¿Sobreescribir el archivo '{filename}'?
fr: Écraser le fichier '{filename}' ?
it: Sovrascrivo il file esistente '{filename}'?
sr: Да пребришем постојећи фајл „{filename}“?
sr@latn: Da prebrišem postojeći fajl „{filename}“?

source: Error message
ca: Missatge d'error
de: Fehlermeldung
es: Mensaje de error
fr: Message d'erreur
it: Messaggio d'errore
sr: Порука о грешци
sr@latn: Poruka o grešci

source: dvd::rip - Message
ca: dvd::rip - Missatge
de: dvd::rip - Nachricht
es: dvd::rip - Mensaje
it: dvd::rip - Messaggio
sr: двд::рип - Порука
sr@latn: dvd::rip - Poruka

source: An internal exception was thrown! The error message was: {msg}
ca: S'ha enviat una excepció interna. El missatge d'error era: {msg}
de: Ein interner Fehler ist aufgetreten! The Fehlermeldung war: {msg}
es: ¡Se ha lanzado una excepción interna! El mensaje de error fue: {msg}
fr: Une erreur interne s'est produite ! Le message était : {msg}
it: E` stata lanciata un'eccezione interna! Il messaggio d'errore è: {msg}
sr: Бачен је интерни изузетак! Порука о грешци је: {msg}
sr@latn: Bačen je interni izuzetak! Poruka o grešci je: {msg}

source: Detected transcode version: {version}
ca: Versió del transcode detectada: {version}
de: Erkannte transcode Version: {version}
es: Versión de transcode detectada: {version}
fr: Version de transcode détectée : {version}
it: Versione di transcode rilevata: {version}
sr: Пронађена верзија transcode-а: {version}
sr@latn: Pronađena verzija transcode-a: {version}

source: Opening project file failed. Aborting.
ca: No s'ha pogut obrir el fitxer de projecte. S'està cancel·lant.
de: Die Projekt Datei konnte nicht geöffnet werden. Abbruch.
es: No se pudo abrir el archivo de proyecto. Abortando.
fr: Abandon suite à l'échec d'ouverture du fichier projet.
it: L'apertura del file progetto è fallita. Annullo.
sr: Отварање датотеке пројекта није успело. Крај.
sr@latn: Otvaranje datoteke projekta nije uspelo. Kraj.

source: _New Project
ca: Projecte _nou
de: _Neues Projekt
es: _Nuevo proyecto
fr: _Nouveau projet
it: _Nuovo Progetto
sr: _Нови пројекат
sr@latn: _Novi projekat

source: _Open Project...
ca: _Obre projecte
de: Pr_ojekt Öffnen...
es: _Abrir proyecto
fr: _Ouvrir un projet...
it: _Apri Progetto...
sr: _Отвори пројекат...
sr@latn: _Otvori projekat...

source: _Save Project
ca: De_sa projecte
de: _Projekt speichern
es: _Guardar proyecto
fr: _Enregistrer le projet
it: _Salva Progetto
sr: _Сачувај пројекат
sr@latn: _Sačuvaj projekat

source: Save _Project as...
ca: Des_a projecte com...
de: Projekt speichern unter...
es: Guardar _proyecto como...
fr: Enregistrer le projet sous...
it: Salva _Progetto come...
sr: Сачувај пројекат _као...
sr@latn: Sačuvaj projekat _kao...

source: _Close Project
ca: _Tanca projecte
de: Projekt s_chließen
es: _Cerrar proyecto
fr: _Fermer le projet
it: _Chiudi Progetto
sr: _Затвори пројекат
sr@latn: _Zatvori projekat

source: _Exit
ca: _Surt
de: B_eenden
es: _Salir
fr: _Quitter
it: _Esci
sr: _Крај
sr@latn: _Kraj

source: _Edit
ca: _Edita
de: _Bearbeiten
es: _Editar
fr: _Édition
it: _Modifica
sr: _Уреди
sr@latn: _Uredi

source: Edit _Preferences...
ca: _Preferències
de: _Voreinstellungen...
es: Editar _preferencias
fr: _Préférences...
it: Modifica _Preferenze...
sr: Уреди _поставке...
sr@latn: Uredi _postavke...

source: _Title
ca: _Títol
de: _Titel
es: _Título
fr: _Titre
it: _Titolo
sr: _Наслов
sr@latn: _Naslov

source: View target file
ca: Visualitza el fitxer codificat
de: Zieldatei an_sehen
es: Ver el archivo codificado
fr: Visionner le fichier encodé
it: Visualizza il file risultante
sr: Прикажи циљну датотеку
sr@latn: Prikaži ciljnu datoteku

source: Add project to cluster
ca: Afegeix projecte a clúster
de: Projekt an _Cluster übergeben
es: Añadir proyecto a un cluster
fr: Ajouter le projet au cluster
it: Aggiungi progetto al cluster
sr: Додај пројекат у рој
sr@latn: Dodaj projekat u roj

source: Create vobsub
ca: Crea fitxer vobsub
de: vobsub Datei erstellen
es: Crear archivo vobsub
fr: Créer un fichier de sous-titres vobsub
it: Crea file vobsub
sr: Направи vobsub
sr@latn: Napravi vobsub

source: Create dvdrip-info file
ca: Crea fitxer dvdrip-info
de: dvdrip-_info Datei erzeugen
es: Crear el archivo dvdrip-info
fr: Créer un fichier dvdrip-info
it: Crea file di informazioni dvdrip-info
sr: Направи датотеку dvdrip-info
sr@latn: Napravi datoteku dvdrip-info

source: Create WAV from selected audio track
ca: Crea WAV de la pista d'àudio seleccionada
de: _WAV Datei der aktuellen Tonspur erzeugen
es: Crear WAV de la pista de audio seleccionada
fr: Créer un fichier WAV depuis la piste audio choisie
it: Crea file WAV dalla traccia audio selezionata
sr: Направи WAV од изабране траке
sr@latn: Napravi WAV od izabrane trake

source: _Cluster
ca: _Clúster
sr: _Рој
sr@latn: _Roj

source: _Debug
ca: _Depuració
de: _Fehlersuche
es: _Depuración
fr: _Déboguer
sr: _Исправка грешака
sr@latn: _Ispravka grešaka

source: Show _Transcode commands...
ca: Mostra ordres del _transcode...
de: _transcode Befehle zeigen...
es: Mostrar comandos de _transcode...
fr: Afficher les commandes _Transcode...
it: Mostra i comandi di _Transcode...
sr: Прика_жи Transcode наредбе...
sr@latn: Prika_ži Transcode naredbe...

source: Check _dependencies...
ca: _Comprova dependències...
de: Prüfe _installierte Pakete...
es: Comprobar _dependencias...
fr: Vérifier les _Dépendances...
it: Controlla _dipendenze...
sr: Провери за_висности...
sr@latn: Proveri za_visnosti...

source: _Help
ca: Aj_uda
de: _Hilfe
es: A_yuda
fr: _Aide
it: _Aiuto
sr: _Помоћ
sr@latn: _Pomoć

source: _About dvd::rip
ca: _Pel que fa al dvd::rip
de: _Über dvd::rip
es: _Acerca de dvd::rip
fr: À _propos de dvd::rip
it: _Informazioni su dvd::rip
sr: _О програму двд::рип
sr@latn: _O programu dvd::rip

source: Selected DVD title
ca: Títol de DVD seleccionat
de: Gewählter DVD Titel
es: Título de DVD seleccionado
fr: Titre DVD selectionné
it: Titolo selezionato del DVD
sr: Изабрани DVD наслов
sr@latn: Izabrani DVD naslov
