Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: If you re-read the TOC, all settings in this project get lost. Probably you want to save the project to another file before you proceeed. Do you want to re-read the TOC now?
ca: Si torneu a llegir la taula de contingut, se perdran totes les configuracions del projecte. Probablement voldreu desar el projecte a un altre fitxer abans de continuar. Desitgeu tornar a llegir ara la taula de contingut?
de: Wenn das Inhaltsverzeichnis erneut eingelesen wird, gehen alle Einstellungen dieses Projektes verloren. Vielleicht möchten Sie dieses Projekt zunächst in eine andere Datei speichern, bevor Sie fortfahren. Soll das Inhaltsverzeichnis jetzt eingelesen werden?
es: Si vuelves a leer la tabla de contenidos, se perderán todas las configuraciones del proyecto. Probablemente quieras salvar el proyecto a otro archivo antes de proceder. ¿Deseas volver a leer la tabla de contenidos ahora?
fr: Si vous relisez la table des matières du DVD tous les paramètres du projet seront perdus. Vous devriez peut-être enregistrer ce projet dans un autre fichier avant de continuer. Voulez-vous relire la table des matières maintenant ?
it: Tutte le impostazioni in questo progetto saranno perse se rileggi la TOC. Probabilmente vuoi salvare il progetto su un altro file prima di procedere. Vuoi rileggere la TOC adesso?
sr: Ако опет прочитате TOC, све поставке у овом пријекту се губе. Вероватно желите да снимите пројекат под другим именом пре него што наставите. Да ли сада желите поново да прочитате TOC?
sr@latn: Ako opet pročitate TOC, sve postavke u ovom prijektu se gube. Verovatno želite da snimite projekat pod drugim imenom pre nego što nastavite. Da li sada želite ponovo da pročitate TOC?

source: Please select a title.
ca: Seleccioneu un títol.
de: Bitte wählen Sie einen Titel aus.
es: Por favor, selecciona un título.
fr: Veuillez sélectionner un titre
it: Per favore, seleziona un titolo.
sr: Молим Вас изаберите наслов.
sr@latn: Molim Vas izaberite naslov.

source: No subtitles activated.
ca: Sense subtítols activats.
de: Keine Untertitel aktiviert.
es: Sin subtítulos activados.
fr: Aucun sous-titre activé
it: Nessun sottotitolo è stato attivato.
sr: Нису активирани титлови.
sr@latn: Nisu aktivirani titlovi.

source: DVD title #{nr}
ca: Títol #{nr}
de: DVD Titel #{nr}
es: Título #{nr}
fr: titre n°{nr} du DVD
it: Titolo DVD #{nr}
sr: DVD наслов #{nr}
sr@latn: DVD naslov #{nr}

source: Show
ca: Mostra
de: Anzeigen
es: Mostrar
fr: Afficher
it: Mostra
sr: Приказ
sr@latn: Prikaz

source: Conformance check:
ca: Prova de conformitat:
de: Konformitätstest:
es: Prueba de conformidad:
fr: Test de conformité
it: Controllo di conformità:
sr: Провера сагласности:
sr@latn: Provera saglasnosti:

source: dvd::rip - Filters & Preview
ca: dvd::rip - Filtres i Vista prèvia
de: dvd::rip - Fiter & Vorschau
es: dvd::rip - Filtros & Previsualización
fr: dvd::rip - Filtres & Aperçu
it: dvd::rip - Filtri & Anteprima
sr: двд::рип - Филтери и преглед
sr@latn: dvd::rip - Filteri i pregled

source: Available filters
ca: Filtres disponibles
de: Verfügbare Filter
es: Filtros disponibles
fr: Filtres disponibles
it: Filtri disponibili
sr: Доступни филтери
sr@latn: Dostupni filteri

source: Double click a row to activate a filter. Greyed out filters are not available anymore, because they are activated already.
ca: Una pulsació doble en una fila activa un filtre. Els filtres de gris ja no estan disponibles, perquè ja estan activats.
de: Per Doppelklick wird ein Filter aktiviert. Ausgegraute Filter stehen nicht mehr zur Verfügung, weil sie bereits aktiviert wurden.
es: Una doble pulsación en una fila activa un filtro. Filtros en gris ya no están disponibles, porque ya están activados.
fr: Double-cliquez sur une ligne pour activer un filtre. Les filtres grisés ne sont plus disponibles, car ils sont déjà actifs.
it: Doppio click su una riga per attivare un filtro. I filtri in grigio non sono più disponibili, perche sono già stati attivati.
sr: Двоструки притисак активира филтер. Засивљени филтери нису више доступни јер су већ активирани.
sr@latn: Dvostruki pritisak aktivira filter. Zasivljeni filteri nisu više dostupni jer su već aktivirani.

source: Used filters
ca: Filtres usats
de: Benutzte Filter
es: Filtros usados
fr: Filtres utilisés
it: Filtri utilizzati
sr: Коришћени филтери
sr@latn: Korišćeni filteri

source: Double click a row to remove a filter, reorder by drag and drop
ca: Una doble pulsació elimina un filtre, es reordena arrossegant i deixant anar.
de: Doppelklick entfernt einen Filter, Reihenfolge ändern mit Drag'n Drop.
es: Una doble pulsación elimina un filtro, se reordena arrastrando y soltando.
fr: Double-cliquez pour enlever un filtre. Changez l'ordre en les faisant glisser
it: Fai un doppio click su una riga per rimuovere un filtro, cambiane l'ordine usando il drag 'n drop.
sr: Дупли притисак на ред да уклоните филтер, преуређивање вучењем и пуштањем
sr@latn: Dupli pritisak na red da uklonite filter, preuređivanje vučenjem i puštanjem

source: You can't change the filter order while the preview window is open.
ca: No podeu canviar l'ordre dels filtres mentre la finestra de vista prèvia és oberta.
de: Die Filterreihenfolge kann nicht verändert werden, solange das Vorschaufenster geöffnet ist.
es: No puedes cambiar el orden de los filtros mientras la ventana de previsualización está abierta.
fr: Vous ne pouvez pas changer l'ordre des filtres pendant que la fenêtre d'aperçu est ouverte.
it: Non puoi cambiare l'ordine dei filtri mentre la finestra d'anteprima è aperta.
sr: Можете мењати редослед филтера док је прозор за преглед отворен.
sr@latn: Možete menjati redosled filtera dok je prozor za pregled otvoren.

source: Filter information
ca: Informació de filtre
es: Información de filtro
fr: Informations de filtre
it: Informazioni sul filtro
sr: Подаци о филтеру
sr@latn: Podaci o filteru

source: Filter name
ca: Nom del filtre
es: Nombre de filtro
fr: Nom du filtre
it: Nome del filtro
sr: Име филтера
sr@latn: Ime filtera

source: Author(s)
ca: Autor(s)
de: Autor(en)
es: Autor(es)
fr: Auteur(s)
it: Autore(i)
sr: Аутори
sr@latn: Autori

source: A/V type
ca: Tipus A/V
de: A/V Typ
es: Tipo A/V
fr: type A/V
it: Tipo A/V
sr: Врста A/V
sr@latn: Vrsta A/V

source: Colorspace
ca: Espai de color
de: Farbraum
es: Espacio de color
fr: Espace de couleurs
sr: Простор боја
sr@latn: Prostor boja

source: Multiple
ca: Múltiple
de: Mehrfachverwendung
it: Multipli
sr: Вишеструки
sr@latn: Višestruki

source: Filter settings
ca: Configuracions de filtre
de: Filter Einstellungen
es: Configuraciones de filtro
fr: Réglages du filtre
it: Impostazioni del filtro
sr: Подешавања филтера
sr@latn: Podešavanja filtera

source: Preview settings
ca: Configuracions de vista prèvia
de: Vorschau Einstellungen
es: Configuraciones de previsualización
fr: Réglages d'aperçu
it: Impostazioni anteprima
sr: Поставке прегледа
sr@latn: Postavke pregleda

source: Frames buffered in the preview window and thus are available for scrubbing
ca: Fotogrames emmagatzemats en la finestra de vista prèvia, i per consegüent, que estan disponibles per a la navegació
de: Gepufferte Bilder im Vorschaufenster die zum Vor- und Zurückspulen angezeigt werden können
es: Fotogramas almacenados en la ventana de previsualización y por lo tanto están disponibles para navegación
fr: Trames stockées dans la fenêtre d'aperçu et donc visualisables directement
it: Numero di fotogrammi memorizzati nella finestra di anteprima, disponibili per l'analisi
sr: Кадрови запамћени у прозору за преглед, који су доступни за чишћење
sr@latn: Kadrovi zapamćeni u prozoru za pregled, koji su dostupni za čišćenje

source: Preview should start at this frame
ca: La vista prèvia hauria de començar en aquest fotograma
de: Die Vorschau soll bei dieser Framenummer starten
es: La previsualización debería empezar en este fotograma
fr: L'aperçu doit commencer à cette trame
it: L'anteprima dovrebbe iniziare da questo fotogramma
sr: Преглед треба да почне од овог кадра
sr@latn: Pregled treba da počne od ovog kadra

source: Preview should start stop this frame
ca: La vista prèvia hauria d'acabar en aquest fotograma
de: Die Vorschau soll bei dieser Bild-Nummer stoppen
es: La previsualización debería terminar en este fotograma
fr: L'aperçu doit finir à cette trame
it: L'anteprima dovrebbe terminare a questo fotogramma
sr: Преглед треба да стане код овог кадра
sr@latn: Pregled treba da stane kod ovog kadra

source: Preview control
ca: Control de previsualització
de: Vorschau Kontrolle
es: Control de previsualización
fr: Contrôle de l'aperçu
it: Controllo anteprima
sr: Контрола прегледа
sr@latn: Kontrola pregleda

source: Open preview window and play
ca: Obre finestra de vista prèvia i reprodueix
de: Vorschaufenster öffnen und abspielen
es: Abrir ventana de previsualización y reproducir
fr: Ouvrir la fenêtre d'aperçu et lire
it: Apri finestra d'anteprima e riproduci
sr: Отвори прозор за преглед и пусти
sr@latn: Otvori prozor za pregled i pusti

source: Apply filter chain
ca: Aplica cadena de filtres
de: Filter Einstellungen anwenden
es: Aplicar cadena de filtros
fr: Appliquer l'enchainement des filtres
it: Applica la catena dei filtri
sr: Примени филтерски ланац
sr@latn: Primeni filterski lanac

source: Decrease preview speed
ca: Redueix la velocitat de previsualització
de: Anzeigegeschwindigkeit reduzieren
es: Reducir la velocidad de previsualización
fr: Diminuer la vitesse d'aperçu
it: Diminuisci la velocità dell'anteprima
sr: Смањи брзину прегледа
sr@latn: Smanji brzinu pregleda

source: Increase preview speed
ca: Augmentar la velocitat de previsualització
de: Anzeigegeschwindigkeit erhöhen
es: Incrementar la velocidad de previsualización
fr: Augmenter la vitesse d'aperçu
it: Aumenta la velocità dell'anteprima
sr: Повећај брзину прегледа
sr@latn: Povećaj brzinu pregleda

source: Pause/Resume
ca: Atura/Reprèn
de: Pause / Start
es: Pausa/Continuar
fr: Pause / Reprise
it: Pausa/Riprendi
sr: Паузирај/Настави
sr@latn: Pauziraj/Nastavi

source: Step backward one frame
ca: Retrocedeix un fotograma
de: Ein Bild zurück
es: Retroceder un fotograma
fr: Retour arrière d'une image
it: Indietro di un solo fotogramma
sr: Корак назад за један кадар
sr@latn: Korak nazad za jedan kadar

source: Step forward one frame
ca: Avança un fotograma
de: Ein Bild vorwärts
es: Avanzar un fotograma
fr: Avance d'une image
it: Avanza di un solo fotogramma
sr: Корак напред за један кадар
sr@latn: Korak napred za jedan kadar

source: Step backward several frames
ca: Retrocedeix diversos fotog.
de: Einige Bilder zurück
es: Retroceder varios fotogramas
fr: Retour arrière de plusieurs images
it: Indietro di alcuni fotogrammi
sr: Корак назад за неколико кадрова
sr@latn: Korak nazad za nekoliko kadrova

source: Step forward several frames
ca: Avança diversos fotogrames
de: Einige Bilder vorwärts
es: Avanzar varios fotogramas
fr: Avance de plusieurs images
it: Avanza di alcuni fotogrammi
sr: Корак напред за неколико кадрова
sr@latn: Korak napred za nekoliko kadrova

source: Stop playing and close preview window
ca: Atura la reproducció i tanca la finestra
de: Abspielen beenden und Vorschaufenster schließen
es: Parar la reproducción y cerrar la ventana
fr: Arrête la lecture et ferme la fenêtre d'aperçu
it: Ferma la riproduzione e chiudi la finestra d'anteprima
sr: Заустави и затвори прозор за преглед
sr@latn: Zaustavi i zatvori prozor za pregled

source: Enable
ca: Activa
de: Einschalten
es: Activar
fr: Activer
it: Abilita
sr: Укључи
sr@latn: Uključi

source: Disable
ca: Desactiva
de: Abschalten
es: Desactivar
fr: Désactiver
it: Disabilita
sr: Искључи
sr@latn: Isključi

source: Enable or disable filter temporarily
ca: Activa o desactiva el filtre temporalment
de: Filter vorrübergehend an- bzw. abschalten
es: Activar o desactivar el filtro temporalmente
fr: Activer/Désactiver le filtre temporairement
it: Abilita o disabilita temporaneamente il filtro
sr: Укључи или искључи филтер привремено
sr@latn: Uključi ili isključi filter privremeno

source: Illegal title number {nr}
ca: El número de títol {nr} no és vàlid
de: Ungültige Titelnummer {nr}
es: Número de título {nr} no válido
fr: Numéro de titre {nr} non valide
it: Numero del titolo non valido {nr}
sr: Неисправан број наслова: {nr}
sr@latn: Neispravan broj naslova: {nr}

source: No deinterlacing
ca: No desentrellacis
de: Kein Deinterlacing
es: No desentrelazar
fr: Aucun désentrelacement
it: Non deinterlacciare
sr: Без расплитања
sr@latn: Bez rasplitanja

source: Interpolate scanlines (fast)
ca: Interpola línies (ràpid)
de: Scan-Zeilen interpolieren (schnell)
es: Interpolar líneas (rápido)
fr: Interpoler les lignes (rapide)
it: Interpola le scanline (veloce)
sr: Уметни скенлиније (брзо)
sr@latn: Umetni skenlinije (brzo)

source: Handled by encoder (may segfault)
ca: Gestionat pel codificador (pot fallar)
de: Durch Encoder (kann abstürzen)
es: Gestionado por el codificador (puede fallar)
fr: Traité par l'encodeur (peut planter)
it: Gestito dall'encoder (potrebbe generare segfault)
sr: Од стране кодера (може доћи до грешке)
sr@latn: Od strane kodera (može doći do greške)

source: Zoom to full frame (slow)
ca: Zoom del fotograma sencer (lent)
de: Auf Vollbild zoomen (langsam)
es: Zoom del fotograma completo (lento)
fr: Zoom to full frame (lent mais meilleur)
it: Ingrandisci a schermo pieno (lento)
sr: Увеличај до пуног кадра (споро)
sr@latn: Uveličaj do punog kadra (sporo)

source: Interpolate scanlines / blend frames (pp=lb)
ca: Interpola línies / barreja fotogrames (pp=lb)
de: Scan-Zeilen interpolieren / Überblenden (pp=lb)
es: Interpolar líneas / mezclar fotogramas (pp=lb)
fr: Interpoler les lignes / fusionner les images (pp=lb)
it: Interpola le scanline / mischia i fotogrammi (pp=lb)
sr: Уметни скенлиније / стопи кадрове (pp=lb)
sr@latn: Umetni skenlinije / stopi kadrove (pp=lb)

source: Automatic deinterlacing of single frames
ca: Desentrellaçat automàtic de fotogrames individuals
de: Automatisches Deinterlacen von einzelnen Frames
es: Desentrelazado automático de fotogramas individuales
fr: Désentrelacement automatique de chaque image
it: Deinterlacciamento automatico dei singoli fotogrammi
sr: Аутоматскo расплитање појединачних кадрова
sr@latn: Automatsko rasplitanje pojedinačnih kadrova

source: Smart deinterlacing
ca: Desentrellaçat intel·ligent
de: Smart Deinterlacer (empfohlen)
es: Desentrelazado inteligente
fr: Désentrelacement intelligent
it: Deinterlacciamento intelligente
sr: Паметно расплитање
sr@latn: Pametno rasplitanje

source: Inverse telecine
ca: Telecine invers
es: Telecine inverso
fr: Inverser le Téléciné (retour à 24 images/s)
it: Telecine inverso
sr: Инверзно telecine
sr@latn: Inverzno telecine

source: No antialiasing
ca: Sense suavitzat de vores
de: Kein Antialiasing
es: Sin suavizado de bordes
fr: Pas d'antialiasing
it: Nessun antialias
sr: Без умекшавања
sr@latn: Bez umekšavanja

source: Process de-interlace effects
ca: Processa efectes de desentrellaçat
de: Verarbeite Deinterlace Artefakte
es: Procesar efectos de desentrelazado
fr: Traiter le désentrelacement
it: Processa gli effetti di deinterlacciamento
sr: Обради ефекте отплитања
sr@latn: Obradi efekte otplitanja

source: Process resize effects
ca: Processa efectes de redimensionat
de: Skalierungseffekte bearbeiten
es: Procesar efectos de redimensionado
fr: Traiter le redimensionnement
it: Processa gli effetti di ridimensionamento
sr: Обради ефекте мењања величине
sr@latn: Obradi efekte menjanja veličine

source: Process full frame (slow)
ca: Processa fotogrames sencers (lent)
de: Verarbeite Vollbild (langsam)
es: Procesar fotogramas enteros (lento)
fr: Traiter toute l'image (lent)
it: Elabora tutto il fotogramma (lento)
sr: Обради пун кадар (споро)
sr@latn: Obradi pun kadar (sporo)

source: None, volume rescale only
ca: Cap, només reescala el volum
de: Keine, nur Lautstärkenmaximierung
es: Ninguno, sólo reescalar el volumen
fr: Aucun, modifier le volume seulement
it: Niente, riscala solo il volume
sr: Ниједан, само поново скалирај
sr@latn: Nijedan, samo ponovo skaliraj

source: Range compression (liba52 filter)
ca: Compressió de rang (filtre de liba52)
de: Komprimierung (liba52 Filter)
es: Compresión de rango (filtro de liba52)
fr: Compression (filtre liba52)
it: Intervallo di compressione (filtro liba52)
sr: Компресија опсега (liba52 филтер)
sr@latn: Kompresija opsega (liba52 filter)

source: Normalizing (mplayer filter)
ca: Normalitza (filtre de mplayer)
de: Normalisierung (mplayer Filter)
es: Normalizar (filtro de mplayer)
fr: Normalisation (filtre mplayer)
it: Normalizzazione (filtro di MPlayer)
sr: Нормализирање (mplayer филтер)
sr@latn: Normaliziranje (mplayer filter)

source: Executing command: {command}
ca: S'està executant l'ordre: {command}
de: Befehlsausführung: {command}
es: Ejecutando comando: {command}
fr: Lancement de la commande : {command}
it: Eseguo il comando: {command}
sr: Извршавање наредбе: {command}
sr@latn: Izvršavanje naredbe: {command}

source: Sending signal 9 to PID(s)
ca: S'està enviant el senyal 9 a PID(s)
de: Sende Signal 9 an Prozess ID(s)
es: Enviando señal 9 a PID(s)
fr: Envoi du signal 9 vers les processus
it: Invio il segnale 9 al(i) processo(i)
sr: Слање сигнала 9 процесима:
sr@latn: Slanje signala 9 procesima:

source: Cancelled
ca: S'ha cancel·lat
de: Abgebrochen
es: Cancelado
fr: Annulé
it: Annullato
sr: Отказано
sr@latn: Otkazano

source: Skipped
ca: S'ha saltat
de: Übersprungen
es: Saltado
fr: Sauté
it: Saltato
sr: Прескочено
sr@latn: Preskočeno

source: Waiting
ca: S'està esperant
de: Warten
es: Esperando
fr: Attente
it: In attesa
sr: Чекање
sr@latn: Čekanje

source: Duration: {time}
ca: Durada: {time}
de: Dauer: {time}
es: Duración: {time}
fr: Durée : {time}
it: Durata: {time}
sr: Трајање: {time}
sr@latn: Trajanje: {time}

source: Initializing
ca: S'està inicialitzant
de: Initialisierung
es: Inicializando
fr: Initialisation
it: Inizializzazione
sr: Започињем
sr@latn: Započinjem

source: elapsed {time}
ca: transcorregut: {time}
de: vergangen {time}
es: transcurrido {time}
fr: {time} écoulé
it: {time} trascorso
sr: протекло {time}
sr@latn: proteklo {time}

source: finished
ca: fet
de: fertig
es: terminado
fr: fini
it: terminato
sr: готово
sr@latn: gotovo

source: {percent}PERCENT done.
ca: {percent}PERCENT fet.
de: {percent}PERCENT erledigt.
es: {percent}PERCENT hecho.
fr: {percent}% effectué.
it: {percent}PERCENT fatto.
sr: {percent} %% готово.
sr@latn: {percent} %% gotovo.

source: _Node
de: _Knoten
es: _Nodo
fr: _Noeud
it: _Nodo
sr: _Чвор
sr@latn: _Čvor

source: Colors
de: Farben
es: Colores
fr: Couleurs
it: Colori
sr: Боје
sr@latn: Boje

source: Angle {angle}
de: Winkel {angle}
es: Ángulo {angle}
it: Angolo {angle}
sr: Угао {angle}
sr@latn: Ugao {angle}

source: No
de: Nein
fr: Non
sr: Не
sr@latn: Ne

source: fps
fr: tps
sr: сл./s
sr@latn: sl./s

source: SVCD 16:9 -> 4:3 letterbox, PAL
de: SVCD 16:9 nach 4:3 Letterbox, PAL
fr: SVCD 16:9 -> 4:3 à bandes noires, PAL
sr: SVCD 16:9 -> 4:3 сандуче, PAL
sr@latn: SVCD 16:9 -> 4:3 sanduče, PAL

source: SVCD 16:9 -> 4:3 letterbox, NTSC
de: SVCD 16:9 nach 4:3 Letterbox, NTSC
fr: SVCD 16:9 -> 4:3 à bandes noires, NTSC
sr: SVCD 16:9 -> 4:3 сандуче, NTSC
sr@latn: SVCD 16:9 -> 4:3 sanduče, NTSC

source: Contro_l...
de: Kontro_llfenster...
fr: Panneau de contrô_le...
it: Contro_llo...
sr: _Управљање...
sr@latn: _Upravljanje...

source: Multi...
it: Multiple...
sr: Мулти...

source: Zoom
de: Skalierung
sr: Увеличај
sr@latn: Uveličaj

source: PRE/POST
sr: ПРЕ/ПОСТ

source: Error
de: Fehler
fr: Erreur
it: Errore
sr: Грешка
sr@latn: Greška

source: MB
fr: Mo

source: kbit/s
fr: kb/s
