Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: ERROR: '{file}' not found in PATH
ca: ERROR: '{file}' no s'ha trobat en PATH
de: FEHLER: '{file}' wurde im PATH Suchpfad nicht gefunden
es: ERROR: '{file}' no encontrado en PATH
fr: ERREUR : {file} est introuvable dans PATH
it: ERRORE: '{file}' non trovato nel PATH
sr: ГРЕШКА: датотека „{file}‟ није нађена у променљивој PATH
sr@latn: GREŠKA: datoteka „{file}‟ nije nađena u promenljivoj PATH

source: dvd::rip is nothing without transcode
ca: El dvd::rip no és res sense el transcode
de: dvd::rip ist nichts ohne transcode!
es: dvd::rip no es nada sin transcode
fr: dvd::rip, ne sert à rien sans Transcode
it: dvd::rip è nulla senza transcode
sr: двд::рип је ништа без програма transcode
sr@latn: dvd::rip je ništa bez programa transcode

source: Needed for preview image processing
ca: Es necessita per a les previsualitzacions
de: Für die Erstellung von Vorschaubildern
es: Necesitado para las previsualizaciones
fr: Nécessaire pour le traitement de l'image d'aperçu
it: E` necessario per l'elaborazione delle immagini d'anteprima
sr: Потребно за обраду слика за преглед
sr@latn: Potrebno za obradu slika za pregled

source: FFmpeg video converter command line program
ca: Línia d'ordres del convertidor de vídeo FFmpeg
de: FFmpeg Kommandozeilenprogramm
es: Programa FFmpeg conversor de videos de linea de comandos

source: xvid4 configuration tool
ca: És l'eina de configuració de l'xvid4
de: xvdi4 Konfigurationsprogramm
es: Herramienta de configuración de xvid4
fr: Outil de configuration XviD 4
it: Strumento per configurare xvid4
sr: xvid4 алат за подешавање
sr@latn: xvid4 alat za podešavanje

source: Needed for subtitles
ca: Es necessita per als subtítols
de: Benötigt für Untertitel
es: Necesitado para los subtítulos
fr: Nécessaire pour les sous-titres
it: E` necessario per i sottotitoli
sr: Потребно за титлове
sr@latn: Potrebno za titlove

source: Needed for faster DVD TOC reading
ca: Es necessita per llegir la TOC del DVD més depressa
de: Benötigt zum schnellen Lesen des DVD Inhaltsverzeichnisses
es: Necesitado para leer la TOC del DVD más rápidamente
fr: Nécessaire pour une lecture plus rapide de la table des matières
it: Necessario per una lettura più veloce della TOC del DVD
sr: Потребно за брже читање DVD табеле садржаја
sr@latn: Potrebno za brže čitanje DVD tabele sadržaja

source: Needed for compressed vobsub subtitles
ca: Es necessita per als subtítols vobsub comprimits
de: Benötigt für komprimierte vobsub Untertitel
es: Necesitado para subtítulos vobsub comprimidos
fr: Nécessaire pour des sous-titres vobsub compressés
it: E` necessario per i sottotitoli compressi vobsub
sr: Потребно за компресоване vobsub титлове
sr@latn: Potrebno za kompresovane vobsub titlove

source: Needed for subtitle vobsub viewing
ca: Es necessita per veure els subtítols vobsub
de: Benötigt zum Ansehen von vobsub Untertiteln
es: Necesitado para ver subtítulos vobsub
fr: Nécessaire pour la visualisation des vobsub
it: E` necessario per la visualizzazione dei sottotitolo vobsub
sr: Потребно за приказ vobsub титлова
sr@latn: Potrebno za prikaz vobsub titlova

source: Needed for OGG/Vorbis
ca: Es necessita per als OGG/Vorbis
de: Benötigt für OGG/Vorbis
es: Necesitado para OGG/Vorbis
fr: Nécessaire pour la création des fichiers Ogg/Vorbis
it: E` necessario per file OGG/Vorbis
sr: Потребно за OGG/Vorbis
sr@latn: Potrebno za OGG/Vorbis

source: For chapter progress bar (ogmtools)
ca: Barra de progrés de capítols (ogmtools)
de: Für Kapitel Fortschrittsanzeige (ogmtools)
es: Barras de progreso de capítulos (ogmtools)
fr: Pour la barre de progression des chapitres (ogmtools)
it: Per la barra di avanzamento del capito (ogmtools)
sr: За линију напретка поглавља (ogmtools)
sr@latn: Za liniju napretka poglavlja (ogmtools)

source: Needed for (S)VCD encoding
ca: Es necessita per codificar els (S)VCD
de: Benötigt für (S)VCD Erstellung
es: Necesitado para codificar (S)VCD
fr: Nécessaire pour l'encodage des (S)VCD
it: E` necessario per la codifica di (S)VCD
sr: Потребно за (S)VCD кодирање
sr@latn: Potrebno za (S)VCD kodiranje

source: Can be used to view DVD's/files
ca: Es pot usar per veure fitxers de DVD
de: Kann zum Ansehen von DVDs/Dateien benutzt werden
es: Se puede usar para ver DVD/archivos
fr: Peut être utilisé pour visionner des DVD ou fichiers
it: Può essere usato per vedere DVD o file
sr: Не може се користити за приказ DVD-ова/фајлова
sr@latn: Ne može se koristiti za prikaz DVD-ova/fajlova

source: Only for cluster mode master
ca: Només per al mestre del mode clúster
de: Nur für den Cluster Master Rechner
es: Sólo para el maestro del modo cluster
fr: Seulement pour le maître dans le calcul en cluster
it: Solo per chi ospita il demone di controllo del cluster
sr: Само за главни режим скупине
sr@latn: Samo za glavni režim skupine

source: Used for DVD device scanning
ca: S'usa per escanejar la unitat de DVD
de: Benötigt zum Ermitteln der angeschlossenen DVD Geräte
es: Usado para escanear la unidad de DVD
fr: Utilisé pour scanner le périphérique DVD
it: Utilizzato per la scansione dei dispositivi DVD
sr: Користи се за претрагу ДВД уређаја
sr@latn: Koristi se za pretragu DVD uređaja

source: not installed
ca: no instal·lada
de: nicht installiert
es: No instalado
fr: non installé
it: non installato
sr: није инсталирано
sr@latn: nije instalirano

source: Program
ca: Programa
de: Programm
es: Programa
fr: Programme
it: Programma
sr: Програм

source: Version
ca: Versió
es: Versión
it: Versione
sr: Издање
sr@latn: Izdanje

source: Number of frames
ca: Nombre de fotogrames
de: Anzahl Frames
es: Número de fotogramas
fr: Nombre d'images
it: Numero di fotogrammi
sr: Број кадрова
sr@latn: Broj kadrova

source: Frames per second
ca: Fotogrames per segon
de: Frames pro Sekunde
es: Fotogramas por segundo
fr: Images par seconde
it: Fotogrammi per secondo
sr: Кадрова у секунди
sr@latn: Kadrova u sekundi

source: Runtime
ca: Temps de reproducció
de: Länge
es: Tiempo de reproducción
fr: Temps d'exécution
sr: Време трајања
sr@latn: Vreme trajanja

source: Audio size is given with {audio_size} MB
ca: Mida de l'àudio donada per {audio_size} MB
de: Audio Größe ist gegeben mit {audio_size} MB
es: Tamaño de audio dado por {audio_size} MB
fr: La taille audio est donnée avec {audio_size} Mo
it: La dimensione dell'audio è data da {audio_size} MB
sr: Аудио величина је дата са {audio_size} MB
sr@latn: Audio veličina je data sa {audio_size} MB

source: Audio size
ca: Mida de l'àudio
de: Audio Größe
es: Tamaño de audio
fr: Taille de la bande son
it: Dimensione audio
sr: Аудио величина
sr@latn: Audio veličina

source: (incl. {avi_overhead} byte AVI overhead per frame)
ca: (incl. {avi_overhead} bytes de sobrecàrrega AVI per fotog.)
de: (inkl. {avi_overhead} byte AVI Overhead pro Frame)
es: (incl. {avi_overhead} B de sobrecarga AVI por fotog.)
fr: (incl. {avi_overhead} octets d'excédent AVI par image)
it: (incl. {avi_overhead} byte di overhead AVI per ciascun fotogramma)
sr: (укљ. {avi_overhead} бајта AVI вишка по кадру)
sr@latn: (uklj. {avi_overhead} bajta AVI viška po kadru)

source: (assume nominal bitrate for this quality)
ca: (es pressuposa taxa de bits nominal per a aquesta qualitat)
de: (bei Durchnittsbitrate für diese Qualitätsstufe)
es: (se asume tasa de bits nominal para esta calidad)
fr: (suppose un débit nominal pour cette qualité)
it: (assumi bitrate nominale per questa qualità)
sr: (претпостави номиналну учесталост бита за овај квалитет)
sr@latn: (pretpostavi nominalnu učestalost bita za ovaj kvalitet)

source: (exact bitrate match assumed)
ca: (es pressuposa que la taxa de bits final coincideix)
de: (exakte Bitratenberechnung vorausgesetzt)
es: (se asume que la tasa de bits final coincida)
fr: (correspondance exacte du débit supposée)
it: (si è assunta l'esatta corrispondenza del bitrate)
sr: (претпоставља се тачно поклапање учесталости бита)
sr@latn: (pretpostavlja se tačno poklapanje učestalosti bita)

source: Audio track #{nr}
ca: Pista d'àudio #{nr}
de: Tonspur #{nr}
es: Pista de audio #{nr}
fr: Piste audio n°{nr}
it: Traccia audio #{nr}
sr: Аудио нумера #{nr}
sr@latn: Audio numera #{nr}

source: AVI video overhead ({avi_overhead} bytes per frame)
ca: Sobrecàrrega del vídeo AVI ({avi_overhead} bytes per fotog.)
de: AVI Video Overhead ({avi_overhead} Bytes pro Frame)
es: Sobrecarga del video AVI ({avi_overhead} bytes por fotograma)
fr: Excédent video AVI ({avi_overhead} octets par image)
it: Overhead del video AVI ({avi_overhead} byte per fotogramma)
sr: AVI видео вишак ({avi_overhead} бајта по кадру)
sr@latn: AVI video višak ({avi_overhead} bajta po kadru)

source: OGG overhead ({ogg_overhead} percent of video+audio size)
ca: Sobrecarrega de l'OGG ({ogg_overhead}% de la mida de vídeo+àudio)
de: OGG Overhead ({ogg_overhead} Prozent von Video+Audio)
es: Sobrecraga de OGG ({ogg_overhead}% del tamaño de video+audio)
fr: Excédent OGG ({ogg_overhead}% de la taille vidéo+audio)
it: Overhead OGG ({ogg_overhead} percento della dimensione di destinazione di video+audio)
sr: OGG вишак ({ogg_overhead} процената величине аудиа и видеа)
sr@latn: OGG višak ({ogg_overhead} procenata veličine audia i videa)

source: Number of discs
ca: Nombre de discs
de: Anzahl CDs
es: Número de discos
fr: Nombre de disques
it: Numero di dischi
sr: Број дискова
sr@latn: Broj diskova

source: Disc size
ca: Mida del disc
de: CD Größe
es: Tamaño de disco
fr: Taille des disques
it: Dimensione del disco
sr: Величина диска
sr@latn: Veličina diska

source: Target size
ca: Mida del medi
de: Zielgröße
es: Tamaño del medio
fr: Taille des CDs
it: Dimensione della destinazione
sr: Циљна величина
sr@latn: Ciljna veličina

source: VCD sector size addition (factor: 2324/2048)
ca: Addició de la mida de sector de VCD (factor: 2324/2048)
de: VCD Sektor Overhead (Faktor: 2324/2048)
es: Adición del tamaño de sector de VCD (factor: 2324/2048)
fr: Ajout de la taille des secteurs du VCD (rapport : 2324/2048)
it: Addizione della dimensione del settore VCD (fattore: 2324/2048)
sr: VCD додатак величини сектора (фактор: 2324/2048)
sr@latn: VCD dodatak veličini sektora (faktor: 2324/2048)

source: VCD per disc overhead (600 sectors)
ca: Sobrecàrrega de VCD per disc (600 sectors)
de: VCD pro CD Overhead (600 Sektoren)
es: Sobrecarga de VCD por disco (600 sectores)
fr: Excédent par disque VCD (600 secteurs)
it: Overhead VCD per ciascun disco (600 settori)
sr: VCD вишак по диску (600 сектора)
sr@latn: VCD višak po disku (600 sektora)

source: (X)(S)VCD/CVD target size
ca: Mida del (X)(S)VCD/CVD
de: (X)(S)VCD/CVD Zielgröße
es: Tamaño del (X)(S)VCD/CVD
fr: Taille finale (X)(S)VCD/CVD
it: Dimensione della destinazione (X)(S)VCD/CVD
sr: (X)(S)VCD/CVD циљна величина
sr@latn: (X)(S)VCD/CVD ciljna veličina

source: vobsub size
ca: Mida del vobsub
de: vobsub Größe
es: Tamaño de vobsub
fr: Taille du vobsub
it: dimensione vobsub
sr: vobsub величина
sr@latn: vobsub veličina

source: vobsub size subtitle #{nr}
ca: Mida del subtítol vobsub #{nr}
de: vobsub Größe Untertitel #{nr}
es: Tamaño del subtítulo vobsub #{nr}
fr: Taille du vobsub sous-titre n°{nr}
it: dimensione vobsub del sottotitolo #{nr}
sr: vobsub величина титла #{nr}
sr@latn: vobsub veličina titla #{nr}

source: Space left for video
ca: Espai que queda per al vídeo
de: Platz übrig für Video
es: Espacio que queda para el video
fr: Espace restant pour la vidéo
it: Spazio rimasto per il video
sr: Преостало простора за видео
sr@latn: Preostalo prostora za video

source: Resulting video bitrate, rounded
ca: Taxa de bits final de vídeo, arrodonida
de: Ergebnis Video Bitrate, gerundet
es: Tasa de bits de video final, redondeada
fr: Débit vidéo résultant arrondi
it: Bitrate video risultantem arrotondato
sr: Коначни битски проток видеа, заокружен
sr@latn: Konačni bitski protok videa, zaokružen

source: Resulting BPP
ca: BPP final
de: Resultierende BPP
es: BPP resultante
fr: Valeur BPP résultante
it: Bit per pixel risultanti
sr: Коначни BPP
sr@latn: Konačni BPP

source: Resulting video size
ca: Mida final del vídeo
de: Resultierende Video Größe
es: Tamaño de video final
fr: Taille vidéo résultante
it: Dimensione video risultante
sr: Резултујућа величина видеа
sr@latn: Rezultujuća veličina videa

source: Bitrate too high, set to {max_video_rate}
ca: Taxa massa alta, limitada a {max_video_rate}
de: Bitrate zu groß, auf {max_video_rate} gesetzt
es: Demasiado alta, definida en {max_video_rate}
fr: Débit trop grand. Réglé à {max_video_rate}
it: Bitrate troppo alto, imposta su {max_video_rate}
sr: Битски проток је превисок, постављено на {max_video_rate}
sr@latn: Bitski protok je previsok, postavljeno na {max_video_rate}

source: Bitrate too high, limited
ca: La taxa és massa alta, s'ha limitat
de: Bitrate zu groß, Wert limitiert
es: Demasiado alta, limitada
fr: Débit trop grand, limité
it: Bitrate troppo alto, limitato
sr: Битски проток је превисок, ограничено
sr@latn: Bitski protok je previsok, ograničeno

source: VCD has fixed rate
ca: VCD té una taxa fixa
de: VCD hat feste Bitrate
es: VCD tiene una tasa fija
fr: Les VCD ont un débit fixé
it: Il VCD ha un rate fisso
sr: VCD има фиксну брзину
sr@latn: VCD ima fiksnu brzinu

source: Manual BPP setting
ca: BPP manual
de: Manuelle BPP Einstellung
es: BPP manual
fr: Réglage BPP manuel
it: Impostazioni manuali di BPP
sr: Ручно подешавање BPPа
sr@latn: Ručno podešavanje BPPa

source: Resulting Video Bitrate
ca: Taxa de bits de vídeo final
de: Resultierende Video Bitrate
es: Tasa de bits de video final
fr: Débit vidéo résultant
it: Bitrate risultante per il Video
sr: Коначни битски проток видеа
sr@latn: Konačni bitski protok videa

source: Manual video bitrate setting
ca: Taxa de bits de vídeo manual
de: Manuelle Video Bitrate
es: Tasa de bits de video manual
fr: Réglage manuel du débit vidéo
it: Impostazioni manuali del bitrate video
sr: Ручно подешавање битског протока
sr@latn: Ručno podešavanje bitskog protoka

source: Resulting Video Size
ca: Mida final del vídeo
de: Resultierende Video Größe
es: Tamaño de video final
fr: Taille vidéo résultante
it: Dimensione video risultante
sr: Коначна величина видеа
sr@latn: Konačna veličina videa

source: Resulting File Size
ca: Mida final del(s) fitxer(s)
de: Resultierende Dateigröße
es: Tamaño de archivo final
fr: Taille vidéo résultante
it: Dimensione file risultante
sr: Коначна величина датотеке
sr@latn: Konačna veličina datoteke

source: Logfile nuked.
ca: El fitxer de registre s'ha buidat.
de: Protokolldatei wurde gelöscht.
es: Archivo de registro vaciado.
fr: Fichier journal vidé.
it: Il file di registro è stato azzerato.
sr: Фајл дневника уништен.
sr@latn: Fajl dnevnika uništen.

source: {cnt} images
ca: {cnt} imatges
de: {cnt} Bilder
es: {cnt} imágenes
it: {cnt} immagini
sr: број слика: {cnt}
sr@latn: broj slika: {cnt}

source: Discard
ca: Descarta
de: Verwerfen
es: Descartar
fr: Non utilisé
it: Scarta
sr: Одбаци
sr@latn: Odbaci

source: title #{title}
ca: títol #{title}
de: Titel #{title}
es: título #{title}
fr: titre n°{title}
it: titolo #{title}
sr: наслов #{title}
sr@latn: naslov #{title}

source: chapter #{chapter}
ca: capítol #{chapter}
de: Kapitel #{chapter}
es: capítulo #{chapter}
fr: chapitre n°{chapter}
it: capitolo #{chapter}
sr: поглавље #{chapter}
sr@latn: poglavlje #{chapter}

source: Read TOC ({method})
ca: Llegeix TOC ({method})
de: Inhaltsverzeichnis lesen ({method})
es: Leer TOC ({method})
it: Leggi TOC ({method}

source: Successfully read DVD TOC
ca: S'ha llegit amb èxit la TOC del DVD
de: Inhaltsverzeichnis erfolgreich gelesen
es: TOC del DVD leída con éxito
fr: Table des matières du DVD correctement lue
it: TOC dev DVD letta con successo
sr: Успешно је прочитан садржај ДВДа
sr@latn: Uspešno je pročitan sadržaj DVDa

source: Failed to copy the IFO files. vobsub creation won't work properly. (Did you specify the mount point of your DVD drive in the Preferences?) The error message is:
ca: Hi ha hagut una fallada en copiar els fitxers IFO. La creació de vobsub no funcionarà bé. (Heu especificat el punt de muntatge del DVD en les Preferències?) El missatge d'error és:
de: IFO Dateien konnten nicht kopiert werden. Die Erzeugung von vobsub Dateien wird deshalb fehlschlagen. (Wurde der richtige Mount-Punkt in den Voreinstellungen angegeben?). Die System-Fehlermeldung ist:
es: Fallo al copiar los archivos IFO. Creación de vobsub no funcionará correctamente. (¿Especificaste el punto de montaje de tu DVD en las Preferencias?) El mensaje de error es:
fr: Échec de copie des fichier IFO. La création des fichiers vosub ne fonctionnera pas. (Avez vous specifié le bon point de montage du DVD dans les préférences?) Le message d'erreur est :
it: La copia dei file IFO non è riuscita. La creazione dei file vobsub non ha funzionato correttamente: hai specificato il punto di montaggio del tuo DVD nelle Preferenze? Il messaggio d'errore è:
sr: Нисам успео да копирам IFO фајлове. vobsub прављење неће добро радити. (Да ли сте прецизирали тачку монтирања Вашег DVD уређаја у поставкама?) Порука грешке је:
sr@latn: Nisam uspeo da kopiram IFO fajlove. vobsub pravljenje neće dobro raditi. (Da li ste precizirali tačku montiranja Vašeg DVD uređaja u postavkama?) Poruka greške je:

source: Error reading table of contents. Please check your DVD device settings in the Preferences and don't forget to put a DVD in the drive.
ca: Hi ha hagut un error en llegir la taula de contingut. Comproveu la configuració de la unitat de DVD en les Preferències i no oblideu introduir un DVD en la unitat.
de: Das DVD Inhaltsverzeichnis konnte nicht eingelesen werden. Bitte überprüfen Sie die DVD Geräteeinstellungen im Voreinstellungsdialog und ob eine DVD in das Laufwerk eingelegt wurde.
es: Error leyendo la tabla de contenidos. Por favor comprueba tu configuración de la unidad de DVD en Preferencias y no olvides introducir un DVD en la unidad.
fr: Erreur lors de la lecture de la table des matières.Veuillez vérifier les réglages du DVD dans les préférenceset n'oubliez pas de mettre un DVD dans le lecteur.
it: Errore durante la lettura della TOC. Controlla le impostazioni del tuo lettore DVD nelle Preferenze e non dimenticare di inserire un DVD nel lettore.
sr: Грешка при читању садржаја. Молимо да проверите поставке ДВД уређаја у Поставкама и не заборавите да убаците ДВД у уређај.
sr@latn: Greška pri čitanju sadržaja. Molimo da proverite postavke DVD uređaja u Postavkama i ne zaboravite da ubacite DVD u uređaj.

source: Warning: lsdvd failed reading TOC, trying tcprobe.
ca: Atenció: lsdvd ha fallat en llegir la TOC, s'intenta tcprobe.
de: Warnung: lsdvd konnte Inhaltsverzeichnis nicht lesen, versuche es mit tcprobe.
es: Atención: lsdvd falló al leer la TOC, probando tcprobe.
it: Attenzione: lsdvd non è riuscito a leggere la TOC, provo con tcprobe.

source: Determine number of titles
ca: Determina el nombre de títols
de: Bestimme Anzahl der Titel
es: Determinar el número de títulos
fr: Détermine le nombre de titres
it: Determina il numero dei titoli
sr: Утврди број наслова
sr@latn: Utvrdi broj naslova

source: Probe - title #{title}
ca: Explora - títol #{title}
de: Analyse - Titel #{title}
es: Explorar - título #{title}
fr: Inspection - titre n°{title}
it: Esame - titolo #{title}
sr: Проба - наслов бр. {title}
sr@latn: Proba - naslov br. {title}

source: Probe all DVD titles
ca: Explora tots els títols del DVD
de: Analysiere alle DVD Titel
es: Explorar todos los títulos del DVD
fr: Inspection de tous les titres du DVD
it: Esamina tutti i titolo del DVD
sr: Пробање свих ДВД наслова
sr@latn: Probanje svih DVD naslova

source: Rip chapters of title #{nr}
ca: Extreu capítols del títol #{nr}
de: Kopiere Kapiel von Titel #{nr}
es: Extraer capítulos del título #{nr}
fr: Extraction des chapitres du titre n°{nr}
it: Estrazione capitoli del titolo #{nr}
sr: Скини поглавља наслова бр. #{nr}
sr@latn: Skini poglavlja naslova br. #{nr}

source: Process title #{nr}
ca: Processa títol #{nr}
de: Verarbeite DVD Titel #{nr}
es: Procesar título #{nr}
fr: traitement du titre n°{nr}
it: Elabora il titolo #{nr}
sr: Обрада наслова бр. {nr}
sr@latn: Obrada naslova br. {nr}

source: Rip selected title(s) / chapter(s)
ca: Extreu el(s) títol(s)/capítol(s) seleccionat(s)
de: Ausgewähle Titel/Kapitel auf die Festplatte kopieren
es: Extraer los título(s)/capítulo(s) seleccionados
fr: Extraire les titres ou chapitres sélectionnés
it: Estrai i(l) titolo(i)/capitolo(i) selezionato(i)
sr: Рипуј одабране наслове одн. поглавља
sr@latn: Ripuj odabrane naslove odn. poglavlja

source: Rip
ca: Extreu
de: Kopieren
es: Extraer
fr: Extraction
it: Estrazione
sr: Риповање
sr@latn: Ripovanje

source: chapter {chapter}
ca: capítol {chapter}
de: Kapitel {chapter}
es: capítulo {chapter}
fr: chapitre {chapter}
it: capitolo {chapter}
sr: поглавље {chapter}
sr@latn: poglavlje {chapter}

source: Chapter {nr} is too small and useless. You should deselect it.
ca: El capítol {nr} és massa petit i inútil. No l'hauríeu de seleccionar.
de: Kapitel {nr} ist zu klein und unbrauchbar. Sie sollten es abwählen.
es: El capítulo {nr} es demasiado pequeño e inútil. No deberías seleccionarlo.
fr: Le chapitre n°{nr} est trop petit et inutile. Vous devriez le désélectionner.
it: Il capitolo {nr} è troppo piccolo ed inutile. Dovresti deselezionarlo.
sr: Поглавље {nr} је премало и бескорисно. Немојте га обележавати.
sr@latn: Poglavlje {nr} je premalo i beskorisno. Nemojte ga obeležavati.

source: DVD TOC reported wrong framerate {toc_fps}, adjusted frame rate to {disc_fps} and frame count to {disc_count}
ca: El TOC del DVD ha informat una velocitat de vídeo {toc_fps} incorrecta, la velocitat de vídeo s'ha ajustat a {disc_fps} i el nombre de fotogrames a {disc_count}
de: Im DVD Inhaltsverzeichnis ist eine falsche Framerate ({toc_fps}) eingetragen. Die Framerate wurde zu {disc_fps} korrigiert, die Anzahl der Frames auf {disc_count}.
es: El TOC del DVD informó una tasa de video {toc_fps} incorrecta, tasa de video ajustada a {disc_fps} y número de fotogramas a {disc_count}
it: La TOC del DVD riporta un valore di intervallo tra i fotogrammi non corretto {toc_fps}, modifico l'intervallo su {disc_fps} ed il numero di fotogrammi su {disc_count}
