Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: It seems that transcode ripping stopped short. The movie has {title_frames} frames, but only {disc_frames} were ripped. This is most likely a problem with your transcode/libdvdread installation, resp. a problem with this specific DVD.
ca: Sembla que l'extracció amb el transcode s'ha aturat abans d'hora. El vídeo té {title_frames} fotogrames, però només se n'han extret {disc_frames}. El més probable és que això es degui a un problema amb la instal·lació del transcode/libdvdread, més que no pas a un problema amb aquest DVD concret.
de: Es scheint, dass transcode den Titel nicht vollständig kopiert hat. Der Titel hat {title_frames} Frames, aber nur {disc_frames} wurden eingelesen. Vermutlich gibt es ein Problem mit Ihrer transcode/libdvdread Installation oder auch ein spezifisches Problem mit dieser DVD.
es: Parece que la extracción con transcode paró pronto. El video tiene {title_frames} fotogramas, pero sólo se extrajeron {disc_frames}. Lo más probable es que sea un problema con tu instalación de transcode/libdvdread, más que un problema con este DVD específico.
fr: Il semble que l'extraction par transcode se soit arrêtée rapidement. Le film a {title_frames} trames mais seulement {disc_frames} ont été extraites. C'est très probablement un problème avec votre installation de transcode / libdvdread, ou bien un problème spécifiquement dû à ce DVD.
it: Sembra che l'estrazione di transcode si sia interrotta troppo presto. Il filmato ha {title_frames} fotogrammi, ma soltanto {disc_frames} sono stati estratti. Questo è tipicamente un problema con la tua installazione di transcode/libdvdread, oppure un problema con questo specifico DVD.
sr: Изгледа да је транскодирање стало у пола посла. Филм има оволико слика {title_frames}, али само {disc_frames} је обрађено. Ово је највероватноје проблем са инсталацијом библиотека transcode или libdvdread, или проблем са овим диском.
sr@latn: Izgleda da je transkodiranje stalo u pola posla. Film ima ovoliko slika {title_frames}, ali samo {disc_frames} je obrađeno. Ovo je najverovatnoje problem sa instalacijom biblioteka transcode ili libdvdread, ili problem sa ovim diskom.

source: Detect audio bitrate of title #{nr}
ca: Detecta la taxa de bits de l'àudio del títol #{nr}
de: Audio Bitrate von Titel #{nr} ermitteln
es: Detectar la tasa de bits de audio del título #{nr}
fr: Détecte le débit audio du titre n°{nr}
it: Scopri il bitrate audio del titolo #{nr}
sr: Аутоматско откривање битског протока за наслов бр. #{nr}
sr@latn: Automatsko otkrivanje bitskog protoka za naslov br. #{nr}

source: Grab preview
ca: Captura la previsualització
de: Hole Vorschaubild
es: Capturar la previsualización
fr: Capture de l'aperçu
it: Acquisisco anteprima
sr: Хватање прегледа
sr@latn: Hvatanje pregleda

source: transcode can't find this frame.
ca: El transcode no pot trobar aquest fotograma.
de: transcode konnte das gewünschte Bild nicht finden.
es: transcode no puede encontrar este fotograma.
fr: Transcode ne trouve pas cette trame.
it: transcode non riesce a trovare questo fotogramma.
sr: transcode не може да нађе овај кадар.
sr@latn: transcode ne može da nađe ovaj kadar.

source: Try a lower frame number.
ca: Prova un nombre de fotograma més baix.
de: Versuchen Sie es mit einer kleineren Frame Nummer.
es: Prueba un número de fotograma menor.
fr: Essayez un nombre de trames inférieur.
it: Prova con un numero di fotogramma più basso.
sr: Пробајте са мањим бројем кадрова.
sr@latn: Probajte sa manjim brojem kadrova.

source: Try forcing slow frame grabbing.
ca: Prova de forçar la captura lenta de fotogrames.
de: Versuchen Sie es mit der langsamen Methode.
es: Prueba a forzar la captura lenta de fotogramas.
fr: Essayez de forcer la capture lente d'aperçus
it: Prova a forzare la cattura lenta del fotogramma.
sr: Пробајте да форсирате споро хватање кадрова.
sr@latn: Probajte da forsirate sporo hvatanje kadrova.

source: You first have to rip this title.
ca: Abans heu d'extreure aquest títol.
de: Der Titel muss erst auf die Platte kopiert werden.
es: Primero tienes que extraer este título.
fr: Vous devez d'abord extraire ce titre
it: Devi prima estrarre questo titolo.
sr: Прво морате да ишчупате овај наслов.
sr@latn: Prvo morate da iščupate ovaj naslov.

source: Process preview frame
ca: Processa un fotograma per previsualitzar
de: Verarbeite Vorschaubild
es: Procesar un fotograma para previsualizar
fr: Traiter la trame d'aperçu
it: Cattura fotogramma d'anteprima
sr: Обрада кадра за преглед
sr@latn: Obrada kadra za pregled

source: Generate preview thumbnails
ca: Genera vistes prèvies en miniatura
de: Vorschaubilder erzeugen
es: Generar previsualizaciones
fr: Générer des vignettes d'aperçu
it: Genera le miniature d'anteprima
sr: Направи слике за преглед
sr@latn: Napravi slike za pregled

source: Apply preset & make previews
ca: Aplica ajust predefinit i fes previsualitzacions
de: Vorlagenwerte übernehmen
es: Aplicar ajuste predefinido y hacer previsualizaciones
fr: Appliquer ce réglage et fabrique les aperçus
it: Applica i valori predefiniti e crea le anteprime
sr: Примени унапред постављене вредности и направи преглед
sr@latn: Primeni unapred postavljene vrednosti i napravi pregled

source: Apply Clip & Zoom preset
ca: Aplica l'ajust de retallat i zoom
de: Clip & Zoom Einstellungen anwenden
es: Aplicar el ajuste de Recorte y Zoom
fr: Applique le réglage de Découpe & Zoom
it: Applica le impostazioni di Clip & Zoom
sr: Примени подешавања за опсецање и зумирање
sr@latn: Primeni podešavanja za opsecanje i zumiranje

source: You can't select a frame range with psu core.
ca: No podeu seleccionar un rang de fotogrames amb nucli PSU activat.
de: Ein Frame-Bereich kann mit dem PSU Core kombiniert werden.
es: No puedes seleccionar un rango de fotogramas con el núcleo PSU activado.
fr: Vous ne pouvez pas choisir un intervalle d'image avec PSU core activé.
it: Non puoi selezionare un intervallo di fotogrammi con il core PSU.
sr: Можете изабрати опсег кадрова са psu језгром.
sr@latn: Možete izabrati opseg kadrova sa psu jezgrom.

source: PSU core only available for ripped DVD's.
ca: Nucli PSU només està disponible per a DVD extrets.
de: PSU Core kann nur bei kopierten DVDs verwendet werden.
es: Núcleo PSU sólo disponible para DVD extraídos.
fr: L'option PSU core n'est disponible que pour les DVD extraits.
it: Il core PSU è disponibile solo per i DVD estratti.
sr: PSU језгро доступно само за ишчупане DVD-ове.
sr@latn: PSU jezgro dostupno samo za iščupane DVD-ove.

source: No chapters selected.
ca: No s'ha seleccionat cap capítol.
de: Keine Kapitel ausgewählt.
es: Ningún capítulo seleccionado.
fr: Aucun chapitre sélectionné
it: Nessun capitolo è stato selezionato.
sr: Нема изабраних поглавља.
sr@latn: Nema izabranih poglavlja.

source: Splitting AVI files in chapter mode makes no sense.
ca: Dividir els fitxers AVI usant el mode per capítols no té sentit.
de: Das Aufteilen von Dateien im Kapitel-Modus macht keinen Sinn.
es: Dividir los archivos AVI usando el modo por capítulos no tiene sentido.
fr: Découper les fichiers AVI n'a pas d'intérêt si les chapitres sont séparés.
it: Non ha senso dividere i file AVI in modalità capitoli.
sr: Раздвајање AVI фајлова у режиму поглавља нема смисла.
sr@latn: Razdvajanje AVI fajlova u režimu poglavlja nema smisla.

source: WARNING: no target audio track #0
ca: ATENCIÓ: no hi ha cap pista d'àudio #0
de: WARNUNG: keine Tonspur auf Nummer #0
es: ATENCIÓN: no hay pista de audio #0
fr: ATTENTION : aucune piste audio n°0
it: ATTENZIONE: nessuna traccia audio #0
sr: УПОЗОРЕЊЕ: нема циљне аудио нумере #0
sr@latn: UPOZORENJE: nema ciljne audio numere #0

source: Having more than one audio track isn't possible on a (X)VCD.
ca: No es pot tenir més d'una pista d'àudio en un (X)VCD.
de: Mehr als eine Tonspur ist bei (X)VCD nicht möglich.
es: No se puede tener más de una pista de audio en un (X)VCD.
fr: Les (X)VCD ne peuvent avoir qu'une piste audio.
it: Non è possibile avere più di una traccia audio su un (X)VCD.
sr: Постојање више од једне аудио нумере није могуће на (X)VCD-у.
sr@latn: Postojanje više od jedne audio numere nije moguće na (X)VCD-u.

source: WARNING: Having more than two audio tracks on a (X)SVCD/CVD is not standard conform. You may encounter problems on hardware players.
ca: ATENCIÓ: Tenir més de dues pistes d'àudio en un (X)SVCD/CVD no s'ajusta a l'estàndard. Pot ser que tingueu problemes en reproductors de sobretaula.
de: WARNUNG: mehr als zwei Tonspuiren bei (X)SVCD/CVD ist nicht standardkonform. Es können Probleme bei einigen Abspielgeräten auftreten.
es: ATENCIÓN: Tener más de dos pistas de audio en un (X)SVCD/CVD no se ajusta al estándar. Puedes tener problemas en reproductores de sobremesa.
fr: ATTENTION : avoir plus de deux pistes audio sur un (X)SVCD/CVD n'est pas conforme au standard. Il est possible que vous recontriez des problèmes de lecture sur des platines de salon.
it: ATTENZIONE: avere più di due tracce audio su un (X)SVCD/CVD non è conforme allo standard. Puoi riscontrare dei problemi su alcuni riproduttori hardware.
sr: УПОЗОРЕЊЕ: Постојање више од две аудио нумере на (X)SVCD/CVD-у није стандардна пракса. Можете наићи на проблеме на хардверским плејерима.
sr@latn: UPOZORENJE: Postojanje više od dve audio numere na (X)SVCD/CVD-u nije standardna praksa. Možete naići na probleme na hardverskim plejerima.

source: You better cancel now and select the appropriate preset on the Clip &amp; Zoom page.
ca: Val més que ara cancel·leu i seleccioneu l'ajustament predefinit apropiat en la pàgina de retallat i zoom.
de: Besser Sie brechen jetzt ab und wählen eine entsprechende Vorlage auf der Clip & Zoom Seite.
es: Mejor cancela ahora y selecciona el ajuste predefinido apropiado en la página Recorte y Zoom.
fr: Vous devriez plutôt annuler et sélectionner le bon réglage sur la page Découpe &amp; Zoom.
it: E` meglio se adesso annulli e selezioni le impostazioni appropriate sulla pagina di Clip & Zoom.
sr: Боље би било да сада поништите и изаберете одговарајућу претходну поставку на страни „Исеци и увеличај“.
sr@latn: Bolje bi bilo da sada poništite i izaberete odgovarajuću prethodnu postavku na strani „Iseci i uveličaj“.

source: Transcode multiple titles
ca: Codifica diversos títols
de: Mehrere Titel transkodieren
es: Codificar varios títulos
fr: Transcoder plusieurs titres
it: Codifica più titolo
sr: Транскодирај више наслова
sr@latn: Transkodiraj više naslova

source: Transcode
ca: Codifica
de: Transkodieren
es: Codificar
fr: Encoder
it: Codifica
sr: Транскодирај
sr@latn: Transkodiraj

source: Transcode chapters
ca: Codifica capítols
de: Kapitel transkodieren
es: Codificar capítulos
fr: Transcoder des chapitres
it: Codifica capitoli
sr: Транскодирање поглавља
sr@latn: Transkodiranje poglavlja

source: Transcode with VBR audio, first pass
ca: Codifica amb àudio VBR, primera passada
de: Transkodiere mit VBR Audio, erster Durchgang
es: Codificar con audio VBR, primera pasada
fr: Transcodage avec un débit audio variable (VBR), 1ère passe
it: Codifica con audio VBR, prima passata
sr: Транскодирање са променљивим аудио битским протоком (VBR), први пролаз
sr@latn: Transkodiranje sa promenljivim audio bitskim protokom (VBR), prvi prolaz

source: Transcode with VBR audio, second pass
ca: Codifica amb àudio VBR, segona passada
de: Transkodiere mit VBR audio, zweiter Durchgang
es: Codificar con audio VBR, segunda pasada
fr: Transcodage avec un débit audio variable (VBR), 2ème passe
it: Codifica con audio VBR, seconda passata
sr: Транскодирање са променљивим аудио битским протоком (VBR), други пролаз
sr@latn: Transkodiranje sa promenljivim audio bitskim protokom (VBR), drugi prolaz

source: Transcode with VBR audio
ca: Codifica amb àudio VBR
de: Transkodieren mit VBR Audio
es: Codificar con audio VBR
fr: Transcodage à débit audio variable (VBR)
it: Codifica con audio VBR
sr: Транскодирање са променљивим аудио битским протоком (VBR)
sr@latn: Transkodiranje sa promenljivim audio bitskim protokom (VBR)

source: Calculate video bitrate
ca: Calcula la taxa de bits de vídeo
de: Video Bitrate berechnen
es: Calcular la tasa de bits de video
fr: Calculer le débit vidéo
it: Calcola bitrate video
sr: Рачунање видео битског протока
sr@latn: Računanje video bitskog protoka

source: Adjusted video bitrate to {video_bitrate} after vbr audio transcoding
ca: Taxa de bits de vídeo ajustada a {video_bitrate} després de codificar l'àudio VBR
de: Video-Bitrate wurde auf {video_bitrate} eingestellt, nach VBR Audio Transkodierung.
es: Tasa de bits de video ajustada a {video_bitrate} después de codificar el audio vbr
fr: Débit vidéo ajusté à {video_bitrate} après le transcodage audio à débit variable
it: Bitrate video aggiustato su {video_bitrate} copo la codifica audio vbr
sr: Битски проток видеа је подешен на {video_bitrate} после аудио VBR транскодирања
sr@latn: Bitski protok videa je podešen na {video_bitrate} posle audio VBR transkodiranja

source: Transcode multipass
ca: Codifica amb diverses passades
de: Transkodieren mit zwei Durchgängen
es: Codificar con varias pasada
fr: Transcodage multipasse
it: Codifica a molteplici passate
sr: Вишепролазно транскодирање
sr@latn: Višeprolazno transkodiranje

source: Transcode video
ca: Codifica el vídeo
de: Video Transkodieren
es: Codificar el video
fr: Transcodage de la vidéo
it: Codifica video
sr: Транскодирање видеа
sr@latn: Transkodiranje videa

source: chunk {chunk}
ca: part {chunk}
de: Block {chunk}
es: parte {chunk}
fr: tranche {chunk}
it: blocco {chunk}
sr: комад {chunk}
sr@latn: komad {chunk}

source: pass {pass}
ca: passada {pass}
de: Lauf {pass}
es: pasada {pass}
fr: passe {pass}
it: passaggio {pass}
sr: прелаз {pass}
sr@latn: prelaz {pass}

source: single pass
ca: una única passada
de: Einzellauf
es: una única pasada
fr: passe unique
it: singolo passaggio
sr: један прелаз
sr@latn: jedan prelaz

source: Merge audio
ca: Incorpora l'àudio
de: Audio hinzufügen
es: Incorporar el audio
fr: Fusion de l'audio
it: Unisco l'audio
sr: Састављање аудио
sr@latn: Sastavljanje audio

source: audio track #{nr}
ca: pista d'àudio #{nr}
de: Tonspur #{nr}
es: pista de audio #{nr}
fr: piste audio n°{nr}
it: traccia audio #{nr}
sr: аудио нумера #{nr}
sr@latn: audio numera #{nr}

source: Transcode & merge audio track
ca: Codifica i incorpora la pista d'àudio
de: Transkodieren und Audio hinzufügen
es: Codificando e incorporar la pista de audio
fr: Transcode et fusionne les pistes audio
it: Codifico ed unisco la traccia audio
sr: Транскодирај и састави аудио траке
sr@latn: Transkodiraj i sastavi audio trake

source: Add additional audio tracks
ca: Afegeix pistes d'àudio addicionals
de: Weitere Tonspuren hinzufügen
es: Añadir pistas de audio adicionales
fr: Ajout de pistes audio
it: Aggiunta tracce audio addizionali
sr: Додај још аудио трака
sr@latn: Dodaj još audio traka

source: Transcode audio
ca: Codifica l'àudio
de: Ton Transkodieren
es: Codificar el audio
fr: Transcodage audio
it: Codifico l'audio
sr: Аудио транскодирање
sr@latn: Audio transkodiranje

source: track #{nr}
ca: pista #{nr}
de: Spur #{nr}
es: pista #{nr}
fr: piste n°{nr}
it: traccia #{nr}
sr: трака бр. {nr}
sr@latn: traka br. {nr}

source: Multiplex MPEG
ca: Multiplexa MPEG
de: Multiplexe MPEG
es: Multiplexar MPEG
fr: Multiplexage MPEG
it: MPEG multiplex
sr: Мултиплексирање MPEG
sr@latn: Multipleksiranje MPEG

source: Split OGG
ca: Divideix OGG
de: OGG aufteilen
es: Dividir OGG
fr: Découper OGG
it: Dividi OGG
sr: Раздвоји OGG
sr@latn: Razdvoji OGG

source: Split AVI
ca: Divideix AVI
de: AVI aufteilen
es: Dividir AVI
fr: Découper AVI
it: Dividi AVI
sr: Раздвоји AVI
sr@latn: Razdvoji AVI

source: Grab subtitle images
ca: Captura imatges de subtítols
de: Untertitelbilder holen
es: Capturar imágenes de subtítulos.
fr: Capture des images de sous-titres
it: Cattura le immagini dei sottititoli
sr: Ухвати слике титла
sr@latn: Uhvati slike titla

source: Need IFO files in place. You must re-read TOC from DVD.
ca: Calen els fitxers IFO. Heu de rellegir la taula de contingut del DVD.
de: IFO Dateien werden benötigt. Sie müssen das Inhaltsverzeichnis der DVD erneut einlesen.
es: Se necesitan los archivos IFO. Relee la tabla de contenidos del DVD.
fr: Nécessite des fichiers IFO au bon endroit. Il faut relire la table des matières du DVD.
it: Ci devono essere i file IFO. Devi rileggere la TOC dal DVD.
sr: Потребни су IFO фајлови на месту. Морате поново прочитати TOC са DVD-а.
sr@latn: Potrebni su IFO fajlovi na mestu. Morate ponovo pročitati TOC sa DVD-a.

source: No splitted target files available. First transcode and split the movie.
ca: No hi ha fitxers dividits disponibles. Abans codifiqueu i dividiu la pel·lícula.
de: Keine aufgeteilten Zieldateien verfügbar. Bitte führen Sie zunächst das Transkodieren und Aufteilen durch.
es: No hay archivos divididos disponibles. Codifica y divide la película primero.
fr: Les fichiers encodés et découpés sont introuvables. Veuillez d'abord encoder et découper le film.
it: Non è disponibile alcun file risultato diviso. Prima codifica e dividi il film.
sr: Нема доступних подељених циљних фајлова. Прво кодирајте и раздвојите филм.
sr@latn: Nema dostupnih podeljenih ciljnih fajlova. Prvo kodirajte i razdvojite film.

source: Create vobsub files
ca: Crea fitxer vobsub
de: vobsub Dateien erstellen
es: Crear archivo vobsub
fr: Création des fichiers de sous-titres vobsub
it: Crea file vobsub
sr: Направи vobsub датотеке
sr@latn: Napravi vobsub datoteke

source: Extract PS1 streams from VOB
ca: Extreu els fluxos PS1 del VOB
de: Extrahiere PS1 Datenstrom von den VOB Dateien
es: Extraer los flujos PS1 del VOB
fr: Extraction des flux PS1 à partir du fichier VOB
it: Estrarre i flussi PS1 dal VOB
sr: Извлачење PS1 тока из VOBа
sr@latn: Izvlačenje PS1 toka iz VOBa

source: Splitted vobsub file generation
ca: Generació de fitxers vobsub dividits
de: Mehrteilige vobsub Dateierzeugung
es: Generación de archivos vobsub divididos
fr: Génération du fichier vobsub découpé
it: Generazione dei file vobsub divisi
sr: Раздвојено генерисање вобсуб датотека
sr@latn: Razdvojeno generisanje vobsub datoteka

source: Count frames of files
ca: Compta fotogrames dels fitxers
de: Zähle Frames der Dateien
es: Contar fotogramas de los archivos
fr: Compter le nombre de trames des fichiers
it: Conta il numero di fotogrammi dei file
sr: Изброј кадрове у датотекама
sr@latn: Izbroj kadrove u datotekama

source: File {file} has {frames} frames.
ca: El fitxer {file} té {frames} fotogrames.
de: Datei {file} hat {frames} Frames.
es: El archivo {file} tiene {frames} fotogramas.
fr: Le fichier {file} a {frames} images.
it: Il file {file} ha {frames} fotogrammi.
sr: Датотека: {file}, кадрова: {frames}.
sr@latn: Datoteka: {file}, kadrova: {frames}.

source: Single vobsub file generation
ca: Generació d'un fitxer vobsub únic
de: Einzeldatei vosub Erzeugung
es: Generación de un archivo vobsub único
fr: Génération du fichier vobsub unique
it: Generazione di un unico file vobsub
sr: Јединствено генерисање вобсуб датотеке
sr@latn: Jedinstveno generisanje vobsub datoteke

source: Extract PS1 stream from VOB
ca: Extreu el flux PS1 del VOB
de: Extrahiere PS1 Datenstrom von VOB Dateien
es: Extraer el flujo PS1 del VOB
fr: Extraction du flux PS1 à partir du fichier VOB
it: Estrazione dei flussi PS1 dal VOB
sr: Извлачење PS1 тока из VOBа
sr@latn: Izvlačenje PS1 toka iz VOBa

source: Set codec of audio track #{nr} to 'mp3', 'vorbis' not supported by AVI container
ca: El còdec de la pista d'àudio #{nr} s'ha canviat a 'mp3', el 'vorbis' no és compatible amb el contenidor AVI
de: Setze Codec von Tonspur #{nr} auf 'mp3', 'vorbis' wird von AVI nicht unterstützt
es: Codec de la pista de audio #{nr} cambiado a 'mp3', 'vorbis' no soportado por el contenedor AVI
fr: Format de compression audio de la piste n°{nr} mis à 'mp3' : 'vorbis' ne peut pas être inclus dans un conteneur AVI
it: Imposta la codifica della traccia audio #{nr} su 'mp3', 'vorbis' non è supportato da AVI
sr: Аудио кодек за траку бр. {nr} постављен на „mp3“, AVI контејнер не подржава „vorbis“
sr@latn: Audio kodek za traku br. {nr} postavljen na „mp3“, AVI kontejner ne podržava „vorbis“

source: Set codec of audio track #{nr} to 'mp3', 'mp2' not supported by AVI container
ca: El còdec de la pista d'àudio #{nr} s'ha canviat a 'mp3', el còdec 'mp2' no és compatible amb el contenidor AVI
de: Setze Codec von Tonspur #{nr} auf 'mp3', 'mp2' wird von AVI nicht unterstützt
es: Codec de la pista de audio #{nr} cambiado a 'mp3', 'mp2' no soportado por el contenedor AVI
fr: Format de compression de la piste audio n°{nr} mis à 'mp3' : 'mp2' ne peut pas être inclus dans un conteneur AVI
it: Imposta la codifica della traccia audio #{nr} su 'mp3', 'mp2' non è supportato da AVI
sr: Постави кодек за аудио нумеру #{nr} на „mp3“, AVI контејнер не подржава „mp2“
sr@latn: Postavi kodek za audio numeru #{nr} na „mp3“, AVI kontejner ne podržava „mp2“

source: Set video codec to 'xvid', '
ca: S'ha posat el còdec de vídeo a 'xvid', '
de: Setze Codec auf 'xvid', '
es: Codec de video puesto a 'xvid', '
fr: Format de compression vidéo mis à 'xvid' ; '
it: Imposta la codifica video su 'xvid', '
sr: Постави видео кодек на „xvid“, „
sr@latn: Postavi video kodek na „xvid“, „

source: ' not supported by AVI container
ca: ' no és compatible amb el contenidor AVI
de: ' wird nicht von AVI unterstützt
es: ' no soportado por el contenedor AVI
fr: ' ne peut pas être inclus dans un conteneur AVI
it: ' non è supportato da AVI
sr: ‟ AVI контејнер не подржава
sr@latn: ‟ AVI kontejner ne podržava

source: Set codec of audio track #{nr} to 'mp2', '
ca: El còdec de la pista d'àudio #{nr} s'ha posat a 'mp2', '
de: Setze Codec von Tonspur #{nr} auf 'mp2', '
es: Codec de la pista de audio #{nr} puesto a 'mp2', '
fr: Format de compression de la piste audio n°{nr} mis à 'mp2 ; '
it: Imposta la codifica della traccia audio #{nr} su 'mp2', '
sr: Постави кодек аудио нумере #{nr} на „mp2“, '
sr@latn: Postavi kodek audio numere #{nr} na „mp2“, '

source: ' not supported by MPEG container
ca: ' no és compatible amb el contenidor MPEG
de: ' wird von MPEG nicht unterstützt
es: ' no soportado por el contenedor MPEG
fr: ' ne peut pas être inclus dans un conteneur MPEG
it: ' non è supportato da MPEG
sr: ‟ не подржава OGG контејнер
sr@latn: ‟ ne podržava OGG kontejner

source: Set video codec to 'SVCD', '
ca: El còdec de vídeo s'ha posat a 'SVCD', '
de: Setze Video Codec auf 'SVCD', '
es: Codec de video puesto a 'SVCD', '
fr: Format de compression vidéo mis à 'SVCD' ; '
it: Imposta la codifica video su 'SVCD', '
sr: Постави видео кодек на „SVCD“, '
sr@latn: Postavi video kodek na „SVCD“, '

source: Set codec of audio track #{nr} to 'vorbis', '
ca: El còdec de la pista d'àudio #{nr} s'ha posat a 'vorbis', '
de: Setze Codec von Tonspur #{nr} auf 'vorbis', '
es: Codec de la pista de audio #{nr} puesto a 'vorbis', '
fr: Format de compression de la piste audio n°{nr} mis à 'vorbis' ; '
it: Imposta la codifica della traccia audio #{nr} su 'vorbis', '
sr: Постави кодек аудио нумере #{nr} на „vorbis“, '
sr@latn: Postavi kodek audio numere #{nr} na „vorbis“, '

source: ' not supported by OGG container
ca: ' no és compatible amb el contenidor OGG
de: ' wird von OGG nicht unterstützt
es: ' no soportado por el contenedor OGG
fr: ' n'est pas compatible avec OGG
it: ' non è supportato da OGG
sr: ‟ не подржава OGG контејнер
sr@latn: ‟ ne podržava OGG kontejner
