Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Choose a DVD title at any time here
ca: Escolliu aquí un títol de DVD en qualsevol moment
de: Hier können Sie jederzeit einen anderen DVD Titel auswählen
es: Elige un título de DVD en cualquier momento aquí
fr: Choisissez un titre DVD ici n'importe quand
it: Scegli qui un titolo del DVD in qualsiasi momento
sr: Одавде можете да изаберете наслов ДВДа
sr@latn: Odavde možete da izaberete naslov DVDa

source: File '{filename}' not found or not readable.
ca: El fitxer '{filename}' no s'ha trobat o no es pot llegir.
de: Datei '{filename}' nicht gefunden oder nicht lesbar.
es: El archivo '{filename}' no se encuentra o no se puede leer.
fr: Fichier '{filename}' introuvable ou en lecture seule
it: Il file '{filename}' non è stato trovato o non è leggibile.
sr: Фајл „{filename}“ није пронађен или није читљив.
sr@latn: Fajl „{filename}“ nije pronađen ili nije čitljiv.

source: Save project: choose filename
ca: Desa projecte: escolliu un nom de fitxer
de: Projekt speichern: Dateiname wählen
es: Guardar proyecto: elige un nombre de archivo
fr: Enregistrement du projet : choisissez un nom de fichier
it: Salva Progetto: scegli il nome del file
sr: Чување пројекта: изаберите име датотеке
sr@latn: Čuvanje projekta: izaberite ime datoteke

source: Project {name} created
ca: S'ha creat el projecte {name}.
de: Projekt {name} wurde angelegt
es: Proyecto {name} creado
fr: Projet {name} créé
it: Progetto {name} creato
sr: Направљен је пројекат „{name}‟
sr@latn: Napravljen je projekat „{name}‟

source: Do you want to save this project first?
ca: Voleu desar abans aquest projecte?
de: Soll die Projektdatei vorher gespeichert werden?
es: ¿Desea guardar primero este proyecto?
fr: Voulez-vous d'abord enregistrer ce projet ?
it: Vuoi prima salvare questo progetto?
sr: Да ли прво желите да запамтите овај пројекат?
sr@latn: Da li prvo želite da zapamtite ovaj projekat?

source: This is the first time you start dvd::rip. The Preferences dialog was opened automatically for you. Please review the settings, in particular the default DVD device and your data base directory. Point it to a directory with sufficient diskspace of at least 10 GB for full DVD copies.
ca: Aquest és el primer cop que inicieu el dvd::rip. Se us ha obert automàticament el diàleg de Preferències. Reviseu les configuracions, en particular la unitat de DVD predeterminada i el directori base de dades. Assigneu un directori amb espai de disc suficient d'almenys 10 GB per a còpies de DVD completes.
de: Sie starten dvd::rip zum ersten Mal. Der Voreinstellungen Dialog wurde automatisch geöffnet. Bitte überprüfen Sie die Einstellungen, vor allem das Standard DVD Gerät und das Standarddatenverzeichnis. Dieses sollte mindestens 10 GB freien Speicher für vollständige DVD Kopien haben.
es: Es la primera vez que inicias dvd::rip. Se te ha abierto automáticamente el diálogo Preferencias. Por favor revisa las configuraciones, en particular la unidad de DVD predeterminada y tu directorio base de datos. Asigna un directorio con espacio de disco suficiente de al menos 10 GB para copias de DVD completas.
it: Questa è la prima volta che fai partire dvd::rip. La finestra di Impostazioni è stata aperta automaticamente. Per favore controlla le impostazioni, in particolare il dispositivo DVD predefinito e la directory di base per il salvataggio dei dati. Falla puntare ad una directory con spazio sufficiente, con almeno 10 GB liberi per le copie di DVD interi.
sr: Ово је први пут да сте покренули двд::рип. Прозор са поставкама је аутоматски отворен. Молимо да прегледате подешавања, посебно подразумевани ДВД уређај и директоријум са базом података. Изаберите директоријум на диску са пуно места или бар 10GB за копије целих ДВД дискова.
sr@latn: Ovo je prvi put da ste pokrenuli dvd::rip. Prozor sa postavkama je automatski otvoren. Molimo da pregledate podešavanja, posebno podrazumevani DVD uređaj i direktorijum sa bazom podataka. Izaberite direktorijum na disku sa puno mesta ili bar 10GB za kopije celih DVD diskova.

source: Probe Command: ==============
ca: Ordre d'exploració: =======================
de: Analyse Befehl: ===============
es: Comando de exploración: =======================
fr: >>>> Commande d'exploration :
it: Comando Sonda: ==============
sr: Наредба за тражење: ==============
sr@latn: Naredba za traženje: ==============

source: Rip Command: ============
ca: Ordre d'extracció: ======================
de: Rip Befehl: ===========
es: Comando de extracción: ======================
fr: >>>> Commande d'extraction :
it: Comando Estrai: ============
sr: Наредба за чупање: ============
sr@latn: Naredba za čupanje: ============

source: Scan Command: ============
ca: Ordre d'escanejat: ===================
de: Scan Befehl: ============
es: Comando de escaneo: ===================
fr: >>>> Commande de scan :
it: Comando Esamina: ============
sr: Наредба за претрагу: ============
sr@latn: Naredba za pretragu: ============

source: Grab Preview Image Command: ===========================
ca: Ordre de captura de previsualització: =======================================
de: Vorschaubild Holen Befehl: ==========================
es: Comando de captura de previsualización: =======================================
fr: >>>> Commande d'aperçu de la capture d'image :
it: Comando Acquisisci Immagine d'Anteprima: ====================================
sr: Наредба за хватање прелиминарне слике: ===========================
sr@latn: Naredba za hvatanje preliminarne slike: ===========================

source: You must first rip the selected title to see this command.
ca: Abans heu d'extreure el títol seleccionat per veure aquesta ordre.
de: Zunächst muss der ausgewählte Titel kopiert werden, um diesen Befehl zu sehen.
es: Primero debes extraer el título seleccionado para ver este comando.
fr: Vous devez d'abord extraire le titre sélectionné pour voir cette commande.
it: Devi estrarre il titolo selezionato prima di poter utilizzare questo comando.
sr: Прво морате ишчупати изабрани наслов да бисте видели ову команду.
sr@latn: Prvo morate iščupati izabrani naslov da biste videli ovu komandu.

source: Transcode Command: ==================
ca: Ordre de codificació: ========================
de: Befehle zum Transkodieren: ==========================
es: Comando de codificación: ========================
fr: >>>> Commande Transcode :
it: Comando Transcode: ===================
sr: Наредба за кодирање: ==================
sr@latn: Naredba za kodiranje: ==================

source: Additional audio tracks commands: ============================
ca: Ordre de pistes d'àudio addicionals: ========================================
de: Befehle für zusätzliche Tonspuren: ===================================
es: Comandos de pistas de audio adicionales: ========================================
fr: >>>> Commandes additionnelles pour les pistes audio :
it: Comandi addizionali delle tracce audio: ===============================
sr: Команде за додатне аудио нумере: ============================
sr@latn: Komande za dodatne audio numere: ============================

source: View DVD Command: =================
ca: Ordre de visualització del DVD: =================================
de: Befehl zum Ansehen einer DVD: =============================
es: Comando de visualización del DVD: =================================
fr: >>>> Commande de lecture du DVD :
it: Comando vedi DVD: =================
sr: Наредба за приказ DVD-а: =================
sr@latn: Naredba za prikaz DVD-a: =================

source: View Files Command: ===================
ca: Ordre de visualització de fitxers: =====================================
de: Befehl zum Ansehen einer Videodatei: =====================================
es: Comando de visualización de archivos: =====================================
fr: >>>> Commande de lecture des fichiers :
it: Comando vedi file: ===================
sr: Наредба за приказ фајлова: ===================
sr@latn: Naredba za prikaz fajlova: ===================

source: CD image creation command: ========================
ca: Ordre de creació d'imatge de CD: ====================================
de: Befehl zur Erstellung des CD Images: ====================================
es: Comando de creación de imagen de CD: ====================================
fr: Commande de création de l'image ISO du CD :
it: Comando per la creazione dell'immagine CD: ==================================
sr: Наредба за прављење CD слике: ========================
sr@latn: Naredba za pravljenje CD slike: ========================

source: CD burning command: ==================
ca: Ordre de gravació de CD: ===========================
de: Befehl zum CD Brennen: ======================
es: Comando de grabación de CD: ===========================
fr: >>>> Commande de gravure du CD :
it: Comando di masterizzazione CD: ==========================
sr: Наредба за нарезивање CD-а: ==================
sr@latn: Naredba za narezivanje CD-a: ==================

source: WAV creation command: ====================
ca: Ordre de creació de WAV: ===========================
de: Befehl zur WAV Erzeugung: ===========================
es: Comando de creación de WAV: ===========================
fr: >>>> Commande de création des fichiers WAV:
it: Comando di creazione WAV: ======================
sr: Наредба за прављење WAV-а: ====================
sr@latn: Naredba za pravljenje WAV-a: ====================

source: Commands executed by dvd::rip
ca: Ordres a executar pel dvd::rip
de: Befehle, die von dvd::rip ausgeführt werden
es: Comandos ejecutados por dvd::rip
fr: Commandes exécutées par dvd::rip
it: Comandi eseguiti da dvd::rip
sr: Наредбе које извршава двд::рип
sr@latn: Naredbe koje izvršava dvd::rip

source: One or several mandatory tools are missing or too old. You must install them before you can proceed with dvd::rip.
ca: Manquen una o diverses eines obligatòries o bé són massa antigues. Heu d'instal·lar-les abans d'usar el dvd::rip.
de: Ein oder mehrere notwengige Programme fehlen oder sind zu alt. Sie müssen diese installieren, bevor Sie mit dvd::rip fortfahren können.
es: Una o varias herramientas obligatorias faltan o son demasiado viejas. Debes instalarlas antes de usar dvd::rip.
fr: Un ou plusieurs outils indispensables sont absents ou trop anciens. Vous devez les installer avant d'utiliser dvd::rip.
it: Uno o più programmi obbligatori sono mancanti o troppo vecchi. Devi installarli prima di procedere con dvd::rip.
sr: Један или више обавезних алата недостаје или је превише стар. Морате их инсталирати пре него што наставите са dvd::rip-ом.
sr@latn: Jedan ili više obaveznih alata nedostaje ili je previše star. Morate ih instalirati pre nego što nastavite sa dvd::rip-om.

source: Container options
ca: Opcions de contenidor
de: Container Einstellungen
es: Opciones de contenedor
fr: Conteneur
it: Opzioni del contenitore
sr: Опције складишта
sr@latn: Opcije skladišta

source: Select container
ca: Selecciona contenidor
de: Container Format
es: Selecciona contenedor
fr: Format du conteneur
it: Seleziona contenitore
sr: Изаберите складиште
sr@latn: Izaberite skladište

source: Video options
ca: Opcions de vídeo
de: Video Einstellungen
es: Opciones de video
fr: Vidéo
it: Opzioni video
sr: Видео опције
sr@latn: Video opcije

source: Video codec
ca: Còdec de vídeo
es: Codec de video
fr: Format de compression
it: Codec video
sr: Видео кодек
sr@latn: Video kodek

source: Choose a video codec here. If you don't find the codec you want in the list, just enter its transcode name by hand
ca: Escolliu aquí un còdec de vídeo. Si no trobeu a la llista el còdec que voleu, introduïu el seu nom en 'transcode' a mà.
de: Wählen Sie einen Video Codec aus. Wenn der gewünschte Codec nicht aufgelistet wird, so können Sie den Namen auch per Hand eingeben.
es: Elige un codec de video aquí. Si no encuentras el codec que quieres en la lista, sólo introduce su nombre en trasncode a mano
fr: Choisissez un codec video ici. Si vous ne trouvez pas ce que vous voulez,entrez vous-même son nom transcode
it: Scegli un codec video. Se non trovi il codec che cerchi nella lista, inserisci manualmente il suo nome come richiesto da transcode
sr: Овде изаберите видео кодек. Ако не нађете у списку кодек који Вам треба, унесите његово име ручно.
sr@latn: Ovde izaberite video kodek. Ako ne nađete u spisku kodek koji Vam treba, unesite njegovo ime ručno.

source: Configure...
ca: Configura...
de: Konfigurieren...
es: Configurar...
fr: Configurer...
it: Configura...
sr: Подеси...
sr@latn: Podesi...

source: The xvid4 video codec may be configured in detail if you have the xvid4conf utility installed
ca: El còdec de vídeo xvid4 es pot configurar detalladament si teniu instal·lada la utilitat xvid4conf.
de: Der xvid4 Video Codec kann im Detail konfiguriert werden. Hierzu wird das externe Programm xvid4conf aufgerufen
es: El codec de video xvid4 puede configurarse en detalle si tienes instalada la utilidad xvid4conf
fr: Le codec video xvid4 peut être configuré en détail si l'utilitaire xvid4conf est installé
it: Il codec video xvid4 può essere configurato in dettaglio se hai installato l'utility xvid4conf
sr: Видео кодек xvid4 може се детаљно подешавати ако имате постављен програм xvid4conf
sr@latn: Video kodek xvid4 može se detaljno podešavati ako imate postavljen program xvid4conf

source: ffmpeg/af6 codec
ca: Còdec ffmpeg/af6
es: codec ffmpeg/af6
fr: codec ffmpeg/af6
sr: кодек за ffmpeg/af6
sr@latn: kodek za ffmpeg/af6

source: Some transcode video export modules support multiple video codecs, e.g. the ffmpeg module. Enter the name of the video codec the module should use here
ca: Alguns mòduls d'exportació de vídeo del transcode admeten nombrosos còdecs de vídeo, com per ex., el mòdul ffmpeg. Introduïu el nom del còdec de vídeo que el mòdul hauria d'usar.
de: Einige transcode Video Export Module unterstützen mehrere Video Codecs, z.B.das ffmpeg Modul. Der Name des zu verwendenden Codecs wird hier eingetragen
es: Algunos módulos de exportación de video de transcode soportan múltiples codecs de video, e.g. el módulo ffmpeg. Introduce el nombre del codec de video que el módulo debería usar
fr: Certains modules d'export vidéo de transcode prennent en charge plusieurs codecs,comme le module ffmpeg. Tapez le nom du codec vidéo que le module doit utiliser
it: Alcuni moduli per l'esportazione video di transcode supportano diversi codec video, ad esempio il modulo ffmpeg. Inserisci il nome del codec video che il modulodovrebbe utilizzare
sr: Неки модули за видео извоз програма transcode подржавају вишеструке видео кодеке, попут модула ffmpeg. Унесите овде име видео кодека које модул треба да користи
sr@latn: Neki moduli za video izvoz programa transcode podržavaju višestruke video kodeke, poput modula ffmpeg. Unesite ovde ime video kodeka koje modul treba da koristi

source: Keyframes
ca: Fotogrames clau
es: Fotogramas clave
fr: Trames clés
sr: Кључни кадрови
sr@latn: Ključni kadrovi

source: This setting controls the number of frames after which a keyframe should be inserted into the video stream. The lower this value the better the quality, but filesize may increase as well
ca: Controla el nombre de fotogrames després del qual s'hauria d'inserir un fotograma clau en el flux de vídeo. Com més petit sigui aquest valor, millor serà la qualitat, però la mida del fitxer també augmentarà.
de: Hiermit wird festgelegt nach wievielen Frames ein Keyframe in den Videostrom eingefügt werden soll. Je niedriger der Wert desto besser die Qualität, aber die Dateigröße kann entsprechend ansteigen
es: Controla el número de fotogramas después del cual se debería insertar un fotograma clave en el flujo de video. Cuanto menor es este valor, mayor calidad pero el tamaño del archivo también aumenta
fr: Ce réglage contrôle le nombre de trames après lesquelles une trame clé doit être insérée.Plus il est bas, meilleure est la qualité mais plus grande est la taille finale du fichier.
it: Queste impostazioni controllano dopo quanti fotogrammi debba essere inserito un keyframe nel flusso video. Più il valore è basso, maggiore sarà la qualità, ma la grandezzo del file potrebbe aumentare di conseguenza
sr: Ово подешавање управља бројем кадрова после ког се кључни кадар убацује у видео ток. Што је ова вредност нижа, квалитет је бољи али се величина датотеке повећава
sr@latn: Ovo podešavanje upravlja brojem kadrova posle kog se ključni kadar ubacuje u video tok. Što je ova vrednost niža, kvalitet je bolji ali se veličina datoteke povećava

source: Video framerate
ca: Veloc. d'imatge
de: Video Bildrate
es: Tasa de video
fr: Images par seconde
it: Framerate video
sr: Брзина кадрирања видеа
sr@latn: Brzina kadriranja videa

source: This is the video framerate of this movie. Only change this if transcode detected the framerate wrong, which may happen sometimes. If you want true framerate conversion check out the Filters dialog, which provides some video filters for this task
ca: Això és la velocitat de fotogrames de vídeo d'aquesta pel·lícula. Canvieu-la només si el transcode l'ha detectada malament, cosa que pot succeir algun cop. Si desitgeu una autèntica conversió de velocitat de vídeo examineu el diàleg de Filtres, que proporciona alguns filtres de vídeo per a aquesta tasca.
de: Das ist die Bildwiederholrate des Films. Dieser Wert sollte nur geändert werden, wenn die Rate von transcode falsch ermittelt wurde. Für echte Umrechnung in eine andere Bildwiederholrate gibt es eigene Transcode Filter, die über den Filterdialog aktiviert werden können.
es: La tasa de fotogramas de video de esta película. Cambialo sólo si transcode detectó mal la tasa de video, lo que puede ocurrir a veces. Si quieres una verdadera conversión de tasa de video comprueba el diálogo de Filtros, que proporciona algunos filtros de video para esta tarea
fr: Ceci est le nombre d'image par sec de ce film. Ne le changez que si transcode l'a maldétecté, ce qui peut parfois arriver. Si vous souhaitez réellement modifier le nombre d'imagespar sec, vérifiez la fenêtre des filtres, celle-ci fournit des filtres vidéo appropriés.
it: Questo è il framerate video. Modifica questo valore solo se transcode ha sbagliato nel rilevarlo, a volte può accadere. Se vuoi una vera conversione del framerate, controlla la sezione Filtri la quale fornisce alcuni filtri video per questo lavoro
sr: Ово је брзина кадрирања за филм. Промените ово само ако је transcode погрешно препознао кадрирање, што се понекад може десити. Ако желите праву конверзију кадрирања, погледајте прозор Филтери, који обезбеђује неке видео филтере за ту сврху
sr@latn: Ovo je brzina kadriranja za film. Promenite ovo samo ako je transcode pogrešno prepoznao kadriranje, što se ponekad može desiti. Ako želite pravu konverziju kadriranja, pogledajte prozor Filteri, koji obezbeđuje neke video filtere za tu svrhu

source: 2-pass encoding
ca: Codif. en 2 passades
de: Zwei Durchläufe
es: Hacer 2 pasadas
fr: Encodage en 2 passes
it: Codifica a 2 passate
sr: Кодирање са два пролаза
sr@latn: Kodiranje sa dva prolaza

source: 2-pass encoding increases video quality and video bitrate accuracy significantly. But the whole transcoding needs nearly twice the time. It's strongly recommended to use 2-pass encoding whenever possible.
ca: La codificació en 2 passades augmenta la qualitat del vídeo així com la precisió de la taxa de bis del vídeo significativament. Però tot el procés requereix gairebé el doble de temps. Es recomana l'ús de la codificació en 2 passades quan sigui possible.
de: 2-Pass Kodierung erhöht die Videoqualität und Bitratenbestimmungsignifikant. Allerdings wird der Film hierfür quasi 2x transkodiert,d.h. der Vorgang dauert doppelt so lange. Es ist jedoch empfohlen, stets mit 2-Pass Kodierung zu arbeiten
es: La codificación en 2 pasadas incrementa la calidad del video y la precisión de la tasa de bits de video significativamente. Pero el proceso entero requiere casi el doble de tiempo. Es muy recomendable usar la codificación en 2 pasadas cuando sea posible.
fr: L'encodage en 2 passes augmente la qualité et affine le débit vidéo de manière signficative,mais il double quasiment le temps de transcodage complet.Il est fortement recommandé d'effectuer les 2 passes dans la majorité des cas.
it: La codifica a due passate aumenta significativamente la qualità del video e l'accuratezzo del bitrate video. Il processo di codifica necessita quasi del doppio del tempo. E` caldamente raccomandato di utilizzare la codifica a due passate ogni volta che sia possibile.
sr: Двопролазно кодирање значајно повећава квалитет излаза и тачност битског протока. Али укупан процес транскодирања онда траје скоро двапут дуже. Препоручује се употреба двопролазног кодирања кад год је могуће.
sr@latn: Dvoprolazno kodiranje značajno povećava kvalitet izlaza i tačnost bitskog protoka. Ali ukupan proces transkodiranja onda traje skoro dvaput duže. Preporučuje se upotreba dvoprolaznog kodiranja kad god je moguće.

source: Reuse log
ca: Reutilitza el registre
de: Log wiederverw.
es: Reutilizar registro
fr: Réutiliser le Log
it: Riutilizza file di log
sr: Поново искористи дневник
sr@latn: Ponovo iskoristi dnevnik

source: During the first pass of a 2-pass transcoding a logfile with statistic information about the movie is written. If you didn't change any parameters affecting the video you may reuse this logfile for subsequent transcodings by activating this button. dvd::rip will skip the first pass saving much time.
ca: Durant la primera passada d'una codificació en 2 passades s'escriu un fitxer amb informació estadística sobre la pel·lícula. Si no canvieu cap paràmetre que afecti el vídeo, podreu reutilitzar aquest registre per a properes codificacions tot activant aquesta opció. El dvd::rip se saltarà la primera passada estalviant així molt temps.
de: Während der ersten Phase einer 2-Pass Transkodierung wird eine Logdatei mit statistischen Informationen erzeugt. Wenn keinerlei Einstellungen das Videobild betreffend geändert wurden (z.B. nur Audio-Einstellungen), so kann die erste Phase übersprungen werden, was natürlich viel Zeit spart.
es: Durante la primera pasada de una codificación en 2 pasadas se escribe un fichero de registro con información estadísticas sobre la película. Si no cambión ningún parámetro que afecte al video puedes reutilizar este registropara próximas codificaciones activando esta opción. dvd::rip se saltará la primera pasada ahorrando mucho tiempo.
fr: Pendant la 1ère passe d'un transcodage à 2 passes, un fichier de statistiques est écrit.Si vous ne modifiez aucun paramètre affectant la vidéo, vous pouvez réutiliser ce fichier pour les transcodages ultérieurs en activant ce bouton. dvd::rip sautera la 1ère passe etéconomisera beaucoup de temps.
it: Durante la prima passata di una codifica a due passate viene scritto un file di log contenente statistiche su come il filmato è scritto. Se non hai modificato alcun parametro riguardante il video potresti riutilizzare questo file di log per le codifiche successive attivando questa opzione. dvd::rip salterà la prima passata risparmiando molto tempo.
sr: Током првог пролаза двопролазног транскодирања, записује се датотека са статистичким подацима о филму. Ако нисте променили параметре који утичу на видео, ову датотеку можете користити за каснија транскодирања избором овог дугмета. Двд::рип ће прескочити први пролаз штедећи тако доста времена.
sr@latn: Tokom prvog prolaza dvoprolaznog transkodiranja, zapisuje se datoteka sa statističkim podacima o filmu. Ako niste promenili parametre koji utiču na video, ovu datoteku možete koristiti za kasnija transkodiranja izborom ovog dugmeta. Dvd::rip će preskočiti prvi prolaz štedeći tako dosta vremena.
