Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Set video codec to 'xvid', MPEG not supported by OGG container
ca: El còdec de vídeo s'ha posat a 'xvid', MPEG no és compatible amb el contenidor OGG
de: Setze Video Codec auf 'xvid', MPEG wird von OGG nicht unterstützt
es: Codec de video puesto a 'xvid', MPEG no soportado por el contenedor OGG
fr: Format de compression vidéo mis à 'xvid' ; (S)VCD/CVD ne peut pas être inclus dans un conteneur OGG
it: Imposta la codifica video su 'xvid', MPEG non è supportato da OGG
sr: Постави видео кодек на „xvid“, OGG не подржава (S)VCD/CVD
sr@latn: Postavi video kodek na „xvid“, OGG ne podržava (S)VCD/CVD

source: Chp
ca: Caps.
de: Kap
es: Cap
fr: Chap.
it: Cap
sr: Пог
sr@latn: Pog

source: Aud
ca: Àud.
fr: Audio
sr: Ауд

source: frames
ca: fotogrames
es: fotogramas
fr: images
it: fotogrammi
sr: кадрова
sr@latn: kadrova

source: Can't mkpath directory '{dir}'
ca: No es pot crear el directori '{dir}'
de: Kann Pfad des Verzeichnisses '{dir}' nicht anlegen
es: No puedo crear el directorio '{dir}'
fr: Impossible de créer le dossier '{dir}' (avec mkpath)
it: Non posso stabilire il percorso della directory '{dir}'
sr: Не могу да извршим mkpath за директоријум „{dir}“
sr@latn: Ne mogu da izvršim mkpath za direktorijum „{dir}“

source: Width isn't even.
ca: L'amplada no és parell.
de: Breite ist keine gerade Zahl
es: La anchura no es par.
fr: La largeur n'est pas paire.
it: La larghezza non è un numero pari.
sr: Ширина није парна.
sr@latn: Širina nije parna.

source: Width is not divisible by 16.
ca: L'amplada no és divisible per 16.
de: Breite ist nicht durch 16 teilbar.
es: La anchura no es divisible por 16.
fr: La largeur n'est pas divisible par 16
it: La larghezza non è divisibile per 16.
sr: Ширина није дељива са 16.
sr@latn: Širina nije deljiva sa 16.

source: Height isn't even.
ca: L'alçària no és parell.
de: Höhe ist keine gerade Zahl.
es: La altura no es par.
fr: La hauteur n'est pas paire.
it: L'altezza non è un numero pari.
sr: Висина није парна.
sr@latn: Visina nije parna.

source: Height is not divisible by 16.
ca: L'alçària no és divisible per 16.
de: Höhe ist nicht durch 16 teilbar.
es: La altura no es divisible por 16.
fr: La hauteur n'est pas divisible par 16.
it: L'altezza non è divisibile per 16.
sr: Висина није дељива са 16.
sr@latn: Visina nije deljiva sa 16.

source: Settings Ok
ca: Configuracions correctes
de: Einstellungen Ok
es: Configuraciones correctas
fr: Réglages OK
it: Impostazioni OK
sr: Подешавања су у реду
sr@latn: Podešavanja su u redu

source: After 1st clipping
ca: Després del 1r retall
de: Nach 1. Beschnitt
es: Después del 1er recorte
fr: 1er découpage
it: Dopo il primo clipping
sr: После првог сечења
sr@latn: Posle prvog sečenja

source: After 2nd clipping
ca: Després del 2n retall
de: Nach 2. Beschnitt
es: Después del 2º recorte
fr: 2ème découpage
it: Dopo il secondo clipping
sr: После другог сечења
sr@latn: Posle drugog sečenja

source: After zoom
ca: Després del zoom
de: Nach Skalierung
es: Después del zoom
fr: zoom
it: Dopo l'ingrandimento
sr: После увећања
sr@latn: Posle uvećanja

source: Eff. ratio: <b>{eff}</b>, phys. ratio: <b>{phys}</b>
ca: R.A. efec.: <b>{eff}</b>, R.A. física: <b>{phys}</b>
es: Tasa efec.: <b>{eff}</b>, tasa física: <b>{phys}</b>
fr: Rapport effect. : <b>{eff}</b>, rapport phys. : <b>{phys}</b>
it: Rapporto effettivo: <b>{eff}</b>, rapporto fisico: <b>{phys}</b>
sr: Ефективни однос: <b>{eff}</b>, физички однос: <b>{phys}</b>
sr@latn: Efektivni odnos: <b>{eff}</b>, fizički odnos: <b>{phys}</b>

source: Can't read VOB navigation file '{filename}'
ca: No es pot llegir el fitxer de navegació VOB '{filename}'
de: Kann VOB Navigationsdatei '{filename}' nicht lesen
es: No puedo leer el archivo de navegación VOB '{filename}'
fr: Impossible de lire le fichier de navigation VOB '{filename}'
it: Non posso leggere il file di navigazione VOB '{filename}'
sr: Не могу да прочитам VOB навигациони фајл „{filename}“
sr@latn: Ne mogu da pročitam VOB navigacioni fajl „{filename}“

source: Program stream units calculated
ca: Unitats de flux de programa calculades
de: PSUs berechnet
es: Unidades de flujo de programa calculadas
fr: Unités de flux de programme calculés
it: Sono state calcolate le PSU
sr: Израчунате јединице тока програма
sr@latn: Izračunate jedinice toka programa

source: invalid parameter for frame_size ('{frame_size}')
ca: Paràmetre no vàlid per a mida de fotograma ('{frame_size}')
de: Ungültiger Parameter für frame_size ('{frame_size}')
es: Parámetro no válido para tamaño de fotograma ('{frame_size}')
fr: paramètre invalide pour frame_size ('{frame_size}')
it: il parametro per la dimensione_fotogramma ('{frame_size}') non è valido
sr: неисправан параметар за величину кадра („{frame_size}“)
sr@latn: neispravan parametar za veličinu kadra („{frame_size}“)

source: Can't read VOB navigation file '{vob_nav_file}'
ca: No es pot llegir el fitxer de navegació VOB '{vob_nav_file}'
de: Kann VOB Navigationsdatei '{vob_nav_file}' nicht lesen
es: No puedo leer el archivo de navegación VOB '{vob_nav_file}'
fr: Impossible de lire le fichier de navigation VOB '{vob_nav_file}'
it: Non posso leggere il file di navigazione VOB '{vob_nav_file}'
sr: Не могу да прочитам VOB навигациони фајл „{vob_nav_file}“
sr@latn: Ne mogu da pročitam VOB navigacioni fajl „{vob_nav_file}“

source: Enabled PSU core. Movie is NTSC and has more than one PSU.
ca: S'ha activat nucli PSU. La pel·lícula és NTSC i té més d'una PSU (program stream unit).
de: PSU Core wurde eingeschaltet. Der Film ist NTSC und hat mehr als eine PSU.
es: Núcleo PSU activado. La película es NTSC y tiene más de una PSU.
fr: PSU core activé. Le film est en NTSC et possède plus d'un PSU.
it: Il nucleo PSU è stato abilitato. Il film è di tipo NTSC ed ha più di una PSU.
sr: Укључено PSU језгро. Филм је NTSC и има више од једног PSU-а.
sr@latn: Uključeno PSU jezgro. Film je NTSC i ima više od jednog PSU-a.

source: Not enabling PSU core, because this movie has only one PSU.
ca: No s'activa nucli PSU, perquè aquesta pel·lícula només té una PSU (program stream unit).
de: Schalte PSU Core nicht ein, weil der Film nur eine PSU hat.
es: No se activa el núcleo PSU, porque esta película sólo tiene una PSU.
fr: Désactivation du PSU core, car ce film n'a qu'un PSU.
it: Non abilito il sistema PSU perchè questo film ha solo una PSU.
sr: Не укључујем PSU језгро, зато што овај филм има само један PSU.
sr@latn: Ne uključujem PSU jezgro, zato što ovaj film ima samo jedan PSU.

source: When using fast resize: Clip1 and Zoom size must be divisible by {multiple_of}
ca: En usar redimensionat ràpid: la mida de Retall 1 i la de Zoom han de ser divisibles per {multiple_of}
de: Wenn die Schnellskalierung verwendet wird, müssen 1. Beschnitt und die Zoom Größe teilbar sein durch {multiple_of}
es: Cuando usar redimensionado rápido: Recorte 1 y Zoom deben ser divisibles por {multiple_of}
fr: Pour le redimensionnement rapide : les tailles du découpage n°1 et du zoom doivent être divisibles par {multiple_of}
it: Quando viene usato il ridimensionamento veloce: Clip1 e Zoom devono essere divisibili per {multiple_of}
sr: Када користите брзо мењање величине: Исечак 1 у величина увећања морају бити дељиви са {multiple_of}
sr@latn: Kada koristite brzo menjanje veličine: Isečak 1 u veličina uvećanja moraju biti deljivi sa {multiple_of}

source: When using fast resize: Width and height must both shrink or expand
ca: En usar redimensionat ràpid: tant l'amplada com l'alçària han d'encongir-se o bé expandir-se.
de: Bei Schnellskalierung: Höhe und Breite müssen beide kleiner oder beide größer werden
es: Cuando usar redimensionado rápido: Tanto la anchura como la altura deben encogerse o expandirse.
fr: Pour le redimensionnement rapide : la hauteur et la largeur doivent en même temps réduire ou étendre
it: Quando viene usato il ridimensionamento veloce: larghezza ed altezza devono essere entrambe ridotte o espanse
sr: Када користите брзо мењање величине: И ширина и висина морају да се скупљају или проширују
sr@latn: Kada koristite brzo menjanje veličine: I širina i visina moraju da se skupljaju ili proširuju

source: Fast VOB navigation only available for ripped DVD's, falling back to slow method.
ca: La navegació rapida de VOB només està disponible per a DVD extrets, s'està tornant al mètode lent.
de: Schnelle VOB Navigation nur möglich bei DVDs, die auf die Festplatte kopiert wurden.Benutze langsame Methode.
es: La navegación de VOB rápida sólo está disponible para DVD extraídos, volviendo al método lento.
fr: La navigation VOB rapide n'est disponible que pour les DVD extraits. Retour à la méthode lente.
it: La navigazione VOB veloce è disponibile solo per i DVD già estratti, per cui ritorno alla modalità lenta.
sr: Брза VOB навигација је могућа само за ишчупане DVD-ове, враћам се на спори метод.
sr@latn: Brza VOB navigacija je moguća samo za iščupane DVD-ove, vraćam se na spori metod.

source: VOB navigation file is missing. Slow navigation method used.
ca: Manca el fitxer de navegació VOB. S'usarà el mètode de navegació lent.
de: VOB Navigationsdatei fehlt. Langsame Methode wird verwendet.
es: Falta el archivo de navegación VOB. Se usará el método de navegación lento.
fr: Le fichier de navigation VOB est absent. La méthode lente est utilisée.
it: Il file di navigazione VOB è mancante. Verrà usato il metodo di navigazione lenta.
sr: VOB навигациони фајл недостаје. Користи се метод за спору навигацију.
sr@latn: VOB navigacioni fajl nedostaje. Koristi se metod za sporu navigaciju.

source: Using slow preview grabbing as adviced by user
ca: S'està usant la captura lenta de previsualització com ha aconsellat l'usuari
de: Verwende langsame Methode zur Vorschaugenerierung, wie vorgegeben.
es: Usando captura lenta de previsualización como aconsejó el usuario
fr: Utilisation de la capture de prévisualisation lente, comme demandée
it: Usa la cattura lenta dell'anteprima come suggerito dall'utente
sr: Користи се спора добавка прегледа, према упутству корисника
sr@latn: Koristi se spora dobavka pregleda, prema uputstvu korisnika

source: VOB navigation file '{vob_nav_file}' is corrupted.
ca: El fitxer de navegació VOB '{vob_nav_file}' és corrupte.
de: VOB Navigationsdatei '{vob_nav_file}' ist fehlerhaft.
es: El archivo de navegación VOB '{vob_nav_file}' está corrupto.
fr: Le fichier de navigation VOB '{vob_nav_file}' est corrompu.
it: Il file di navigazione VOB '{vob_nav_file}' è corrotto.
sr: VOB навигациони фајл „{vob_nav_file}“ није исправан.
sr@latn: VOB navigacioni fajl „{vob_nav_file}“ nije ispravan.

source: Can't find frame {frame} in VOB navigation file '{vob_nav_file}' (which has only {frames} frames).
ca: No es pot trobar el fotograma {frame} en el fitxer de navegació VOB '{vob_nav_file}' (que només té {frames} fotogrames).
de: Konnte Frame {frame} in VOB Navigationsdatei '{vob_nav_file}' nicht finden. Die Datei hat nur {frames} Frames.
es: No puedo encontrar el fotograma {frame} en el archivo de navegación VOB '{vob_nav_file}' (que sólo tiene {frames} fotogramas).
fr: Impossible de trouver l'image {frame} dans le fichier de navigation VOB '{vob_nav_file}' (qui n'a que {frames} images).
it: Non posso trovare il fotogramma {frame} nel file di navigazione VOB '{vob_nav_file}' (che ha solo {frames} fotogrammi).
sr: Не могу да пронађем кадар {frame} у VOB навигационом фајлу „{vob_nav_file}“ (који има само {frames} кадрова).
sr@latn: Ne mogu da pronađem kadar {frame} u VOB navigacionom fajlu „{vob_nav_file}“ (koji ima samo {frames} kadrova).

source: You first have to transcode this title.
ca: Abans heu de codificar aquest títol.
de: Der Titel muss zunächst transkodiert werden.
es: Primero tienes que codificar este título.
fr: Vous devez d'abord encoder ce titre.
it: Devi prima codificare questo titolo.
sr: Прво морате да кодирате овај наслов.
sr@latn: Prvo morate da kodirate ovaj naslov.

source: No files for image creation selected.
ca: No hi ha fitxers seleccionats per crear la imatge.
de: Keine Dateien für Image Erzeugung ausgewählt.
es: No hay archivos seleccionados para crear la imagen.
fr: Aucun fichier sélectionné pour la création d'images.
it: Non è stato selezionato alcun file per la creazione di un'immagine.
sr: Нема изабраних фајлова за прављење слике.
sr@latn: Nema izabranih fajlova za pravljenje slike.

source: No burn files selected.
ca: No hi ha fitxers seleccionats per gravar.
de: Keine Dateien zum Brennen ausgewählt.
es: No hay archivos seleccionados para grabar.
fr: Aucun fichier sélectionné pour la gravure.
it: Non è stato selezionato nessun file da masterizzare.
sr: Нема изабраних фајлова за нарезивање.
sr@latn: Nema izabranih fajlova za narezivanje.

source: File is already an CD image.
ca: El fitxer ja és una imatge de CD.
de: Datei ist bereite ein CD Image.
es: El archivo ya es una imagen de CD.
fr: Le fichier est déja une image de CD.
it: Il file è già un'immagine CD.
sr: Фајл је већ CD слика.
sr@latn: Fajl je već CD slika.

source: Can't burn (S)VCD on the fly
ca: No es pot gravar el (S)VCD al vol
de: Kann (S)VCD nicht on-the-fly brennen
es: No se puede grabar (S)VCD al vuelo
fr: Impossible de graver des (S)VCD à la volée
it: Non posso masterizzare (S)VCD al volo
sr: Не могу да нарезујем (S)VCD-ове у лету
sr@latn: Ne mogu da narezujem (S)VCD-ove u letu

source: No files for burning selected.
ca: No hi ha fitxers seleccionats per gravar.
de: Keine Dateien zum Brennen ausgewählt.
es: No hay archivos seleccionados para grabar.
fr: Aucun fichier sélectionné pour la gravure.
it: Nessun file è stato selezionato per essere masterizzato.
sr: Нема изабраних фајлова за нарезивање.
sr@latn: Nema izabranih fajlova za narezivanje.

source: No subtitle selected
ca: No hi ha subtítols seleccionats
de: Keine Untertitel ausgewählt.
es: No hay subtítulos seleccionados
fr: Aucun sous-titre sélectionné
it: Nessun sottotitolo è stato selezionato
sr: Није изабран титл
sr@latn: Nije izabran titl

source: Your frame size isn't conform to the standard, which is {should_width}x{should_height} for {codec}/{mode}, but you configured {width}x{height}.
ca: La mida de fotograma no s'ajusta a l'estàndard, que és {should_width}x{should_height} per a {codec}/{mode}, però heu configurat {width}x{height}.
de: Die Bildgröße ist nicht standardkonform. Richtig wäre {should_width}x{should_height} bei {codec}/{mode}, aber Sie haben {width}x{height} eingestellt.
es: El tamaño de fotograma no se ajusta al estándar, que es {should_width}x{should_height} para {codec}/{mode}, pero has configurado {width}x{height}.
fr: La taille de l'image n'est pas conforme au standard, qui est {should_width}x{should_height} pour {codec}/{mode}, alors que vous avez configuré {width}x{height}.
it: La dimensione del tuo fotogramma non è conforme allo standard, che è {should_width}x{should_height} per {codec}/{mode}, ma tu hai configurato {width}x{height}.
sr: Ваша величина кадра се не поклапа са стандардом, који је {should_width}x{should_height} за {codec}/{mode}, али сте Ви подесили {width}x{height}.
sr@latn: Vaša veličina kadra se ne poklapa sa standardom, koji je {should_width}x{should_height} za {codec}/{mode}, ali ste Vi podesili {width}x{height}.

source: 2nd clipping parameters can only be moved to 1st clipping parameters, if 1st clipping is not defined.
ca: Els paràmetres del 2n retall només es poden moure cap als del 1r si el 1r no està definit.
de: 2. Beschnitt kann nur zu 1. Beschnitt transformiert werden, wenn beim 1. Beschnitt keine Einstellungen vorgenommen wurden.
es: Los parámetros del 2º recorte sólo se pueden mover a los del 1º si el 1º no está definido.
fr: Les paramètres du 2ème découpage ne peuvent être appliqués au 1er découpage que si ce dernier n'est pas défini.
it: I parametri del secondo clipping possono solo essere spostati a quelli del primo unicamente se il primo non è stato definito.
sr: Параметри другог сечења се могу преместити у параметре првог сечења само ако прво сечење није дефинисано.
sr@latn: Parametri drugog sečenja se mogu premestiti u parametre prvog sečenja samo ako prvo sečenje nije definisano.

source: Default DVD device
ca: Unitat de DVD predeterminada
de: Standard DVD Gerät
es: Unidad de DVD predeterminada
fr: Périphérique DVD par défaut
it: Dispositivo DVD di default
sr: Подразумевани ДВД уређај
sr@latn: Podrazumevani DVD uređaj

source: Eject Command
ca: Ordre d'expulsió
de: Auswurf Befehl
es: Comando de expulsión
fr: Commande d'éjection
it: Comando di espulsione
sr: Наредба за избацивање
sr@latn: Naredba za izbacivanje

source: DVD player command
ca: Ordre de reproducció de DVD
de: DVD Abspielbefehl
es: Comando de reproducción de DVD
fr: Commande de lecture DVD
it: Comando del riproduttore per i DVD
sr: Наредба DVD плејера
sr@latn: Naredba DVD plejera

source: File player command
ca: Ordre de reproducció de fitxer
de: Datei Abspielbefehl
es: Comando de reproducción de archivo
fr: Commande de lecture de fichiers
it: Comando del riproduttore per i file
sr: Наредба фајл плејера
sr@latn: Naredba fajl plejera

source: STDIN player command
ca: Ordre de reproducció de STDIN
de: STDIN Abspielbefehl
es: Comando de reproducción de STDIN
fr: Commande lecture STDIN
it: Comando del riproduttore per STDIN
sr: Наредба STDIN плејера
sr@latn: Naredba STDIN plejera

source: rar command (for vobsub compression)
ca: Ordre rar (per a la compressió de vobsub)
de: rar Befehl (für vobsub Komprimierung)
es: Comando rar (para compresión de vobsub)
fr: Commande rar (pour la compression vobsub)
it: Comando rar (per la compressione vobsub)
sr: rar наредба (за vobsub компресију)
sr@latn: rar naredba (za vobsub kompresiju)

source: Default data base directory
ca: Directori predeterminat de dades
de: Standarddatenverzeichnis
es: Directorio base de datos por defecto
fr: Dossier par défaut des données
it: Directory prestabilita per il salvataggio dei dati
sr: Подразумевани директоријум за базу података
sr@latn: Podrazumevani direktorijum za bazu podataka

source: Default directory for .rip project files
ca: Directori predet. per a fitxers de projecte .rip
de: Standardverzeichnis für Projektdateien
es: Directorio para archivos de proyecto .rip por defecto
fr: Dossier par défault des fichiers projet .rip
it: Directory prestabilita per i file di progetto .rip
sr: Подразумевани директоријум за .rip фајлове пројекта
sr@latn: Podrazumevani direktorijum za .rip fajlove projekta

source: OGG file extension
ca: Extensió dels fitxers OGG
de: OGG Dateiendung
es: Extensión de archivos OGG
fr: Extension des fichiers OGG
it: Estensione dei file OGG
sr: Наставак за OGG фајлове
sr@latn: Nastavak za OGG fajlove

source: Start cluster control daemon locally
ca: Inicia dimoni de control del clúster localment
de: Starte Cluster Control Daemon lokal
es: Iniciar demonio de control del cluster localmente
fr: Démarrer le contrôleur du cluster localement
it: Avvia localmente il demone di controllo del cluster
sr: Покрени демон за контролу скупине локално
sr@latn: Pokreni demon za kontrolu skupine lokalno

source: Hostname of server with daemon
ca: Nom del servidor que executa el dimoni
de: Name des Servers mit dem Daemon
es: Nombre del servidor ejecutando el demonio
fr: Nom de machine du serveur avec contrôleur
it: Nome host del server con il demone
sr: Име домаћина сервера са демоном
sr@latn: Ime domaćina servera sa demonom

source: TCP port number of daemon
ca: Port TCP del dimoni
de: TCP Port Nummer des Daemons
es: Puerto TCP del demonio
fr: N° de port TCP du contrôleur
it: Porta TCP del demone
sr: Број TCP порта демона
sr@latn: Broj TCP porta demona

source: Default video codec
ca: Còdec predeterminat de vídeo
de: Standard Video Codec
es: Codec de video por defecto
fr: Format de compression par défaut
it: Codifica video prestabilita
sr: Подразумевани видео кодек
sr@latn: Podrazumevani video kodek

source: Default container format
ca: Format predeterminat de contenidor
de: Standard Container Format
es: Formato de contenedor por defecto
fr: Conteneur vidéo par défaut
it: Formato prestabilito del contenitore
sr: Подразумевани формат складишта
sr@latn: Podrazumevani format skladišta

source: Default BPP value
ca: Valor predeterminat de BPP
de: Default BPP Wert
es: Valor de BPP por defecto
fr: Pourcentage BPP par défaut
it: Valore BPP (bit per pixel) prestabilito
sr: Подразумевана вредност за BPP (бита по пикселу)
sr@latn: Podrazumevana vrednost za BPP (bita po pikselu)

source: If this option is set dvd::rip automatically calculates the video bitrate using this BPP value
ca: Si s'activa aquesta opció, el dvd::rip calcula automàticament la taxa de bits de vídeo usant aquest valor de BPP
de: Wenn diese Option gesetzt ist, so wird die Video Bitrate per Default nach diesem BPP (Bits Per Pixel) Wert berechnet
es: Si se activa está opción dvd::rip automáticamente calcula la tasa de bits de video usando este valor de BPP
fr: Si cette option est spécifiée, dvd::rip calcule automatiquement le débit vidéo à partir de cette valeur
it: Se questa opzione è selezionata dvd::rip calcola automaticamente il bitrate del video utilizzando questo valore BPP
sr: Ако је ова опција постављена, двд::рип аутоматски рачуна битски проток употребом ове вредности за BPP
sr@latn: Ako je ova opcija postavljena, dvd::rip automatski računa bitski protok upotrebom ove vrednosti za BPP

source: Grab subtitles while ripping
ca: Captura de subtítols durant l'extracció
de: Untertitelbilder beim Kopieren erstellen
es: Capturar subtítulos durante la extracción.
fr: Capture des sous-titres pendant l'extraction
it: Cattura le immagini dei sottititoli durante l'estrazione
sr: Сачувај титлове при риповању
sr@latn: Sačuvaj titlove pri ripovanju

source: Grab all subtitles
ca: Captura tots els subtítols
de: Alle Untertitelbilder holen
es: Capturar todos los subtítulos.
fr: Capture de tous les sous-titres
it: Cattura tutti i sottititoli
sr: Сачувај титлове
sr@latn: Sačuvaj titlove

source: Grab subtitles of preferred language
ca: Captura subtítols de l'idioma preferit
de: Untertitelbilder der bevorzugten Sprache kopieren
es: Capturar subtítulos del Idioma preferido
fr: Capture des sous-titres de la langue préférée
it: Cattura le immagini dei sottotitoli solo per lingue specifiche
sr: Сачувај титлове на изабраном језику
sr@latn: Sačuvaj titlove na izabranom jeziku

source: Don't grab subtitles
ca: No capturis subtítols
de: Keine Untertitel kopieren
es: No capturar subtítulos.
fr: Pas de capture des sous-titres
it: Non catturare i sottititoli
sr: Не хватај титлове
sr@latn: Ne hvataj titlove

source: Default Clip & Zoom preset
ca: Retallat i zoom predeterminats
de: Default Clip & Zoom Vorlage

source: Preferred language
ca: Idioma preferit
de: Bevorzugte DVD Sprache
es: Idioma preferido
fr: Langue préférée
it: Linguaggio preferito
sr: Пожељни језик
sr@latn: Poželjni jezik

source: Workaround transcode NPTL bugs
ca: Eludeix els errors NPTL del transcode
de: Umgehe transcode NPTL Fehler
es: Solución temporal a los errores NPTL de transcode
fr: Contourner les bogues de transcode liés à la NPTL
it: Aggira i problemi NPTL di transcode
sr: Премости грешке у NPTLу
sr@latn: Premosti greške u NPTLu

source: Set LD_ASSUME_KERNEL to
ca: Fixa LD_ASSUME_KERNEL a
de: Setze LD_ASSUME_KERNEL auf
es: Establecer LD_ASSUME_KERNEL a
fr: LD_ASSUME_KERNEL réglé à
it: Imposta LD_ASSUME_KERNEL su
sr: Постави LD_ASSUME_KERNEL на
sr@latn: Postavi LD_ASSUME_KERNEL na

source: Optimize layout for small screens
ca: Optimitza la presentació per a pantalles petites
de: Oberfläche für kleinen Bildschirm optimieren
