Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Specify whether on this node runs the cluster control daemon. In that case no ssh remote command execution is neccessary
ca: Especifiqueu si aquest node executa el dimoni de control de clúster. En aquest cas no caldrà executar cap ordre remota ssh.
de: Geben Sie an ob auf diesem Knoten den dvd::rip Cluster Kontroll Daemon läuft. In diesem Fall ist keine Kommunikation über SSH notwendig
es: Especificar si este nodo ejecuta el demonio de control de cluster. En ese caso no es necesario ningún comando remoto ssh
fr: Précisez si ce noeud fait fonctionner le contrôleur du cluster. Dans ce cas aucune commande distante par ssh n'est nécessaire
it: Specifica se su questo nodo sarà eseguito il demone di controllo del cluster. In questo caso non è necessaria l'esecuzione di comandi remoti via ssh
sr: Одредите да ли се на овом чвору покреће демон за контролу јата. У том случају, није потребно извршавати команде удаљено помоћу sshа.
sr@latn: Odredite da li se na ovom čvoru pokreće demon za kontrolu jata. U tom slučaju, nije potrebno izvršavati komande udaljeno pomoću ssha.

source: Username to connect with ssh
ca: Nom d'usuari per connectar amb ssh
de: Benutzername für die Verbindungsaufnahme via SSH
es: Nombre de usuario para conectar con ssh
fr: Nom d'utilisateur pour la connexion ssh
it: Nome utente ssh
sr: Корсничко име за повезивање кроз ssh
sr@latn: Korsničko ime za povezivanje kroz ssh

source: You need to setup passwordless authorization via ~/.ssh/authorized_keys for this user from the master server to the node
ca: Necessiteu configurar l'autorització sense contrasenya via ~/.ssh/authorized_keys per a aquest usuari des del servidor mestre al node.
de: Es ist notwendig mittels ~/.ssh/authorized_keys eine passwortlose Authentifizierung für diesen Benutzer zu konfigurieren, so dass Prozesse vom Master Cluster Daemon ohne Benutzerinteraktion über SSH ausgeführt werden können.
es: Necesitas configurar autorización sin contraseña via ~/.ssh/authorized_keys para este usuario desde el servidor maestro al nodo
fr: Vous devez permettre à cet utilisateur de se connecter sans mot de passe depuis le serveur maître vers le noeud (grâce à ~/.ssh/authorized_keys)
it: Devi impostare l'autorizzazione senza password per questo utente dal server principale al nodo utilizzando ~/.ssh/authorized_keys
sr: Треба да подесите ауторизацију без лозинке употребом ~/.ssh/authorized_keys за овог корисника са главног сервера на чвор
sr@latn: Treba da podesite autorizaciju bez lozinke upotrebom ~/.ssh/authorized_keys za ovog korisnika sa glavnog servera na čvor

source: SSH command and options
ca: Ordre i opcions de SSH
de: SSH Befehl und Optionen
es: Comando y opciones de SSH
fr: commande et options SSH
it: Comando e opzioni SSH
sr: Команда SSH и подешавања
sr@latn: Komanda SSH i podešavanja

source: Usually you leave this empty (defaults to 'ssh -x'), but if your setup needs special ssh options you may edit them here
ca: Normalment deixeu això buit (predeterminat a 'ssh -x'), però si la configuració requereix opcions de ssh especials, podeu editar-les aquí.
de: Diese Optionen werden zusätzlich an den SSH Befehl übergeben. Normalerweise muss hier nichts eingetragen werden.
es: Normalmente dejas esto vacío (predeterminado a 'ssh -x'), pero si tu configuración necesita opciones de ssh especiales, puedes editarlas aquí
fr: Habituellement vide (par défaut : 'ssh -x'), mais si votre configuration nécessite des options spéciales pour ssh, tapez-les ici
it: Di solito puoi lasciarlo vuoto (prestabilito 'ssh -x'), ma se le tue impostazioni hanno bisogno di opzioni particolari per ssh puoi inserirle qui
sr: Ова се опција обично не користи (подразумева се „ssh -x‟), алил ако ваша подешавања траже посебне опције за ssh, овде их можете унети
sr@latn: Ova se opcija obično ne koristi (podrazumeva se „ssh -x‟), alil ako vaša podešavanja traže posebne opcije za ssh, ovde ih možete uneti

source: Test settings
ca: Prova configuracions
de: Einstellungen testen
es: Probar configuraciones
fr: Tester les réglages
it: Impostazioni del test
sr: Провера подешавања
sr@latn: Provera podešavanja

source: This triggers a simple test connection to the node, checking file permissions, transcode versions etc.
ca: Això realitza una connexió de prova al node, comprovant permisos de fitxer, versions del transcode, etc.
de: Hiermit wird eine Testverbindung zum Knoten aufgebaut und der Dateizugriff geprüft, sowie die transcode Version etc.
es: Realiza una conexión de prueba al nodo, comprobando permisos de archivo, versiones de transcode, etc.
fr: Ceci déclenche a simple test de connexion vers le noeud, et vérifie les permissions, la version de transcode, etc.
it: Questo inizia una semplice connessione di test verso il nodo, controllando i permessi dei file, la versione di transcode ecc.
sr: Ово покреће просту везу за тестирање чвора, проверу права приступа датотекама, проверу издања програма transcode итд.
sr@latn: Ovo pokreće prostu vezu za testiranje čvora, proveru prava pristupa datotekama, proveru izdanja programa transcode itd.

source: Node test results
ca: Resultats de la comprovació del node
de: Testergebnisse
es: Resultados de la comprobación del nodo
fr: Résultats des tests du noeud
it: Risultati dei test del nodo
sr: Резултати провере чвора
sr@latn: Rezultati provere čvora

source: Test
ca: Prova
es: Prueba
sr: Провера
sr@latn: Provera

source: Result
ca: Resultat
de: Ergebnis
es: Resultado
fr: Résultat
it: Risultato
sr: Резултат
sr@latn: Rezultat

source: Details
ca: Detalls
es: Detalles
fr: Détail
it: Dettagli
sr: Детаљи
sr@latn: Detalji

source: SSH connection
ca: Connexió SSH
de: SSH Verbindung
es: Conexión SSH
fr: Connexion SSH
it: Connessione SSH
sr: SSH веза
sr@latn: SSH veza

source: Data directory
ca: Directori de dades
de: Datenverzeichnis
es: Directorio de datos
fr: Dossier de données
it: Directory dei dati
sr: Директоријум са подацима
sr@latn: Direktorijum sa podacima

source: Write access
ca: Accés d'escriptura
de: Schreibzugriff
es: Acceso de escritura
fr: Accès en écriture
it: Accesso in scrittura
sr: Приступ за упис
sr@latn: Pristup za upis

source: Program versions
ca: Estat del progrés
de: Programmversionen
es: Versiones de programas

source: No details available
ca: No hi ha detalls disponibles
de: Keine Details verfügbar
es: No hay detalles disponibles
fr: Aucun détail disponible
it: Nessun dettaglio disponibile
sr: Детаљи нису доступни
sr@latn: Detalji nisu dostupni

source: Not tested, no SSH connection!
ca: No s'ha comprovat, no hi ha connexió SSH!
de: Nicht getestet, keine SSH Verbindung!
es: No comprobado, ¡no hay conexión SSH!
fr: Non testé, pas connexion SSH !
it: Non testato, nessuna connessione SSH!
sr: Није тестирано, нема SSH везе!
sr@latn: Nije testirano, nema SSH veze!

source: OK
ca: Bé
es: Bien
sr: У реду
sr@latn: U redu

source: NOT OK
ca: Error
de: NICHT OK
es: Mal
fr: ERREUR
it: NON OK
sr: НИЈЕ У РЕДУ
sr@latn: NIJE U REDU

source: Master can connect to node
ca: El mestre pot connectar al node
de: Master kann Verbindung mit Knoten herstellen
es: El maestro puede conectar al nodo
fr: Le maître peut se connecter au noeud
it: Il nodo principale può connettersi al nodo
sr: Главни рачунар не може да се повеже на чвор
sr@latn: Glavni računar ne može da se poveže na čvor

source: Empty
ca: Buit
de: Leer
es: Vacío
fr: Vide
it: Vuoto
sr: Празно
sr@latn: Prazno

source: Node's data directory
ca: Directori de dades del node
de: Datenverzeichnis des Knotens
es: Directorio de datos del nodo
fr: Dossier de données du noeud
it: Directory dei dati del nodo
sr: Чворов директоријум са подацима
sr@latn: Čvorov direktorijum sa podacima

source: Masters' data directory
ca: Directori de dades del mestre
de: Datenverzeichnis des Masters
es: Directorio de datos de los maestros

source: Content of data directory matches
ca: El contingut dels directoris de dades és igual
de: Inhalt des Datenverzeichnisses stimmt überein
es: El contenido de los directorios de datos es igual
fr: Le contenu du dossier de données correspond
it: Il contenuto della directory dei dati corrisponde
sr: Садржај директоријума са подацима се поклапа
sr@latn: Sadržaj direktorijuma sa podacima se poklapa

source: Node's programs
ca: Programes del node
de: Programme des Knotens
es: Transcode del nodo

source: Masters's programs
ca: Programes del mestre
de: Programme des Masters
es: Transcode de los maestros

source: Node can write to data directory
ca: El node pot escriure en el directori de dades
de: Knoten kann ins Datenverzeichnis schreiben
es: El nodo puede escribir al directorio de datos
fr: Le noeud peut écrire dans le dossier de données
it: Il nodo può scrivere sulla directory dei dati
sr: Чвор може да уписује у директоријум с подацима
sr@latn: Čvor može da upisuje u direktorijum s podacima

source: Can't execute tests:
ca: No s'han pogut executar les proves:
de: Konnte Tests nicht ausführen:
es: No se pudo ejecutar las pruebas:
fr: Tests impossibles :
it: Non posso eseguire i test:
sr: Није могуће проверити:
sr@latn: Nije moguće proveriti:

source: ssh connect
ca: Connexió SSH
de: SSH Verbindung
es: Conexión SSH

source: Content of project base directory
ca: Contingut del directori del projecte
de: Inhalt des Datenverzeichnisses
es: Contenido del directorio base del proyecto

source: Project base directory writable
ca: El directori del projecte és escribible
de: Datenverzeichnis ist beschreibbar
es: Directorio base del proyecto escribible

source: transcode version match
ca: La versió del transcode és la mateixa
de: transcode Versionen passen
es: Versiones de transcode iguales

source: All tests successful
ca: Totes les proves s'han realitzat amb èxit
de: Alle Tests waren erfolgreich
es: Todas las pruebas realizadas con éxito
fr: Tous les tests sont réussis
it: Tutti i test completati con successo
sr: Сви тестови су у реду
sr@latn: Svi testovi su u redu

source: Brief report
ca: Informe resumit
de: Kurz-Report
es: Informe resumido
fr: Rapport résumé
it: Resoconto breve
sr: Кратак извештај
sr@latn: Kratak izveštaj

source: Detailed report
ca: Informe detallat
de: Detaillierter Report
es: Informe detallado
fr: Rapport détaillé
it: Resoconto dettagliato
sr: Детаљан извештај
sr@latn: Detaljan izveštaj

source: dvd::rip - Edit cluster project
ca: dvd::rip - Edita projecte de clúster
de: dvd::rip - Cluster Projekt bearbeiten
es: dvd::rip - Editar proyecto de cluster
fr: dvd::rip - Modifier le cluster
it: dvd::rip - Modifica il progetto cluster
sr: двд::рип - Уређивање ројних пројеката
sr@latn: dvd::rip - Uređivanje rojnih projekata

source: Edit cluster project properties
ca: Edita propietats del projecte de clúster
de: Cluster Projekt Eigenschaften bearbeiten
es: Editar propiedades del proyecto de cluster
fr: Modifier les propriétés du cluster
it: Modifica le proprietà del progetto cluster
sr: Уређивање особина ројног пројекта
sr@latn: Uređivanje osobina rojnog projekta

source: Project
ca: Projecte
de: Projekt
es: Proyecto
fr: Projet
it: Progetto
sr: Пројекат
sr@latn: Projekat

source: Number of frames per chunk
ca: Nombre de fotogrames per part
de: Anzahl der Frames pro Block
es: Número de fotogramas por parte
fr: Nombre de trames par tranche
it: Numero di fotogrammi per blocco
sr: Број кадрова по комаду
sr@latn: Broj kadrova po komadu

source: The smaller the chunks the higher the parallelism, but overall bitrate distribution may suffer if set too low
ca: Com més petites siguin les parts, més gran és el paral·lelisme, però la distribució de la taxa de bits global pot resultar perjudicada si es fixa massa baix.
de: Je kleiner die Blockgröße desto höher die Parallelität. Allerdings kann die Videobitratenverteilung darunter leiden, wenn die Blockgröße zu klein gewählt wird
es: Cuanto más pequeñas las partes mayor es el paralelismo, pero la distribución de la tasa de bits global puede sufrir si es demasiado bajo
fr: Le parallélisme croît quand la taille des tranches diminue, mais la répartition générale du débit peut en pâtir
it: Più piccoli saranno i blocchi, più alto sarà il parallelismo, ma la distribuzione globale del bitrate potrebbe diminuire se il valore è troppo basso
sr: Што су делови мањи, паралелизам је већи, али укупни битски проток може да трпи ако је подешавање премало.
sr@latn: Što su delovi manji, paralelizam je veći, ali ukupni bitski protok može da trpi ako je podešavanje premalo.

source: Cleanup temporary files after merging?
ca: Esborro els fitxers temporals després d'incorporar?
de: Temporäre Dateien nach Zusammenfügen löschen?
es: ¿Borrar los archivos temporales después de incorporar?
fr: Nettoyer les fichiers temporaires après la fusion ?
it: Eliminare i file temporanei dopo l'unione?
sr: Да ли треба уклонити привремене датотеке после спајања?
sr@latn: Da li treba ukloniti privremene datoteke posle spajanja?

source: Cleanup original VOB files when finished?
ca: Esborro els fitxers VOB originals en acabar?
de: Original VOB Dateien am Ende löschen?
es: ¿Borrar los archivos VOB originales cuando se termine?
fr: Nettoyer les fichiers VOB originaux à la fin ?
it: Eliminare i fle VOB originali al termine?
sr: Уклањање VOB датотека по крају посла?
sr@latn: Uklanjanje VOB datoteka po kraju posla?

source: dvd::rip - Cluster Control
ca: dvd::rip - Control del clúster
de: dvd::rip - Cluster Kontrolle
es: dvd::rip - Control del Cluster
fr: dvd::rip - Contrôle du cluster
it: dvd::rip - Controllo del cluster
sr: двд::рип - Управљање ројем
sr@latn: dvd::rip - Upravljanje rojem

source: _File
ca: _Fitxer
de: _Datei
es: _Archivo
fr: _Fichier
sr: _Датотека
sr@latn: _Datoteka

source: _Close window
ca: _Tanca finestra
de: Fenster _schließen
es: _Cerrar ventana
fr: _Fermer la fenêtre
it: _Chiudi finestra
sr: _Затвори прозор
sr@latn: _Zatvori prozor

source: _Master
ca: _Mestre
es: _Maestro
fr: _Maître
it: Cluster nodo _Principale
sr: _Главни
sr@latn: _Glavni

source: _Connect Master Daemon
ca: _Connecta al dimoni mestre
de: _Verbindung zum Master Daemon aufbauen
es: _Conectar al Demonio Maestro
fr: _Connecter le contrôleur maître
it: _Connetti il demone principale
sr: _Прикључи главни демон
sr@latn: _Priključi glavni demon

source: _Disconnect from Master Daemon
ca: _Desconnecta del dimoni mestre
de: Verbindung zum Master Daemon _beenden
es: _Desconectar del Demonio Maestro
fr: _Déconnecter le contrôleur maître
it: _Disconnetti dal demone principale
sr: _Искључи са главног демона
sr@latn: _Isključi sa glavnog demona

source: Shutdown Master Daemon
ca: Tanca el dimoni mestre
de: Master Daemon stoppen
es: Apagar el Demonio Maestro
fr: Stopper le contrôleur maître
it: Ferma demone principale
sr: Угаси главни демон
sr@latn: Ugasi glavni demon

source: _Add node
ca: _Afegeix node
de: Knoten _hinzufügen
es: _Añadir nodo
fr: _Ajouter un noeud
it: _Aggiungi Nodo
sr: _Додај чвор
sr@latn: _Dodaj čvor

source: _Edit node
ca: _Edita node
de: Knoten _bearbeiten
es: _Editar nodo
fr: _Éditer le noeud
it: _Modifica Nodo
sr: _Уреди чвор
sr@latn: _Uredi čvor

source: _Start node
ca: _Inicia node
de: Knoten s_tarten
es: _Iniciar nodo
fr: _Démarrer le noeud
it: A_vvia Nodo
sr: _Покрени чвор
sr@latn: _Pokreni čvor

source: Sto_p node
ca: A_tura node
de: Knoten an_halten
es: _Parar nodo
fr: _Stopper le noeud
it: _Ferma nodo
sr: _Заустави чвор
sr@latn: _Zaustavi čvor

source: _Remove node
ca: Es_borra node
de: Knoten ent_fernen
es: _Borrar nodo
fr: _Retirer le noeud
it: _Rimuovi nodo
sr: _Уклони чвор
sr@latn: _Ukloni čvor

source: _Project
ca: _Projecte
de: _Projekt
es: _Proyecto
fr: _Projet
it: _Progetto
sr: _Пројекат
sr@latn: _Projekat

source: _Edit project
ca: _Edita projecte
de: Projekt b_earbeiten
es: _Editar proyecto
fr: _Editer le projet
it: _Modifica progetto
sr: _Уреди пројекат
sr@latn: _Uredi projekat

source: _Start project
ca: _Inicia projecte
de: Projekt _starten
es: _Iniciar proyecto
fr: _Démarrer un projet.
it: _Salva progetto
sr: П_окрени пројекат
sr@latn: P_okreni projekat

source: _Cancel project
ca: _Cancel·la projecte
de: Projekt _abbrechen
es: _Cancelar proyecto
fr: _Annuler le projet.
it: A_nnulla progetto
sr: Отка_жи пројекат
sr@latn: Otka_ži projekat

source: Res_tart project
ca: _Reinicia projecte
de: Projekt _neu starten
es: _Reiniciar proyecto
fr: Redé_marrer le projet
it: _Riavvia progetto
sr: По_нови пројекат
sr@latn: Po_novi projekat

source: _Remove project
ca: Es_borra projecte
de: Projekt ent_fernen
es: _Borrar proyecto
fr: _Retirer le projet
it: R_imuovi progetto
sr: _Уклони пројекат
sr@latn: _Ukloni projekat

source: Project queue
ca: Cua de projectes
de: Projekt Warteschlange
es: Cola de proyectos
fr: File d'attente des projets
it: Coda Progetto
sr: Ред пројекта
sr@latn: Red projekta

source: Number
ca: Número
de: Nummer
es: Número
fr: Numéro
it: Numero
sr: Број
sr@latn: Broj

source: State
ca: Estat
de: Zustand
es: Estado
fr: État
it: Status
sr: Стање
sr@latn: Stanje

source: Progress
ca: Progrés
de: Fortschritt
es: Progreso
fr: État d'avancement
it: Progresso
sr: Напредак
sr@latn: Napredak

source: Edit project
ca: Edita projecte
de: Projekt bearbeiten
es: Editar proyecto
fr: Modifier le projet
it: Modifica progetto
sr: Уреди пројекат
sr@latn: Uredi projekat

source: Start project
ca: Inicia projecte
de: Projekt starten
es: Iniciar proyecto
fr: Démarrer le projet.
it: A_vvia progetto
sr: Покрени пројекат
sr@latn: Pokreni projekat

source: Cancel project
ca: Cancel·la projecte
de: Projekt abbrechen
es: Cancelar proyecto
fr: Annuler le projet.
it: A_nnulla progetto
sr: Откажи пројекат
sr@latn: Otkaži projekat

source: Restart project
ca: Reinicia projecte
de: Projekt neu starten
es: Reiniciar proyecto
fr: Redémarrer le projet.
it: Riavvia progetto
sr: Понови пројекат
sr@latn: Ponovi projekat

source: Remove project
ca: Esborra projecte
de: Projekt entfernen
es: Borrar proyecto
fr: Retirer le projet
it: Rimuovi progetto
sr: Уклони пројекат
sr@latn: Ukloni projekat

source: Job running status
ca: Estat d'execució de tasques
de: Job Status
es: Estado de ejecución de trabajos
fr: État des travaux actifs
it: Stato del lavoro attuale
sr: Статус извршавања послова
sr@latn: Status izvršavanja poslova

source: Registered Nodes
ca: Nodes registrats
de: Angemeldete Knoten
es: Nodos registrados
fr: Noeuds inscrits
it: Nodi registrati
sr: Регистровани чворови
sr@latn: Registrovani čvorovi

source: Job
ca: Tasca
es: Trabajo
fr: Tâche
it: Lavoro
sr: Посао
sr@latn: Posao

source: Add node
ca: Afegeix node
de: Knoten hinzufügen
es: Añadir nodo

source: Edit node
ca: Edita node
de: Knoten bearbeiten
es: Editar nodo
fr: Éditer le noeud
it: Modifica Nodo
sr: Уреди чвор
sr@latn: Uredi čvor

source: Start node
ca: Inicia node
de: Knoten starten
es: Iniciar nodo
fr: Démarrer le noeud
it: Avvia Nodo
sr: Покрени чвор
sr@latn: Pokreni čvor

source: Stop node
ca: Atura node
de: Knoten stoppen
es: Parar nodo
fr: Stopper le noeud
it: Ferma Nodo
sr: Заустави чвор
sr@latn: Zaustavi čvor

source: Cluster control daemon log output
ca: Sortida del registre del dimoni de control del clúster
de: Cluster Daemon Log Ausgaben
es: Salida de registro del demonio de control del cluster
fr: Journal de sortie du contrôleur du cluster
it: Log del demone di controllo del cluster
sr: Преглед дневника контролног демона
sr@latn: Pregled dnevnika kontrolnog demona

source: You must first configure a cluster control daemon in the Preferences dialog.
ca: Abans heu de configurar un dimoni de control de clúster en el diàleg de Preferències.
de: Bitte konfigurieren Sie zunächst den Cluster Control Daemon im Voreinstellungen Dialog.
es: Primero debes configurar un demonio de control de cluster en el diálogo de Preferencias.
fr: Vous devez d'abord configurer le contrôleur du cluster dans les préférences
it: Devi prima configurare un demone di controllo del cluster nel dialogo delle Preferenze.
sr: Прво морате подесити демон за контролу скупине у прозору „Поставке“.
sr@latn: Prvo morate podesiti demon za kontrolu skupine u prozoru „Postavke“.

source: Can't connect to master daemon on {server}:{port}.
ca: No es pot connectar al dimoni mestre en {server}:{port}.
de: Konnte nicht zum Master Daemon verbinden: {server}:{port}
es: No puedo conectar al demonio maestro en {server}:{port}.
fr: Connexion impossible au contrôleur principal sur {server}:{port}.
it: Non posso connettermi al demone principale su {server}:{port}.
sr: Не могу да се повежем са главним демоном на {server}:{port}.
sr@latn: Ne mogu da se povežem sa glavnim demonom na {server}:{port}.

source: Can't start local master daemon on port {port}. Execute the dvdrip-master program by hand to see why it doesn't run.
ca: No es pot iniciar el dimoni mestre local en el port {port}. Executeu el programa dvdrip-master a mà per veure per què no s'executa.
de: Konnte dvd::rip Cluster Master Daemon nicht lokal starten auf Port {port}. Führen Sie das dvdrip-master Programm per Hand aus, um zu sehen was genau das Problem ist.
es: No puedo iniciar el demonio maestro local en el puerto {port}. Ejecuta el programa dvdrip-master a mano para ver porque no se ejecuta.
fr: Démarrage impossible du maître local sur le port {port}. Exécutez dvdrip-master vous-même pour comprendre pourquoi il ne veut pas démarrer.
it: Non riesco ad avviare il demone principale locale sulla porta {port}. Esegui il programma dvdrip-master a mano e controlla perché non parte.
sr: Није могуће покренути главног локалног демона на порту {port}. Покрените ручно програм dvdrip-master да бисте видели зашто није покренут.
sr@latn: Nije moguće pokrenuti glavnog lokalnog demona na portu {port}. Pokrenite ručno program dvdrip-master da biste videli zašto nije pokrenut.

source: Please configure the master node first
ca: Configureu abans el node mestre.
de: Bitte konfigurieren Sie zunächst den Master Knoten
es: Por favor, configura primero el nodo maestro
fr: Veuillez d'abord configurer le noeud maître
it: Per favore configura prima il nodo principale
sr: Молимо да прво подесите главни чвор
sr@latn: Molimo da prvo podesite glavni čvor

source: Connection to master daemon lost!
ca: La connexió al dimoni mestre s'ha perdut.
de: Die Verbindung zum Cluster Master wurde unterbrochen!
es: ¡Conexión al demonio maestro perdida!
fr: Connexion impossible au contrôleur principal sur {server}:{port}.
it: Connessione al demone principale persa!
sr: Изгубљена је веза са главним демоном!
sr@latn: Izgubljena je veza sa glavnim demonom!

source: Do you want to remove the selected project?
ca: Voleu eliminar el projecte seleccionat?
de: Soll das ausgewählte Projekt entfernt werden?
es: ¿Deseas eliminar el proyecto seleccionado?
fr: Voulez-vous retirer le projet sélectionné ?
it: Vuoi rimuovere il progetto selezionato?
sr: Да ли желите да уклоните изабрани пројекат?
sr@latn: Da li želite da uklonite izabrani projekat?

source: Do you want to remove the selected node?
ca: Voleu eliminar el node seleccionat?
de: Soll der ausgewählte Knoten entfernt werden?
es: ¿Deseas eliminar el nodo seleccionado?
fr: Voulez-vous enlever le noeud sélectionné ?
it: Vuoi rimuovere il nodo selezionato?
sr: Да ли желите да уклоните изабрани чвор?
sr@latn: Da li želite da uklonite izabrani čvor?

source: Do you really want to shutdown the Cluster Control Daemon?
ca: Realment, voleu tancar el dimoni de control del clúster?
de: Soll der Cluster Control Daemon wirklich heruntergefahren werden?
es: ¿Realmente deseas cerrar el Demonio de Control del Cluster?
fr: Voulez-vous vraiment arrêter le contrôleur du cluster ?
it: Vuoi davvero terminare il Demone di Controllo del Cluster?
sr: Да ли стварно желите да угасите демон за контролу скупине?
sr@latn: Da li stvarno želite da ugasite demon za kontrolu skupine?
