Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/d/dvdrip/l10n/*.po
Languages: ca, de, es, fr, it, sr, sr@latn

source: Subtitles
ca: Subtítols
de: Untertitel
es: Subtítulos
fr: Sous-titres
it: Sottotitoli
sr: Титлови
sr@latn: Titlovi

source: This title has no subtitles
ca: Aquest títol no té subtítols
de: Dieser DVD-Titel hat keine Untertitel
es: Este título no tiene subtítulos
fr: Ce titre n'a pas de sous-titre
it: Questo titolo non ha sottotitoli
sr: Овај наслов нема титлове
sr@latn: Ovaj naslov nema titlove

source: Subtitle selection
ca: Selecció de subtítol
de: Untertitel Auswahl
es: Selección de subtítulo
fr: Sélection des sous-titres
it: Selezione dei sottotitoli
sr: Избор титлова
sr@latn: Izbor titlova

source: Select subtitle
ca: Selecciona subtítol
de: Wählen Sie einen Untertitel
es: Seleccionar subtítulo
fr: Sélectionner le sous-titre
it: Seleziona sottotitolo
sr: Изаберите титл
sr@latn: Izaberite titl

source: Activated:
ca: Activat:
de: Aktiviert:
es: Activado:
fr: Activé :
it: Attivato:
sr: Укључено:
sr@latn: Uključeno:

source: Preview
ca: Vista prèvia
de: Vorschau
es: Previsualizar
fr: Aperçu
it: Anteprima
sr: Преглед
sr@latn: Pregled

source: Grab
ca: Captura
de: Hole
es: Capturar
fr: Capturer
it: Cattura
sr: Ухвати
sr@latn: Uhvati

source: image(s)
ca: imatge(s)
de: Bild(er)
es: imagen(es)
it: Immagine(i)
sr: слике
sr@latn: slike

source: starting at
ca: començant en
de: beginnend bei
es: empezando en
fr: commençant à
it: inizia a
sr: почиње на
sr@latn: počinje na

source: Movie has only {cnt} frames
ca: El vídeo només té {cnt} fotogrames
de: Der Film hat nur {cnt} Frames
es: El video sólo tiene {cnt} fotogramas
fr: Le film n'a que {cnt} trames
it: Il filmato ha solo {cnt} fotogrammi
sr: Филм има само оволико кадрова: {cnt}
sr@latn: Film ima samo ovoliko kadrova: {cnt}

source: Invalid time/frame number format
ca: El format de temps/número de fotograma no és vàlid
de: Ungültiges Zeit/Frame Format
es: Formato de tiempo/número de fotograma no válido
fr: Format de temps/trame invalide
it: Formato numerico tempo/fotogrammi non valido
sr: Неисправан формат времена и броја кадра
sr@latn: Neispravan format vremena i broja kadra

source: (timecode nn:nn:nn or frame number)
ca: (temps en format nn:nn:nn o número de fotograma)
de: (Zeitpunkt nn:nn:nn oder Frame Nummer)
es: (tiempo en formato nn:nn:nn o número de fotograma)
fr: (timecode nn:nn:nn ou numéro de trame)
it: (codice temporale nn:nn:nn o numero di fotogrammi)
sr: (временска ознака nn:nn:nn или број кадра)
sr@latn: (vremenska oznaka nn:nn:nn ili broj kadra)

source: Render subtitle on movie
ca: Incrusta subtítols en el vídeo
de: Zeichnen der Untertitel auf den Film
es: Incrustar subtítulos en el video
fr: Incrustation des sous-titres dans le film
it: Codifica il sottotitolo sul film
sr: Рендеруј титл на филм
sr@latn: Renderuj titl na film

source: Activate this subtitle
ca: Activa aquest subtítol
de: Untertitel aktivieren
es: Activar este subtítulo
fr: Activer ce sous-titre
it: Attiva questo sottotitolo
sr: Укључи овај титл
sr@latn: Uključi ovaj titl

source: for rendering
ca: per incrustar
de: zum Zeichnen
es: para incrustar
fr: dans le film
it: per la codifica
sr: за рендеровање
sr@latn: za renderovanje

source: Enable manipulation
ca: Activa manipulació
de: manipulieren
es: Activar manipulación
fr: Active la manipulation
it: Abilita manipolazione
sr: Укључи манипулацију
sr@latn: Uključi manipulaciju

source: Preview image count
ca: Núm. de vistes prèvies
de: Anz. Vorschaubilder
es: Número de previsualizaciones
fr: Compteur d'images d'aperçu
it: Numero di immagini per l'anteprima
sr: Број слика за преглед
sr@latn: Broj slika za pregled

source: Vertical offset
ca: Desplaçament vertical
de: Abstand vertikal
es: Desplazamiento vertical
fr: Décalage vertical
it: Spostamento verticale
sr: Усправни померај
sr@latn: Uspravni pomeraj

source: rows
ca: files
de: Zeilen
es: filas
fr: colonnes
it: righe
sr: редови
sr@latn: redovi

source: Gray A/B
ca: Gris A/B
de: Grau A/B
es: Gris A/B
fr: Gris A/B
it: Grigio A/B
sr: Сива A/B
sr@latn: Siva A/B

source: Value not between 0 and 255
ca: El valor no és entre 0 i 255
de: Wert ist nicht im Bereich von 0 bis 255
es: El valor no está entre 0 y 255
fr: Valeur hors de l'intervalle 0-255
it: Valore non compreso fra 0 e 255
sr: Вредност мора бити између 0 и 255
sr@latn: Vrednost mora biti između 0 i 255

source: Preview window
ca: Vista prèvia
de: Vorschaufenster
es: Previsualizar
fr: Fenêtre d'aperçu
it: Finestra d'anteprima
sr: Прозор за преглед
sr@latn: Prozor za pregled

source: Open
ca: Obre
de: Öffnen
es: Abrir
fr: Ouvrir
it: Apri
sr: Отвори
sr@latn: Otvori

source: Time shift
ca: Desplaçament temporal
de: Zeitverschiebung
es: Desplazamiento temporal
fr: Décalage temporel
it: Spostamento temporale
sr: Временски померај
sr@latn: Vremenski pomeraj

source: Index A/B
ca: Índex A/B
es: Índice A/B
it: Indice A/B
sr: Индекс A/B
sr@latn: Indeks A/B

source: Postprocessing
ca: Postprocessament
es: Postprocesamiento
fr: Post-traitement
it: Postproduzione
sr: Накнадна обрада
sr@latn: Naknadna obrada

source: Antialiasing
ca: Suavitzat de vores
es: Suavizado de bordes
fr: Anticrénelage
it: Antialias
sr: Антиалиасинг

source: Suggest
ca: Suggeriment
de: Vorschlagen
es: Sugerencia
fr: Suggestion
it: Suggerisci
sr: Предложи
sr@latn: Predloži

source: Values for letterbox
ca: Valors per a letterbox
de: Werte für Letterbox
es: Valores para letterbox
fr: Valeurs pour bandes noires
it: Valori per il formato letterbox
sr: Вредности за поштанско сандуче
sr@latn: Vrednosti za poštansko sanduče

source: Values for full size movie
ca: Valors per a mida completa
de: Werte für Vollbild
es: Valores para tamaño completo
fr: Valeurs pour plein écran
it: Valori per il film a formato intero
sr: Вредности за филм пуне величине
sr@latn: Vrednosti za film pune veličine

source: Create vobsub file
ca: Crea fitxer vobsub
de: vobsub Datei erstellen
es: Crear archivo vobsub
fr: Création d'un fichier vobsub pour les sous-titres
it: Crea file vobsub
sr: Направи vobsub фајл
sr@latn: Napravi vobsub fajl

source: Create now
ca: Crea ara
de: Jetzt erstellen
es: Crear ahora
fr: Créer
it: Crea ora
sr: Направи сада
sr@latn: Napravi sada

source: View vobsub
ca: Visualitza vobsub
de: vobsub ansehen
es: Ver vobsub
fr: Voir le vobsub
it: Vedi vobsub
sr: Прикажи vobsub
sr@latn: Prikaži vobsub

source: Only useful for single-CD-rips or after transcoding
ca: Només és útil per a codificacions d'un únic CD o després de codificar
de: Nur sinnvoll, wenn eine einzelne CD erstellt wird.
es: Sólo útil para codificaciones de un único CD o despues de codificar
fr: Utile seulement pour un encodage sur un seul CD, ou après le transcodage
it: Utile solo per le estrazioni destinate a CD singoli oppure dopo la codifica
sr: Корисно је само за појединачно чупање CD-а или после кодирања
sr@latn: Korisno je samo za pojedinačno čupanje CD-a ili posle kodiranja

source: Create later
ca: Crea més tard
de: Später erstellen
es: Crear más tarde
fr: Créer plus tard
it: Crea più tardi
sr: Направи касније
sr@latn: Napravi kasnije

source: after transcoding
ca: després de codificar
de: nach dem Transkodieren
es: después de codificar
fr: après l'encodage
it: dopo codifica
sr: после кодирања
sr@latn: posle kodiranja

source: This considers splitted files automaticly
ca: Això té en consideració els fitxers dividits automàticament
de: Dabei werden aufgeteilte Videodateien berücksichtigt.
es: Esto tienen en cuenta archivos divididos automáticamente
fr: Ceci suppose que le fichier encodé soit automatiquement découpé
it: Questo considera i file divisi automaticamente
sr: Ово увек узима у обзир подељене фајлове.
sr@latn: Ovo uvek uzima u obzir podeljene fajlove.

source: You need Mplayer to view vobsub files.
ca: Necessiteu l'Mplayer per visualitzar fitxers vobsub.
de: Sie benötigen mplayer um vobsub Dateien anzusehen.
es: Necesitas Mplayer para ver archivos vobsub.
fr: Vous devez installer MPlayer pour lire les fichiers vobsub.
it: Hai bisogno di MPlayer per vedere i file vobsub.
sr: Потребан Вам је Mplayer за приказ vobsub фајлова.
sr@latn: Potreban Vam je Mplayer za prikaz vobsub fajlova.

source: This is only supported for ripped movies.
ca: Només està permès per a pel·lícules extretes.
de: Dies ist nur möglich bei Filmen, die auf die Festplatte kopiert wurden.
es: Sólo esta soportado para películas extraídas.
fr: Seulement disponible avec des films extraits.
it: E' supportato solo per film estratti.
sr: Ово је подржано само за ишчупане филмове.
sr@latn: Ovo je podržano samo za iščupane filmove.

source: What about creating the vobsub file first?
ca: I si creeu abans el fitxer vobsub?
de: Sie müssen zunächst die vobsub Dateien erzeugen.
es: ¿Qué tal si creas primero el archivo vobsub?
fr: Pourquoi ne pas créer d'abord le fichier vobsub ?
it: Che ne dici di creare prima i file vobsub?
sr: Како би било да прво направите vobsub фајл?
sr@latn: Kako bi bilo da prvo napravite vobsub fajl?

source: Executing command:
ca: S'està executant l'ordre:
de: Führe Befehl aus:
es: Ejecutando comando:
fr: Lancement de la commande :
it: Eseguo il comando:
sr: Извршавање наредбе:
sr@latn: Izvršavanje naredbe:

source: Sorry, you need subtitle2pgm for this to work.
ca: Us cal el subtitle2pgm per a aquesta tasca.
de: Sie benötigen subtitle2pgm.
es: Lo siento, necesitas subtitle2pgm para este trabajo.
fr: Désolé, vous avez besoin de subtitle2pgm pour que cela fonctionne.
it: Mi dispiace ma hai bisogno di subtitle2pgm per questo lavoro.
sr: Извините, потребан Вам је subtitle2pgm да би ово радило.
sr@latn: Izvinite, potreban Vam je subtitle2pgm da bi ovo radilo.

source: RIP Title
ca: Extreu el títol
de: Titel kopieren
es: Extraer Título
fr: Extraction
it: ESTRAI Titolo
sr: ЧУПАЈ Наслов
sr@latn: ČUPAJ Naslov

source: Read content
ca: Llegeix el contingut
de: Inhalt einlesen
es: Leer contenido
fr: Lecture du contenu
it: Leggi contenuto
sr: Читај садржај
sr@latn: Čitaj sadržaj

source: Read DVD table of contents
ca: Llegeix la taula de contingut del DVD
de: DVD Inhaltsverzeichnis einlesen
es: Leer tabla de contenidos del DVD
fr: Lire la table des matières du DVD
it: Leggi la TOC del DVD
sr: Читај садржај DVD-а
sr@latn: Čitaj sadržaj DVD-a

source: Scan the DVD for all available titles and setup the table of contents
ca: Escaneja el DVD a la cerca de tots els títols disponibles i configura la taula de contingut
de: Einlesen des DVD Inhaltsverzeichnisses
es: Escanear el DVD en busca de todos los títulos disponibles y configurar la tabla de contenidos
fr: Parcourt le DVD à la recherche des titres disponibles et prépare la table des matières
it: Controlla tutti i titoli disponibili sul DVD e organizza la TOC
sr: Тражи све доступне наслове на ДВДу и поставља табелу са садржајем
sr@latn: Traži sve dostupne naslove na DVDu i postavlja tabelu sa sadržajem

source: Open DVD tray
ca: Obre el DVD
de: DVD Schublade öffnen
es: Abrir DVD
fr: Ouvrir le lecteur DVD
it: Apri il cassetto del DVD
sr: Отвори DVD
sr@latn: Otvori DVD

source: Open the tray of your configured DVD device
ca: Obre la safata de la unitat de DVD configurada
de: Öffnen der Schublade ihres DVD Lesegerätes
es: Abrir la bandeja de la unidad de DVD configurada
fr: Ouvre le lecteur DVD que vous avez configuré
it: Apri il cassetto del tuo dispositivo DVD configurato
sr: Отвара фиоку ДВД уређаја
sr@latn: Otvara fioku DVD uređaja

source: Close DVD tray
ca: Tanca el DVD
de: DVD Schublade schließen
es: Cerrar DVD
fr: Fermer le lecteur DVD
it: Chiudi il cassetto del DVD
sr: Затвори DVD
sr@latn: Zatvori DVD

source: Close the tray of your configuried DVD device
ca: Tanca la safata de la unitat de DVD configurada
de: Schließen der Schublade Ihres DVD Lesegerätes
es: Cerrar la bandeja de la unidad de DVD configurada
fr: Ferme le lecteur DVD que vous avez configuré
it: Chiudi il cassetto del tuo dispositivo DVD configurato
sr: Затвара фиоку ДВД уређајa
sr@latn: Zatvara fioku DVD uređaja

source: DVD table of contents
ca: Taula de contingut del DVD
de: DVD Inhaltsverzeichnis
es: Tabla de contenidos del DVD
fr: Table des matières du DVD
it: TOC del DVD
sr: Садржај DVD-а
sr@latn: Sadržaj DVD-a

source: Select title for further operation
ca: Selecciona un títol per executar amb ell les operacions posteriors
de: Wählen Sie hier einen Titel für alle weiteren Operationen aus
es: Seleccionar un título para operaciones posteriores
it: Scegli il titolo per ulteriori operazioni
sr: Изаберите наслов за даљу обраду
sr@latn: Izaberite naslov za dalju obradu

source: Title
ca: Títol
de: Titel
es: Título
fr: Titre
it: Titolo
sr: Наслов
sr@latn: Naslov

source: Norm
ca: Norma
es: Norma
sr: Нормиран
sr@latn: Normiran

source: Framerate
ca: Veloc. d'imatge
es: Tasa de video
fr: images / s
sr: Брзина кадрирања
sr@latn: Brzina kadriranja

source: Aspect
ca: Aspecte
de: Seitenverh.
es: Aspecto
it: Aspetto
sr: Однос
sr@latn: Odnos

source: Frames
ca: Fotogrames
es: Fotogramas
fr: images
it: Fotogrammi
sr: Кадрови
sr@latn: Kadrovi

source: Resolution
ca: Resolució
de: Auflösung
es: Resolución
fr: Résolution
it: Risoluzione
sr: Резолуција
sr@latn: Rezolucija

source: View selected title/chapter(s)
ca: Visualitza el(s) títol(s)/capítol(s) seleccionat(s)
de: Ausgewählte Titel/Kapitel ansehen
es: Ver título(s)/capítulo(s) seleccionados
fr: Visionner les titres ou chapitres sélectionnés
it: Vedi i titoli/capitoli selezionati
sr: Прикажи изабран наслов или поглавља
sr@latn: Prikaži izabran naslov ili poglavlja

source: RIP selected title(s)/chapter(s)
ca: Extreu el(s) títol(s)/capítol(s) seleccionat(s)
de: Ausgewähle Titel/Kapitel auf die Festplatte kopieren
es: Extraer título(s)/capítulo(s) seleccionados
fr: Extraire les titres ou chapitres sélectionnés
it: ESTRAI i titoli/capitoli selezionati
sr: Рипуј изабране наслове или поглавља
sr@latn: Ripuj izabrane naslove ili poglavlja

source: Select audio track
ca: Selecciona pista d'àudio
de: Tonspur wählen
es: Seleccionar pista de audio
fr: Choisissez une piste audio
it: Scegli la traccia audio
sr: Изабери аудио траку
sr@latn: Izaberi audio traku

source: All audio tracks are ripped, but this track is also scanned for volume while ripping
ca: S'extreuen totes les pistes d'àudio, però a aquesta pista també se li escaneja el volum durant l'extracció
de: Alle Tonspuren werden kopiert, aber die Lautstärke der hier ausgewählten Spur wird gleich mit analysiert. Damit kann dann später die Lautstärke automatisiert angehoben werden.
es: Se extraen todas las pistas de audio, pero a esta pista se le escanea el volumen durante la extracción
fr: Toutes les pistes audio sont extraites, mais le volume de cette piste est inspecté pendant l'extraction
it: Tutte le tracce audio vengono estratte, ma il volume di questa traccia viene analizzato durante l'estrazione
sr: Све аудио траке су скинуте, али ова трака је такође коришћена за звук при скидању
sr@latn: Sve audio trake su skinute, ali ova traka je takođe korišćena za zvuk pri skidanju

source: Select viewing angle
ca: Selecciona angle de vista
de: Sichtwinkel wählen
es: Seleccionar ángulo de vista
fr: Choisissez un angle de vue
it: Scegli l'angolo di visuale
sr: Избор угла гледања
sr@latn: Izbor ugla gledanja

source: This selection affects ripping, so you must rip again if you change this later
ca: Aquesta selecció afecta l'extracció, per la qual cosa s'haurà de tornar a fer si es canvia després
de: Es muss erneut kopiert werden wenn dies verändert wird.
es: Afecta a la extracción, por lo que se debe extraer de nuevo si se cambia después
fr: Vous devez refaire l'extraction si vous changez l'angle de vue
it: Questa selezione interessa l'estrazione, perciò se cambi il valore dovrai estrarre nuovamente
sr: Овај избор утиче на риповање, тако да морате да рипујете опет ако ово касније промените
sr@latn: Ovaj izbor utiče na ripovanje, tako da morate da ripujete opet ako ovo kasnije promenite

source: Grab subtitle preview images
ca: Captura imatges de subtítols
de: Untertitelbilder holen
es: Capturar imágenes de subtítulos
fr: Extraction des aperçus de sous-titres
it: Cattura le immagini dei sottititoli
sr: Ухвати прегледне слике за титлове
sr@latn: Uhvati pregledne slike za titlove

source: No subitle images are created while ripping but can be grabbed later on demand. This is the fastest ripping mode.
ca: Durant l'extracció no es creen imatges de subtítols, però es poden capturar després a petició. És el mode d'extracció més ràpid.
de: Keine Untertitelbilder während des Kopiervorgangs auf die Festplatte schreiben. Diese können auch später noch kopiert werden. Dies ist der schnellste Modus.
es: No se crean imágenes de subtítulos durante la extracción, pero se pueden capturar después a demanda. Es el modo de extracción más rápido.
fr: Aucune image de sous-titre n'est créée pendant l'extraction mais ceci peut être fait plus tard. C'est le mode d'extraction le plus rapide.
it: Nessuna immagine dei sottotitoli viene creata durante l'estrazione, ma può essere catturata successivamente su richiesta. Questa è la modalità di estrazione più rapida.
sr: Слике титлова нису направљене приликом риповања али се могу накнадно урадити. Ово је најбржи начин за риповање.
sr@latn: Slike titlova nisu napravljene prilikom ripovanja ali se mogu naknadno uraditi. Ovo je najbrži način za ripovanje.

source: All
ca: Tot
de: Alle
es: Todo
fr: Tout
it: Tutti
sr: Све
sr@latn: Sve

source: Images of all subtitle streams are created during ripping and available for preview immediately. Note that this will slow down the ripping process significantly.
ca: Durant l'extracció es creen imatges de tots els fluxos de subtítols que queden disponibles per previsualitzar immediatament. Noteu que això reduirà la velocitat d'extracció significativament.
de: Bilder von allen Untertiteln werden während des Kopiervorgangs angelegt und stehen später umgehend für eine Vorschau zur Verfügung. Dies wird den Kopiervorgang signifikant verlangsamen.
es: Se crean imágenes de todos los flujos de subtítulos durante la extracción y quedan disponibles para previsualizar inmediatamente. Esto reduce la velocidad de extracción significativamente.
fr: Les images de tous les sous-titres sont créés pendant l'extraction et peuvent être prévisualisés immédiatement. Notez que cela ralentit significativement l'extraction.
it: Le immagini di tutti i flussi dei sottotitoli vengono create durante l'estrazione e sono disponibili per l'anteprima immediatamente. Nota che questo rallenterà significativamente il processo di estrazione.
sr: Отисци свих токова за титлове праве се током риповања и одмах су доступни за преглед. Ово ће значајно успорити риповање.
sr@latn: Otisci svih tokova za titlove prave se tokom ripovanja i odmah su dostupni za pregled. Ovo će značajno usporiti ripovanje.

source: By language
ca: Per idioma
de: Nach Spr.
es: Por idioma
fr: Par langue
it: Per linguaggio
sr: Језик
sr@latn: Jezik

source: Grab subtitle images of specific languages only. Note that this will slow down the ripping process significantly.
ca: Captura les imatges de subtítols només d'idiomes específics. Això reduirà la velocitat d'extracció significativament.
de: Untertitelbilder nur von bestimmten Sprachen erstellen. Achtung: das wird den Kopiervorgang signifikant verlangsamen.
es: Captura las imágenes de subtítulos sólo de idiomas específicos. Esto reducirá la velocidad de extracción significativamente.
fr: Extrait des images d'aperçu de certaines langues seulement. Ceci ralentit significativement l'extraction.
it: Estrai soltanto le immagini dei sottotitoli di lingue specifiche. Nota che questo rallenterà significativamente il processo di estrazione.
sr: Скидање титлова само за одређене језике. Ово ће значајно да успори процес риповања.
sr@latn: Skidanje titlova samo za određene jezike. Ovo će značajno da uspori proces ripovanja.

source: Select one or more languages
ca: Selecciona un o més idiomes
de: Wählen Sie eine oder mehrere Sprachen aus
es: Selecciona uno o más idiomas
fr: Choisissez une ou plusieurs langues
it: Seleziona uno o più lingue
sr: Изаберите један или више језика
sr@latn: Izaberite jedan ili više jezika

source: Language selection
ca: Selecció d'idioma
de: Sprachauswahl
es: Selección de idioma
fr: Choix de la langue
it: Selezione lingua
sr: Избор језика
sr@latn: Izbor jezika

source: Specify chapter mode
ca: Especifica mode per capítols
de: Kapitelmodus einstellen
es: Especificar modo por capítulos
fr: Séparer les chapitres
it: Specifica la modalità capitolo
sr: Прецизирајте режим поглавља
sr@latn: Precizirajte režim poglavlja

source: None
ca: No
de: Kein
es: Ninguno
fr: Non
it: Nessuno
sr: Ниједан
sr@latn: Nijedan

source: The title is handled as a whole ignoring all chapter marks
ca: El títol es gestiona com un tot, ignorant les marques de capítol
de: Der DVD Titel wird als ganzes verarbeitet. Alle Kapitelmarkierungen werden ignoriert.
es: El título se maneja como un todo, ignorando las marcas de capítulo
fr: Le titre est traité en un bloc, en ignorant les chapitres.
it: Questo titolo viene trattato nella sua totalità ignorando la suddivisione in capitoli
sr: Наслов се обрађује као целина и ознаке поглавља се занемарују
sr@latn: Naslov se obrađuje kao celina i oznake poglavlja se zanemaruju

source: Processing is divided into chapters. You get one file per chapter for all chapters of this title
ca: El processament es divideix en capítols. S'obté un fitxer per capítol per a tots els capítols del títol
de: Die Verarbeitung erfolgt nach Kapiteln. Im Endergebnis wird für jedes Kapitel eine eigene Datei angelegt
es: El procesamiento se divide en capítulos. Obtienes un fichero por capítulo para todos los capítulos del título
fr: Le traitement est divisé en chapitres. Vous obtenez un fichier par chapitre pour l'ensemble du DVD
it: L'elaborazione è divisa in capitoli. Otterrai un file per capitolo per ciascun capitolo di questo titolo
sr: Обрада је подељена по поглављима. Добићете једну датотеку по поглављу за сва поглавља овог наслова
sr@latn: Obrada je podeljena po poglavljima. Dobićete jednu datoteku po poglavlju za sva poglavlja ovog naslova

source: Selection
ca: Selecció
de: Auswahl
es: Selección
fr: Sélection
it: Selezione
sr: Избор
sr@latn: Izbor

source: Processing is divided into chapters. You get one file per chapter for a specific selection of chapters
ca: El processament es divideix en capítols. S'obté un fitxer per capítol per a una selecció específica de capítols
de: Die Verarbeitung erfolgt nach Kapiteln. Sie können hier einzelne Kapitel zur Verarbeitung auswählen.
es: El procesamiento se divide en capítulos. Obtienes un fichero por capítulo para una selección específica de capítulos
fr: Le traitement est divisé en chapitres. Vous obtenez un fichier par chapitre pour la sélection choisie
it: L'elaborazione è divisa in capitoli. Otterrai un file per capitolo per una selezione specifica di capitoli
sr: Обрада је подељена у поглавља. Добићете једну датотеку по поглављу за изабрана поглавља
sr@latn: Obrada je podeljena u poglavlja. Dobićete jednu datoteku po poglavlju za izabrana poglavlja

source: Select one or more chapters
ca: Selecciona un o més capítols
de: Wählen Sie ein oder mehrere Kapitel aus
es: Selecciona uno o más capítulos
fr: Choisissez un ou plusieurs chapitres
it: Scegli uno o più capitoli
sr: Изаберите једно или више поглавља
sr@latn: Izaberite jedno ili više poglavlja

source: Chapter selection
ca: Selecció de capítols
de: Kapitelauswahl
es: Selección de capítulos
fr: Sélection des chapitres
it: Selezione del capitolo
sr: Избор поглавља
sr@latn: Izbor poglavlja
