Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion-Format/i18n/Aion/Format.*.po
Languages: ru_en

source: Aion::Format - расширение Perl для форматирования чисел, раскрашивания вывода и т.п.
ru_en: Aion::Format - a Perl extension for formatting numbers, coloring output, etc.

source: Утилиты для форматирования чисел, раскрашивания вывода и т.п.
ru_en: Utilities for formatting numbers, coloring output, etc.

source: Раскрашивает текст с помощью escape-последовательностей, а затем заменяет формат на `sprintf`. Названия цветов используются из модуля `Term::ANSIColor`. Для **RESET** используйте `#r` или `#R`.
ru_en: Colorizes text using escape sequences and then replaces the format with `sprintf`. The color names are used from the `Term::ANSIColor` module. For **RESET** use `#r` or `#R`.

source: Как `coloring`, но печатает отформатированную строку на стандартный вывод.
ru_en: Like `coloring`, but prints the formatted string to standard output.

source: Как `coloring`, но печатает отформатированную строку в `STDERR`.
ru_en: Like `coloring`, but prints the formatted string to `STDERR`.

source: Пишет в STDOUT используя для форматирования функцию `coloring` и добавляет префикс с датой-временем.
ru_en: Writes to STDOUT using the `coloring` function for formatting and adds a date-time prefix.

source: Пишет в **STDERR** используя для форматирования функцию `coloring` и добавляет префикс с датой-временем.
ru_en: Writes to **STDERR** using the `coloring` function for formatting and adds a date-time prefix.

source: `p` из Data::Printer с предустановленными настройками.
ru_en: `p` from Data::Printer with preset settings.

source: `np` из Data::Printer с предустановленными настройками.
ru_en: `np` from Data::Printer with preset settings.

source: Вместо неудобного первого параметра используется просто скаляр.
ru_en: Instead of the inconvenient first parameter, a simple scalar is used.

source: Необязательный параметр `%properties` позволяет перекрывать настройки.
ru_en: The optional `%properties` parameter allows you to override settings.

source: Преобразует индекс Флеша в русскоязычную метку с помощью шага 10.
ru_en: Converts the Flesch index to a Russian label using step 10.

source: Анализирует натуральное число в указанной системе счисления. По умолчанию используется 64-значная система.
ru_en: Parses a natural number in the specified number system. The default is the 64-digit system.

source: Для цифр используются символы 0–9, A–Z, a–z, _ и –. Эти символы используются до и для 64 значной системы. Для цифр после 64 значной системы используются символы кодировки **CP1251**.
ru_en: The symbols used for numbers are 0–9, A–Z, a–z, _, and –. These characters are used before and for the 64 character system. For numbers after the 64-digit system, **CP1251** encoding characters are used.

source: Преобразует натуральное число в заданную систему счисления. По умолчанию используется 64-значная система.
ru_en: Converts a natural number to a given number system. The default is the 64-digit system.

source: Добавляет числовые цифры и добавляет единицу измерения.
ru_en: Adds numeric digits and adds a unit of measurement.

source: Несколько преобразований текста за один проход.
ru_en: Multiple text transformations in one pass.

source: Синоним `replace`. **DEPRECATED**.
ru_en: Synonym for `replace`. **DEPRECATED**.

source: Упрощенный язык регулярных выражений для распознавания текста в документах HTML.
ru_en: A simplified regular expression language for text recognition in HTML documents.

source: 1. Убирает все пробелы в начале и конце. 2. С начала каждой строки удаляются 4 пробела или 0-3 пробела и табуляция. 3. Пробелы в конце строки и строки пробелов заменяются на `\s*`. 4. Все переменные в `{{ var }}` заменяются на `.*?`. Т.е. распознаётся всё. 4. Все переменные в `{{> var }}` заменяются на `[^<>]*?`. Т.е. не распознаются html-теги. 4. Все переменные в `{{: var }}` заменяются на `[^\n]*`. Т.е. должно быть на одной строке. 5. Выражения в двойных квадратных скобках (`[[ ... ]]`) могут не существовать. 5. В качестве круглых скобок используются двойные скобки (`(( ... ))`). 5. `||` - или.
ru_en: 1. Removes all spaces at the beginning and end. 2. From the beginning of each line, 4 spaces or 0-3 spaces and a tab are removed. 3. Spaces at the end of a line and strings of spaces are replaced with `\s*`. 4. All variables in `{{ var }}` are replaced with `.*?`. Those. everything is recognized. 4. All variables in `{{> var }}` are replaced with `[^<>]*?`. Those. HTML tags are not recognized. 4. All variables in `{{: var }}` are replaced with `[^\n]*`. Those. must be on one line. 5. Expressions in double square brackets (`[[ ... ]]`) may not exist. 5. Double brackets (`(( ... ))` are used as parentheses. 5. `||` - or.

source: Добавляет разделители между цифрами числа.
ru_en: Adds separators between digits of a number.

source: Разделителем по умолчанию является неразрывный пробел. Установите разделитель и десятичную точку так же, как:
ru_en: The default separator is a non-breaking space. Set the separator and decimal point the same way:

source: См. также `Number::Format`.
ru_en: See also `Number::Format`.

source: Переводит положительные целые числа в **римские цифры**.
ru_en: Converts positive integers to **Roman numerals**.

source: **Римские цифры** после 1000:
ru_en: **Roman numerals** after 1000:

source: См. также:
ru_en: See also:

source: * [Roman](https://metacpan.org/pod/Roman) это простой конвертер. * [Math::Roman](https://metacpan.org/pod/Math::Roman) это еще один конвертер. * [Convert::Number::Roman](https://metacpan.org/pod/Convert::Number::Roman) имеет ООП-интерфейс. * [Number::Convert::Roman](https://metacpan.org/pod/Number::Convert::Roman) – еще один интерфейс ООП. * [Text::Roman](https://metacpan.org/pod/Text::Roman) конвертирует стандартные и милхарные римские числа. * [Roman::Unicode](https://metacpan.org/pod/Roman::Unicode) использует цифры ↁ (5 000), ↂ (1000) и так далее. * [Acme::Roman](https://metacpan.org/pod/Acme::Roman) добавляет поддержку римских цифр в коде Perl (`I + II -> III`), но использует только операции `+`, `-` и `*`. * [Date::Roman](https://metacpan.org/pod/Date::Roman) — это объектно-ориентированное расширение Perl для обработки дат в римском стиле, но с арабскими цифрами (id 3 702). * [DateTime::Format::Roman](https://metacpan.org/pod/DateTime::Format::Roman) – средство форматирования римских дат, но с арабскими цифрами (5 Kal Jun 2003).
ru_en: * [Roman](https://metacpan.org/pod/Roman) is a simple converter. * [Math::Roman](https://metacpan.org/pod/Math::Roman) is another converter. * [Convert::Number::Roman](https://metacpan.org/pod/Convert::Number::Roman) has an OOP interface. * [Number::Convert::Roman](https://metacpan.org/pod/Number::Convert::Roman) – another OOP interface. * [Text::Roman](https://metacpan.org/pod/Text::Roman) converts standard and milharic Roman numerals. * [Roman::Unicode](https://metacpan.org/pod/Roman::Unicode) uses the numbers ↁ (5000), ↂ (1000) and so on. * [Acme::Roman](https://metacpan.org/pod/Acme::Roman) adds support for Roman numerals in Perl code (`I + II -> III`), but only uses the `+`, `-` and `*` operators. * [Date::Roman](https://metacpan.org/pod/Date::Roman) is an object-oriented Perl extension for handling Roman-style dates but with Arabic numerals (id 3,702). * [DateTime::Format::Roman](https://metacpan.org/pod/DateTime::Format::Roman) - Roman date formatter, but with Arabic numerals (5 Kal Jun 2003).

source: Округляет число до указанного десятичного знака.
ru_en: Rounds a number to the specified decimal place.

source: Создает человекочитаемый интервал.
ru_en: Creates human-readable spacing.

source: Ширина результата — 12 символов.
ru_en: The width of the result is 12 characters.

source: Оставляет `$digits` цифр после последнего нуля (сам 0 не учитывается).
ru_en: Leaves `$digits` digits after the last zero (the 0 itself is ignored).

source: По умолчанию `$digits` равен 2.
ru_en: By default `$digits` is 2.

source: Транслитерирует русский текст, оставляя только латинские буквы и тире.
ru_en: Transliterates Russian text, leaving only Latin letters and dashes.

source: Транслитерирует русский текст.
ru_en: Transliterates Russian text.

source: Ловушка для **STDERR**.
ru_en: Trap for **STDERR**.

source: См. также `IO::Capture::Stderr`.
ru_en: See also `IO::Capture::Stderr`.

source: Ловушка для **STDOUT**.
ru_en: Trap for **STDOUT**.

source: См. также `IO::Capture::Stdout`.
ru_en: See also `IO::Capture::Stdout`.

source: Константа равна одному тебибайту.
ru_en: The constant is equal to one tebibyte.

source: Константа равна одному гибибайту.
ru_en: The constant is equal to one gibibyte.

source: Константа равна одному мебибайту.
ru_en: The constant is equal to one mebibyte.

source: Константа равна одному кибибайту.
ru_en: The constant is equal to one kibibyte.

source: Максимальная длина данных LongText mysql и mariadb. L - large.
ru_en: Maximum length of LongText mysql and mariadb data. L - large.

source: Максимальная длина данных MediumText mysql и mariadb. M - medium.
ru_en: Maximum length of MediumText mysql and mariadb data. M - medium.

source: Максимальная длина текста данных mysql и mariadb. R - regularity.
ru_en: Maximum text length of mysql and mariadb data. R - regularity.

source: Максимальная длина данных TinyText mysql и mariadb. S - small.
ru_en: Maximum length of TinyText mysql and mariadb data. S - small.

source: Преобразование в строку Perl без интерполяции.
ru_en: Convert to Perl string without interpolation.

source: Преобразование из строки Perl без интерполяции.
ru_en: Conversion from Perl string without interpolation.
