Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-Mojolicious/share/locale/Padre__Plugin__Mojolicious-*.po
Languages: pl

source: New Mojolicious Application
pl: Nowa aplikacja Mojolicious

source: Start Web Server
pl: Uruchom serwer WWW

source: Stop Web Server
pl: Zatrzymaj serwer WWW

source: Mojolicious Online References
pl: Dokumentacja online Mojolicious

source: Mojolicious Manual
pl: Podręcznik Mojolicious

source: Mojolicious Website
pl: Strona WWW Mojolicious

source: About
pl: O wtyczce

source: Mojolicious application script not found at %s Please make sure the active document is from your Mojolicious project.
pl: Nie odnaleziono skryptu aplikacji Mojolicious pod adresem %s Upewnij się, że aktywny dokument należy do Twojego projektu Mojolicious.

source: Server not found
pl: Nie odnaleziono serwera

source: Web server appears to be running. Launch web browser now?
pl: Serwer WWW zdaje się działać. Czy uruchomić teraz przeglądarkę WWW?

source: Start Web Browser?
pl: Uruchomić przeglądarkę WWW?

source: Web server stopped successfully.
pl: Zatrzymano serwer WWW.

source: Application Name:
pl: Nazwa aplikacji:

source: Parent Directory:
pl: Katalog nadrzędny:

source: Pick parent directory
pl: Wybierz katalog nadrzędny

source: Invalid Application name
pl: Błędna nazwa aplikacji

source: missing field
pl: brakujące pole

source: You need to select a base directory
pl: Musisz wybrać katalog podstawowy

source: %s apparently created. Do you want to open it now?
pl: Najwyraźniej %s został stworzony. Czy chcesz go otworzyć?

source: Done
pl: Gotowe
