package PDK::Firewall::Element::NatPool::H3c;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 引用 PDK::Firewall::Element::NatPool::Role 角色
#------------------------------------------------------------------------------
with 'PDK::Firewall::Element::NatPool::Role';

#------------------------------------------------------------------------------
# PDK::Firewall::Element::NatPool::H3c 通用属性
#------------------------------------------------------------------------------
has '+poolIp' => (is => 'ro', isa => 'ArrayRef', required => 1,);

has name => (is => 'ro', isa => 'Str', required => 0,);

__PACKAGE__->meta->make_immutable;
1;
