Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion-Enum/i18n/Aion/Enum.*.po
Languages: ru_en

source: Aion::Enum - перечисления в стиле ООП, когда каждое перечсление является объектом
ru_en: Aion :: Enum - Listing in the style of OOP, when each renewal is an object

source: Файл lib/StatusEnum.pm:
ru_en: File lib/StatusEnum.pm:

source: `Aion::Enum` позволяет создавать перечисления-объекты. Данные перечисления могут содержать дополнительные методы и свойства. В них можно добавлять роли (с помощью `with`) или использовать их самих как роли.
ru_en: `Aion :: Enum` allows you to create transfers-objects. These transfers may contain additional methods and properties. You can add roles to them (using `with`) or use them as a role.

source: Важной особенностью является сохранение порядка перечисления.
ru_en: An important feature is the preservation of the procedure for listing.

source: `Aion::Enum` подобен перечислениям из php8, но имеет дополнительные свойства `alias` и `stash`.
ru_en: `Aion::Enum` is similar to php8 enums, but has the additional properties `alias` and `stash`.

source: Создаёт перечисление: его константу.
ru_en: Creates a listing: his constant.

source: Указывает тип (isa) значений и дополнений.
ru_en: Indicates the type (ISA) of meanings and additions.

source: Её название – отсылка к богине Иссе из повести «Под лунами Марса» Берроуза.
ru_en: Its name is a reference to the goddess Isse from the story “Under the Moles of Mars” Burrose.

source: Файл lib/StringEnum.pm:
ru_en: File lib/StringEnum.pm:

source: Список перечислений.
ru_en: List of transfers.

source: Имена перечислений.
ru_en: Names of transfers.

source: Значения перечислений.
ru_en: The values of the transfers.

source: Дополнения перечислений.
ru_en: Additions of transfers.

source: Псевдонимы перечислений.
ru_en: Pseudonyms of transfers.

source: Файл lib/AuthorEnum.pm:
ru_en: LIB/authorenum.pm file:

source: Получить case по имени c исключением.
ru_en: Get Case by name with exceptions.

source: Получить case по имени.
ru_en: Get Case by name.

source: Получить case по значению c исключением.
ru_en: Get Case by value with exceptions.

source: Получить case по значению.
ru_en: Get Case by value.

source: Получить case по дополнению c исключением.
ru_en: Get CASE on addition with exceptions.

source: Получить case по дополнению.
ru_en: Get Case for addition.

source: Получить case по псевдониму c исключением.
ru_en: Get Case by pseudonym with exceptions.

source: Получить case по псевдониму.
ru_en: Get case by alias.

source: Свойство только для чтения.
ru_en: Property only for reading.

source: Алиасы работают только если пакет находится в модуле, так как считывают комментарий перед кейсом за счёт рефлексии.
ru_en: Aliases work only if the package is in the module, as they read the comment before the case due to reflection.

source: Файл lib/AliasEnum.pm:
ru_en: LIB/aliasenum.pm file:
