#!/usr/bin/perl
use 5.016;
use strict;
use warnings;
use utf8;

use Encode qw(encode);
use Getopt::Long;
use List::Util qw(max);

binmode *STDOUT, ':utf8';
binmode *STDERR, ':utf8';

my $USAGE = <<"HERE";
Usage: $0 <encoding>
HERE

# Generated from contrib/512-cjk.pl using a collection of public-domain
# Chinese texts from Project Gutenberg (https://www.gutenberg.org/).
my @CN_CHARS = (
'。','一','不','人','了','的','之','「','」','有','是','來','我','道','說','在','子','他','大','也',
'上','去','這','你','見','得','個','中','為','下','家','以','而','到','此','其','日','二','生','出',
'三','著','、','就','如','那','天','又','事','知','要','小','自','十','無','老','者','時','曰','公',
'可','看','所','然','何','心','把','前','回','今','好','年','兩','只','《','》','與','行','過','山',
'王','後','面','將','馬','門','已','於','頭','能','金','書','起','相','至','地','先','正','四','身',
'多','主','女','手','名','便','走','言','明','作','官','文','叫','問','們','都','同','聽','外','兒',
'當','進','死','夫','亦','還','五','太','方','里','等','龍','未','則','往','打','神','玉','故','裡',
'聲','白','因','月','成','眾','君','意','花','想','本','甚','西','和','話','從','爺','乃','用','分',
'必','水','處','百','高','住','若','做','位','矣','長','張','兵','即','安','士','弟','坐','國','東',
'開','請','路','使','入','真','石','父','口','內','命','且','非','少','拿','麼','兄','字','房','清',
'會','才','沒','間','尚','八','酒','聞','卻','李','婦','吃','些','幾','南','夜','再','皆','風','被',
'告','定','數','笑','詩','親','教','世','己','帶','雲','情','師','云','信','六','七','九','忽','第',
'氣','對','武','邊','娘','于','法','敢','各','德','立','但','遂','學','別','應','眼','勝','送','母',
'鬼','裏','青','后','給','傳','連','取','理','歸','通','飛','語','平','元','次','府','報','發','城',
'喜','殺','半','怎','衣','向','放','及','劉','州','堂','黃','倒','姓','錢','氏','實','既','賊','罷',
'千','吾','光','解','江','周','恩','求','雖','原','欲','萬','曾','早','動','陽','難','物','海','常',
'重','春','直','北','刀','禮','軍','許','義','全','餘','香','縣','令','經','乎','色','船','拜','望',
'銀','匡','果','謂','力','或','樣','客','唐','吳','差','雄','仙','她','受','跟','姐','竟','首','新',
'古','盡','由','虎','朝','保','足','點','英','遇','耳','紅','齊','居','目','覺','記','趙','会','罪',
'歲','〕','遠','〔','並','彭','隨','林','合','交','京','留','忙','火','似','待','哥','友','流','胤',
'宋','卷','久','臣','樂','復','病','急','落','更','快','諸','与','姑','某','史','妻','舉','初','什',
'計','接','驚','宗','誰','化','孫','莊','志','河','稱','守','店','關','工','怕','院','思','寶','失',
'晚','民','佛','照','美','漢','空','木','樓','管','鑄','尋','細','卿','賢','善','祇','近','收','服',
'来','福','救','徐','滿','指','莫','寫','現','鄭','性','深','候','反','夢','論','余','每','觀','郎',
'視','为','暗','奉','須','苦','幸','轉','句','代','總','蘇','食','號','興','戰','完','肯','左','司',
'容','惡','陳','布','呼','怪','終','『','寨','奔','紀','算',
);

# Generated from contrib/512-cjk.pl using a collection of public-domain
# Japanese texts from Project Gutenberg (https://www.gutenberg.org/).
my @JP_CHARS = (
'《','》','の','た','い','し','、','に','な','は','。','て','と','か','を','う','が','る','ら','で',
'ん','も','つ','っ','れ','く','こ','ま','だ','り','あ','す','き','や','さ','そ','「','」','よ','わ',
'け','ー','お','ち','ン','彼','せ','人','ど','め','え','ス','み','へ','ろ','一','じ','ば','ひ','ふ',
'見','女','出','分','ね','ほ','思','・','何','ド','イ','事','ル','ゐ','ラ','手','自','ト','言','リ',
'ミ','云','大','間','ず','時','ゝ','行','げ','ア','む','居','日','上','中','子','二','び','私','ご',
'下','タ','ク','今','心','ぶ','者','方','知','家','來','話','テ','生','目','前','ッ','気','ゆ','立',
'べ','ぎ','グ','フ','ィ','ジ','聞','ウ','バ','づ','入','本','ぢ','ゃ','氣','ブ','ぐ','ぬ','ツ','ざ',
'屋','其','男','ロ','シ','後','レ','物','〵','君','マ','度','十','エ','取','書','年','ぼ','持','意',
'此','〳','ょ','通','小','ニ','合','不','口','身','三','感','面','ャ','無','然','地','部','チ','明',
'来','セ','所','考','場','外','ぞ','少','處','夜','カ','切','笑','同','代','ぜ','先','オ','足','点',
'色','的','主','着','僕','音','仕','味','メ','世','傍','正','会','新','白','頭','最','相','返','理',
'文','金','死','長','引','夫','紙','食','好','ガ','動','道','樣','顏','ゞ','デ','母','父','信','名',
'向','ョ','情','次','結','御','山','ゑ','座','問','風','声','愛','若','力','待','四','付','誰','キ',
'車','込','親','近','光','落','コ','内','プ','直','顔','様','聲','月','空','五','神','起','野','木',
'用','高','全','当','早','以','田','ダ','置','町','階','美','如','原','程','友','ぱ','開','過','振',
'別','葉','パ','重','宿','恐','ェ','打','寄','學','ム','実','呼','第','火','ナ','連','眼','馬','教',
'突','調','作','士','サ','店','止','性','ズ','朝','想','聖','得','『','頃','』','ノ','違','張','眞',
'急','安','苦','変','娘','妻','水','初','半','體','又','ベ','晩','要','室','使','体','ヴ','命','受',
'會','読','平','他','天','ュ','深','歸','決','有','側','殺','多','了','語','兄','掛','花','吉','段',
'終','解','浮','婚','窓','島','電','答','議','ギ','皆','可','杉','老','失','始','細','望','樂','ハ',
'客','暗','夢','国','加','敷','遠','真','幸','惡','歩','ポ','必','関','指','驚','等','酒','姿','悪',
'鳴','古','回','運','冷','配','草','那','宗','戻','番','ケ','國','川','步','活','實','奇','消','表',
'石','息','記','ソ','忘','快','當','卿','我','成','非','対','利','乗','六','鶴','員','公','旦','ワ',
'駒','送','元','帰','渡','買','ボ','堂','船','機','變','藝','申','飛','流','逹','集','確','折','片',
'字','歌','定','社','訂','進','病','胸','耳','興','赤','モ','形','服','数','供','楽','注','態','戀',
'常','健','土','爲','椅','放','強','業','題','残','茶','八',
);

# Generated from contrib/512-cjk.pl using a collection of public-domain
# Korean texts from Wikisource (https://ko.wikisource.org/wiki/).
my @KR_CHARS = (
'하','이','다','에','을','。','사','의','고','는','서','를','가','지','로','여','게','니','도','으',
'은','한','어','기','정','아','조','시','나','였','부','대','것','제','리','전','자','과','관','보',
'내','그','、','들','금','라','성','수','주','신','경','명','인','군','원','일','문','었','상','장',
'공','무','있','임','말','려','와','등','중','소','데','람','면','만','우','해','되','안','두','마',
'거','치','왕','오','위','히','비','러','행','모','호','직','국','각','삼','백','며','없','유','세',
'천','진','않','동','구','청','할','음','르','습','방','종','양','계','태','개','적','입','바','감',
'화','간','당','영','못','때','까','물','또','선','록','령','교','돌','생','함','므','년','추','찰',
'실','용','재','받','강','았','건','불','미','산','예','처','남','병','터','복','절','김','죄','속',
'심','운','후','법','요','연','께','품','반','역','본','회','승','단','황','항','더','민','겠','써',
'따','판','차','매','저','목','형','통','했','같','번','날','평','야','분','및','외','좌','윤','궁',
'현','노','순','올','참','근','북','달','식','온','석','죽','포','박','래','변','스','충','드','배',
'알','합','학','《','》','옵','된','권','키','허','친','봉','결','땅','귀','살','집','잡','칙','헌',
'덕','울','월','초','피','른','준','범','작','규','망','왜','「','창','흥','」','책','약','씨','찌',
'최','별','급','술','던','표','환','송','질','침','설','랑','례','루','워','느','발','손','편','뢰',
'둥','쪽','능','량','베','길','란','논','찬','누','토','타','업','언','왔','격','난','름','광','겨',
'켜','파','늘','익','견','폐','곳','뒤','묘','필','될','너','쳐','출','총','머','혹','점','체','새',
'척','듣','축','풀','갔','향','버','련','효','독','뜻','많','궐','색','벌','극','슬','답','탄','홍',
'렀','악','희','쓰','져','즉','큰','글','풍','숙','열','좋','힘','잘','밀','맞','렸','밖','첩','옛',
'린','먼','취','족','옥','짓','겸','력','곡','납','징','증','검','읍','쌓','옮','육','닭','릉','엄',
'염','첨','벼','접','담','졌','끼','칭','채','림','갑','막','획','든','먹','곧','험','맡','휘','빈',
'움','런','앞','갖','【','】','몸','〈','찍','〉','졸','탁','디','몰','〔','〕','줄','얼','료','놓',
'훈','응','ㆍ','쏘','네','크','혜','철','특','패','핵','났','싸','득','밤','락','섬','애','뿐','갈',
'릇','춘','앉','렴','몽','녹','떠','농','잔','삭','활','둘','밝','욱','쳤','랐','둔','씩','얻','숭',
'냥','컨','눈','론','암','냈','옷','략','압','혼','맹','떨','뽑','놀','켰','꾸','택','곤','균','높',
'존','완','짐','옳','투','잠','류','럼','빼','낮','립','뛰','쫓','앙','렬','깊','룡','묻','긴','낳',
'혀','넘','렇','롭','욕','셨','칠','럽','괴','케','십','펴',
);

my %encodings = (
    'big5' => {
        Chars => \@CN_CHARS,
        Conv  => sub { encoding2int($_[0], 'big5') },
    },
    'gb2312' => {
        Chars => \@CN_CHARS,
        Conv  => sub { encoding2int($_[0], 'gb2312') },
    },
    'euc-jp' => {
        Chars => \@JP_CHARS,
        Conv  => sub { encoding2int($_[0], 'EUC-JP') },
    },
    'shiftjis' => {
        Chars => \@JP_CHARS,
        Conv  => sub { encoding2int($_[0], 'Shift_JIS') },
    },
    'euc-kr' => {
        Chars => \@KR_CHARS,
        Conv  => sub { encoding2int($_[0], 'EUC-KR') },
    },
);

sub bytes2int {

    my ($bytes) = @_;

    my $int = 0;
    for my $i (0 .. length($bytes)-1) {
        my $b = ord(substr $bytes, $i, 1);
        if ($b > 0xff) {
            die '$bytes is not a byte string';
        }
        $int = ($int << 8) | $b;
    }

    return $int;

}

sub encoding2int {

    my ($str, $encoding) = @_;

    my $encode = eval { encode($encoding, $str, Encode::FB_CROAK) };
    # We can accept the few characters that can't be encoded as lost.
    return undef if not defined $encode;
    return bytes2int($encode);

}

sub set2perl {

    my ($name) = @_;
    if (not exists $encodings{ $name }) {
        die "'$name' is not a valid encoding set";
    }
    my $ref = $encodings{ $name };

    my $hash_name = uc($name =~ s/\W//gr) . '_FREQS';
    my @codes = grep { defined }
                map { $ref->{Conv}->($_) } @{ $ref->{Chars} };
    my $maxlen = max map { length } @codes;

    say "my %$hash_name = map { \$_ => 1 } (";
    my $l = '';
    for my $c (@codes) {
        my $add = sprintf "%*s,", $maxlen, $c;
        if (length($l) + length($add) > 80) {
            say $l;
            $l = '';
        }
        $l .= $add;
    }
    if ($l ne '') {
        say $l;
    }
    say ");";

}

sub print_table {

    my ($name) = @_;
    if (not exists $encodings{ $name }) {
        die "'$name' is not a valid encoding set";
    }
    my $ref = $encodings{ $name };

    for my $i (0 .. $#{ $ref->{Chars} }) {
        my $c = $ref->{Chars}[$i];
        printf "%-3d : %s : 0x%04x\n", $i + 1, $c, ord($c);
    }

}

my $table = 0;

GetOptions(
    't' => \$table,
    'h' => sub { print $USAGE; exit 0 },
) or die $USAGE;

my $encoding = shift @ARGV;
if (not defined $encoding) {
    die $USAGE;
}
$encoding = lc $encoding;
if (not exists $encodings{ $encoding }) {
    die "'$encoding' is not a valid encoding name\n";
}

if ($table) {
    print_table($encoding);
} else {
    set2perl($encoding);
}

