
Examples/StructureLayoutTest:     file format elf64-x86-64

The section .debug_aranges contains:

  Length:                   76
  Version:                  2
  Offset into .debug_info:  8b
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0x00000000004008fc 0x17
    0x00000000004007d0 0x9
    0x0000000000400e44 0x4
    0x0000000000000000 0x0
  Length:                   60
  Version:                  2
  Offset into .debug_info:  119
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0x0000000000400988 0x3ac
    0x0000000000400d34 0x37
    0x0000000000000000 0x0
  Length:                   60
  Version:                  2
  Offset into .debug_info:  7136
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0x00000000004007e3 0x5
    0x0000000000400e4d 0x5
    0x0000000000000000 0x0

Contents of the .debug_pubnames section:

  Length:                              33
  Version:                             2
  Offset into .debug_info section:     0
  Size of area in .debug_info section: 139

    Offset	Name
    111   		_IO_stdin_used
  Length:                              39
  Version:                             2
  Offset into .debug_info section:     281
  Size of area in .debug_info section: 28701

    Offset	Name
    24407 		min<size_t>
    24912 		main

The section .debug_info contains:

  Compilation Unit @ offset 0x0:
   Length:        135

  <55b>     DW_AT_decl_line   : 120	
  <55c>     DW_AT_import      : <266e>	
 <2><560>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <561>     DW_AT_decl_file   : 13	
  <562>     DW_AT_decl_line   : 122	
  <563>     DW_AT_import      : <2689>	
 <2><567>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <568>     DW_AT_decl_file   : 13	
  <569>     DW_AT_decl_line   : 125	
  <56a>     DW_AT_import      : <26a7>	
 <2><56e>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <56f>     DW_AT_decl_file   : 13	
  <570>     DW_AT_decl_line   : 126	
  <571>     DW_AT_import      : <26c6>	
 <2><575>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <576>     DW_AT_decl_file   : 13	
  <577>     DW_AT_decl_line   : 127	
  <578>     DW_AT_import      : <26ed>	
 <2><57c>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <57d>     DW_AT_decl_file   : 13	
  <57e>     DW_AT_decl_line   : 129	
  <57f>     DW_AT_import      : <2712>	
 <2><583>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <584>     DW_AT_decl_file   : 13	
  <585>     DW_AT_decl_line   : 130	
  <586>     DW_AT_import      : <2737>	
 <2><58a>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <58b>     DW_AT_decl_file   : 13	
  <58c>     DW_AT_decl_line   : 131	
  <58d>     DW_AT_import      : <2746>	
 <2><591>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <592>     DW_AT_decl_file   : 13	
  <593>     DW_AT_decl_line   : 132	
  <594>     DW_AT_import      : <2767>	
 <2><598>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <599>     DW_AT_decl_file   : 13	
  <59a>     DW_AT_decl_line   : 133	
  <59b>     DW_AT_import      : <277d>	
 <2><59f>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5a0>     DW_AT_decl_file   : 13	
  <5a1>     DW_AT_decl_line   : 134	
  <5a2>     DW_AT_import      : <27a2>	
 <2><5a6>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5a7>     DW_AT_decl_file   : 13	
  <5a8>     DW_AT_decl_line   : 135	
  <5a9>     DW_AT_import      : <27c6>	
 <2><5ad>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5ae>     DW_AT_decl_file   : 13	
  <5af>     DW_AT_decl_line   : 136	
  <5b0>     DW_AT_import      : <27eb>	
 <2><5b4>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5b5>     DW_AT_decl_file   : 13	
  <5b6>     DW_AT_decl_line   : 138	
  <5b7>     DW_AT_import      : <2806>	
 <2><5bb>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5bc>     DW_AT_decl_file   : 13	
  <5bd>     DW_AT_decl_line   : 139	
  <5be>     DW_AT_import      : <282d>	
 <2><5c2>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5c3>     DW_AT_decl_file   : 13	
  <5c4>     DW_AT_decl_line   : 206	
  <5c5>     DW_AT_import      : <2547>	
 <2><5c9>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5ca>     DW_AT_decl_file   : 13	
  <5cb>     DW_AT_decl_line   : 208	
  <5cc>     DW_AT_import      : <290f>	
 <2><5d0>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5d1>     DW_AT_decl_file   : 13	
  <5d2>     DW_AT_decl_line   : 209	
  <5d3>     DW_AT_import      : <232a>	
 <2><5d7>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5d8>     DW_AT_decl_file   : 13	
  <5d9>     DW_AT_decl_line   : 211	
  <5da>     DW_AT_import      : <2925>	
 <2><5de>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5df>     DW_AT_decl_file   : 13	
  <5e0>     DW_AT_decl_line   : 212	
  <5e1>     DW_AT_import      : <2355>	
 <2><5e5>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5e6>     DW_AT_decl_file   : 13	
  <5e7>     DW_AT_decl_line   : 213	
  <5e8>     DW_AT_import      : <284d>	
 <2><5ec>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5ed>     DW_AT_decl_file   : 13	
  <5ee>     DW_AT_decl_line   : 215	
  <5ef>     DW_AT_import      : <286c>	
 <2><5f3>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5f4>     DW_AT_decl_file   : 13	
  <5f5>     DW_AT_decl_line   : 216	
  <5f6>     DW_AT_import      : <28d0>	
 <2><5fa>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <5fb>     DW_AT_decl_file   : 13	
  <5fc>     DW_AT_decl_line   : 217	
  <5fd>     DW_AT_import      : <2885>	
 <2><601>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <602>     DW_AT_decl_file   : 13	
  <603>     DW_AT_decl_line   : 218	
  <604>     DW_AT_import      : <28aa>	
 <2><608>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <609>     DW_AT_decl_file   : 13	
  <60a>     DW_AT_decl_line   : 219	
  <60b>     DW_AT_import      : <28ef>	
 <2><60f>: Abbrev Number: 7 (DW_TAG_namespace)
  <610>     DW_AT_name        : __debug	
  <618>     DW_AT_decl_file   : 32	
  <619>     DW_AT_decl_line   : 49	
 <2><61a>: Abbrev Number: 8 (DW_TAG_structure_type)
  <61b>     DW_AT_name        : nothrow_t	
  <625>     DW_AT_declaration : 1	
 <2><626>: Abbrev Number: 8 (DW_TAG_structure_type)
  <627>     DW_AT_name        : allocator<char>	
  <637>     DW_AT_declaration : 1	
 <2><638>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <639>     DW_AT_name        : float_denorm_style	
  <64c>     DW_AT_byte_size   : 4	
  <64d>     DW_AT_decl_file   : 14	
  <64e>     DW_AT_decl_line   : 172	
  <64f>     DW_AT_sibling     : <68c>	
 <3><653>: Abbrev Number: 10 (DW_TAG_enumerator)
  <654>     DW_AT_name        : denorm_indeterminate	
  <669>     DW_AT_const_value : -1	
 <3><66a>: Abbrev Number: 10 (DW_TAG_enumerator)
  <66b>     DW_AT_name        : denorm_absent	
  <679>     DW_AT_const_value : 0	
 <3><67a>: Abbrev Number: 10 (DW_TAG_enumerator)
  <67b>     DW_AT_name        : denorm_present	
  <68a>     DW_AT_const_value : 1	
 <2><68c>: Abbrev Number: 11 (DW_TAG_structure_type)
  <68d>     DW_AT_name        : basic_string<char,std::char_traits<char>,std::allocator<char> >	
  <6cd>     DW_AT_declaration : 1	
  <6ce>     DW_AT_sibling     : <711>	
 <3><6d2>: Abbrev Number: 12 (DW_TAG_structure_type)
  <6d3>     DW_AT_name        : (indirect string, offset: 0x3bd): _Alloc_hider	
  <6d7>     DW_AT_byte_size   : 8	
  <6d8>     DW_AT_decl_file   : 18	
  <6d9>     DW_AT_decl_line   : 260	
 <4><6db>: Abbrev Number: 13 (DW_TAG_inheritance)
  <6dc>     DW_AT_type        : <2c2e>	
  <6e0>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
  <6e3>     DW_AT_accessibility: 1	(public)
 <4><6e4>: Abbrev Number: 14 (DW_TAG_member)
  <6e5>     DW_AT_name        : _M_p	
  <6ea>     DW_AT_decl_file   : 18	
  <6eb>     DW_AT_decl_line   : 264	
  <6ed>     DW_AT_type        : <cd5>	
  <6f1>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <4><6f4>: Abbrev Number: 15 (DW_TAG_subprogram)
  <6f5>     DW_AT_external    : 1	
  <6f6>     DW_AT_name        : (indirect string, offset: 0x3bd): _Alloc_hider	
  <6fa>     DW_AT_decl_file   : 18	
  <6fb>     DW_AT_decl_line   : 261	
  <6fd>     DW_AT_declaration : 1	
 <5><6fe>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <6ff>     DW_AT_type        : <2ca9>	
  <703>     DW_AT_artificial  : 1	
 <5><704>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <705>     DW_AT_type        : <cd5>	
 <5><709>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <70a>     DW_AT_type        : <2c94>	
 <2><711>: Abbrev Number: 8 (DW_TAG_structure_type)
  <712>     DW_AT_name        : reverse_iterator<__gnu_cxx::__normal_iterator<const char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >	
  <798>     DW_AT_declaration : 1	
 <2><799>: Abbrev Number: 8 (DW_TAG_structure_type)
  <79a>     DW_AT_name        : reverse_iterator<__gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >	
  <81a>     DW_AT_declaration : 1	
 <2><81b>: Abbrev Number: 18 (DW_TAG_structure_type)
  <81c>     DW_AT_name        : (indirect string, offset: 0x357): locale	
  <820>     DW_AT_declaration : 1	
 <2><821>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <822>     DW_AT_name        : _Ios_Fmtflags	
  <830>     DW_AT_byte_size   : 4	
  <831>     DW_AT_decl_file   : 15	
  <832>     DW_AT_decl_line   : 55	
  <833>     DW_AT_sibling     : <948>	
 <3><837>: Abbrev Number: 10 (DW_TAG_enumerator)
  <838>     DW_AT_name        : _S_boolalpha	
  <845>     DW_AT_const_value : 1	
 <3><846>: Abbrev Number: 10 (DW_TAG_enumerator)
  <847>     DW_AT_name        : _S_dec	
  <84e>     DW_AT_const_value : 2	
 <3><84f>: Abbrev Number: 10 (DW_TAG_enumerator)
  <850>     DW_AT_name        : _S_fixed	
  <859>     DW_AT_const_value : 4	
 <3><85a>: Abbrev Number: 10 (DW_TAG_enumerator)
  <85b>     DW_AT_name        : _S_hex	
  <862>     DW_AT_const_value : 8	
 <3><863>: Abbrev Number: 10 (DW_TAG_enumerator)
  <864>     DW_AT_name        : _S_internal	
  <870>     DW_AT_const_value : 16	
 <3><871>: Abbrev Number: 10 (DW_TAG_enumerator)
  <872>     DW_AT_name        : _S_left	
  <87a>     DW_AT_const_value : 32	
 <3><87b>: Abbrev Number: 10 (DW_TAG_enumerator)
  <87c>     DW_AT_name        : _S_oct	
  <883>     DW_AT_const_value : 64	
 <3><885>: Abbrev Number: 10 (DW_TAG_enumerator)
  <886>     DW_AT_name        : _S_right	
  <88f>     DW_AT_const_value : 128	
 <3><891>: Abbrev Number: 10 (DW_TAG_enumerator)
  <892>     DW_AT_name        : _S_scientific	
  <8a0>     DW_AT_const_value : 256	
 <3><8a2>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8a3>     DW_AT_name        : _S_showbase	
  <8af>     DW_AT_const_value : 512	
 <3><8b1>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8b2>     DW_AT_name        : _S_showpoint	
  <8bf>     DW_AT_const_value : 1024	
 <3><8c1>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8c2>     DW_AT_name        : _S_showpos	
  <8cd>     DW_AT_const_value : 2048	
 <3><8cf>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8d0>     DW_AT_name        : _S_skipws	
  <8da>     DW_AT_const_value : 4096	
 <3><8dc>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8dd>     DW_AT_name        : _S_unitbuf	
  <8e8>     DW_AT_const_value : 8192	
 <3><8eb>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8ec>     DW_AT_name        : _S_uppercase	
  <8f9>     DW_AT_const_value : 16384	
 <3><8fc>: Abbrev Number: 10 (DW_TAG_enumerator)
  <8fd>     DW_AT_name        : _S_adjustfield	
  <90c>     DW_AT_const_value : 176	
 <3><90e>: Abbrev Number: 10 (DW_TAG_enumerator)
  <90f>     DW_AT_name        : _S_basefield	
  <91c>     DW_AT_const_value : 74	
 <3><91e>: Abbrev Number: 10 (DW_TAG_enumerator)
  <91f>     DW_AT_name        : _S_floatfield	
  <92d>     DW_AT_const_value : 260	
 <3><92f>: Abbrev Number: 10 (DW_TAG_enumerator)
  <930>     DW_AT_name        : _S_ios_fmtflags_end	
  <944>     DW_AT_const_value : 65536	
 <2><948>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <949>     DW_AT_name        : _Ios_Openmode	
  <957>     DW_AT_byte_size   : 4	
  <958>     DW_AT_decl_file   : 15	
  <959>     DW_AT_decl_line   : 107	
  <95a>     DW_AT_sibling     : <9ae>	
 <3><95e>: Abbrev Number: 10 (DW_TAG_enumerator)
  <95f>     DW_AT_name        : _S_app	
  <966>     DW_AT_const_value : 1	
 <3><967>: Abbrev Number: 10 (DW_TAG_enumerator)
  <968>     DW_AT_name        : _S_ate	
  <96f>     DW_AT_const_value : 2	
 <3><970>: Abbrev Number: 10 (DW_TAG_enumerator)
  <971>     DW_AT_name        : _S_bin	
  <978>     DW_AT_const_value : 4	
 <3><979>: Abbrev Number: 10 (DW_TAG_enumerator)
  <97a>     DW_AT_name        : _S_in	
  <980>     DW_AT_const_value : 8	
 <3><981>: Abbrev Number: 10 (DW_TAG_enumerator)
  <982>     DW_AT_name        : _S_out	
  <989>     DW_AT_const_value : 16	
 <3><98a>: Abbrev Number: 10 (DW_TAG_enumerator)
  <98b>     DW_AT_name        : _S_trunc	
  <994>     DW_AT_const_value : 32	
 <3><995>: Abbrev Number: 10 (DW_TAG_enumerator)
  <996>     DW_AT_name        : _S_ios_openmode_end	
  <9aa>     DW_AT_const_value : 65536	
 <2><9ae>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <9af>     DW_AT_name        : _Ios_Iostate	
  <9bc>     DW_AT_byte_size   : 4	
  <9bd>     DW_AT_decl_file   : 15	
  <9be>     DW_AT_decl_line   : 147	
  <9bf>     DW_AT_sibling     : <a0d>	
 <3><9c3>: Abbrev Number: 10 (DW_TAG_enumerator)
  <9c4>     DW_AT_name        : _S_goodbit	
  <9cf>     DW_AT_const_value : 0	
 <3><9d0>: Abbrev Number: 10 (DW_TAG_enumerator)
  <9d1>     DW_AT_name        : _S_badbit	
  <9db>     DW_AT_const_value : 1	
 <3><9dc>: Abbrev Number: 10 (DW_TAG_enumerator)
  <9dd>     DW_AT_name        : _S_eofbit	
  <9e7>     DW_AT_const_value : 2	
 <3><9e8>: Abbrev Number: 10 (DW_TAG_enumerator)
  <9e9>     DW_AT_name        : _S_failbit	
  <9f4>     DW_AT_const_value : 4	
 <3><9f5>: Abbrev Number: 10 (DW_TAG_enumerator)
  <9f6>     DW_AT_name        : _S_ios_iostate_end	
  <a09>     DW_AT_const_value : 65536	
 <2><a0d>: Abbrev Number: 9 (DW_TAG_enumeration_type)
  <a0e>     DW_AT_name        : _Ios_Seekdir	
  <a1b>     DW_AT_byte_size   : 4	
  <a1c>     DW_AT_decl_file   : 15	
  <a1d>     DW_AT_decl_line   : 184	
  <a1e>     DW_AT_sibling     : <a55>	
 <3><a22>: Abbrev Number: 10 (DW_TAG_enumerator)
  <a23>     DW_AT_name        : _S_beg	
  <a2a>     DW_AT_const_value : 0	
 <3><a2b>: Abbrev Number: 10 (DW_TAG_enumerator)
  <a2c>     DW_AT_name        : _S_cur	
  <a33>     DW_AT_const_value : 1	
 <3><a34>: Abbrev Number: 10 (DW_TAG_enumerator)
  <a35>     DW_AT_name        : _S_end	
  <a3c>     DW_AT_const_value : 2	
 <3><a3d>: Abbrev Number: 10 (DW_TAG_enumerator)
  <a3e>     DW_AT_name        : _S_ios_seekdir_end	
  <a51>     DW_AT_const_value : 65536	
 <2><a55>: Abbrev Number: 11 (DW_TAG_structure_type)
  <a56>     DW_AT_name        : ios_base	
  <a5f>     DW_AT_declaration : 1	
  <a60>     DW_AT_sibling     : <b1b>	
 <3><a64>: Abbrev Number: 19 (DW_TAG_structure_type)
  <a65>     DW_AT_name        : Init	
  <a6a>     DW_AT_byte_size   : 1	
  <a6b>     DW_AT_decl_file   : 15	
  <a6c>     DW_AT_decl_line   : 531	
 <4><a6e>: Abbrev Number: 20 (DW_TAG_variable)
  <a6f>     DW_AT_name        : (indirect string, offset: 0x4fb): _S_refcount	
  <a73>     DW_AT_decl_file   : 15	
  <a74>     DW_AT_decl_line   : 538	
  <a76>     DW_AT_MIPS_linkage_name: _ZNSt8ios_base4Init11_S_refcountE	
  <a98>     DW_AT_type        : <2975>	
  <a9c>     DW_AT_external    : 1	
  <a9d>     DW_AT_accessibility: 3	(private)
  <a9e>     DW_AT_declaration : 1	
 <4><a9f>: Abbrev Number: 21 (DW_TAG_variable)
  <aa0>     DW_AT_name        : _S_synced_with_stdio	
  <ab5>     DW_AT_decl_file   : 15	
  <ab6>     DW_AT_decl_line   : 539	
  <ab8>     DW_AT_MIPS_linkage_name: _ZNSt8ios_base4Init20_S_synced_with_stdioE	
  <ae3>     DW_AT_type        : <296d>	
  <ae7>     DW_AT_external    : 1	
  <ae8>     DW_AT_accessibility: 3	(private)
  <ae9>     DW_AT_declaration : 1	
 <4><aea>: Abbrev Number: 22 (DW_TAG_subprogram)
  <aeb>     DW_AT_external    : 1	
  <aec>     DW_AT_name        : Init	
  <af1>     DW_AT_decl_file   : 15	
  <af2>     DW_AT_decl_line   : 534	
  <af4>     DW_AT_declaration : 1	
  <af5>     DW_AT_sibling     : <b00>	
 <5><af9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <afa>     DW_AT_type        : <588f>	
  <afe>     DW_AT_artificial  : 1	
 <4><b00>: Abbrev Number: 23 (DW_TAG_subprogram)
  <b01>     DW_AT_external    : 1	
  <b02>     DW_AT_name        : ~Init	
  <b08>     DW_AT_decl_file   : 15	
  <b09>     DW_AT_decl_line   : 535	
  <b0b>     DW_AT_declaration : 1	
 <5><b0c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b0d>     DW_AT_type        : <588f>	
  <b11>     DW_AT_artificial  : 1	
 <5><b12>: Abbrev Number: 16 (DW_TAG_formal_parameter)
  <b13>     DW_AT_type        : <c76>	
  <b17>     DW_AT_artificial  : 1	
 <2><b1b>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b1c>     DW_AT_decl_file   : 16	
  <b1d>     DW_AT_decl_line   : 82	
  <b1e>     DW_AT_import      : <58c1>	
 <2><b22>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b23>     DW_AT_decl_file   : 16	
  <b24>     DW_AT_decl_line   : 84	
  <b25>     DW_AT_import      : <58c4>	
 <2><b29>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b2a>     DW_AT_decl_file   : 16	
  <b2b>     DW_AT_decl_line   : 85	
  <b2c>     DW_AT_import      : <58a5>	
 <2><b30>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b31>     DW_AT_decl_file   : 16	
  <b32>     DW_AT_decl_line   : 93	
  <b33>     DW_AT_import      : <58c7>	
 <2><b37>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b38>     DW_AT_decl_file   : 16	
  <b39>     DW_AT_decl_line   : 102	
  <b3a>     DW_AT_import      : <58e8>	
 <2><b3e>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b3f>     DW_AT_decl_file   : 16	
  <b40>     DW_AT_decl_line   : 105	
  <b41>     DW_AT_import      : <590a>	
 <2><b45>: Abbrev Number: 5 (DW_TAG_imported_declaration)
  <b46>     DW_AT_decl_file   : 16	
  <b47>     DW_AT_decl_line   : 106	
  <b48>     DW_AT_import      : <5925>	
 <2><b4c>: Abbrev Number: 11 (DW_TAG_structure_type)
  <b4d>     DW_AT_name        : money_base	
  <b58>     DW_AT_declaration : 1	
  <b59>     DW_AT_sibling     : <b7d>	
 <3><b5d>: Abbrev Number: 19 (DW_TAG_structure_type)
  <b5e>     DW_AT_name        : pattern	
  <b66>     DW_AT_byte_size   : 4	
  <b67>     DW_AT_decl_file   : 17	
  <b68>     DW_AT_decl_line   : 3526	
 <4><b6a>: Abbrev Number: 14 (DW_TAG_member)
  <b6b>     DW_AT_name        : field	
  <b71>     DW_AT_decl_file   : 17	
  <b72>     DW_AT_decl_line   : 3526	
  <b74>     DW_AT_type        : <10d3>	
  <b78>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><b7d>: Abbrev Number: 8 (DW_TAG_structure_type)
  <b7e>     DW_AT_name        : basic_ostream<char,std::char_traits<char> >	
  <baa>     DW_AT_declaration : 1	
 <2><bab>: Abbrev Number: 24 (DW_TAG_subprogram)
  <bac>     DW_AT_external    : 1	
  <bad>     DW_AT_name        : min<size_t>	
  <bb9>     DW_AT_decl_file   : 1	
  <bba>     DW_AT_decl_line   : 182	
  <bbb>     DW_AT_MIPS_linkage_name: _ZSt3minImERKT_S2_S2_	
  <bd1>     DW_AT_type        : <606a>	
  <bd5>     DW_AT_declaration : 1	
  <bd6>     DW_AT_sibling     : <be5>	
 <3><bda>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <bdb>     DW_AT_type        : <606a>	
 <3><bdf>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <be0>     DW_AT_type        : <606a>	
 <2><be5>: Abbrev Number: 25 (DW_TAG_subprogram)
  <be6>     DW_AT_name        : __verify_grouping	
  <bf8>     DW_AT_decl_file   : 2	
  <bf9>     DW_AT_decl_line   : 2560	
  <bfb>     DW_AT_type        : <296d>	
  <bff>     DW_AT_declaration : 1	
  <c00>     DW_AT_sibling     : <c14>	
 <3><c04>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <c05>     DW_AT_type        : <c7d>	
 <3><c09>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <c0a>     DW_AT_type        : <1b6>	
 <3><c0e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <c0f>     DW_AT_type        : <60af>	
 <2><c14>: Abbrev Number: 26 (DW_TAG_variable)
  <c15>     DW_AT_name        : nothrow	
  <c1d>     DW_AT_decl_file   : 19	
  <c1e>     DW_AT_decl_line   : 73	
  <c1f>     DW_AT_MIPS_linkage_name: (indirect string, offset: 0x37f): _ZSt7nothrow	
  <c23>     DW_AT_type        : <647c>	
  <c27>     DW_AT_external    : 1	
  <c28>     DW_AT_declaration : 1	
 <2><c29>: Abbrev Number: 26 (DW_TAG_variable)
  <c2a>     DW_AT_name        : cout	
  <c2f>     DW_AT_decl_file   : 4	
  <c30>     DW_AT_decl_line   : 64	
  <c31>     DW_AT_MIPS_linkage_name: (indirect string, offset: 0x4f1): _ZSt4cout	
  <c35>     DW_AT_type        : <6496>	
  <c39>     DW_AT_external    : 1	
  <c3a>     DW_AT_declaration : 1	
 <2><c3b>: Abbrev Number: 27 (DW_TAG_variable)
  <c3c>     DW_AT_name        : __ioinit	
  <c45>     DW_AT_decl_file   : 4	
  <c46>     DW_AT_decl_line   : 77	
  <c47>     DW_AT_type        : <a64>	
  <c4b>     DW_AT_declaration : 1	
 <1><c4d>: Abbrev Number: 28 (DW_TAG_base_type)
  <c4e>     DW_AT_byte_size   : 8	
  <c4f>     DW_AT_encoding    : 5	(signed)
 <1><c50>: Abbrev Number: 28 (DW_TAG_base_type)
  <c51>     DW_AT_byte_size   : 8	
  <c52>     DW_AT_encoding    : 7	(unsigned)
 <1><c53>: Abbrev Number: 28 (DW_TAG_base_type)
  <c54>     DW_AT_byte_size   : 8	
  <c55>     DW_AT_encoding    : 7	(unsigned)
 <1><c56>: Abbrev Number: 29 (DW_TAG_const_type)
  <c57>     DW_AT_type        : <c5b>	
 <1><c5b>: Abbrev Number: 3 (DW_TAG_base_type)
  <c5c>     DW_AT_byte_size   : 2	
  <c5d>     DW_AT_encoding    : 7	(unsigned)
  <c5e>     DW_AT_name        : short unsigned int	
 <1><c71>: Abbrev Number: 29 (DW_TAG_const_type)
  <c72>     DW_AT_type        : <c76>	
 <1><c76>: Abbrev Number: 3 (DW_TAG_base_type)
  <c77>     DW_AT_byte_size   : 4	
  <c78>     DW_AT_encoding    : 5	(signed)
  <c79>     DW_AT_name        : int	
 <1><c7d>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <c7e>     DW_AT_byte_size   : 8	
  <c7f>     DW_AT_type        : <c83>	
 <1><c83>: Abbrev Number: 29 (DW_TAG_const_type)
  <c84>     DW_AT_type        : <c88>	
 <1><c88>: Abbrev Number: 3 (DW_TAG_base_type)
  <c89>     DW_AT_byte_size   : 1	
  <c8a>     DW_AT_encoding    : 6	(signed char)
  <c8b>     DW_AT_name        : char	
 <1><c90>: Abbrev Number: 31 (DW_TAG_subprogram)
  <c91>     DW_AT_external    : 1	
  <c92>     DW_AT_name        : strcoll	
  <c9a>     DW_AT_decl_file   : 20	
  <c9b>     DW_AT_decl_line   : 107	
  <c9c>     DW_AT_type        : <c76>	
  <ca0>     DW_AT_declaration : 1	
  <ca1>     DW_AT_sibling     : <cb0>	
 <2><ca5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <ca6>     DW_AT_type        : <c7d>	
 <2><caa>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <cab>     DW_AT_type        : <c7d>	
 <1><cb0>: Abbrev Number: 31 (DW_TAG_subprogram)
  <cb1>     DW_AT_external    : 1	
  <cb2>     DW_AT_name        : strxfrm	
  <cba>     DW_AT_decl_file   : 20	
  <cbb>     DW_AT_decl_line   : 111	
  <cbc>     DW_AT_type        : <1b6>	
  <cc0>     DW_AT_declaration : 1	
  <cc1>     DW_AT_sibling     : <cd5>	
 <2><cc5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <cc6>     DW_AT_type        : <cd5>	
 <2><cca>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <ccb>     DW_AT_type        : <c7d>	
 <2><ccf>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <cd0>     DW_AT_type        : <1b6>	
 <1><cd5>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <cd6>     DW_AT_byte_size   : 8	
  <cd7>     DW_AT_type        : <c88>	
 <1><cdb>: Abbrev Number: 31 (DW_TAG_subprogram)
  <cdc>     DW_AT_external    : 1	
  <cdd>     DW_AT_name        : strtok	
  <ce4>     DW_AT_decl_file   : 20	
  <ce5>     DW_AT_decl_line   : 200	
  <ce6>     DW_AT_type        : <cd5>	
  <cea>     DW_AT_declaration : 1	
  <ceb>     DW_AT_sibling     : <cfa>	
 <2><cef>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <cf0>     DW_AT_type        : <cd5>	
 <2><cf4>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <cf5>     DW_AT_type        : <c7d>	
 <1><cfa>: Abbrev Number: 32 (DW_TAG_subprogram)
  <cfb>     DW_AT_external    : 1	
  <cfc>     DW_AT_name        : strerror	
  <d05>     DW_AT_decl_file   : 20	
  <d06>     DW_AT_decl_line   : 256	
  <d08>     DW_AT_type        : <cd5>	
  <d0c>     DW_AT_declaration : 1	
  <d0d>     DW_AT_sibling     : <d17>	
 <2><d11>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <d12>     DW_AT_type        : <c76>	
 <1><d17>: Abbrev Number: 31 (DW_TAG_subprogram)
  <d18>     DW_AT_external    : 1	
  <d19>     DW_AT_name        : memchr	
  <d20>     DW_AT_decl_file   : 20	
  <d21>     DW_AT_decl_line   : 67	
  <d22>     DW_AT_type        : <d3b>	
  <d26>     DW_AT_declaration : 1	
  <d27>     DW_AT_sibling     : <d3b>	
 <2><d2b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <d2c>     DW_AT_type        : <d3d>	
 <2><d30>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <d31>     DW_AT_type        : <c76>	
 <2><d35>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <d36>     DW_AT_type        : <1b6>	
 <1><d3b>: Abbrev Number: 33 (DW_TAG_pointer_type)
  <d3c>     DW_AT_byte_size   : 8	
 <1><d3d>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <d3e>     DW_AT_byte_size   : 8	
  <d3f>     DW_AT_type        : <d43>	
 <1><d43>: Abbrev Number: 34 (DW_TAG_const_type)
 <1><d44>: Abbrev Number: 3 (DW_TAG_base_type)
  <d45>     DW_AT_byte_size   : 1	
  <d46>     DW_AT_encoding    : 8	(unsigned char)
  <d47>     DW_AT_name        : unsigned char	
 <1><d55>: Abbrev Number: 3 (DW_TAG_base_type)
  <d56>     DW_AT_byte_size   : 4	
  <d57>     DW_AT_encoding    : 7	(unsigned)
  <d58>     DW_AT_name        : unsigned int	
 <1><d65>: Abbrev Number: 3 (DW_TAG_base_type)
  <d66>     DW_AT_byte_size   : 1	
  <d67>     DW_AT_encoding    : 6	(signed char)
  <d68>     DW_AT_name        : signed char	
 <1><d74>: Abbrev Number: 3 (DW_TAG_base_type)
  <d75>     DW_AT_byte_size   : 2	
  <d76>     DW_AT_encoding    : 5	(signed)
  <d77>     DW_AT_name        : short int	
 <1><d81>: Abbrev Number: 2 (DW_TAG_typedef)
  <d82>     DW_AT_name        : __int32_t	
  <d8c>     DW_AT_decl_file   : 21	
  <d8d>     DW_AT_decl_line   : 41	
  <d8e>     DW_AT_type        : <c76>	
 <1><d92>: Abbrev Number: 2 (DW_TAG_typedef)
  <d93>     DW_AT_name        : __off_t	
  <d9b>     DW_AT_decl_file   : 21	
  <d9c>     DW_AT_decl_line   : 141	
  <d9d>     DW_AT_type        : <1aa>	
 <1><da1>: Abbrev Number: 2 (DW_TAG_typedef)
  <da2>     DW_AT_name        : __off64_t	
  <dac>     DW_AT_decl_file   : 21	
  <dad>     DW_AT_decl_line   : 142	
  <dae>     DW_AT_type        : <1aa>	
 <1><db2>: Abbrev Number: 2 (DW_TAG_typedef)
  <db3>     DW_AT_name        : __clock_t	
  <dbd>     DW_AT_decl_file   : 21	
  <dbe>     DW_AT_decl_line   : 145	
  <dbf>     DW_AT_type        : <1aa>	
 <1><dc3>: Abbrev Number: 2 (DW_TAG_typedef)
  <dc4>     DW_AT_name        : __time_t	
  <dcd>     DW_AT_decl_file   : 21	
  <dce>     DW_AT_decl_line   : 149	
  <dcf>     DW_AT_type        : <1aa>	
 <1><dd3>: Abbrev Number: 2 (DW_TAG_typedef)
  <dd4>     DW_AT_name        : FILE	
  <dd9>     DW_AT_decl_file   : 22	
  <dda>     DW_AT_decl_line   : 49	
  <ddb>     DW_AT_type        : <ddf>	
 <1><ddf>: Abbrev Number: 35 (DW_TAG_structure_type)
  <de0>     DW_AT_name        : _IO_FILE	
  <de9>     DW_AT_byte_size   : 216	
  <dea>     DW_AT_decl_file   : 23	
  <deb>     DW_AT_decl_line   : 271	
  <ded>     DW_AT_sibling     : <106c>	
 <2><df1>: Abbrev Number: 14 (DW_TAG_member)
  <df2>     DW_AT_name        : _flags	
  <df9>     DW_AT_decl_file   : 23	
  <dfa>     DW_AT_decl_line   : 272	
  <dfc>     DW_AT_type        : <c76>	
  <e00>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><e03>: Abbrev Number: 14 (DW_TAG_member)
  <e04>     DW_AT_name        : _IO_read_ptr	
  <e11>     DW_AT_decl_file   : 23	
  <e12>     DW_AT_decl_line   : 277	
  <e14>     DW_AT_type        : <cd5>	
  <e18>     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><e1b>: Abbrev Number: 14 (DW_TAG_member)
  <e1c>     DW_AT_name        : _IO_read_end	
  <e29>     DW_AT_decl_file   : 23	
  <e2a>     DW_AT_decl_line   : 278	
  <e2c>     DW_AT_type        : <cd5>	
  <e30>     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><e33>: Abbrev Number: 14 (DW_TAG_member)
  <e34>     DW_AT_name        : _IO_read_base	
  <e42>     DW_AT_decl_file   : 23	
  <e43>     DW_AT_decl_line   : 279	
  <e45>     DW_AT_type        : <cd5>	
  <e49>     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><e4c>: Abbrev Number: 14 (DW_TAG_member)
  <e4d>     DW_AT_name        : _IO_write_base	
  <e5c>     DW_AT_decl_file   : 23	
  <e5d>     DW_AT_decl_line   : 280	
  <e5f>     DW_AT_type        : <cd5>	
  <e63>     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><e66>: Abbrev Number: 14 (DW_TAG_member)
  <e67>     DW_AT_name        : _IO_write_ptr	
  <e75>     DW_AT_decl_file   : 23	
  <e76>     DW_AT_decl_line   : 281	
  <e78>     DW_AT_type        : <cd5>	
  <e7c>     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><e7f>: Abbrev Number: 14 (DW_TAG_member)
  <e80>     DW_AT_name        : _IO_write_end	
  <e8e>     DW_AT_decl_file   : 23	
  <e8f>     DW_AT_decl_line   : 282	
  <e91>     DW_AT_type        : <cd5>	
  <e95>     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><e98>: Abbrev Number: 14 (DW_TAG_member)
  <e99>     DW_AT_name        : _IO_buf_base	
  <ea6>     DW_AT_decl_file   : 23	
  <ea7>     DW_AT_decl_line   : 283	
  <ea9>     DW_AT_type        : <cd5>	
  <ead>     DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><eb0>: Abbrev Number: 14 (DW_TAG_member)
  <eb1>     DW_AT_name        : _IO_buf_end	
  <ebd>     DW_AT_decl_file   : 23	
  <ebe>     DW_AT_decl_line   : 284	
  <ec0>     DW_AT_type        : <cd5>	
  <ec4>     DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><ec7>: Abbrev Number: 14 (DW_TAG_member)
  <ec8>     DW_AT_name        : _IO_save_base	
  <ed6>     DW_AT_decl_file   : 23	
  <ed7>     DW_AT_decl_line   : 286	
  <ed9>     DW_AT_type        : <cd5>	
  <edd>     DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><ee0>: Abbrev Number: 14 (DW_TAG_member)
  <ee1>     DW_AT_name        : _IO_backup_base	
  <ef1>     DW_AT_decl_file   : 23	
  <ef2>     DW_AT_decl_line   : 287	
  <ef4>     DW_AT_type        : <cd5>	
  <ef8>     DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><efb>: Abbrev Number: 14 (DW_TAG_member)
  <efc>     DW_AT_name        : _IO_save_end	
  <f09>     DW_AT_decl_file   : 23	
  <f0a>     DW_AT_decl_line   : 288	
  <f0c>     DW_AT_type        : <cd5>	
  <f10>     DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><f13>: Abbrev Number: 14 (DW_TAG_member)
  <f14>     DW_AT_name        : _markers	
  <f1d>     DW_AT_decl_file   : 23	
  <f1e>     DW_AT_decl_line   : 290	
  <f20>     DW_AT_type        : <11fc>	
  <f24>     DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><f27>: Abbrev Number: 14 (DW_TAG_member)
  <f28>     DW_AT_name        : _chain	
  <f2f>     DW_AT_decl_file   : 23	
  <f30>     DW_AT_decl_line   : 292	
  <f32>     DW_AT_type        : <1202>	
  <f36>     DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><f39>: Abbrev Number: 14 (DW_TAG_member)
  <f3a>     DW_AT_name        : _fileno	
  <f42>     DW_AT_decl_file   : 23	
  <f43>     DW_AT_decl_line   : 294	
  <f45>     DW_AT_type        : <c76>	
  <f49>     DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><f4c>: Abbrev Number: 14 (DW_TAG_member)
  <f4d>     DW_AT_name        : _flags2	
  <f55>     DW_AT_decl_file   : 23	
  <f56>     DW_AT_decl_line   : 298	
  <f58>     DW_AT_type        : <c76>	
  <f5c>     DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><f5f>: Abbrev Number: 14 (DW_TAG_member)
  <f60>     DW_AT_name        : _old_offset	
  <f6c>     DW_AT_decl_file   : 23	
  <f6d>     DW_AT_decl_line   : 300	
  <f6f>     DW_AT_type        : <d92>	
  <f73>     DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><f76>: Abbrev Number: 14 (DW_TAG_member)
  <f77>     DW_AT_name        : _cur_column	
  <f83>     DW_AT_decl_file   : 23	
  <f84>     DW_AT_decl_line   : 304	
  <f86>     DW_AT_type        : <c5b>	
  <f8a>     DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><f8e>: Abbrev Number: 14 (DW_TAG_member)
  <f8f>     DW_AT_name        : _vtable_offset	
  <f9e>     DW_AT_decl_file   : 23	
  <f9f>     DW_AT_decl_line   : 305	
  <fa1>     DW_AT_type        : <d65>	
  <fa5>     DW_AT_data_member_location: 3 byte block: 23 82 1 	(DW_OP_plus_uconst: 130)
 <2><fa9>: Abbrev Number: 14 (DW_TAG_member)
  <faa>     DW_AT_name        : _shortbuf	
  <fb4>     DW_AT_decl_file   : 23	
  <fb5>     DW_AT_decl_line   : 306	
  <fb7>     DW_AT_type        : <1208>	
  <fbb>     DW_AT_data_member_location: 3 byte block: 23 83 1 	(DW_OP_plus_uconst: 131)
 <2><fbf>: Abbrev Number: 14 (DW_TAG_member)
  <fc0>     DW_AT_name        : _lock	
  <fc6>     DW_AT_decl_file   : 23	
  <fc7>     DW_AT_decl_line   : 310	
  <fc9>     DW_AT_type        : <1218>	
  <fcd>     DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><fd1>: Abbrev Number: 14 (DW_TAG_member)
  <fd2>     DW_AT_name        : _offset	
  <fda>     DW_AT_decl_file   : 23	
  <fdb>     DW_AT_decl_line   : 319	
  <fdd>     DW_AT_type        : <da1>	
  <fe1>     DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><fe5>: Abbrev Number: 14 (DW_TAG_member)
  <fe6>     DW_AT_name        : __pad1	
  <fed>     DW_AT_decl_file   : 23	
  <fee>     DW_AT_decl_line   : 328	
  <ff0>     DW_AT_type        : <d3b>	
  <ff4>     DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><ff8>: Abbrev Number: 14 (DW_TAG_member)
  <ff9>     DW_AT_name        : __pad2	
  <1000>     DW_AT_decl_file   : 23	
  <1001>     DW_AT_decl_line   : 329	
  <1003>     DW_AT_type        : <d3b>	
  <1007>     DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><100b>: Abbrev Number: 14 (DW_TAG_member)
  <100c>     DW_AT_name        : __pad3	
  <1013>     DW_AT_decl_file   : 23	
  <1014>     DW_AT_decl_line   : 330	
  <1016>     DW_AT_type        : <d3b>	
  <101a>     DW_AT_data_member_location: 3 byte block: 23 a8 1 	(DW_OP_plus_uconst: 168)
 <2><101e>: Abbrev Number: 14 (DW_TAG_member)
  <101f>     DW_AT_name        : __pad4	
  <1026>     DW_AT_decl_file   : 23	
  <1027>     DW_AT_decl_line   : 331	
  <1029>     DW_AT_type        : <d3b>	
  <102d>     DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><1031>: Abbrev Number: 14 (DW_TAG_member)
  <1032>     DW_AT_name        : __pad5	
  <1039>     DW_AT_decl_file   : 23	
  <103a>     DW_AT_decl_line   : 332	
  <103c>     DW_AT_type        : <1b6>	
  <1040>     DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><1044>: Abbrev Number: 14 (DW_TAG_member)
  <1045>     DW_AT_name        : _mode	
  <104b>     DW_AT_decl_file   : 23	
  <104c>     DW_AT_decl_line   : 334	
  <104e>     DW_AT_type        : <c76>	
  <1052>     DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><1056>: Abbrev Number: 14 (DW_TAG_member)
  <1057>     DW_AT_name        : _unused2	
  <1060>     DW_AT_decl_file   : 23	
  <1061>     DW_AT_decl_line   : 336	
  <1063>     DW_AT_type        : <121e>	
  <1067>     DW_AT_data_member_location: 3 byte block: 23 c4 1 	(DW_OP_plus_uconst: 196)
 <1><106c>: Abbrev Number: 2 (DW_TAG_typedef)
  <106d>     DW_AT_name        : __FILE	
  <1074>     DW_AT_decl_file   : 22	
  <1075>     DW_AT_decl_line   : 65	
  <1076>     DW_AT_type        : <ddf>	
 <1><107a>: Abbrev Number: 36 (DW_TAG_structure_type)
  <107b>     DW_AT_name        : ._1	
  <107f>     DW_AT_byte_size   : 8	
  <1080>     DW_AT_decl_file   : 24	
  <1081>     DW_AT_decl_line   : 79	
  <1082>     DW_AT_sibling     : <10d3>	
 <2><1086>: Abbrev Number: 37 (DW_TAG_union_type)
  <1087>     DW_AT_name        : ._2	
  <108b>     DW_AT_byte_size   : 4	
  <108c>     DW_AT_decl_file   : 24	
  <108d>     DW_AT_decl_line   : 82	
  <108e>     DW_AT_sibling     : <10ae>	
 <3><1092>: Abbrev Number: 38 (DW_TAG_member)
  <1093>     DW_AT_name        : __wch	
  <1099>     DW_AT_decl_file   : 24	
  <109a>     DW_AT_decl_line   : 84	
  <109b>     DW_AT_type        : <d55>	
 <3><109f>: Abbrev Number: 38 (DW_TAG_member)
  <10a0>     DW_AT_name        : __wchb	
  <10a7>     DW_AT_decl_file   : 24	
  <10a8>     DW_AT_decl_line   : 88	
  <10a9>     DW_AT_type        : <10d3>	
 <2><10ae>: Abbrev Number: 39 (DW_TAG_member)
  <10af>     DW_AT_name        : __count	
  <10b7>     DW_AT_decl_file   : 24	
  <10b8>     DW_AT_decl_line   : 80	
  <10b9>     DW_AT_type        : <c76>	
  <10bd>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c0>: Abbrev Number: 39 (DW_TAG_member)
  <10c1>     DW_AT_name        : __value	
  <10c9>     DW_AT_decl_file   : 24	
  <10ca>     DW_AT_decl_line   : 89	
  <10cb>     DW_AT_type        : <1086>	
  <10cf>     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><10d3>: Abbrev Number: 40 (DW_TAG_array_type)
  <10d4>     DW_AT_type        : <c88>	
  <10d8>     DW_AT_sibling     : <10e3>	
 <2><10dc>: Abbrev Number: 41 (DW_TAG_subrange_type)
  <10dd>     DW_AT_type        : <c53>	
  <10e1>     DW_AT_upper_bound : 3	
 <1><10e3>: Abbrev Number: 36 (DW_TAG_structure_type)
  <10e4>     DW_AT_name        : ._3	
  <10e8>     DW_AT_byte_size   : 16	
  <10e9>     DW_AT_decl_file   : 25	
  <10ea>     DW_AT_decl_line   : 23	
  <10eb>     DW_AT_sibling     : <1112>	
 <2><10ef>: Abbrev Number: 39 (DW_TAG_member)
  <10f0>     DW_AT_name        : __pos	
  <10f6>     DW_AT_decl_file   : 25	
  <10f7>     DW_AT_decl_line   : 24	
  <10f8>     DW_AT_type        : <d92>	
  <10fc>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10ff>: Abbrev Number: 39 (DW_TAG_member)
  <1100>     DW_AT_name        : __state	
  <1108>     DW_AT_decl_file   : 25	
  <1109>     DW_AT_decl_line   : 25	
  <110a>     DW_AT_type        : <107a>	
  <110e>     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><1112>: Abbrev Number: 2 (DW_TAG_typedef)
  <1113>     DW_AT_name        : __gnuc_va_list	
  <1122>     DW_AT_decl_file   : 26	
  <1123>     DW_AT_decl_line   : 43	
  <1124>     DW_AT_type        : <1128>	
 <1><1128>: Abbrev Number: 40 (DW_TAG_array_type)
  <1129>     DW_AT_type        : <1138>	
  <112d>     DW_AT_sibling     : <1138>	
 <2><1131>: Abbrev Number: 41 (DW_TAG_subrange_type)
  <1132>     DW_AT_type        : <c53>	
  <1136>     DW_AT_upper_bound : 0	
 <1><1138>: Abbrev Number: 36 (DW_TAG_structure_type)
  <1139>     DW_AT_name        : __va_list_tag	
  <1147>     DW_AT_byte_size   : 24	
  <1148>     DW_AT_decl_file   : 27	
  <1149>     DW_AT_decl_line   : 0	
  <114a>     DW_AT_sibling     : <11ab>	
 <2><114e>: Abbrev Number: 39 (DW_TAG_member)
  <114f>     DW_AT_name        : gp_offset	
  <1159>     DW_AT_decl_file   : 27	
  <115a>     DW_AT_decl_line   : 0	
  <115b>     DW_AT_type        : <d55>	
  <115f>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1162>: Abbrev Number: 39 (DW_TAG_member)
  <1163>     DW_AT_name        : fp_offset	
  <116d>     DW_AT_decl_file   : 27	
  <116e>     DW_AT_decl_line   : 0	
  <116f>     DW_AT_type        : <d55>	
  <1173>     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1176>: Abbrev Number: 39 (DW_TAG_member)
  <1177>     DW_AT_name        : overflow_arg_area	
  <1189>     DW_AT_decl_file   : 27	
  <118a>     DW_AT_decl_line   : 0	
  <118b>     DW_AT_type        : <d3b>	
  <118f>     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1192>: Abbrev Number: 39 (DW_TAG_member)
  <1193>     DW_AT_name        : reg_save_area	
  <11a1>     DW_AT_decl_file   : 27	
  <11a2>     DW_AT_decl_line   : 0	
  <11a3>     DW_AT_type        : <d3b>	
  <11a7>     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><11ab>: Abbrev Number: 42 (DW_TAG_typedef)
  <11ac>     DW_AT_name        : _IO_lock_t	
  <11b7>     DW_AT_decl_file   : 23	
  <11b8>     DW_AT_decl_line   : 180	
 <1><11b9>: Abbrev Number: 36 (DW_TAG_structure_type)
  <11ba>     DW_AT_name        : _IO_marker	
  <11c5>     DW_AT_byte_size   : 24	
  <11c6>     DW_AT_decl_file   : 23	
  <11c7>     DW_AT_decl_line   : 186	
  <11c8>     DW_AT_sibling     : <11fc>	
 <2><11cc>: Abbrev Number: 39 (DW_TAG_member)
  <11cd>     DW_AT_name        : _next	
  <11d3>     DW_AT_decl_file   : 23	
  <11d4>     DW_AT_decl_line   : 187	
  <11d5>     DW_AT_type        : <11fc>	
  <11d9>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><11dc>: Abbrev Number: 39 (DW_TAG_member)
  <11dd>     DW_AT_name        : _sbuf	
  <11e3>     DW_AT_decl_file   : 23	
  <11e4>     DW_AT_decl_line   : 188	
  <11e5>     DW_AT_type        : <1202>	
  <11e9>     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><11ec>: Abbrev Number: 39 (DW_TAG_member)
  <11ed>     DW_AT_name        : _pos	
  <11f2>     DW_AT_decl_file   : 23	
  <11f3>     DW_AT_decl_line   : 192	
  <11f4>     DW_AT_type        : <c76>	
  <11f8>     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><11fc>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <11fd>     DW_AT_byte_size   : 8	
  <11fe>     DW_AT_type        : <11b9>	
 <1><1202>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1203>     DW_AT_byte_size   : 8	
  <1204>     DW_AT_type        : <ddf>	
 <1><1208>: Abbrev Number: 40 (DW_TAG_array_type)
  <1209>     DW_AT_type        : <c88>	
  <120d>     DW_AT_sibling     : <1218>	
 <2><1211>: Abbrev Number: 41 (DW_TAG_subrange_type)
  <1212>     DW_AT_type        : <c53>	
  <1216>     DW_AT_upper_bound : 0	
 <1><1218>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1219>     DW_AT_byte_size   : 8	
  <121a>     DW_AT_type        : <11ab>	
 <1><121e>: Abbrev Number: 40 (DW_TAG_array_type)
  <121f>     DW_AT_type        : <c88>	
  <1223>     DW_AT_sibling     : <122e>	
 <2><1227>: Abbrev Number: 41 (DW_TAG_subrange_type)
  <1228>     DW_AT_type        : <c53>	
  <122c>     DW_AT_upper_bound : 19	
 <1><122e>: Abbrev Number: 2 (DW_TAG_typedef)
  <122f>     DW_AT_name        : va_list	
  <1237>     DW_AT_decl_file   : 22	
  <1238>     DW_AT_decl_line   : 80	
  <1239>     DW_AT_type        : <1112>	
 <1><123d>: Abbrev Number: 2 (DW_TAG_typedef)
  <123e>     DW_AT_name        : fpos_t	
  <1245>     DW_AT_decl_file   : 22	
  <1246>     DW_AT_decl_line   : 91	
  <1247>     DW_AT_type        : <10e3>	
 <1><124b>: Abbrev Number: 22 (DW_TAG_subprogram)
  <124c>     DW_AT_external    : 1	
  <124d>     DW_AT_name        : clearerr	
  <1256>     DW_AT_decl_file   : 22	
  <1257>     DW_AT_decl_line   : 795	
  <1259>     DW_AT_declaration : 1	
  <125a>     DW_AT_sibling     : <1264>	
 <2><125e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <125f>     DW_AT_type        : <1264>	
 <1><1264>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1265>     DW_AT_byte_size   : 8	
  <1266>     DW_AT_type        : <dd3>	
 <1><126a>: Abbrev Number: 31 (DW_TAG_subprogram)
  <126b>     DW_AT_external    : 1	
  <126c>     DW_AT_name        : fclose	
  <1273>     DW_AT_decl_file   : 22	
  <1274>     DW_AT_decl_line   : 214	
  <1275>     DW_AT_type        : <c76>	
  <1279>     DW_AT_declaration : 1	
  <127a>     DW_AT_sibling     : <1284>	
 <2><127e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <127f>     DW_AT_type        : <1264>	
 <1><1284>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1285>     DW_AT_external    : 1	
  <1286>     DW_AT_name        : feof	
  <128b>     DW_AT_decl_file   : 22	
  <128c>     DW_AT_decl_line   : 797	
  <128e>     DW_AT_type        : <c76>	
  <1292>     DW_AT_declaration : 1	
  <1293>     DW_AT_sibling     : <129d>	
 <2><1297>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1298>     DW_AT_type        : <1264>	
 <1><129d>: Abbrev Number: 32 (DW_TAG_subprogram)
  <129e>     DW_AT_external    : 1	
  <129f>     DW_AT_name        : ferror	
  <12a6>     DW_AT_decl_file   : 22	
  <12a7>     DW_AT_decl_line   : 799	
  <12a9>     DW_AT_type        : <c76>	
  <12ad>     DW_AT_declaration : 1	
  <12ae>     DW_AT_sibling     : <12b8>	
 <2><12b2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <12b3>     DW_AT_type        : <1264>	
 <1><12b8>: Abbrev Number: 31 (DW_TAG_subprogram)
  <12b9>     DW_AT_external    : 1	
  <12ba>     DW_AT_name        : fflush	
  <12c1>     DW_AT_decl_file   : 22	
  <12c2>     DW_AT_decl_line   : 219	
  <12c3>     DW_AT_type        : <c76>	
  <12c7>     DW_AT_declaration : 1	
  <12c8>     DW_AT_sibling     : <12d2>	
 <2><12cc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <12cd>     DW_AT_type        : <1264>	
 <1><12d2>: Abbrev Number: 32 (DW_TAG_subprogram)
  <12d3>     DW_AT_external    : 1	
  <12d4>     DW_AT_name        : fgetc	
  <12da>     DW_AT_decl_file   : 22	
  <12db>     DW_AT_decl_line   : 509	
  <12dd>     DW_AT_type        : <c76>	
  <12e1>     DW_AT_declaration : 1	
  <12e2>     DW_AT_sibling     : <12ec>	
 <2><12e6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <12e7>     DW_AT_type        : <1264>	
 <1><12ec>: Abbrev Number: 32 (DW_TAG_subprogram)
  <12ed>     DW_AT_external    : 1	
  <12ee>     DW_AT_name        : fgetpos	
  <12f6>     DW_AT_decl_file   : 22	
  <12f7>     DW_AT_decl_line   : 767	
  <12f9>     DW_AT_type        : <c76>	
  <12fd>     DW_AT_declaration : 1	
  <12fe>     DW_AT_sibling     : <130d>	
 <2><1302>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1303>     DW_AT_type        : <1264>	
 <2><1307>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1308>     DW_AT_type        : <130d>	
 <1><130d>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <130e>     DW_AT_byte_size   : 8	
  <130f>     DW_AT_type        : <123d>	
 <1><1313>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1314>     DW_AT_external    : 1	
  <1315>     DW_AT_name        : fgets	
  <131b>     DW_AT_decl_file   : 22	
  <131c>     DW_AT_decl_line   : 600	
  <131e>     DW_AT_type        : <cd5>	
  <1322>     DW_AT_declaration : 1	
  <1323>     DW_AT_sibling     : <1337>	
 <2><1327>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1328>     DW_AT_type        : <cd5>	
 <2><132c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <132d>     DW_AT_type        : <c76>	
 <2><1331>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1332>     DW_AT_type        : <1264>	
 <1><1337>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1338>     DW_AT_external    : 1	
  <1339>     DW_AT_name        : fopen	
  <133f>     DW_AT_decl_file   : 22	
  <1340>     DW_AT_decl_line   : 250	
  <1341>     DW_AT_type        : <1264>	
  <1345>     DW_AT_declaration : 1	
  <1346>     DW_AT_sibling     : <1355>	
 <2><134a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <134b>     DW_AT_type        : <c7d>	
 <2><134f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1350>     DW_AT_type        : <c7d>	
 <1><1355>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1356>     DW_AT_external    : 1	
  <1357>     DW_AT_name        : fread	
  <135d>     DW_AT_decl_file   : 22	
  <135e>     DW_AT_decl_line   : 679	
  <1360>     DW_AT_type        : <1b6>	
  <1364>     DW_AT_declaration : 1	
  <1365>     DW_AT_sibling     : <137e>	
 <2><1369>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <136a>     DW_AT_type        : <d3b>	
 <2><136e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <136f>     DW_AT_type        : <1b6>	
 <2><1373>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1374>     DW_AT_type        : <1b6>	
 <2><1378>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1379>     DW_AT_type        : <1264>	
 <1><137e>: Abbrev Number: 32 (DW_TAG_subprogram)
  <137f>     DW_AT_external    : 1	
  <1380>     DW_AT_name        : freopen	
  <1388>     DW_AT_decl_file   : 22	
  <1389>     DW_AT_decl_line   : 257	
  <138b>     DW_AT_type        : <1264>	
  <138f>     DW_AT_declaration : 1	
  <1390>     DW_AT_sibling     : <13a4>	
 <2><1394>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1395>     DW_AT_type        : <c7d>	
 <2><1399>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <139a>     DW_AT_type        : <c7d>	
 <2><139e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <139f>     DW_AT_type        : <1264>	
 <1><13a4>: Abbrev Number: 32 (DW_TAG_subprogram)
  <13a5>     DW_AT_external    : 1	
  <13a6>     DW_AT_name        : fseek	
  <13ac>     DW_AT_decl_file   : 22	
  <13ad>     DW_AT_decl_line   : 718	
  <13af>     DW_AT_type        : <c76>	
  <13b3>     DW_AT_declaration : 1	
  <13b4>     DW_AT_sibling     : <13c8>	
 <2><13b8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <13b9>     DW_AT_type        : <1264>	
 <2><13bd>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <13be>     DW_AT_type        : <1aa>	
 <2><13c2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <13c3>     DW_AT_type        : <c76>	
 <1><13c8>: Abbrev Number: 32 (DW_TAG_subprogram)
  <13c9>     DW_AT_external    : 1	
  <13ca>     DW_AT_name        : fsetpos	
  <13d2>     DW_AT_decl_file   : 22	
  <13d3>     DW_AT_decl_line   : 772	
  <13d5>     DW_AT_type        : <c76>	
  <13d9>     DW_AT_declaration : 1	
  <13da>     DW_AT_sibling     : <13e9>	
 <2><13de>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <13df>     DW_AT_type        : <1264>	
 <2><13e3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <13e4>     DW_AT_type        : <13e9>	
 <1><13e9>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <13ea>     DW_AT_byte_size   : 8	
  <13eb>     DW_AT_type        : <13ef>	
 <1><13ef>: Abbrev Number: 29 (DW_TAG_const_type)
  <13f0>     DW_AT_type        : <123d>	
 <1><13f4>: Abbrev Number: 32 (DW_TAG_subprogram)
  <13f5>     DW_AT_external    : 1	
  <13f6>     DW_AT_name        : ftell	
  <13fc>     DW_AT_decl_file   : 22	
  <13fd>     DW_AT_decl_line   : 723	
  <13ff>     DW_AT_type        : <1aa>	
  <1403>     DW_AT_declaration : 1	
  <1404>     DW_AT_sibling     : <140e>	
 <2><1408>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1409>     DW_AT_type        : <1264>	
 <1><140e>: Abbrev Number: 32 (DW_TAG_subprogram)
  <140f>     DW_AT_external    : 1	
  <1410>     DW_AT_name        : getc	
  <1415>     DW_AT_decl_file   : 22	
  <1416>     DW_AT_decl_line   : 510	
  <1418>     DW_AT_type        : <c76>	
  <141c>     DW_AT_declaration : 1	
  <141d>     DW_AT_sibling     : <1427>	
 <2><1421>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1422>     DW_AT_type        : <1264>	
 <1><1427>: Abbrev Number: 43 (DW_TAG_subprogram)
  <1428>     DW_AT_external    : 1	
  <1429>     DW_AT_name        : getchar	
  <1431>     DW_AT_decl_file   : 22	
  <1432>     DW_AT_decl_line   : 516	
  <1434>     DW_AT_type        : <c76>	
  <1438>     DW_AT_declaration : 1	
 <1><1439>: Abbrev Number: 32 (DW_TAG_subprogram)
  <143a>     DW_AT_external    : 1	
  <143b>     DW_AT_name        : gets	
  <1440>     DW_AT_decl_file   : 22	
  <1441>     DW_AT_decl_line   : 608	
  <1443>     DW_AT_type        : <cd5>	
  <1447>     DW_AT_declaration : 1	
  <1448>     DW_AT_sibling     : <1452>	
 <2><144c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <144d>     DW_AT_type        : <cd5>	
 <1><1452>: Abbrev Number: 22 (DW_TAG_subprogram)
  <1453>     DW_AT_external    : 1	
  <1454>     DW_AT_name        : perror	
  <145b>     DW_AT_decl_file   : 22	
  <145c>     DW_AT_decl_line   : 815	
  <145e>     DW_AT_declaration : 1	
  <145f>     DW_AT_sibling     : <1469>	
 <2><1463>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1464>     DW_AT_type        : <c7d>	
 <1><1469>: Abbrev Number: 31 (DW_TAG_subprogram)
  <146a>     DW_AT_external    : 1	
  <146b>     DW_AT_name        : remove	
  <1472>     DW_AT_decl_file   : 22	
  <1473>     DW_AT_decl_line   : 155	
  <1474>     DW_AT_type        : <c76>	
  <1478>     DW_AT_declaration : 1	
  <1479>     DW_AT_sibling     : <1483>	
 <2><147d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <147e>     DW_AT_type        : <c7d>	
 <1><1483>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1484>     DW_AT_external    : 1	
  <1485>     DW_AT_name        : rename	
  <148c>     DW_AT_decl_file   : 22	
  <148d>     DW_AT_decl_line   : 157	
  <148e>     DW_AT_type        : <c76>	
  <1492>     DW_AT_declaration : 1	
  <1493>     DW_AT_sibling     : <14a2>	
 <2><1497>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1498>     DW_AT_type        : <c7d>	
 <2><149c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <149d>     DW_AT_type        : <c7d>	
 <1><14a2>: Abbrev Number: 22 (DW_TAG_subprogram)
  <14a3>     DW_AT_external    : 1	
  <14a4>     DW_AT_name        : rewind	
  <14ab>     DW_AT_decl_file   : 22	
  <14ac>     DW_AT_decl_line   : 728	
  <14ae>     DW_AT_declaration : 1	
  <14af>     DW_AT_sibling     : <14b9>	
 <2><14b3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14b4>     DW_AT_type        : <1264>	
 <1><14b9>: Abbrev Number: 22 (DW_TAG_subprogram)
  <14ba>     DW_AT_external    : 1	
  <14bb>     DW_AT_name        : setbuf	
  <14c2>     DW_AT_decl_file   : 22	
  <14c3>     DW_AT_decl_line   : 307	
  <14c5>     DW_AT_declaration : 1	
  <14c6>     DW_AT_sibling     : <14d5>	
 <2><14ca>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14cb>     DW_AT_type        : <1264>	
 <2><14cf>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14d0>     DW_AT_type        : <cd5>	
 <1><14d5>: Abbrev Number: 32 (DW_TAG_subprogram)
  <14d6>     DW_AT_external    : 1	
  <14d7>     DW_AT_name        : setvbuf	
  <14df>     DW_AT_decl_file   : 22	
  <14e0>     DW_AT_decl_line   : 312	
  <14e2>     DW_AT_type        : <c76>	
  <14e6>     DW_AT_declaration : 1	
  <14e7>     DW_AT_sibling     : <1500>	
 <2><14eb>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14ec>     DW_AT_type        : <1264>	
 <2><14f0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14f1>     DW_AT_type        : <cd5>	
 <2><14f5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14f6>     DW_AT_type        : <c76>	
 <2><14fa>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <14fb>     DW_AT_type        : <1b6>	
 <1><1500>: Abbrev Number: 44 (DW_TAG_subprogram)
  <1501>     DW_AT_external    : 1	
  <1502>     DW_AT_name        : tmpfile	
  <150a>     DW_AT_decl_file   : 22	
  <150b>     DW_AT_decl_line   : 172	
  <150c>     DW_AT_type        : <1264>	
  <1510>     DW_AT_declaration : 1	
 <1><1511>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1512>     DW_AT_external    : 1	
  <1513>     DW_AT_name        : tmpnam	
  <151a>     DW_AT_decl_file   : 22	
  <151b>     DW_AT_decl_line   : 186	
  <151c>     DW_AT_type        : <cd5>	
  <1520>     DW_AT_declaration : 1	
  <1521>     DW_AT_sibling     : <152b>	
 <2><1525>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1526>     DW_AT_type        : <cd5>	
 <1><152b>: Abbrev Number: 32 (DW_TAG_subprogram)
  <152c>     DW_AT_external    : 1	
  <152d>     DW_AT_name        : ungetc	
  <1534>     DW_AT_decl_file   : 22	
  <1535>     DW_AT_decl_line   : 671	
  <1537>     DW_AT_type        : <c76>	
  <153b>     DW_AT_declaration : 1	
  <153c>     DW_AT_sibling     : <154b>	
 <2><1540>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1541>     DW_AT_type        : <c76>	
 <2><1545>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1546>     DW_AT_type        : <1264>	
 <1><154b>: Abbrev Number: 32 (DW_TAG_subprogram)
  <154c>     DW_AT_external    : 1	
  <154d>     DW_AT_name        : snprintf	
  <1556>     DW_AT_decl_file   : 22	
  <1557>     DW_AT_decl_line   : 363	
  <1559>     DW_AT_type        : <c76>	
  <155d>     DW_AT_declaration : 1	
  <155e>     DW_AT_sibling     : <1573>	
 <2><1562>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1563>     DW_AT_type        : <cd5>	
 <2><1567>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1568>     DW_AT_type        : <1b6>	
 <2><156c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <156d>     DW_AT_type        : <c7d>	
 <2><1571>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1573>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1574>     DW_AT_external    : 1	
  <1575>     DW_AT_name        : vfscanf	
  <157d>     DW_AT_decl_file   : 22	
  <157e>     DW_AT_decl_line   : 451	
  <1580>     DW_AT_type        : <c76>	
  <1584>     DW_AT_declaration : 1	
  <1585>     DW_AT_sibling     : <1599>	
 <2><1589>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <158a>     DW_AT_type        : <1264>	
 <2><158e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <158f>     DW_AT_type        : <c7d>	
 <2><1593>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1594>     DW_AT_type        : <1599>	
 <1><1599>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <159a>     DW_AT_byte_size   : 8	
  <159b>     DW_AT_type        : <1138>	
 <1><159f>: Abbrev Number: 32 (DW_TAG_subprogram)
  <15a0>     DW_AT_external    : 1	
  <15a1>     DW_AT_name        : vscanf	
  <15a8>     DW_AT_decl_file   : 22	
  <15a9>     DW_AT_decl_line   : 458	
  <15ab>     DW_AT_type        : <c76>	
  <15af>     DW_AT_declaration : 1	
  <15b0>     DW_AT_sibling     : <15bf>	
 <2><15b4>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <15b5>     DW_AT_type        : <c7d>	
 <2><15b9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <15ba>     DW_AT_type        : <1599>	
 <1><15bf>: Abbrev Number: 32 (DW_TAG_subprogram)
  <15c0>     DW_AT_external    : 1	
  <15c1>     DW_AT_name        : vsnprintf	
  <15cb>     DW_AT_decl_file   : 22	
  <15cc>     DW_AT_decl_line   : 367	
  <15ce>     DW_AT_type        : <c76>	
  <15d2>     DW_AT_declaration : 1	
  <15d3>     DW_AT_sibling     : <15ec>	
 <2><15d7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <15d8>     DW_AT_type        : <cd5>	
 <2><15dc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <15dd>     DW_AT_type        : <1b6>	
 <2><15e1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <15e2>     DW_AT_type        : <c7d>	
 <2><15e6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <15e7>     DW_AT_type        : <1599>	
 <1><15ec>: Abbrev Number: 32 (DW_TAG_subprogram)
  <15ed>     DW_AT_external    : 1	
  <15ee>     DW_AT_name        : vsscanf	
  <15f6>     DW_AT_decl_file   : 22	
  <15f7>     DW_AT_decl_line   : 463	
  <15f9>     DW_AT_type        : <c76>	
  <15fd>     DW_AT_declaration : 1	
  <15fe>     DW_AT_sibling     : <1612>	
 <2><1602>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1603>     DW_AT_type        : <c7d>	
 <2><1607>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1608>     DW_AT_type        : <c7d>	
 <2><160c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <160d>     DW_AT_type        : <1599>	
 <1><1612>: Abbrev Number: 36 (DW_TAG_structure_type)
  <1613>     DW_AT_name        : lconv	
  <1619>     DW_AT_byte_size   : 96	
  <161a>     DW_AT_decl_file   : 28	
  <161b>     DW_AT_decl_line   : 55	
  <161c>     DW_AT_sibling     : <187b>	
 <2><1620>: Abbrev Number: 39 (DW_TAG_member)
  <1621>     DW_AT_name        : decimal_point	
  <162f>     DW_AT_decl_file   : 28	
  <1630>     DW_AT_decl_line   : 58	
  <1631>     DW_AT_type        : <cd5>	
  <1635>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1638>: Abbrev Number: 39 (DW_TAG_member)
  <1639>     DW_AT_name        : thousands_sep	
  <1647>     DW_AT_decl_file   : 28	
  <1648>     DW_AT_decl_line   : 59	
  <1649>     DW_AT_type        : <cd5>	
  <164d>     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1650>: Abbrev Number: 39 (DW_TAG_member)
  <1651>     DW_AT_name        : grouping	
  <165a>     DW_AT_decl_file   : 28	
  <165b>     DW_AT_decl_line   : 65	
  <165c>     DW_AT_type        : <cd5>	
  <1660>     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1663>: Abbrev Number: 39 (DW_TAG_member)
  <1664>     DW_AT_name        : int_curr_symbol	
  <1674>     DW_AT_decl_file   : 28	
  <1675>     DW_AT_decl_line   : 71	
  <1676>     DW_AT_type        : <cd5>	
  <167a>     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><167d>: Abbrev Number: 39 (DW_TAG_member)
  <167e>     DW_AT_name        : currency_symbol	
  <168e>     DW_AT_decl_file   : 28	
  <168f>     DW_AT_decl_line   : 72	
  <1690>     DW_AT_type        : <cd5>	
  <1694>     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><1697>: Abbrev Number: 39 (DW_TAG_member)
  <1698>     DW_AT_name        : mon_decimal_point	
  <16aa>     DW_AT_decl_file   : 28	
  <16ab>     DW_AT_decl_line   : 73	
  <16ac>     DW_AT_type        : <cd5>	
  <16b0>     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><16b3>: Abbrev Number: 39 (DW_TAG_member)
  <16b4>     DW_AT_name        : mon_thousands_sep	
  <16c6>     DW_AT_decl_file   : 28	
  <16c7>     DW_AT_decl_line   : 74	
  <16c8>     DW_AT_type        : <cd5>	
  <16cc>     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><16cf>: Abbrev Number: 39 (DW_TAG_member)
  <16d0>     DW_AT_name        : mon_grouping	
  <16dd>     DW_AT_decl_file   : 28	
  <16de>     DW_AT_decl_line   : 75	
  <16df>     DW_AT_type        : <cd5>	
  <16e3>     DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><16e6>: Abbrev Number: 39 (DW_TAG_member)
  <16e7>     DW_AT_name        : positive_sign	
  <16f5>     DW_AT_decl_file   : 28	
  <16f6>     DW_AT_decl_line   : 76	
  <16f7>     DW_AT_type        : <cd5>	
  <16fb>     DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><16fe>: Abbrev Number: 39 (DW_TAG_member)
  <16ff>     DW_AT_name        : negative_sign	
  <170d>     DW_AT_decl_file   : 28	
  <170e>     DW_AT_decl_line   : 77	
  <170f>     DW_AT_type        : <cd5>	
  <1713>     DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><1716>: Abbrev Number: 39 (DW_TAG_member)
  <1717>     DW_AT_name        : int_frac_digits	
  <1727>     DW_AT_decl_file   : 28	
  <1728>     DW_AT_decl_line   : 78	
  <1729>     DW_AT_type        : <c88>	
  <172d>     DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><1730>: Abbrev Number: 39 (DW_TAG_member)
  <1731>     DW_AT_name        : frac_digits	
  <173d>     DW_AT_decl_file   : 28	
  <173e>     DW_AT_decl_line   : 79	
  <173f>     DW_AT_type        : <c88>	
  <1743>     DW_AT_data_member_location: 2 byte block: 23 51 	(DW_OP_plus_uconst: 81)
 <2><1746>: Abbrev Number: 39 (DW_TAG_member)
  <1747>     DW_AT_name        : p_cs_precedes	
  <1755>     DW_AT_decl_file   : 28	
  <1756>     DW_AT_decl_line   : 81	
  <1757>     DW_AT_type        : <c88>	
  <175b>     DW_AT_data_member_location: 2 byte block: 23 52 	(DW_OP_plus_uconst: 82)
 <2><175e>: Abbrev Number: 39 (DW_TAG_member)
  <175f>     DW_AT_name        : p_sep_by_space	
  <176e>     DW_AT_decl_file   : 28	
  <176f>     DW_AT_decl_line   : 83	
  <1770>     DW_AT_type        : <c88>	
  <1774>     DW_AT_data_member_location: 2 byte block: 23 53 	(DW_OP_plus_uconst: 83)
 <2><1777>: Abbrev Number: 39 (DW_TAG_member)
  <1778>     DW_AT_name        : n_cs_precedes	
  <1786>     DW_AT_decl_file   : 28	
  <1787>     DW_AT_decl_line   : 85	
  <1788>     DW_AT_type        : <c88>	
  <178c>     DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><178f>: Abbrev Number: 39 (DW_TAG_member)
  <1790>     DW_AT_name        : n_sep_by_space	
  <179f>     DW_AT_decl_file   : 28	
  <17a0>     DW_AT_decl_line   : 87	
  <17a1>     DW_AT_type        : <c88>	
  <17a5>     DW_AT_data_member_location: 2 byte block: 23 55 	(DW_OP_plus_uconst: 85)
 <2><17a8>: Abbrev Number: 39 (DW_TAG_member)
  <17a9>     DW_AT_name        : p_sign_posn	
  <17b5>     DW_AT_decl_file   : 28	
  <17b6>     DW_AT_decl_line   : 94	
  <17b7>     DW_AT_type        : <c88>	
  <17bb>     DW_AT_data_member_location: 2 byte block: 23 56 	(DW_OP_plus_uconst: 86)
 <2><17be>: Abbrev Number: 39 (DW_TAG_member)
  <17bf>     DW_AT_name        : n_sign_posn	
  <17cb>     DW_AT_decl_file   : 28	
  <17cc>     DW_AT_decl_line   : 95	
  <17cd>     DW_AT_type        : <c88>	
  <17d1>     DW_AT_data_member_location: 2 byte block: 23 57 	(DW_OP_plus_uconst: 87)
 <2><17d4>: Abbrev Number: 39 (DW_TAG_member)
  <17d5>     DW_AT_name        : int_p_cs_precedes	
  <17e7>     DW_AT_decl_file   : 28	
  <17e8>     DW_AT_decl_line   : 98	
  <17e9>     DW_AT_type        : <c88>	
  <17ed>     DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><17f0>: Abbrev Number: 39 (DW_TAG_member)
  <17f1>     DW_AT_name        : int_p_sep_by_space	
  <1804>     DW_AT_decl_file   : 28	
  <1805>     DW_AT_decl_line   : 100	
  <1806>     DW_AT_type        : <c88>	
  <180a>     DW_AT_data_member_location: 2 byte block: 23 59 	(DW_OP_plus_uconst: 89)
 <2><180d>: Abbrev Number: 39 (DW_TAG_member)
  <180e>     DW_AT_name        : int_n_cs_precedes	
  <1820>     DW_AT_decl_file   : 28	
  <1821>     DW_AT_decl_line   : 102	
  <1822>     DW_AT_type        : <c88>	
  <1826>     DW_AT_data_member_location: 2 byte block: 23 5a 	(DW_OP_plus_uconst: 90)
 <2><1829>: Abbrev Number: 39 (DW_TAG_member)
  <182a>     DW_AT_name        : int_n_sep_by_space	
  <183d>     DW_AT_decl_file   : 28	
  <183e>     DW_AT_decl_line   : 104	
  <183f>     DW_AT_type        : <c88>	
  <1843>     DW_AT_data_member_location: 2 byte block: 23 5b 	(DW_OP_plus_uconst: 91)
 <2><1846>: Abbrev Number: 39 (DW_TAG_member)
  <1847>     DW_AT_name        : int_p_sign_posn	
  <1857>     DW_AT_decl_file   : 28	
  <1858>     DW_AT_decl_line   : 111	
  <1859>     DW_AT_type        : <c88>	
  <185d>     DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><1860>: Abbrev Number: 39 (DW_TAG_member)
  <1861>     DW_AT_name        : int_n_sign_posn	
  <1871>     DW_AT_decl_file   : 28	
  <1872>     DW_AT_decl_line   : 112	
  <1873>     DW_AT_type        : <c88>	
  <1877>     DW_AT_data_member_location: 2 byte block: 23 5d 	(DW_OP_plus_uconst: 93)
 <1><187b>: Abbrev Number: 31 (DW_TAG_subprogram)
  <187c>     DW_AT_external    : 1	
  <187d>     DW_AT_name        : setlocale	
  <1887>     DW_AT_decl_file   : 28	
  <1888>     DW_AT_decl_line   : 125	
  <1889>     DW_AT_type        : <cd5>	
  <188d>     DW_AT_declaration : 1	
  <188e>     DW_AT_sibling     : <189d>	
 <2><1892>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1893>     DW_AT_type        : <c76>	
 <2><1897>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1898>     DW_AT_type        : <c7d>	
 <1><189d>: Abbrev Number: 44 (DW_TAG_subprogram)
  <189e>     DW_AT_external    : 1	
  <189f>     DW_AT_name        : localeconv	
  <18aa>     DW_AT_decl_file   : 28	
  <18ab>     DW_AT_decl_line   : 128	
  <18ac>     DW_AT_type        : <18b1>	
  <18b0>     DW_AT_declaration : 1	
 <1><18b1>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <18b2>     DW_AT_byte_size   : 8	
  <18b3>     DW_AT_type        : <1612>	
 <1><18b7>: Abbrev Number: 2 (DW_TAG_typedef)
  <18b8>     DW_AT_name        : clock_t	
  <18c0>     DW_AT_decl_file   : 29	
  <18c1>     DW_AT_decl_line   : 61	
  <18c2>     DW_AT_type        : <db2>	
 <1><18c6>: Abbrev Number: 2 (DW_TAG_typedef)
  <18c7>     DW_AT_name        : time_t	
  <18ce>     DW_AT_decl_file   : 29	
  <18cf>     DW_AT_decl_line   : 77	
  <18d0>     DW_AT_type        : <dc3>	
 <1><18d4>: Abbrev Number: 36 (DW_TAG_structure_type)
  <18d5>     DW_AT_name        : tm	
  <18d8>     DW_AT_byte_size   : 56	
  <18d9>     DW_AT_decl_file   : 29	
  <18da>     DW_AT_decl_line   : 135	
  <18db>     DW_AT_sibling     : <19a6>	
 <2><18df>: Abbrev Number: 39 (DW_TAG_member)
  <18e0>     DW_AT_name        : tm_sec	
  <18e7>     DW_AT_decl_file   : 29	
  <18e8>     DW_AT_decl_line   : 136	
  <18e9>     DW_AT_type        : <c76>	
  <18ed>     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><18f0>: Abbrev Number: 39 (DW_TAG_member)
  <18f1>     DW_AT_name        : tm_min	
  <18f8>     DW_AT_decl_file   : 29	
  <18f9>     DW_AT_decl_line   : 137	
  <18fa>     DW_AT_type        : <c76>	
  <18fe>     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1901>: Abbrev Number: 39 (DW_TAG_member)
  <1902>     DW_AT_name        : tm_hour	
  <190a>     DW_AT_decl_file   : 29	
  <190b>     DW_AT_decl_line   : 138	
  <190c>     DW_AT_type        : <c76>	
  <1910>     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1913>: Abbrev Number: 39 (DW_TAG_member)
  <1914>     DW_AT_name        : tm_mday	
  <191c>     DW_AT_decl_file   : 29	
  <191d>     DW_AT_decl_line   : 139	
  <191e>     DW_AT_type        : <c76>	
  <1922>     DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1925>: Abbrev Number: 39 (DW_TAG_member)
  <1926>     DW_AT_name        : tm_mon	
  <192d>     DW_AT_decl_file   : 29	
  <192e>     DW_AT_decl_line   : 140	
  <192f>     DW_AT_type        : <c76>	
  <1933>     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1936>: Abbrev Number: 39 (DW_TAG_member)
  <1937>     DW_AT_name        : tm_year	
  <193f>     DW_AT_decl_file   : 29	
  <1940>     DW_AT_decl_line   : 141	
  <1941>     DW_AT_type        : <c76>	
  <1945>     DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1948>: Abbrev Number: 39 (DW_TAG_member)
  <1949>     DW_AT_name        : tm_wday	
  <1951>     DW_AT_decl_file   : 29	
  <1952>     DW_AT_decl_line   : 142	
  <1953>     DW_AT_type        : <c76>	
  <1957>     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><195a>: Abbrev Number: 39 (DW_TAG_member)
  <195b>     DW_AT_name        : tm_yday	
  <1963>     DW_AT_decl_file   : 29	
  <1964>     DW_AT_decl_line   : 143	
  <1965>     DW_AT_type        : <c76>	
  <1969>     DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><196c>: Abbrev Number: 39 (DW_TAG_member)
  <196d>     DW_AT_name        : tm_isdst	
  <1976>     DW_AT_decl_file   : 29	
  <1977>     DW_AT_decl_line   : 144	
  <1978>     DW_AT_type        : <c76>	
  <197c>     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><197f>: Abbrev Number: 39 (DW_TAG_member)
  <1980>     DW_AT_name        : tm_gmtoff	
  <198a>     DW_AT_decl_file   : 29	
  <198b>     DW_AT_decl_line   : 147	
  <198c>     DW_AT_type        : <1aa>	
  <1990>     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><1993>: Abbrev Number: 39 (DW_TAG_member)
  <1994>     DW_AT_name        : tm_zone	
  <199c>     DW_AT_decl_file   : 29	
  <199d>     DW_AT_decl_line   : 148	
  <199e>     DW_AT_type        : <c7d>	
  <19a2>     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <1><19a6>: Abbrev Number: 3 (DW_TAG_base_type)
  <19a7>     DW_AT_byte_size   : 8	
  <19a8>     DW_AT_encoding    : 7	(unsigned)
  <19a9>     DW_AT_name        : long long unsigned int	
 <1><19c0>: Abbrev Number: 3 (DW_TAG_base_type)
  <19c1>     DW_AT_byte_size   : 8	
  <19c2>     DW_AT_encoding    : 5	(signed)
  <19c3>     DW_AT_name        : long long int	
 <1><19d1>: Abbrev Number: 2 (DW_TAG_typedef)
  <19d2>     DW_AT_name        : pthread_once_t	
  <19e1>     DW_AT_decl_file   : 30	
  <19e2>     DW_AT_decl_line   : 144	
  <19e3>     DW_AT_type        : <c76>	
 <1><19e7>: Abbrev Number: 46 (DW_TAG_volatile_type)
  <19e8>     DW_AT_type        : <c76>	
 <1><19ec>: Abbrev Number: 2 (DW_TAG_typedef)
  <19ed>     DW_AT_name        : __gthread_once_t	
  <19fe>     DW_AT_decl_file   : 31	
  <19ff>     DW_AT_decl_line   : 47	
  <1a00>     DW_AT_type        : <19d1>	
 <1><1a04>: Abbrev Number: 28 (DW_TAG_base_type)
  <1a05>     DW_AT_byte_size   : 8	
  <1a06>     DW_AT_encoding    : 5	(signed)
 <1><1a07>: Abbrev Number: 28 (DW_TAG_base_type)
  <1a08>     DW_AT_byte_size   : 8	
  <1a09>     DW_AT_encoding    : 5	(signed)
 <1><1a0a>: Abbrev Number: 44 (DW_TAG_subprogram)
  <1a0b>     DW_AT_external    : 1	
  <1a0c>     DW_AT_name        : clock	
  <1a12>     DW_AT_decl_file   : 29	
  <1a13>     DW_AT_decl_line   : 184	
  <1a14>     DW_AT_type        : <18b7>	
  <1a18>     DW_AT_declaration : 1	
 <1><1a19>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1a1a>     DW_AT_external    : 1	
  <1a1b>     DW_AT_name        : difftime	
  <1a24>     DW_AT_decl_file   : 29	
  <1a25>     DW_AT_decl_line   : 191	
  <1a26>     DW_AT_type        : <1a3a>	
  <1a2a>     DW_AT_declaration : 1	
  <1a2b>     DW_AT_sibling     : <1a3a>	
 <2><1a2f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1a30>     DW_AT_type        : <18c6>	
 <2><1a34>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1a35>     DW_AT_type        : <18c6>	
 <1><1a3a>: Abbrev Number: 3 (DW_TAG_base_type)
  <1a3b>     DW_AT_byte_size   : 8	
  <1a3c>     DW_AT_encoding    : 4	(float)
  <1a3d>     DW_AT_name        : double	
 <1><1a44>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1a45>     DW_AT_external    : 1	
  <1a46>     DW_AT_name        : mktime	
  <1a4d>     DW_AT_decl_file   : 29	
  <1a4e>     DW_AT_decl_line   : 194	
  <1a4f>     DW_AT_type        : <18c6>	
  <1a53>     DW_AT_declaration : 1	
  <1a54>     DW_AT_sibling     : <1a5e>	
 <2><1a58>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1a59>     DW_AT_type        : <1a5e>	
 <1><1a5e>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1a5f>     DW_AT_byte_size   : 8	
  <1a60>     DW_AT_type        : <18d4>	
 <1><1a64>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1a65>     DW_AT_external    : 1	
  <1a66>     DW_AT_name        : time	
  <1a6b>     DW_AT_decl_file   : 29	
  <1a6c>     DW_AT_decl_line   : 187	
  <1a6d>     DW_AT_type        : <18c6>	
  <1a71>     DW_AT_declaration : 1	
  <1a72>     DW_AT_sibling     : <1a7c>	
 <2><1a76>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1a77>     DW_AT_type        : <1a7c>	
 <1><1a7c>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1a7d>     DW_AT_byte_size   : 8	
  <1a7e>     DW_AT_type        : <18c6>	
 <1><1a82>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1a83>     DW_AT_external    : 1	
  <1a84>     DW_AT_name        : asctime	
  <1a8c>     DW_AT_decl_file   : 29	
  <1a8d>     DW_AT_decl_line   : 254	
  <1a8e>     DW_AT_type        : <cd5>	
  <1a92>     DW_AT_declaration : 1	
  <1a93>     DW_AT_sibling     : <1a9d>	
 <2><1a97>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1a98>     DW_AT_type        : <1a9d>	
 <1><1a9d>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1a9e>     DW_AT_byte_size   : 8	
  <1a9f>     DW_AT_type        : <1aa3>	
 <1><1aa3>: Abbrev Number: 29 (DW_TAG_const_type)
  <1aa4>     DW_AT_type        : <18d4>	
 <1><1aa8>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1aa9>     DW_AT_external    : 1	
  <1aaa>     DW_AT_name        : ctime	
  <1ab0>     DW_AT_decl_file   : 29	
  <1ab1>     DW_AT_decl_line   : 257	
  <1ab3>     DW_AT_type        : <cd5>	
  <1ab7>     DW_AT_declaration : 1	
  <1ab8>     DW_AT_sibling     : <1ac2>	
 <2><1abc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1abd>     DW_AT_type        : <1ac2>	
 <1><1ac2>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1ac3>     DW_AT_byte_size   : 8	
  <1ac4>     DW_AT_type        : <1ac8>	
 <1><1ac8>: Abbrev Number: 29 (DW_TAG_const_type)
  <1ac9>     DW_AT_type        : <18c6>	
 <1><1acd>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1ace>     DW_AT_external    : 1	
  <1acf>     DW_AT_name        : gmtime	
  <1ad6>     DW_AT_decl_file   : 29	
  <1ad7>     DW_AT_decl_line   : 232	
  <1ad8>     DW_AT_type        : <1a5e>	
  <1adc>     DW_AT_declaration : 1	
  <1add>     DW_AT_sibling     : <1ae7>	
 <2><1ae1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ae2>     DW_AT_type        : <1ac2>	
 <1><1ae7>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1ae8>     DW_AT_external    : 1	
  <1ae9>     DW_AT_name        : localtime	
  <1af3>     DW_AT_decl_file   : 29	
  <1af4>     DW_AT_decl_line   : 236	
  <1af5>     DW_AT_type        : <1a5e>	
  <1af9>     DW_AT_declaration : 1	
  <1afa>     DW_AT_sibling     : <1b04>	
 <2><1afe>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1aff>     DW_AT_type        : <1ac2>	
 <1><1b04>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1b05>     DW_AT_external    : 1	
  <1b06>     DW_AT_name        : strftime	
  <1b0f>     DW_AT_decl_file   : 29	
  <1b10>     DW_AT_decl_line   : 202	
  <1b11>     DW_AT_type        : <1b6>	
  <1b15>     DW_AT_declaration : 1	
  <1b16>     DW_AT_sibling     : <1b2f>	
 <2><1b1a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1b1b>     DW_AT_type        : <cd5>	
 <2><1b1f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1b20>     DW_AT_type        : <1b6>	
 <2><1b24>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1b25>     DW_AT_type        : <c7d>	
 <2><1b29>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1b2a>     DW_AT_type        : <1a9d>	
 <1><1b2f>: Abbrev Number: 47 (DW_TAG_typedef)
  <1b30>     DW_AT_name        : wint_t	
  <1b37>     DW_AT_decl_file   : 5	
  <1b38>     DW_AT_decl_line   : 355	
  <1b3a>     DW_AT_type        : <d55>	
 <1><1b3e>: Abbrev Number: 2 (DW_TAG_typedef)
  <1b3f>     DW_AT_name        : mbstate_t	
  <1b49>     DW_AT_decl_file   : 24	
  <1b4a>     DW_AT_decl_line   : 101	
  <1b4b>     DW_AT_type        : <107a>	
 <1><1b4f>: Abbrev Number: 28 (DW_TAG_base_type)
  <1b50>     DW_AT_byte_size   : 4	
  <1b51>     DW_AT_encoding    : 7	(unsigned)
 <1><1b52>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1b53>     DW_AT_external    : 1	
  <1b54>     DW_AT_name        : btowc	
  <1b5a>     DW_AT_decl_file   : 24	
  <1b5b>     DW_AT_decl_line   : 300	
  <1b5d>     DW_AT_type        : <1b2f>	
  <1b61>     DW_AT_declaration : 1	
  <1b62>     DW_AT_sibling     : <1b6c>	
 <2><1b66>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1b67>     DW_AT_type        : <c76>	
 <1><1b6c>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1b6d>     DW_AT_external    : 1	
  <1b6e>     DW_AT_name        : fgetwc	
  <1b75>     DW_AT_decl_file   : 24	
  <1b76>     DW_AT_decl_line   : 692	
  <1b78>     DW_AT_type        : <1b2f>	
  <1b7c>     DW_AT_declaration : 1	
  <1b7d>     DW_AT_sibling     : <1b87>	
 <2><1b81>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1b82>     DW_AT_type        : <1b87>	
 <1><1b87>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1b88>     DW_AT_byte_size   : 8	
  <1b89>     DW_AT_type        : <106c>	
 <1><1b8d>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1b8e>     DW_AT_external    : 1	
  <1b8f>     DW_AT_name        : fgetws	
  <1b96>     DW_AT_decl_file   : 24	
  <1b97>     DW_AT_decl_line   : 722	
  <1b99>     DW_AT_type        : <1bb2>	
  <1b9d>     DW_AT_declaration : 1	
  <1b9e>     DW_AT_sibling     : <1bb2>	
 <2><1ba2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ba3>     DW_AT_type        : <1bb2>	
 <2><1ba7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ba8>     DW_AT_type        : <c76>	
 <2><1bac>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1bad>     DW_AT_type        : <1b87>	
 <1><1bb2>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1bb3>     DW_AT_byte_size   : 8	
  <1bb4>     DW_AT_type        : <1bb8>	
 <1><1bb8>: Abbrev Number: 3 (DW_TAG_base_type)
  <1bb9>     DW_AT_byte_size   : 4	
  <1bba>     DW_AT_encoding    : 5	(signed)
  <1bbb>     DW_AT_name        : wchar_t	
 <1><1bc3>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1bc4>     DW_AT_external    : 1	
  <1bc5>     DW_AT_name        : fputwc	
  <1bcc>     DW_AT_decl_file   : 24	
  <1bcd>     DW_AT_decl_line   : 706	
  <1bcf>     DW_AT_type        : <1b2f>	
  <1bd3>     DW_AT_declaration : 1	
  <1bd4>     DW_AT_sibling     : <1be3>	
 <2><1bd8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1bd9>     DW_AT_type        : <1bb8>	
 <2><1bdd>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1bde>     DW_AT_type        : <1b87>	
 <1><1be3>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1be4>     DW_AT_external    : 1	
  <1be5>     DW_AT_name        : fputws	
  <1bec>     DW_AT_decl_file   : 24	
  <1bed>     DW_AT_decl_line   : 729	
  <1bef>     DW_AT_type        : <c76>	
  <1bf3>     DW_AT_declaration : 1	
  <1bf4>     DW_AT_sibling     : <1c03>	
 <2><1bf8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1bf9>     DW_AT_type        : <1c03>	
 <2><1bfd>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1bfe>     DW_AT_type        : <1b87>	
 <1><1c03>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1c04>     DW_AT_byte_size   : 8	
  <1c05>     DW_AT_type        : <1c09>	
 <1><1c09>: Abbrev Number: 29 (DW_TAG_const_type)
  <1c0a>     DW_AT_type        : <1bb8>	
 <1><1c0e>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1c0f>     DW_AT_external    : 1	
  <1c10>     DW_AT_name        : fwide	
  <1c16>     DW_AT_decl_file   : 24	
  <1c17>     DW_AT_decl_line   : 534	
  <1c19>     DW_AT_type        : <c76>	
  <1c1d>     DW_AT_declaration : 1	
  <1c1e>     DW_AT_sibling     : <1c2d>	
 <2><1c22>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c23>     DW_AT_type        : <1b87>	
 <2><1c27>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c28>     DW_AT_type        : <c76>	
 <1><1c2d>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1c2e>     DW_AT_external    : 1	
  <1c2f>     DW_AT_name        : fwprintf	
  <1c38>     DW_AT_decl_file   : 24	
  <1c39>     DW_AT_decl_line   : 542	
  <1c3b>     DW_AT_type        : <c76>	
  <1c3f>     DW_AT_declaration : 1	
  <1c40>     DW_AT_sibling     : <1c50>	
 <2><1c44>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c45>     DW_AT_type        : <1b87>	
 <2><1c49>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c4a>     DW_AT_type        : <1c03>	
 <2><1c4e>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1c50>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1c51>     DW_AT_external    : 1	
  <1c52>     DW_AT_name        : fwscanf	
  <1c5a>     DW_AT_decl_file   : 24	
  <1c5b>     DW_AT_decl_line   : 583	
  <1c5d>     DW_AT_type        : <c76>	
  <1c61>     DW_AT_declaration : 1	
  <1c62>     DW_AT_sibling     : <1c72>	
 <2><1c66>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c67>     DW_AT_type        : <1b87>	
 <2><1c6b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c6c>     DW_AT_type        : <1c03>	
 <2><1c70>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1c72>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1c73>     DW_AT_external    : 1	
  <1c74>     DW_AT_name        : getwc	
  <1c7a>     DW_AT_decl_file   : 24	
  <1c7b>     DW_AT_decl_line   : 693	
  <1c7d>     DW_AT_type        : <1b2f>	
  <1c81>     DW_AT_declaration : 1	
  <1c82>     DW_AT_sibling     : <1c8c>	
 <2><1c86>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1c87>     DW_AT_type        : <1b87>	
 <1><1c8c>: Abbrev Number: 43 (DW_TAG_subprogram)
  <1c8d>     DW_AT_external    : 1	
  <1c8e>     DW_AT_name        : getwchar	
  <1c97>     DW_AT_decl_file   : 24	
  <1c98>     DW_AT_decl_line   : 699	
  <1c9a>     DW_AT_type        : <1b2f>	
  <1c9e>     DW_AT_declaration : 1	
 <1><1c9f>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1ca0>     DW_AT_external    : 1	
  <1ca1>     DW_AT_name        : mbrlen	
  <1ca8>     DW_AT_decl_file   : 24	
  <1ca9>     DW_AT_decl_line   : 324	
  <1cab>     DW_AT_type        : <1b6>	
  <1caf>     DW_AT_declaration : 1	
  <1cb0>     DW_AT_sibling     : <1cc4>	
 <2><1cb4>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1cb5>     DW_AT_type        : <c7d>	
 <2><1cb9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1cba>     DW_AT_type        : <1b6>	
 <2><1cbe>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1cbf>     DW_AT_type        : <1cc4>	
 <1><1cc4>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1cc5>     DW_AT_byte_size   : 8	
  <1cc6>     DW_AT_type        : <1b3e>	
 <1><1cca>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1ccb>     DW_AT_external    : 1	
  <1ccc>     DW_AT_name        : mbrtowc	
  <1cd4>     DW_AT_decl_file   : 24	
  <1cd5>     DW_AT_decl_line   : 314	
  <1cd7>     DW_AT_type        : <1b6>	
  <1cdb>     DW_AT_declaration : 1	
  <1cdc>     DW_AT_sibling     : <1cf5>	
 <2><1ce0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ce1>     DW_AT_type        : <1bb2>	
 <2><1ce5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ce6>     DW_AT_type        : <c7d>	
 <2><1cea>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ceb>     DW_AT_type        : <1b6>	
 <2><1cef>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1cf0>     DW_AT_type        : <1cc4>	
 <1><1cf5>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1cf6>     DW_AT_external    : 1	
  <1cf7>     DW_AT_name        : mbsinit	
  <1cff>     DW_AT_decl_file   : 24	
  <1d00>     DW_AT_decl_line   : 308	
  <1d02>     DW_AT_type        : <c76>	
  <1d06>     DW_AT_declaration : 1	
  <1d07>     DW_AT_sibling     : <1d11>	
 <2><1d0b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d0c>     DW_AT_type        : <1d11>	
 <1><1d11>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1d12>     DW_AT_byte_size   : 8	
  <1d13>     DW_AT_type        : <1d17>	
 <1><1d17>: Abbrev Number: 29 (DW_TAG_const_type)
  <1d18>     DW_AT_type        : <1b3e>	
 <1><1d1c>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1d1d>     DW_AT_external    : 1	
  <1d1e>     DW_AT_name        : mbsrtowcs	
  <1d28>     DW_AT_decl_file   : 24	
  <1d29>     DW_AT_decl_line   : 357	
  <1d2b>     DW_AT_type        : <1b6>	
  <1d2f>     DW_AT_declaration : 1	
  <1d30>     DW_AT_sibling     : <1d49>	
 <2><1d34>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d35>     DW_AT_type        : <1bb2>	
 <2><1d39>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d3a>     DW_AT_type        : <1d49>	
 <2><1d3e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d3f>     DW_AT_type        : <1b6>	
 <2><1d43>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d44>     DW_AT_type        : <1cc4>	
 <1><1d49>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <1d4a>     DW_AT_byte_size   : 8	
  <1d4b>     DW_AT_type        : <c7d>	
 <1><1d4f>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1d50>     DW_AT_external    : 1	
  <1d51>     DW_AT_name        : putwc	
  <1d57>     DW_AT_decl_file   : 24	
  <1d58>     DW_AT_decl_line   : 707	
  <1d5a>     DW_AT_type        : <1b2f>	
  <1d5e>     DW_AT_declaration : 1	
  <1d5f>     DW_AT_sibling     : <1d6e>	
 <2><1d63>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d64>     DW_AT_type        : <1bb8>	
 <2><1d68>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d69>     DW_AT_type        : <1b87>	
 <1><1d6e>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1d6f>     DW_AT_external    : 1	
  <1d70>     DW_AT_name        : putwchar	
  <1d79>     DW_AT_decl_file   : 24	
  <1d7a>     DW_AT_decl_line   : 713	
  <1d7c>     DW_AT_type        : <1b2f>	
  <1d80>     DW_AT_declaration : 1	
  <1d81>     DW_AT_sibling     : <1d8b>	
 <2><1d85>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1d86>     DW_AT_type        : <1bb8>	
 <1><1d8b>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1d8c>     DW_AT_external    : 1	
  <1d8d>     DW_AT_name        : swprintf	
  <1d96>     DW_AT_decl_file   : 24	
  <1d97>     DW_AT_decl_line   : 553	
  <1d99>     DW_AT_type        : <c76>	
  <1d9d>     DW_AT_declaration : 1	
  <1d9e>     DW_AT_sibling     : <1db3>	
 <2><1da2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1da3>     DW_AT_type        : <1bb2>	
 <2><1da7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1da8>     DW_AT_type        : <1b6>	
 <2><1dac>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1dad>     DW_AT_type        : <1c03>	
 <2><1db1>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1db3>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1db4>     DW_AT_external    : 1	
  <1db5>     DW_AT_name        : swscanf	
  <1dbd>     DW_AT_decl_file   : 24	
  <1dbe>     DW_AT_decl_line   : 594	
  <1dc0>     DW_AT_type        : <c76>	
  <1dc4>     DW_AT_declaration : 1	
  <1dc5>     DW_AT_sibling     : <1dd5>	
 <2><1dc9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1dca>     DW_AT_type        : <1c03>	
 <2><1dce>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1dcf>     DW_AT_type        : <1c03>	
 <2><1dd3>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1dd5>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1dd6>     DW_AT_external    : 1	
  <1dd7>     DW_AT_name        : ungetwc	
  <1ddf>     DW_AT_decl_file   : 24	
  <1de0>     DW_AT_decl_line   : 736	
  <1de2>     DW_AT_type        : <1b2f>	
  <1de6>     DW_AT_declaration : 1	
  <1de7>     DW_AT_sibling     : <1df6>	
 <2><1deb>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1dec>     DW_AT_type        : <1b2f>	
 <2><1df0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1df1>     DW_AT_type        : <1b87>	
 <1><1df6>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1df7>     DW_AT_external    : 1	
  <1df8>     DW_AT_name        : vfwprintf	
  <1e02>     DW_AT_decl_file   : 24	
  <1e03>     DW_AT_decl_line   : 561	
  <1e05>     DW_AT_type        : <c76>	
  <1e09>     DW_AT_declaration : 1	
  <1e0a>     DW_AT_sibling     : <1e1e>	
 <2><1e0e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e0f>     DW_AT_type        : <1b87>	
 <2><1e13>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e14>     DW_AT_type        : <1c03>	
 <2><1e18>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e19>     DW_AT_type        : <1599>	
 <1><1e1e>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1e1f>     DW_AT_external    : 1	
  <1e20>     DW_AT_name        : vfwscanf	
  <1e29>     DW_AT_decl_file   : 24	
  <1e2a>     DW_AT_decl_line   : 638	
  <1e2c>     DW_AT_type        : <c76>	
  <1e30>     DW_AT_declaration : 1	
  <1e31>     DW_AT_sibling     : <1e45>	
 <2><1e35>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e36>     DW_AT_type        : <1b87>	
 <2><1e3a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e3b>     DW_AT_type        : <1c03>	
 <2><1e3f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e40>     DW_AT_type        : <1599>	
 <1><1e45>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1e46>     DW_AT_external    : 1	
  <1e47>     DW_AT_name        : vswprintf	
  <1e51>     DW_AT_decl_file   : 24	
  <1e52>     DW_AT_decl_line   : 575	
  <1e54>     DW_AT_type        : <c76>	
  <1e58>     DW_AT_declaration : 1	
  <1e59>     DW_AT_sibling     : <1e72>	
 <2><1e5d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e5e>     DW_AT_type        : <1bb2>	
 <2><1e62>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e63>     DW_AT_type        : <1b6>	
 <2><1e67>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e68>     DW_AT_type        : <1c03>	
 <2><1e6c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e6d>     DW_AT_type        : <1599>	
 <1><1e72>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1e73>     DW_AT_external    : 1	
  <1e74>     DW_AT_name        : vswscanf	
  <1e7d>     DW_AT_decl_file   : 24	
  <1e7e>     DW_AT_decl_line   : 651	
  <1e80>     DW_AT_type        : <c76>	
  <1e84>     DW_AT_declaration : 1	
  <1e85>     DW_AT_sibling     : <1e99>	
 <2><1e89>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e8a>     DW_AT_type        : <1c03>	
 <2><1e8e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e8f>     DW_AT_type        : <1c03>	
 <2><1e93>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1e94>     DW_AT_type        : <1599>	
 <1><1e99>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1e9a>     DW_AT_external    : 1	
  <1e9b>     DW_AT_name        : vwprintf	
  <1ea4>     DW_AT_decl_file   : 24	
  <1ea5>     DW_AT_decl_line   : 568	
  <1ea7>     DW_AT_type        : <c76>	
  <1eab>     DW_AT_declaration : 1	
  <1eac>     DW_AT_sibling     : <1ebb>	
 <2><1eb0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1eb1>     DW_AT_type        : <1c03>	
 <2><1eb5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1eb6>     DW_AT_type        : <1599>	
 <1><1ebb>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1ebc>     DW_AT_external    : 1	
  <1ebd>     DW_AT_name        : vwscanf	
  <1ec5>     DW_AT_decl_file   : 24	
  <1ec6>     DW_AT_decl_line   : 645	
  <1ec8>     DW_AT_type        : <c76>	
  <1ecc>     DW_AT_declaration : 1	
  <1ecd>     DW_AT_sibling     : <1edc>	
 <2><1ed1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ed2>     DW_AT_type        : <1c03>	
 <2><1ed6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ed7>     DW_AT_type        : <1599>	
 <1><1edc>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1edd>     DW_AT_external    : 1	
  <1ede>     DW_AT_name        : wcrtomb	
  <1ee6>     DW_AT_decl_file   : 24	
  <1ee7>     DW_AT_decl_line   : 318	
  <1ee9>     DW_AT_type        : <1b6>	
  <1eed>     DW_AT_declaration : 1	
  <1eee>     DW_AT_sibling     : <1f02>	
 <2><1ef2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ef3>     DW_AT_type        : <cd5>	
 <2><1ef7>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ef8>     DW_AT_type        : <1bb8>	
 <2><1efc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1efd>     DW_AT_type        : <1cc4>	
 <1><1f02>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1f03>     DW_AT_external    : 1	
  <1f04>     DW_AT_name        : wcscat	
  <1f0b>     DW_AT_decl_file   : 24	
  <1f0c>     DW_AT_decl_line   : 148	
  <1f0d>     DW_AT_type        : <1bb2>	
  <1f11>     DW_AT_declaration : 1	
  <1f12>     DW_AT_sibling     : <1f21>	
 <2><1f16>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f17>     DW_AT_type        : <1bb2>	
 <2><1f1b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f1c>     DW_AT_type        : <1c03>	
 <1><1f21>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1f22>     DW_AT_external    : 1	
  <1f23>     DW_AT_name        : wcscmp	
  <1f2a>     DW_AT_decl_file   : 24	
  <1f2b>     DW_AT_decl_line   : 156	
  <1f2c>     DW_AT_type        : <c76>	
  <1f30>     DW_AT_declaration : 1	
  <1f31>     DW_AT_sibling     : <1f40>	
 <2><1f35>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f36>     DW_AT_type        : <1c03>	
 <2><1f3a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f3b>     DW_AT_type        : <1c03>	
 <1><1f40>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1f41>     DW_AT_external    : 1	
  <1f42>     DW_AT_name        : wcscoll	
  <1f4a>     DW_AT_decl_file   : 24	
  <1f4b>     DW_AT_decl_line   : 184	
  <1f4c>     DW_AT_type        : <c76>	
  <1f50>     DW_AT_declaration : 1	
  <1f51>     DW_AT_sibling     : <1f60>	
 <2><1f55>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f56>     DW_AT_type        : <1c03>	
 <2><1f5a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f5b>     DW_AT_type        : <1c03>	
 <1><1f60>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1f61>     DW_AT_external    : 1	
  <1f62>     DW_AT_name        : wcscpy	
  <1f69>     DW_AT_decl_file   : 24	
  <1f6a>     DW_AT_decl_line   : 140	
  <1f6b>     DW_AT_type        : <1bb2>	
  <1f6f>     DW_AT_declaration : 1	
  <1f70>     DW_AT_sibling     : <1f7f>	
 <2><1f74>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f75>     DW_AT_type        : <1bb2>	
 <2><1f79>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f7a>     DW_AT_type        : <1c03>	
 <1><1f7f>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1f80>     DW_AT_external    : 1	
  <1f81>     DW_AT_name        : wcscspn	
  <1f89>     DW_AT_decl_file   : 24	
  <1f8a>     DW_AT_decl_line   : 231	
  <1f8b>     DW_AT_type        : <1b6>	
  <1f8f>     DW_AT_declaration : 1	
  <1f90>     DW_AT_sibling     : <1f9f>	
 <2><1f94>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f95>     DW_AT_type        : <1c03>	
 <2><1f99>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1f9a>     DW_AT_type        : <1c03>	
 <1><1f9f>: Abbrev Number: 32 (DW_TAG_subprogram)
  <1fa0>     DW_AT_external    : 1	
  <1fa1>     DW_AT_name        : wcsftime	
  <1faa>     DW_AT_decl_file   : 24	
  <1fab>     DW_AT_decl_line   : 804	
  <1fad>     DW_AT_type        : <1b6>	
  <1fb1>     DW_AT_declaration : 1	
  <1fb2>     DW_AT_sibling     : <1fcb>	
 <2><1fb6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1fb7>     DW_AT_type        : <1bb2>	
 <2><1fbb>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1fbc>     DW_AT_type        : <1b6>	
 <2><1fc0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1fc1>     DW_AT_type        : <1c03>	
 <2><1fc5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1fc6>     DW_AT_type        : <1a9d>	
 <1><1fcb>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1fcc>     DW_AT_external    : 1	
  <1fcd>     DW_AT_name        : wcslen	
  <1fd4>     DW_AT_decl_file   : 24	
  <1fd5>     DW_AT_decl_line   : 249	
  <1fd6>     DW_AT_type        : <1b6>	
  <1fda>     DW_AT_declaration : 1	
  <1fdb>     DW_AT_sibling     : <1fe5>	
 <2><1fdf>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1fe0>     DW_AT_type        : <1c03>	
 <1><1fe5>: Abbrev Number: 31 (DW_TAG_subprogram)
  <1fe6>     DW_AT_external    : 1	
  <1fe7>     DW_AT_name        : wcsncat	
  <1fef>     DW_AT_decl_file   : 24	
  <1ff0>     DW_AT_decl_line   : 152	
  <1ff1>     DW_AT_type        : <1bb2>	
  <1ff5>     DW_AT_declaration : 1	
  <1ff6>     DW_AT_sibling     : <200a>	
 <2><1ffa>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <1ffb>     DW_AT_type        : <1bb2>	
 <2><1fff>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2000>     DW_AT_type        : <1c03>	
 <2><2004>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2005>     DW_AT_type        : <1b6>	
 <1><200a>: Abbrev Number: 31 (DW_TAG_subprogram)
  <200b>     DW_AT_external    : 1	
  <200c>     DW_AT_name        : wcsncmp	
  <2014>     DW_AT_decl_file   : 24	
  <2015>     DW_AT_decl_line   : 159	
  <2016>     DW_AT_type        : <c76>	
  <201a>     DW_AT_declaration : 1	
  <201b>     DW_AT_sibling     : <202f>	
 <2><201f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2020>     DW_AT_type        : <1c03>	
 <2><2024>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2025>     DW_AT_type        : <1c03>	
 <2><2029>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <202a>     DW_AT_type        : <1b6>	
 <1><202f>: Abbrev Number: 31 (DW_TAG_subprogram)
  <2030>     DW_AT_external    : 1	
  <2031>     DW_AT_name        : wcsncpy	
  <2039>     DW_AT_decl_file   : 24	
  <203a>     DW_AT_decl_line   : 144	
  <203b>     DW_AT_type        : <1bb2>	
  <203f>     DW_AT_declaration : 1	
  <2040>     DW_AT_sibling     : <2054>	
 <2><2044>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2045>     DW_AT_type        : <1bb2>	
 <2><2049>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <204a>     DW_AT_type        : <1c03>	
 <2><204e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <204f>     DW_AT_type        : <1b6>	
 <1><2054>: Abbrev Number: 32 (DW_TAG_subprogram)
  <2055>     DW_AT_external    : 1	
  <2056>     DW_AT_name        : wcsrtombs	
  <2060>     DW_AT_decl_file   : 24	
  <2061>     DW_AT_decl_line   : 363	
  <2063>     DW_AT_type        : <1b6>	
  <2067>     DW_AT_declaration : 1	
  <2068>     DW_AT_sibling     : <2081>	
 <2><206c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <206d>     DW_AT_type        : <cd5>	
 <2><2071>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2072>     DW_AT_type        : <2081>	
 <2><2076>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <2077>     DW_AT_type        : <1b6>	
 <2><207b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <207c>     DW_AT_type        : <1cc4>	
 <1><2081>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <2082>     DW_AT_byte_size   : 8	
  <2083>     DW_AT_type        : <1c03>	
 <1><2087>: Abbrev Number: 31 (DW_TAG_subprogram)
  <2088>     DW_AT_external    : 1	
  <2089>     DW_AT_name        : wcsspn	
  <2090>     DW_AT_decl_file   : 24	
  <2091>     DW_AT_decl_line   : 235	
  <2092>     DW_AT_type        : <1b6>	
  <2096>     DW_AT_declaration : 1	
  <2097>     DW_AT_sibling     : <20a6>	
 <2><209b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <209c>     DW_AT_type        : <1c03>	
 <2><20a0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <20a1>     DW_AT_type        : <1c03>	
 <1><20a6>: Abbrev Number: 32 (DW_TAG_subprogram)
  <20a7>     DW_AT_external    : 1	
  <20a8>     DW_AT_name        : wcstod	
  <20af>     DW_AT_decl_file   : 24	
  <20b0>     DW_AT_decl_line   : 398	
  <20b2>     DW_AT_type        : <1a3a>	
  <20b6>     DW_AT_declaration : 1	
  <20b7>     DW_AT_sibling     : <20c6>	
 <2><20bb>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <20bc>     DW_AT_type        : <1c03>	
 <2><20c0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
  <20c1>     DW_AT_type        : <20c6>	
 <1><20c6>: Abbrev Number: 30 (DW_TAG_pointer_type)
  <20c7>     DW_AT_byte_size   : 8	
