The section .debug_info contains:

  Compilation Unit @ offset 0x0:
   Length:        139
   Version:       2
   Abbrev Offset: 0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
     DW_AT_stmt_list   : 0	
     DW_AT_high_pc     : 0x40084c	
     DW_AT_low_pc      : 0x40084c	
     DW_AT_producer    : (indirect string, offset: 0x11): GNU C 4.1.2 (Ubuntu 4.1.2-0ubuntu4)	
     DW_AT_language    : 1	(ANSI C)
     DW_AT_name        : (indirect string, offset: 0x0): init.c	
     DW_AT_comp_dir    : (indirect string, offset: 0x5f): /build/buildd/glibc-2.5/build-tree/glibc-2.5/csu	
 <1><2d>: Abbrev Number: 2 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x90): long unsigned int	
     DW_AT_byte_size   : 8	
     DW_AT_encoding    : 7	(unsigned)
 <1><34>: Abbrev Number: 2 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x3e): unsigned char	
     DW_AT_byte_size   : 1	
     DW_AT_encoding    : 8	(unsigned char)
 <1><3b>: Abbrev Number: 2 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x4c): short unsigned int	
     DW_AT_byte_size   : 2	
     DW_AT_encoding    : 7	(unsigned)
 <1><42>: Abbrev Number: 2 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x95): unsigned int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 7	(unsigned)
 <1><49>: Abbrev Number: 2 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x40): signed char	
     DW_AT_byte_size   : 1	

     DW_AT_import      : <254d>	
 <2><567>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 112	
     DW_AT_import      : <2565>	
 <2><56e>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 113	
     DW_AT_import      : <257d>	
 <2><575>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 114	
     DW_AT_import      : <2595>	
 <2><57c>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 116	
     DW_AT_import      : <25c5>	
 <2><583>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 118	
     DW_AT_import      : <25e2>	
 <2><58a>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 119	
     DW_AT_import      : <25f7>	
 <2><591>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 121	
     DW_AT_import      : <2612>	
 <2><598>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 124	
     DW_AT_import      : <2630>	
 <2><59f>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 125	
     DW_AT_import      : <264f>	
 <2><5a6>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 126	
     DW_AT_import      : <2676>	
 <2><5ad>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 128	
     DW_AT_import      : <269b>	
 <2><5b4>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 129	
     DW_AT_import      : <26c0>	
 <2><5bb>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 130	
     DW_AT_import      : <26cf>	
 <2><5c2>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 131	
     DW_AT_import      : <26f0>	
 <2><5c9>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 132	
     DW_AT_import      : <2706>	
 <2><5d0>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 133	
     DW_AT_import      : <272b>	
 <2><5d7>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 134	
     DW_AT_import      : <274f>	
 <2><5de>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 135	
     DW_AT_import      : <2774>	
 <2><5e5>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 137	
     DW_AT_import      : <278f>	
 <2><5ec>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 138	
     DW_AT_import      : <27b6>	
 <2><5f3>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 203	
     DW_AT_import      : <24d0>	
 <2><5fa>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 205	
     DW_AT_import      : <2898>	
 <2><601>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 206	
     DW_AT_import      : <22be>	
 <2><608>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 208	
     DW_AT_import      : <28ae>	
 <2><60f>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 209	
     DW_AT_import      : <22e9>	
 <2><616>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 210	
     DW_AT_import      : <27d6>	
 <2><61d>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 212	
     DW_AT_import      : <27f5>	
 <2><624>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 213	
     DW_AT_import      : <2859>	
 <2><62b>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 214	
     DW_AT_import      : <280e>	
 <2><632>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 215	
     DW_AT_import      : <2833>	
 <2><639>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 216	
     DW_AT_import      : <2878>	
 <2><640>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : nothrow_t	
     DW_AT_declaration : 1	
 <2><64c>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : allocator<char>	
     DW_AT_declaration : 1	
 <2><65e>: Abbrev Number: 11 (DW_TAG_enumeration_type)
     DW_AT_sibling     : <6b2>	
     DW_AT_name        : float_denorm_style	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 109	
     DW_AT_decl_line   : 171	
 <3><679>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : denorm_indeterminate	
     DW_AT_const_value : -1	
 <3><690>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : denorm_absent	
     DW_AT_const_value : 0	
 <3><6a0>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : denorm_present	
     DW_AT_const_value : 1	
 <2><6b2>: Abbrev Number: 13 (DW_TAG_structure_type)
     DW_AT_sibling     : <736>	
     DW_AT_name        : basic_string<char,std::char_traits<char>,std::allocator<char> >	
     DW_AT_declaration : 1	
 <3><6f8>: Abbrev Number: 14 (DW_TAG_structure_type)
     DW_AT_name        : (indirect string, offset: 0x133): _Alloc_hider	
     DW_AT_byte_size   : 8	
     DW_AT_decl_file   : 111	
     DW_AT_decl_line   : 255	
 <4><700>: Abbrev Number: 15 (DW_TAG_inheritance)
     DW_AT_type        : <2b8f>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
     DW_AT_accessibility: 1	(public)
 <4><709>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _M_p	
     DW_AT_decl_file   : 111	
     DW_AT_decl_line   : 259	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <4><719>: Abbrev Number: 17 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : (indirect string, offset: 0x133): _Alloc_hider	
     DW_AT_decl_file   : 111	
     DW_AT_decl_line   : 256	
     DW_AT_declaration : 1	
 <5><723>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     DW_AT_type        : <2c0a>	
     DW_AT_artificial  : 1	
 <5><729>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <5><72e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <2bf5>	
 <2><736>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : reverse_iterator<__gnu_cxx::__normal_iterator<const char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >	
     DW_AT_declaration : 1	
 <2><7be>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : reverse_iterator<__gnu_cxx::__normal_iterator<char*, std::basic_string<char, std::char_traits<char>, std::allocator<char> > > >	
     DW_AT_declaration : 1	
 <2><840>: Abbrev Number: 20 (DW_TAG_structure_type)
     DW_AT_name        : (indirect string, offset: 0x319): locale	
     DW_AT_declaration : 1	
 <2><846>: Abbrev Number: 11 (DW_TAG_enumeration_type)
     DW_AT_sibling     : <96d>	
     DW_AT_name        : _Ios_Fmtflags	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 55	
 <3><85c>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_boolalpha	
     DW_AT_const_value : 1	
 <3><86b>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_dec	
     DW_AT_const_value : 2	
 <3><874>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_fixed	
     DW_AT_const_value : 4	
 <3><87f>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_hex	
     DW_AT_const_value : 8	
 <3><888>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_internal	
     DW_AT_const_value : 16	
 <3><896>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_left	
     DW_AT_const_value : 32	
 <3><8a0>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_oct	
     DW_AT_const_value : 64	
 <3><8aa>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_right	
     DW_AT_const_value : 128	
 <3><8b6>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_scientific	
     DW_AT_const_value : 256	
 <3><8c7>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_showbase	
     DW_AT_const_value : 512	
 <3><8d6>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_showpoint	
     DW_AT_const_value : 1024	
 <3><8e6>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_showpos	
     DW_AT_const_value : 2048	
 <3><8f4>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_skipws	
     DW_AT_const_value : 4096	
 <3><901>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_unitbuf	
     DW_AT_const_value : 8192	
 <3><910>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_uppercase	
     DW_AT_const_value : 16384	
 <3><921>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_adjustfield	
     DW_AT_const_value : 176	
 <3><933>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_basefield	
     DW_AT_const_value : 74	
 <3><943>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_floatfield	
     DW_AT_const_value : 260	
 <3><954>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_ios_fmtflags_end	
     DW_AT_const_value : 65536	
 <2><96d>: Abbrev Number: 11 (DW_TAG_enumeration_type)
     DW_AT_sibling     : <9d3>	
     DW_AT_name        : _Ios_Openmode	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 107	
 <3><983>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_app	
     DW_AT_const_value : 1	
 <3><98c>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_ate	
     DW_AT_const_value : 2	
 <3><995>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_bin	
     DW_AT_const_value : 4	
 <3><99e>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_in	
     DW_AT_const_value : 8	
 <3><9a6>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_out	
     DW_AT_const_value : 16	
 <3><9af>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_trunc	
     DW_AT_const_value : 32	
 <3><9ba>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_ios_openmode_end	
     DW_AT_const_value : 65536	
 <2><9d3>: Abbrev Number: 11 (DW_TAG_enumeration_type)
     DW_AT_sibling     : <a32>	
     DW_AT_name        : _Ios_Iostate	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 147	
 <3><9e8>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_goodbit	
     DW_AT_const_value : 0	
 <3><9f5>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_badbit	
     DW_AT_const_value : 1	
 <3><a01>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_eofbit	
     DW_AT_const_value : 2	
 <3><a0d>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_failbit	
     DW_AT_const_value : 4	
 <3><a1a>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_ios_iostate_end	
     DW_AT_const_value : 65536	
 <2><a32>: Abbrev Number: 11 (DW_TAG_enumeration_type)
     DW_AT_sibling     : <a7a>	
     DW_AT_name        : _Ios_Seekdir	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 184	
 <3><a47>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_beg	
     DW_AT_const_value : 0	
 <3><a50>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_cur	
     DW_AT_const_value : 1	
 <3><a59>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_end	
     DW_AT_const_value : 2	
 <3><a62>: Abbrev Number: 12 (DW_TAG_enumerator)
     DW_AT_name        : _S_ios_seekdir_end	
     DW_AT_const_value : 65536	
 <2><a7a>: Abbrev Number: 13 (DW_TAG_structure_type)
     DW_AT_sibling     : <b40>	
     DW_AT_name        : ios_base	
     DW_AT_declaration : 1	
 <3><a89>: Abbrev Number: 21 (DW_TAG_structure_type)
     DW_AT_name        : Init	
     DW_AT_byte_size   : 1	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 531	
 <4><a93>: Abbrev Number: 22 (DW_TAG_variable)
     DW_AT_name        : (indirect string, offset: 0x525): _S_refcount	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 538	
     DW_AT_MIPS_linkage_name: _ZNSt8ios_base4Init11_S_refcountE	
     DW_AT_type        : <28dc>	
     DW_AT_external    : 1	
     DW_AT_accessibility: 3	(private)
     DW_AT_declaration : 1	
 <4><ac4>: Abbrev Number: 23 (DW_TAG_variable)
     DW_AT_name        : _S_synced_with_stdio	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 539	
     DW_AT_MIPS_linkage_name: _ZNSt8ios_base4Init20_S_synced_with_stdioE	
     DW_AT_type        : <28d4>	
     DW_AT_external    : 1	
     DW_AT_accessibility: 3	(private)
     DW_AT_declaration : 1	
 <4><b0f>: Abbrev Number: 24 (DW_TAG_subprogram)
     DW_AT_sibling     : <b25>	
     DW_AT_external    : 1	
     DW_AT_name        : Init	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 534	
     DW_AT_declaration : 1	
 <5><b1e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     DW_AT_type        : <57f0>	
     DW_AT_artificial  : 1	
 <4><b25>: Abbrev Number: 25 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : ~Init	
     DW_AT_decl_file   : 96	
     DW_AT_decl_line   : 535	
     DW_AT_declaration : 1	
 <5><b31>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     DW_AT_type        : <57f0>	
     DW_AT_artificial  : 1	
 <5><b37>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
     DW_AT_artificial  : 1	
 <2><b40>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 81	
     DW_AT_import      : <1034>	
 <2><b47>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 83	
     DW_AT_import      : <57f6>	
 <2><b4e>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 84	
     DW_AT_import      : <5806>	
 <2><b55>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 92	
     DW_AT_import      : <5822>	
 <2><b5c>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 101	
     DW_AT_import      : <5843>	
 <2><b63>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 104	
     DW_AT_import      : <5865>	
 <2><b6a>: Abbrev Number: 8 (DW_TAG_imported_declaration)
     DW_AT_decl_file   : 122	
     DW_AT_decl_line   : 105	
     DW_AT_import      : <5880>	
 <2><b71>: Abbrev Number: 13 (DW_TAG_structure_type)
     DW_AT_sibling     : <ba2>	
     DW_AT_name        : money_base	
     DW_AT_declaration : 1	
 <3><b82>: Abbrev Number: 21 (DW_TAG_structure_type)
     DW_AT_name        : pattern	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 121	
     DW_AT_decl_line   : 3479	
 <4><b8f>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : field	
     DW_AT_decl_file   : 121	
     DW_AT_decl_line   : 3479	
     DW_AT_type        : <109c>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><ba2>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : basic_ostream<char,std::char_traits<char> >	
     DW_AT_declaration : 1	
 <2><bd0>: Abbrev Number: 26 (DW_TAG_variable)
     DW_AT_name        : nothrow	
     DW_AT_decl_file   : 105	
     DW_AT_decl_line   : 65	
     DW_AT_MIPS_linkage_name: (indirect string, offset: 0x4ad): _ZSt7nothrow	
     DW_AT_type        : <6291>	
     DW_AT_external    : 1	
     DW_AT_declaration : 1	
 <2><be5>: Abbrev Number: 26 (DW_TAG_variable)
     DW_AT_name        : cout	
     DW_AT_decl_file   : 2	
     DW_AT_decl_line   : 63	
     DW_AT_MIPS_linkage_name: (indirect string, offset: 0x447): _ZSt4cout	
     DW_AT_type        : <62ab>	
     DW_AT_external    : 1	
     DW_AT_declaration : 1	
 <2><bf7>: Abbrev Number: 27 (DW_TAG_variable)
     DW_AT_name        : __ioinit	
     DW_AT_decl_file   : 2	
     DW_AT_decl_line   : 76	
     DW_AT_type        : <a89>	
     DW_AT_declaration : 1	
 <1><c09>: Abbrev Number: 7 (DW_TAG_base_type)
     DW_AT_name        : (indirect string, offset: 0x48d): long unsigned int	
     DW_AT_byte_size   : 8	
     DW_AT_encoding    : 7	(unsigned)
 <1><c10>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <c15>	
 <1><c15>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : short unsigned int	
     DW_AT_byte_size   : 2	
     DW_AT_encoding    : 7	(unsigned)
 <1><c2b>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <c30>	
 <1><c30>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 5	(signed)
 <1><c37>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <c3d>	
 <1><c3d>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <c42>	
 <1><c42>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : char	
     DW_AT_byte_size   : 1	
     DW_AT_encoding    : 6	(signed char)
 <1><c4a>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <c6a>	
     DW_AT_external    : 1	
     DW_AT_name        : strcoll	
     DW_AT_decl_file   : 18	
     DW_AT_decl_line   : 107	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><c5f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><c64>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><c6a>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <c8f>	
     DW_AT_external    : 1	
     DW_AT_name        : strxfrm	
     DW_AT_decl_file   : 18	
     DW_AT_decl_line   : 111	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><c7f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><c84>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><c89>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><c8f>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <c42>	
 <1><c95>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <cb4>	
     DW_AT_external    : 1	
     DW_AT_name        : strtok	
     DW_AT_decl_file   : 18	
     DW_AT_decl_line   : 200	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><ca9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><cae>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><cb4>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <cd1>	
     DW_AT_external    : 1	
     DW_AT_name        : strerror	
     DW_AT_decl_file   : 18	
     DW_AT_decl_line   : 256	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><ccb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><cd1>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <cf5>	
     DW_AT_external    : 1	
     DW_AT_name        : memchr	
     DW_AT_decl_file   : 18	
     DW_AT_decl_line   : 67	
     DW_AT_type        : <cf5>	
     DW_AT_declaration : 1	
 <2><ce5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <cf7>	
 <2><cea>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><cef>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><cf5>: Abbrev Number: 32 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
 <1><cf7>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <cfd>	
 <1><cfd>: Abbrev Number: 33 (DW_TAG_const_type)
 <1><cfe>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : unsigned char	
     DW_AT_byte_size   : 1	
     DW_AT_encoding    : 8	(unsigned char)
 <1><d0f>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : unsigned int	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 7	(unsigned)
 <1><d1f>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : signed char	
     DW_AT_byte_size   : 1	
     DW_AT_encoding    : 6	(signed char)
 <1><d2e>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : short int	
     DW_AT_byte_size   : 2	
     DW_AT_encoding    : 5	(signed)
 <1><d3b>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __int32_t	
     DW_AT_decl_file   : 22	
     DW_AT_decl_line   : 44	
     DW_AT_type        : <c30>	
 <1><d4c>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __off_t	
     DW_AT_decl_file   : 22	
     DW_AT_decl_line   : 144	
     DW_AT_type        : <1e9>	
 <1><d5b>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __off64_t	
     DW_AT_decl_file   : 22	
     DW_AT_decl_line   : 145	
     DW_AT_type        : <1e9>	
 <1><d6c>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __clock_t	
     DW_AT_decl_file   : 22	
     DW_AT_decl_line   : 148	
     DW_AT_type        : <1e9>	
 <1><d7d>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __time_t	
     DW_AT_decl_file   : 22	
     DW_AT_decl_line   : 152	
     DW_AT_type        : <1e9>	
 <1><d8d>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : FILE	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 46	
     DW_AT_type        : <d99>	
 <1><d99>: Abbrev Number: 34 (DW_TAG_structure_type)
     DW_AT_sibling     : <1026>	
     DW_AT_name        : _IO_FILE	
     DW_AT_byte_size   : 216	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 267	
 <2><dab>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _flags	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 268	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><dbd>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_read_ptr	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 273	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><dd5>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_read_end	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 274	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><ded>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_read_base	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 275	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><e06>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_write_base	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 276	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><e20>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_write_ptr	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 277	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><e39>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_write_end	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 278	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><e52>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_buf_base	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 279	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><e6a>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_buf_end	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 280	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><e81>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_save_base	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 282	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><e9a>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_backup_base	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 283	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><eb5>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _IO_save_end	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 284	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><ecd>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _markers	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 286	
     DW_AT_type        : <11a5>	
     DW_AT_data_member_location: 2 byte block: 23 60 	(DW_OP_plus_uconst: 96)
 <2><ee1>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _chain	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 288	
     DW_AT_type        : <11ab>	
     DW_AT_data_member_location: 2 byte block: 23 68 	(DW_OP_plus_uconst: 104)
 <2><ef3>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _fileno	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 290	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 70 	(DW_OP_plus_uconst: 112)
 <2><f06>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _flags2	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 294	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 74 	(DW_OP_plus_uconst: 116)
 <2><f19>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _old_offset	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 296	
     DW_AT_type        : <d4c>	
     DW_AT_data_member_location: 2 byte block: 23 78 	(DW_OP_plus_uconst: 120)
 <2><f30>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _cur_column	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 300	
     DW_AT_type        : <c15>	
     DW_AT_data_member_location: 3 byte block: 23 80 1 	(DW_OP_plus_uconst: 128)
 <2><f48>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _vtable_offset	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 301	
     DW_AT_type        : <d1f>	
     DW_AT_data_member_location: 3 byte block: 23 82 1 	(DW_OP_plus_uconst: 130)
 <2><f63>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _shortbuf	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 302	
     DW_AT_type        : <11b1>	
     DW_AT_data_member_location: 3 byte block: 23 83 1 	(DW_OP_plus_uconst: 131)
 <2><f79>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _lock	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 306	
     DW_AT_type        : <11c1>	
     DW_AT_data_member_location: 3 byte block: 23 88 1 	(DW_OP_plus_uconst: 136)
 <2><f8b>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _offset	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 315	
     DW_AT_type        : <d5b>	
     DW_AT_data_member_location: 3 byte block: 23 90 1 	(DW_OP_plus_uconst: 144)
 <2><f9f>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : __pad1	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 324	
     DW_AT_type        : <cf5>	
     DW_AT_data_member_location: 3 byte block: 23 98 1 	(DW_OP_plus_uconst: 152)
 <2><fb2>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : __pad2	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 325	
     DW_AT_type        : <cf5>	
     DW_AT_data_member_location: 3 byte block: 23 a0 1 	(DW_OP_plus_uconst: 160)
 <2><fc5>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : __pad3	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 326	
     DW_AT_type        : <cf5>	
     DW_AT_data_member_location: 3 byte block: 23 a8 1 	(DW_OP_plus_uconst: 168)
 <2><fd8>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : __pad4	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 327	
     DW_AT_type        : <cf5>	
     DW_AT_data_member_location: 3 byte block: 23 b0 1 	(DW_OP_plus_uconst: 176)
 <2><feb>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : __pad5	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 328	
     DW_AT_type        : <1f5>	
     DW_AT_data_member_location: 3 byte block: 23 b8 1 	(DW_OP_plus_uconst: 184)
 <2><ffe>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _mode	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 330	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 3 byte block: 23 c0 1 	(DW_OP_plus_uconst: 192)
 <2><1010>: Abbrev Number: 16 (DW_TAG_member)
     DW_AT_name        : _unused2	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 332	
     DW_AT_type        : <11c7>	
     DW_AT_data_member_location: 3 byte block: 23 c4 1 	(DW_OP_plus_uconst: 196)
 <1><1026>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __FILE	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 62	
     DW_AT_type        : <d99>	
 <1><1034>: Abbrev Number: 35 (DW_TAG_typedef)
     DW_AT_name        : wint_t	
     DW_AT_decl_file   : 17	
     DW_AT_decl_line   : 355	
     DW_AT_type        : <d0f>	
 <1><1043>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <109c>	
     DW_AT_name        : ._1	
     DW_AT_byte_size   : 8	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 77	
 <2><104f>: Abbrev Number: 37 (DW_TAG_union_type)
     DW_AT_sibling     : <1077>	
     DW_AT_name        : ._2	
     DW_AT_byte_size   : 4	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 80	
 <3><105b>: Abbrev Number: 38 (DW_TAG_member)
     DW_AT_name        : __wch	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 81	
     DW_AT_type        : <1034>	
 <3><1068>: Abbrev Number: 38 (DW_TAG_member)
     DW_AT_name        : __wchb	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 82	
     DW_AT_type        : <109c>	
 <2><1077>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : __count	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 78	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1089>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : __value	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 83	
     DW_AT_type        : <104f>	
     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><109c>: Abbrev Number: 40 (DW_TAG_array_type)
     DW_AT_sibling     : <10ac>	
     DW_AT_type        : <c42>	
 <2><10a5>: Abbrev Number: 41 (DW_TAG_subrange_type)
     DW_AT_type        : <c09>	
     DW_AT_upper_bound : 3	
 <1><10ac>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <10db>	
     DW_AT_name        : ._3	
     DW_AT_byte_size   : 16	
     DW_AT_decl_file   : 25	
     DW_AT_decl_line   : 27	
 <2><10b8>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : __pos	
     DW_AT_decl_file   : 25	
     DW_AT_decl_line   : 28	
     DW_AT_type        : <d4c>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><10c8>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : __state	
     DW_AT_decl_file   : 25	
     DW_AT_decl_line   : 29	
     DW_AT_type        : <1043>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><10db>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <c37>	
 <1><10e1>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <1154>	
     DW_AT_name        : __va_list_tag	
     DW_AT_byte_size   : 24	
     DW_AT_decl_file   : 136	
     DW_AT_decl_line   : 0	
 <2><10f7>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : gp_offset	
     DW_AT_decl_file   : 136	
     DW_AT_decl_line   : 0	
     DW_AT_type        : <d0f>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><110b>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : fp_offset	
     DW_AT_decl_file   : 136	
     DW_AT_decl_line   : 0	
     DW_AT_type        : <d0f>	
     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><111f>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : overflow_arg_area	
     DW_AT_decl_file   : 136	
     DW_AT_decl_line   : 0	
     DW_AT_type        : <cf5>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><113b>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : reg_save_area	
     DW_AT_decl_file   : 136	
     DW_AT_decl_line   : 0	
     DW_AT_type        : <cf5>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><1154>: Abbrev Number: 42 (DW_TAG_typedef)
     DW_AT_name        : _IO_lock_t	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 176	
 <1><1162>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <11a5>	
     DW_AT_name        : _IO_marker	
     DW_AT_byte_size   : 24	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 182	
 <2><1175>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : _next	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 183	
     DW_AT_type        : <11a5>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1185>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : _sbuf	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 184	
     DW_AT_type        : <11ab>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1195>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : _pos	
     DW_AT_decl_file   : 24	
     DW_AT_decl_line   : 188	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <1><11a5>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1162>	
 <1><11ab>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <d99>	
 <1><11b1>: Abbrev Number: 40 (DW_TAG_array_type)
     DW_AT_sibling     : <11c1>	
     DW_AT_type        : <c42>	
 <2><11ba>: Abbrev Number: 41 (DW_TAG_subrange_type)
     DW_AT_type        : <c09>	
     DW_AT_upper_bound : 0	
 <1><11c1>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1154>	
 <1><11c7>: Abbrev Number: 40 (DW_TAG_array_type)
     DW_AT_sibling     : <11d7>	
     DW_AT_type        : <c42>	
 <2><11d0>: Abbrev Number: 41 (DW_TAG_subrange_type)
     DW_AT_type        : <c09>	
     DW_AT_upper_bound : 19	
 <1><11d7>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : fpos_t	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 88	
     DW_AT_type        : <10ac>	
 <1><11e5>: Abbrev Number: 24 (DW_TAG_subprogram)
     DW_AT_sibling     : <11fe>	
     DW_AT_external    : 1	
     DW_AT_name        : clearerr	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 725	
     DW_AT_declaration : 1	
 <2><11f8>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><11fe>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <d8d>	
 <1><1204>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <121e>	
     DW_AT_external    : 1	
     DW_AT_name        : fclose	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 211	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1218>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><121e>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1237>	
     DW_AT_external    : 1	
     DW_AT_name        : feof	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 727	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1231>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1237>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1252>	
     DW_AT_external    : 1	
     DW_AT_name        : ferror	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 729	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><124c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1252>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <126c>	
     DW_AT_external    : 1	
     DW_AT_name        : fflush	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 216	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1266>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><126c>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1286>	
     DW_AT_external    : 1	
     DW_AT_name        : fgetc	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 439	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1280>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1286>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <12a7>	
     DW_AT_external    : 1	
     DW_AT_name        : fgetpos	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 697	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><129c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <2><12a1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <12a7>	
 <1><12a7>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <11d7>	
 <1><12ad>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <12d1>	
     DW_AT_external    : 1	
     DW_AT_name        : fgets	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 530	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><12c1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><12c6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><12cb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><12d1>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <12ef>	
     DW_AT_external    : 1	
     DW_AT_name        : fopen	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 247	
     DW_AT_type        : <11fe>	
     DW_AT_declaration : 1	
 <2><12e4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><12e9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><12ef>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1318>	
     DW_AT_external    : 1	
     DW_AT_name        : fread	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 609	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1303>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <cf5>	
 <2><1308>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><130d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1312>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1318>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <133d>	
     DW_AT_external    : 1	
     DW_AT_name        : freopen	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 254	
     DW_AT_type        : <11fe>	
     DW_AT_declaration : 1	
 <2><132d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1332>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1337>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><133d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1361>	
     DW_AT_external    : 1	
     DW_AT_name        : fseek	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 648	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1351>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <2><1356>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1e9>	
 <2><135b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><1361>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1382>	
     DW_AT_external    : 1	
     DW_AT_name        : fsetpos	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 702	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1377>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <2><137c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1382>	
 <1><1382>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1388>	
 <1><1388>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <11d7>	
 <1><138d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <13a7>	
     DW_AT_external    : 1	
     DW_AT_name        : ftell	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 653	
     DW_AT_type        : <1e9>	
     DW_AT_declaration : 1	
 <2><13a1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><13a7>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <13c0>	
     DW_AT_external    : 1	
     DW_AT_name        : getc	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 440	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><13ba>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><13c0>: Abbrev Number: 43 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : getchar	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 446	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <1><13d2>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <13eb>	
     DW_AT_external    : 1	
     DW_AT_name        : gets	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 538	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><13e5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <1><13eb>: Abbrev Number: 24 (DW_TAG_subprogram)
     DW_AT_sibling     : <1402>	
     DW_AT_external    : 1	
     DW_AT_name        : perror	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 745	
     DW_AT_declaration : 1	
 <2><13fc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><1402>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1420>	
     DW_AT_external    : 1	
     DW_AT_name        : putc	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 482	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1415>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><141a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1420>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <143a>	
     DW_AT_external    : 1	
     DW_AT_name        : remove	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 152	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1434>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><143a>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1459>	
     DW_AT_external    : 1	
     DW_AT_name        : rename	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 154	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><144e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1453>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><1459>: Abbrev Number: 24 (DW_TAG_subprogram)
     DW_AT_sibling     : <1470>	
     DW_AT_external    : 1	
     DW_AT_name        : rewind	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 658	
     DW_AT_declaration : 1	
 <2><146a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1470>: Abbrev Number: 24 (DW_TAG_subprogram)
     DW_AT_sibling     : <148c>	
     DW_AT_external    : 1	
     DW_AT_name        : setbuf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 301	
     DW_AT_declaration : 1	
 <2><1481>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <2><1486>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <1><148c>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <14b7>	
     DW_AT_external    : 1	
     DW_AT_name        : setvbuf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 306	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><14a2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <2><14a7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><14ac>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><14b1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><14b7>: Abbrev Number: 44 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : tmpfile	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 169	
     DW_AT_type        : <11fe>	
     DW_AT_declaration : 1	
 <1><14c8>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <14e2>	
     DW_AT_external    : 1	
     DW_AT_name        : tmpnam	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 183	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><14dc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <1><14e2>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1502>	
     DW_AT_external    : 1	
     DW_AT_name        : ungetc	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 601	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><14f7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><14fc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <1><1502>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <152a>	
     DW_AT_external    : 1	
     DW_AT_name        : snprintf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 357	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1519>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><151e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1523>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1528>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><152a>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1550>	
     DW_AT_external    : 1	
     DW_AT_name        : vfscanf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 417	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1540>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <11fe>	
 <2><1545>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><154a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1550>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <10e1>	
 <1><1556>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1576>	
     DW_AT_external    : 1	
     DW_AT_name        : vscanf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 424	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><156b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1570>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1576>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <15a3>	
     DW_AT_external    : 1	
     DW_AT_name        : vsnprintf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 361	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><158e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><1593>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1598>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><159d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><15a3>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <15c9>	
     DW_AT_external    : 1	
     DW_AT_name        : vsscanf	
     DW_AT_decl_file   : 21	
     DW_AT_decl_line   : 429	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><15b9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><15be>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><15c3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><15c9>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <1832>	
     DW_AT_name        : lconv	
     DW_AT_byte_size   : 96	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 53	
 <2><15d7>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : decimal_point	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 56	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15ef>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : thousands_sep	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 57	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1607>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : grouping	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 63	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><161a>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_curr_symbol	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 69	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><1634>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : currency_symbol	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 70	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><164e>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : mon_decimal_point	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 71	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><166a>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : mon_thousands_sep	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 72	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><1686>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : mon_grouping	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 73	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><169d>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : positive_sign	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 74	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><16b5>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : negative_sign	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 75	
     DW_AT_type        : <c8f>	
     DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <2><16cd>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_frac_digits	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 76	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 50 	(DW_OP_plus_uconst: 80)
 <2><16e7>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : frac_digits	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 77	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 51 	(DW_OP_plus_uconst: 81)
 <2><16fd>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : p_cs_precedes	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 79	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 52 	(DW_OP_plus_uconst: 82)
 <2><1715>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : p_sep_by_space	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 81	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 53 	(DW_OP_plus_uconst: 83)
 <2><172e>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : n_cs_precedes	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 83	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 54 	(DW_OP_plus_uconst: 84)
 <2><1746>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : n_sep_by_space	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 85	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 55 	(DW_OP_plus_uconst: 85)
 <2><175f>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : p_sign_posn	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 92	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 56 	(DW_OP_plus_uconst: 86)
 <2><1775>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : n_sign_posn	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 93	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 57 	(DW_OP_plus_uconst: 87)
 <2><178b>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_p_cs_precedes	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 96	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 58 	(DW_OP_plus_uconst: 88)
 <2><17a7>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_p_sep_by_space	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 98	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 59 	(DW_OP_plus_uconst: 89)
 <2><17c4>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_n_cs_precedes	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 100	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 5a 	(DW_OP_plus_uconst: 90)
 <2><17e0>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_n_sep_by_space	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 102	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 5b 	(DW_OP_plus_uconst: 91)
 <2><17fd>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_p_sign_posn	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 109	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 5c 	(DW_OP_plus_uconst: 92)
 <2><1817>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : int_n_sign_posn	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 110	
     DW_AT_type        : <c42>	
     DW_AT_data_member_location: 2 byte block: 23 5d 	(DW_OP_plus_uconst: 93)
 <1><1832>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1854>	
     DW_AT_external    : 1	
     DW_AT_name        : setlocale	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 125	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><1849>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><184e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <1><1854>: Abbrev Number: 44 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : localeconv	
     DW_AT_decl_file   : 33	
     DW_AT_decl_line   : 128	
     DW_AT_type        : <1868>	
     DW_AT_declaration : 1	
 <1><1868>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <15c9>	
 <1><186e>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : clock_t	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 61	
     DW_AT_type        : <d6c>	
 <1><187d>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : time_t	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 77	
     DW_AT_type        : <d7d>	
 <1><188b>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <195d>	
     DW_AT_name        : tm	
     DW_AT_byte_size   : 56	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 135	
 <2><1896>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_sec	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 136	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><18a7>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_min	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 137	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><18b8>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_hour	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 138	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><18ca>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_mday	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 139	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><18dc>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_mon	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 140	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><18ed>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_year	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 141	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><18ff>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_wday	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 142	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><1911>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_yday	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 143	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><1923>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_isdst	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 144	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><1936>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_gmtoff	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 147	
     DW_AT_type        : <1e9>	
     DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><194a>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : tm_zone	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 148	
     DW_AT_type        : <c37>	
     DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <1><195d>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : long long unsigned int	
     DW_AT_byte_size   : 8	
     DW_AT_encoding    : 7	(unsigned)
 <1><1977>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : long long int	
     DW_AT_byte_size   : 8	
     DW_AT_encoding    : 5	(signed)
 <1><1988>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : pthread_once_t	
     DW_AT_decl_file   : 49	
     DW_AT_decl_line   : 144	
     DW_AT_type        : <c30>	
 <1><199e>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : __gthread_once_t	
     DW_AT_decl_file   : 41	
     DW_AT_decl_line   : 47	
     DW_AT_type        : <1988>	
 <1><19b6>: Abbrev Number: 44 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : clock	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 184	
     DW_AT_type        : <186e>	
     DW_AT_declaration : 1	
 <1><19c5>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <19e6>	
     DW_AT_external    : 1	
     DW_AT_name        : difftime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 191	
     DW_AT_type        : <19e6>	
     DW_AT_declaration : 1	
 <2><19db>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <187d>	
 <2><19e0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <187d>	
 <1><19e6>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : double	
     DW_AT_byte_size   : 8	
     DW_AT_encoding    : 4	(float)
 <1><19f0>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1a0a>	
     DW_AT_external    : 1	
     DW_AT_name        : mktime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 194	
     DW_AT_type        : <187d>	
     DW_AT_declaration : 1	
 <2><1a04>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a0a>	
 <1><1a0a>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <188b>	
 <1><1a10>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1a28>	
     DW_AT_external    : 1	
     DW_AT_name        : time	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 187	
     DW_AT_type        : <187d>	
     DW_AT_declaration : 1	
 <2><1a22>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a28>	
 <1><1a28>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <187d>	
 <1><1a2e>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1a49>	
     DW_AT_external    : 1	
     DW_AT_name        : asctime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 254	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><1a43>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a49>	
 <1><1a49>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1a4f>	
 <1><1a4f>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <188b>	
 <1><1a54>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1a6e>	
     DW_AT_external    : 1	
     DW_AT_name        : ctime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 257	
     DW_AT_type        : <c8f>	
     DW_AT_declaration : 1	
 <2><1a68>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a6e>	
 <1><1a6e>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1a74>	
 <1><1a74>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <187d>	
 <1><1a79>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1a93>	
     DW_AT_external    : 1	
     DW_AT_name        : gmtime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 232	
     DW_AT_type        : <1a0a>	
     DW_AT_declaration : 1	
 <2><1a8d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a6e>	
 <1><1a93>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1ab0>	
     DW_AT_external    : 1	
     DW_AT_name        : localtime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 236	
     DW_AT_type        : <1a0a>	
     DW_AT_declaration : 1	
 <2><1aaa>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a6e>	
 <1><1ab0>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1adb>	
     DW_AT_external    : 1	
     DW_AT_name        : strftime	
     DW_AT_decl_file   : 44	
     DW_AT_decl_line   : 202	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1ac6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><1acb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1ad0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1ad5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a49>	
 <1><1adb>: Abbrev Number: 5 (DW_TAG_typedef)
     DW_AT_name        : mbstate_t	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 95	
     DW_AT_type        : <1043>	
 <1><1aec>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1b06>	
     DW_AT_external    : 1	
     DW_AT_name        : btowc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 294	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1b00>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><1b06>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1b21>	
     DW_AT_external    : 1	
     DW_AT_name        : fgetwc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 712	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1b1b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1b21>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1026>	
 <1><1b27>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1b4c>	
     DW_AT_external    : 1	
     DW_AT_name        : fgetws	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 742	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><1b3c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1b41>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <2><1b46>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1b4c>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1b52>	
 <1><1b52>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : wchar_t	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 5	(signed)
 <1><1b5d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1b7d>	
     DW_AT_external    : 1	
     DW_AT_name        : fputwc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 726	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1b72>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <2><1b77>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1b7d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1b9d>	
     DW_AT_external    : 1	
     DW_AT_name        : fputws	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 749	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1b92>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1b97>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1b9d>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1ba3>	
 <1><1ba3>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <1b52>	
 <1><1ba8>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1bc7>	
     DW_AT_external    : 1	
     DW_AT_name        : fwide	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 614	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1bbc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <2><1bc1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><1bc7>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1bea>	
     DW_AT_external    : 1	
     DW_AT_name        : fwprintf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 622	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1bde>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <2><1be3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1be8>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1bea>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1c0c>	
     DW_AT_external    : 1	
     DW_AT_name        : fwscanf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 663	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1c00>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <2><1c05>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1c0a>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1c0c>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1c26>	
     DW_AT_external    : 1	
     DW_AT_name        : getwc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 713	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1c20>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1c26>: Abbrev Number: 43 (DW_TAG_subprogram)
     DW_AT_external    : 1	
     DW_AT_name        : getwchar	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 719	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <1><1c39>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1c5e>	
     DW_AT_external    : 1	
     DW_AT_name        : mbrlen	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 318	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1c4e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1c53>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1c58>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1c5e>	
 <1><1c5e>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1adb>	
 <1><1c64>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1c8f>	
     DW_AT_external    : 1	
     DW_AT_name        : mbrtowc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 308	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1c7a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1c7f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c37>	
 <2><1c84>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1c89>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1c5e>	
 <1><1c8f>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1cab>	
     DW_AT_external    : 1	
     DW_AT_name        : mbsinit	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 302	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1ca5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1cab>	
 <1><1cab>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1cb1>	
 <1><1cb1>: Abbrev Number: 28 (DW_TAG_const_type)
     DW_AT_type        : <1adb>	
 <1><1cb6>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1ce3>	
     DW_AT_external    : 1	
     DW_AT_name        : mbsrtowcs	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 353	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1cce>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1cd3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <10db>	
 <2><1cd8>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1cdd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1c5e>	
 <1><1ce3>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1d02>	
     DW_AT_external    : 1	
     DW_AT_name        : putwc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 727	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1cf7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <2><1cfc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1d02>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1d1f>	
     DW_AT_external    : 1	
     DW_AT_name        : putwchar	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 733	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1d19>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <1><1d1f>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1d47>	
     DW_AT_external    : 1	
     DW_AT_name        : swprintf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 633	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1d36>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1d3b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1d40>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1d45>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1d47>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1d69>	
     DW_AT_external    : 1	
     DW_AT_name        : swscanf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 674	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1d5d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1d62>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1d67>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><1d69>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1d8a>	
     DW_AT_external    : 1	
     DW_AT_name        : ungetwc	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 756	
     DW_AT_type        : <1034>	
     DW_AT_declaration : 1	
 <2><1d7f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1034>	
 <2><1d84>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <1><1d8a>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1db2>	
     DW_AT_external    : 1	
     DW_AT_name        : vfwprintf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 641	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1da2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <2><1da7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1dac>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1db2>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1dd9>	
     DW_AT_external    : 1	
     DW_AT_name        : vfwscanf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 688	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1dc9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b21>	
 <2><1dce>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1dd3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1dd9>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1e06>	
     DW_AT_external    : 1	
     DW_AT_name        : vswprintf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 655	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1df1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1df6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1dfb>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1e00>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1e06>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1e2d>	
     DW_AT_external    : 1	
     DW_AT_name        : vswscanf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 701	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1e1d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1e22>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1e27>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1e2d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1e4f>	
     DW_AT_external    : 1	
     DW_AT_name        : vwprintf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 648	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1e44>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1e49>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1e4f>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1e70>	
     DW_AT_external    : 1	
     DW_AT_name        : vwscanf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 695	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1e65>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1e6a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1550>	
 <1><1e70>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1e96>	
     DW_AT_external    : 1	
     DW_AT_name        : wcrtomb	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 312	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1e86>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><1e8b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <2><1e90>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1c5e>	
 <1><1e96>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1eb5>	
     DW_AT_external    : 1	
     DW_AT_name        : wcscat	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 142	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><1eaa>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1eaf>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><1eb5>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1ed4>	
     DW_AT_external    : 1	
     DW_AT_name        : wcscmp	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 150	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1ec9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1ece>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><1ed4>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1ef4>	
     DW_AT_external    : 1	
     DW_AT_name        : wcscoll	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 178	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1ee9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1eee>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><1ef4>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1f13>	
     DW_AT_external    : 1	
     DW_AT_name        : wcscpy	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 134	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><1f08>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1f0d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><1f13>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1f33>	
     DW_AT_external    : 1	
     DW_AT_name        : wcscspn	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 225	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1f28>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1f2d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><1f33>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <1f5f>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsftime	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 824	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1f4a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1f4f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><1f54>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1f59>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1a49>	
 <1><1f5f>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1f79>	
     DW_AT_external    : 1	
     DW_AT_name        : wcslen	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 243	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><1f73>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><1f79>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1f9e>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsncat	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 146	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><1f8e>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1f93>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1f98>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><1f9e>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1fc3>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsncmp	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 153	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><1fb3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1fb8>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1fbd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><1fc3>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <1fe8>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsncpy	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 138	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><1fd8>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><1fdd>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><1fe2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><1fe8>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <2015>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsrtombs	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 359	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><2000>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c8f>	
 <2><2005>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <2015>	
 <2><200a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <2><200f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1c5e>	
 <1><2015>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1b9d>	
 <1><201b>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <203a>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsspn	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 229	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><202f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2034>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><203a>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <205a>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstod	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 394	
     DW_AT_type        : <19e6>	
     DW_AT_declaration : 1	
 <2><204f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2054>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <1><205a>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <1b4c>	
 <1><2060>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <2080>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstof	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 399	
     DW_AT_type        : <2080>	
     DW_AT_declaration : 1	
 <2><2075>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><207a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <1><2080>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : float	
     DW_AT_byte_size   : 4	
     DW_AT_encoding    : 4	(float)
 <1><2089>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <20ad>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstok	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 240	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><209d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><20a2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><20a7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <1><20ad>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <20d2>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstol	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 408	
     DW_AT_type        : <1e9>	
     DW_AT_declaration : 1	
 <2><20c2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><20c7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <2><20cc>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><20d2>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <20f8>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstoul	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 414	
     DW_AT_type        : <203>	
     DW_AT_declaration : 1	
 <2><20e8>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><20ed>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <2><20f2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><20f8>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <211d>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsxfrm	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 183	
     DW_AT_type        : <1f5>	
     DW_AT_declaration : 1	
 <2><210d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><2112>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2117>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><211d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <2137>	
     DW_AT_external    : 1	
     DW_AT_name        : wctob	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 298	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><2131>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1034>	
 <1><2137>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <215d>	
     DW_AT_external    : 1	
     DW_AT_name        : wmemcmp	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 267	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><214d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2152>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2157>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><215d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <2183>	
     DW_AT_external    : 1	
     DW_AT_name        : wmemcpy	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 271	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><2173>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><2178>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><217d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><2183>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <21aa>	
     DW_AT_external    : 1	
     DW_AT_name        : wmemmove	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 276	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><219a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><219f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><21a4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><21aa>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <21d0>	
     DW_AT_external    : 1	
     DW_AT_name        : wmemset	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 279	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><21c0>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b4c>	
 <2><21c5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <2><21ca>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><21d0>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <21ed>	
     DW_AT_external    : 1	
     DW_AT_name        : wprintf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 628	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><21e6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><21eb>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><21ed>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <2209>	
     DW_AT_external    : 1	
     DW_AT_name        : wscanf	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 669	
     DW_AT_type        : <c30>	
     DW_AT_declaration : 1	
 <2><2202>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2207>: Abbrev Number: 45 (DW_TAG_unspecified_parameters)
 <1><2209>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <2228>	
     DW_AT_external    : 1	
     DW_AT_name        : wcschr	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 208	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><221d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2222>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <1><2228>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <2248>	
     DW_AT_external    : 1	
     DW_AT_name        : wcspbrk	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 232	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><223d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2242>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><2248>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <2268>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsrchr	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 211	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><225d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2262>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <1><2268>: Abbrev Number: 30 (DW_TAG_subprogram)
     DW_AT_sibling     : <2287>	
     DW_AT_external    : 1	
     DW_AT_name        : wcsstr	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 235	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><227c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2281>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <1><2287>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <22ad>	
     DW_AT_external    : 1	
     DW_AT_name        : wmemchr	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 262	
     DW_AT_type        : <1b4c>	
     DW_AT_declaration : 1	
 <2><229d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><22a2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b52>	
 <2><22a7>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1f5>	
 <1><22ad>: Abbrev Number: 2 (DW_TAG_namespace)
     DW_AT_sibling     : <23fd>	
     DW_AT_name        : __gnu_cxx	
     DW_AT_decl_file   : 20	
     DW_AT_decl_line   : 155	
 <2><22be>: Abbrev Number: 46 (DW_TAG_subprogram)
     DW_AT_sibling     : <22e9>	
     DW_AT_external    : 1	
     DW_AT_name        : abs	
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 172	
     DW_AT_MIPS_linkage_name: _ZN9__gnu_cxx3absEx	
     DW_AT_type        : <1977>	
     DW_AT_declaration : 1	
 <3><22e3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1977>	
 <2><22e9>: Abbrev Number: 46 (DW_TAG_subprogram)
     DW_AT_sibling     : <231a>	
     DW_AT_external    : 1	
     DW_AT_name        : div	
     DW_AT_decl_file   : 79	
     DW_AT_decl_line   : 178	
     DW_AT_MIPS_linkage_name: _ZN9__gnu_cxx3divExx	
     DW_AT_type        : <24d0>	
     DW_AT_declaration : 1	
 <3><230f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1977>	
 <3><2314>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1977>	
 <2><231a>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : new_allocator<char>	
     DW_AT_declaration : 1	
 <2><2330>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : __normal_iterator<char*,std::basic_string<char, std::char_traits<char>, std::allocator<char> > >	
     DW_AT_declaration : 1	
 <2><2393>: Abbrev Number: 10 (DW_TAG_structure_type)
     DW_AT_name        : __normal_iterator<const char*,std::basic_string<char, std::char_traits<char>, std::allocator<char> > >	
     DW_AT_declaration : 1	
 <1><23fd>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <241e>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstold	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 401	
     DW_AT_type        : <241e>	
     DW_AT_declaration : 1	
 <2><2413>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2418>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <1><241e>: Abbrev Number: 6 (DW_TAG_base_type)
     DW_AT_name        : long double	
     DW_AT_byte_size   : 16	
     DW_AT_encoding    : 4	(float)
 <1><242d>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <2453>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstoll	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 422	
     DW_AT_type        : <1977>	
     DW_AT_declaration : 1	
 <2><2443>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><2448>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <2><244d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><2453>: Abbrev Number: 31 (DW_TAG_subprogram)
     DW_AT_sibling     : <247a>	
     DW_AT_external    : 1	
     DW_AT_name        : wcstoull	
     DW_AT_decl_file   : 26	
     DW_AT_decl_line   : 429	
     DW_AT_type        : <195d>	
     DW_AT_declaration : 1	
 <2><246a>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <1b9d>	
 <2><246f>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <205a>	
 <2><2474>: Abbrev Number: 19 (DW_TAG_formal_parameter)
     DW_AT_type        : <c30>	
 <1><247a>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <24a5>	
     DW_AT_name        : ._43	
     DW_AT_byte_size   : 8	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 99	
 <2><2487>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : quot	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 100	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><2496>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : rem	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 101	
     DW_AT_type        : <c30>	
     DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><24a5>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <24d0>	
     DW_AT_name        : ._44	
     DW_AT_byte_size   : 16	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 107	
 <2><24b2>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : quot	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 108	
     DW_AT_type        : <1e9>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><24c1>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : rem	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 109	
     DW_AT_type        : <1e9>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><24d0>: Abbrev Number: 36 (DW_TAG_structure_type)
     DW_AT_sibling     : <24fb>	
     DW_AT_name        : ._45	
     DW_AT_byte_size   : 16	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 119	
 <2><24dd>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : quot	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 120	
     DW_AT_type        : <1977>	
     DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><24ec>: Abbrev Number: 39 (DW_TAG_member)
     DW_AT_name        : rem	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 121	
     DW_AT_type        : <1977>	
     DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <1><24fb>: Abbrev Number: 35 (DW_TAG_typedef)
     DW_AT_name        : __compar_fn_t	
     DW_AT_decl_file   : 80	
     DW_AT_decl_line   : 765	
     DW_AT_type        : <2511>	
 <1><2511>: Abbrev Number: 29 (DW_TAG_pointer_type)
     DW_AT_byte_size   : 8	
     DW_AT_type        : <2517>	
