Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/L/Liveman/i18n/Liveman/MinillaPod2Markdown.*.po
Languages: ru_en

source: Liveman::MinillaPod2Markdown – заглушка для Minilla, которая перебрасывает lib/MainModule.md в README.md
ru_en: Liveman::Minillapod2markdown - a plug for minilla, which throws lib/MainModule.md to README.md

source: Добавьте строку `markdown_maker = "Liveman::MinillaPod2Markdown"` в `minil.toml`, и Minilla не будет создавать `README.md` из pod-документации главного модуля, а возьмёт из одноимённого файла рядом с расширением `*.md`.
ru_en: Add the `Markdown_maker = "Liveman::MinillaPod2Markdown"` to `minil.toml`, and Minilla will not create `README.md` from the POD-documenting of the main module, and will take from the same name next to the extension `*.md`.

source: Конструктор.
ru_en: Constructor.

source: Заглушка.
ru_en: Plug.

source: Парсит !options на первой строке:
ru_en: Parses !options on the first line:

source: 1. Удаляет ! и языки за ним. 2. Переводит бейджи через запятую в markdown-картинки.
ru_en: 1. Removes ! and languages behind him. 2. He translates the badge through a comma into a Markdown picture.

source: Список бейджей:
ru_en: Badge List:

source: 1. badges - все бейджи. 2. github-actions - бейдж на тесты гитхаба. 3. metacpan - бейдж на релиз. 4. cover - бейдж на покрытие который создаёт `liveman` при прохождении теста в `doc/badges/total.svg`.
ru_en: 1. badges - all badges. 2. github-actions - badge for GitHub tests. 3. metacpan - badge for release. 4. cover - badge for coverage that creates `liveman` when passing the test in `doc/badges/total.svg`.

source: Путь проекта на github: username/repository.
ru_en: The project path to GitHub: username/repository.

source: Считывает файл с markdown-документацией.
ru_en: Reads a file with MarkDown-documentation.

source: Считывает модуль.
ru_en: Reads the module.

source: Версия модуля.
ru_en: The version of the module.

source: Чтобы установить этот модуль в вашу систему, выполните следующие действия [командой](https://metacpan.org/pod/App::cpm):
ru_en: To install this module in your system, follow the following actions [command] (https://metacpan.org/pod/App::cpm):
