Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-LaTeX/share/locale/Padre__Plugin__LaTeX-*.po
Languages: ar

source: LaTeX
ar: برنامج LaTeX

source: About
ar: عن

source: Create/Update PDF
ar: انشاء أو تحديث PDF

source: View PDF
ar: عرض PDF

source: Run BibTeX
ar: تشغيل BibTeX

source: LaTeX Plug-in
ar: البرنامج المساعد LaTeX

source: Copyright 2010 %s This plug-in is free software; you can redistribute it and/or modify it under the same terms as Padre.
ar: حقوق الطبع 2010 %s هذا البرنامج المساعد مجاني، تستطيع توزيعه أو تغييره تحت نفس شروط Padre.

source: Creating PDF files is only supported for LaTeX documents.
ar: انشاء ملفات PDF مدعوم فقط في وثائق LATEX.

source: Running BibTeX is only supported for LaTeX documents.
ar: تشغيل BibTeX مدعوم فقط في وثائق LATEX.

source: Viewing PDF files is only supported for LaTeX documents.
ar: عرض PDF مدعوم فقط في وثائق LATEX.
