Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-CSS/share/locale/Padre__Plugin__CSS-*.po
Languages: ar

source: CSS
ar: برنامج CSS

source: CSS Minifier
ar: تقليل ال CSS

source: Validate CSS
ar: التأكد من صحة ال CSS

source: Docs
ar: الوثائق

source: CSS 2.1 specs
ar: مواصفات CSS 2.1

source: CSS 2.1 property list
ar: قائمة خصائص CSS 2.1

source: No Code
ar: بلا شيفرة

source: Error
ar: خطأ

source: CSS is valid
ar: ال CSS صحيح

source: CSS is not valid
ar: ال CSS غير صحيح

source: Errors:
ar: الأخطاء :

source: Failed to validate the code
ar: خطأ في التأكد من صحة الشيفرة
