use strict;
use warnings;

use Business::UDC;
use Readonly;
use Test::More 'tests' => 53;
use Test::NoWarnings;
use Unicode::UTF8 qw(decode_utf8 encode_utf8);

Readonly::Array our @RIGHT_UDCS => (
	'0/9',
	'821.111(73)-31"19"',
	'621.397:621.395',
	'(075)',
	'(075)78',
	'78(075)',
	'"19"',
	'=111',
	'821-312.5',
	'636.1/.5',
	'(084.3)911.375',
	'911.375(084.3)',
	'908(437.2)Jihlava',
	'821.133.1MOL',
	'334.72:621.3(430)AEG',
	'821.111(73)-32=163.42',
	'821.111.09',
	'821.111(73).09',
	'821.111(73).09-32',
	"811.161.2'373.21",
	"811.161.2'373.21(477.72)(0.75.3)",
	decode_utf8('004.738.1Википедия'),
	"821.124'02-13",
	'26-244/-245',
	'364-5-783.2',
	'784.3/.7-021.18',
	"81'42'373.46",
	'233-852.5U',
	"81'27/'28",
	"94(437)'1/'3",
	'[007+004]:658',
	'[782.9:792.82].086',
	'341.222[(4-11):(4-15)]',
	'016:[371.035.4:335.55]378(437)',
);
Readonly::Array our @BAD_UDCS => (
	'bad',
	'821.111+',
	':821.111',
	'+821.111',
	'-31',
	'-312.5',
	'636.1/.',
	'.5',
	'821+.5',
	'821:.5',
	'(437.2)94',
	'(73).09',
	'551.50 551.57 14',
	"’373.21",
	"(477.72)’373.21",
	"81/'28",
	"'27/'28",
	"81:27/'28",
);

# Test.
my $obj;
foreach my $right_udc (@RIGHT_UDCS) {
	$obj = Business::UDC->new($right_udc);
	is($obj->is_valid, 1, encode_utf8("It is valid ($right_udc)."));
}

# Test.
foreach my $bad_udc (@BAD_UDCS) {
	$obj = Business::UDC->new($bad_udc);
	is($obj->is_valid, 0, "It is not valid ($bad_udc).");
}
