Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/L/Liveman/i18n/Liveman/App/liveman.*.po
Languages: ru_en

source: liveman - «живое руководство». Утилита для конвертации файлов **lib/\*\*.md** в тестовые файлы (**t/\*\*.t**) и документацию (**POD**), которая размещается в соответствующем модуле (**lib/\*\*.pm**)
ru_en: "Liveman - “Living Guide”. Utility for converting files **lib/\*\*.md** in test files (**t/\*\*.t**) and documentation (**POD**), which is placed in the corresponding module (**lib/\*\*.pm**)

source: Проблема современных проектов в том, что документация отделена от тестирования. Это означает, что примеры в документации могут не работать, а сама документация может отставать от кода.
ru_en: The problem of modern projects is that the documentation is separated from testing. This means that the examples in the documentation may not work, and the documentation itself can lag behind the code.

source: Метод одновременного документирования и тестирования решает эту проблему.
ru_en: The method of simultaneous documentation and testing solves this problem.

source: Для документации был выбран формат **md**, поскольку он наиболее прост для ввода и широко распространён. Описанные в нем участки кода **perl** транслируются в тест. Документация переводится в **POD** и добавляется в раздел **\__END__** модуля perl.
ru_en: For the documentation, the **md** format was selected, since it is the most simple for input and widespread. The areas of code **perl** described in it are broadcast into a test. The documentation is translated into **pod** and is added to the **\__END__** section of the perl module.

source: Другими словами, **liveman** конвертирует **lib/\*\*.md**-файлы в тестовые файлы (**t/\*\*.t**) и документацию, которая помещается в соответствующую **lib/\*\*.pm** модуль. И сразу запускает тесты с покрытием.
ru_en: In other words, **liveman** converts **lib/\*\*.md**-files to test files (**t/\*\*.t**) and documentation that is placed in the corresponding **lib/\*\*.pm** module. And immediately launches the tests with coating.

source: Покрытие можно просмотреть в файле *cover_db/coverage.html*.
ru_en: The coating can be viewed in the **cover_db/coverage.html* file.

source: Примечание: лучше сразу поместить *cover_db/* в *.gitignore*.
ru_en: Note: it is better to immediately place *cover_db/* in *.gitignore*.

source: Показать справку и выйти.
ru_en: Show a certificate and get out.

source: Показать версию и выйти.
ru_en: Show the version and go out.

source: Распечатать инструкцию и завершиться.
ru_en: Print instructions and end.

source: Только компилировать (без запуска тестов).
ru_en: Only compile (without starting the tests).

source: Преобразовать файлы *lib/\*\*.md*, даже если они не изменились.
ru_en: Convert the *lib/\*\*.md* files, even if they have not changed.

source: Использовать для тестов утилиту `prove`, а не `yath`.
ru_en: Use the `prove` utility for tests, not `yath`.

source: Открыть покрытие в браузере.
ru_en: Open the coating in the browser.

source: Передать строку с опциями `yath` или `prove`. Эти параметры будут добавлены к параметрам по умолчанию.
ru_en: Transfer the line with the options `yath` or `prove`. These parameters will be added to the default parameters.

source: Параметры по умолчанию для `yath`:
ru_en: Default parameters for `yath`:

source: Параметры по умолчанию для `prove`:
ru_en: Default parameters for `prove`:

source: **-а**, **--append**
ru_en: **-a**, **--append**

source: Добавить разделы функций в `*.md` из `*.pm` и завершиться.
ru_en: Add functions in `*.md` from`*.pm` and end.

source: Создать новый репозиторий.
ru_en: Create a new repository.

source: * *PACKAGE* — это имя нового пакета, например, `Aion::View`. * *LICENSE* — это имя лицензии, например, GPLv3 или perl_5.
ru_en: * *PACKAGE* - this is the name of the new package, for example, `Aion::View`. * *License* is a license name, for example, GPLv3 or perl_5.

source: Распечатать примерный cpanfile.
ru_en: Print a sample cpanfile.

source: Сравнить примерный cpanfile с существующим. Если параметр не указан – используется `meld`. В качестве альтернативы можно использовать `diff`, `colordiff`, `wdiff`, `kompare`, `kdiff3`, `tkdiff`, `diffuse` или любую другую утилиту, которая принимает два файла в качестве аргументов.
ru_en: Compare the sample cpanfile with the existing one. If the parameter is not specified, `meld` is used. Alternatively, you can use `diff`, `colordiff`, `wdiff`, `kompare`, `kdiff3`, `tkdiff`, `diffuse` or any other utility that takes two files as arguments.

source: Чтобы установить этот модуль в вашу систему, выполните следующую [команду](https://metacpan.org/pod/App::cpm):
ru_en: To install this module in your system, follow the following [command](https://metacpan.org/pod/App::cpm)
