Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-HTMLExport/share/locale/Padre__Plugin__HTMLExport-*.po
Languages: ar

source: Export Colorful HTML
ar: تصدير إلى HTML ملون

source: Export HTML...
ar: تصدير إلى HTML...

source: Configure Color
ar: تعريف اللون

source: Save as HTML...
ar: حفظ كHTML...

source: File already exists. Overwrite it?
ar: الملف موجود أصلا. هل تريد الكتابة فوقه؟

source: Exist
ar: موجود

source: %s is not supported
ar: ال %s غير مدعوم

source: Saved to %s. Do you want to open it now?
ar: تم الحفظ إلى %s. هل تريد فتحه الآن؟

source: Done
ar: تم

source: Not implemented, TODO
ar: لم تنفذ بعد، TODO
