Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/R/RT-Extension-ReferenceIDoitObjects/po/*.po
Languages: de

source: Referenced i-doit objects
de: Referenzierte Objekte aus i-doit

source: Default tenant is not configured.
de: Standard-Mandant ist nicht konfiguriert.

source: Please select an i-doit tenant.
de: Bitte wählen Sie einen i-doit-Mandanten.

source: Object view
de: Objektansicht

source: Tree view
de: Baumansicht

source: Selected objects
de: Ausgewählte Objekte

source: Go to i-doit
de: Gehe zu i-doit

source: Refresh
de: Aktualisieren

source: URL for i-doit is not configured.
de: URL zu i-doit ist nicht konfiguriert.

source: URL for i-doit's API is not configured.
de: URL zur API von i-doit ist nicht konfiguriert.

source: Key for i-doit's API is not configured.
de: Key für die API von i-doit ist nicht konfiguriert.

source: Custom field %s does not exist.
de: Benutzerdefiniertes Feld %s existiert nicht.

source: Default view for referenced i-doit objects is not configured.
de: Standardansicht für referenzierte Objekte aus i-doit ist nicht konfiguriert.

source: Configuration option to show/hide i-doit related custom fields is not set.
de: Option zum Anzeigen/Verstecken von auf i-doit bezogene benutzerdefinierte Feldern ist nicht konfiguriert.

source: Show _MENU_ objects
de: Zeige _MENU_ Objekte

source: No objects has been selected yet.
de: Es wurden noch keine Objekte ausgewählt.

source: _START_ to _END_ of _TOTAL_ objects
de: _START_ bis _END_ von _TOTAL_ Objekt(en)

source: 0 to 0 of 0 objects
de: 0 bis 0 von 0 Objekten

source: (filtered from _MAX_ objects)
de: (gefiltert von _MAX_ Objekten)

source: Error while loading object types
de: Fehler beim Laden der Objekttypen

source: Error while loading objects by object type
de: Fehler beim Laden der Objekte zu einem Objekttyp

source: Error while loading objects by email
de: Fehler beim Laden von Objekten anhand von E-Mail-Adressen

source: Error while loading pre-selecting objects
de: Fehler beim Laden vorselektierter Objekte

source: Error while loading relation objects
de: Fehler beim Laden von Beziehungsobjekten

source: Modify referenced i-doit objects for ticket #%1
de: Bearbeite referenzierte Objekte aus i-doit für Ticket #%1

source: Given requestor(s) could not be found in i-doit.
de: In i-doit wurde keiner der angegebenen Klienten gefunden.

source: Object type
de: Objekttyp

source: These fields are needed to modify referenced i-doit objects.
de: Diese Felder werden zum Bearbeiten von referenzierten Objekten aus i-doit benötigt.

source: Ticket was edited.
de: Ticket wurde editiert.

source: Ticket was created.
de: Ticket wurde erstellt.

source: Error while creating i-doit logbook entry
de: Fehler beim Erstellen eines Logbuch-Eintrags in i-doit

source: There is no requestor selected.
de: Es ist kein Klient ausgewählt.

source: Unknown
de: Unbekannt

source: Expand menu tree
de: Menübaum ausklappen

source: There are no roles defined for given customer(s).
de: Für den/die angegebenen Klienten sind keine Rollen definiert.

source: Role
de: Rolle

source: Primary
de: Primär

source: Installed software
de: Installierte Software

source: All objects
de: Alle Objekte

source: Workplaces
de: Arbeitsplätze

source: Devices
de: Geräte

source: Given customer(s) could not be found in i-doit.
de: In i-doit wurde keiner der angegebenen Klienten gefunden.
