package Firewall::Config::Dao::Parser::Huawei;

#------------------------------------------------------------------------------
# 加载扩展插件
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 继承 Firewall::Config::Dao::Parser::Role 方法属性
#------------------------------------------------------------------------------
with 'Firewall::Config::Dao::Parser::Role';

__PACKAGE__->meta->make_immutable;
1;
