Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/T/Time-Ago/po/*.po
Languages: fr, it

source: about {count} hour
fr: environ une heure
it: circa un'ora

source: about {count} month
fr: environ un mois
it: circa un mese

source: about {count} year
fr: environ un an
it: circa un anno

source: almost {count} year
fr: presqu'un an
it: circa 1 anno

source: half a minute
fr: une demi-minute
it: mezzo minuto

source: less than a minute
fr: moins d'une seconde
it: meno di un minuto

source: less than {count} second
fr: moins d'une seconde
it: meno di un secondo

source: over {count} year
fr: plus d'un an
it: oltre un anno

source: {count} day
fr: 1 jour
it: {count} giorno

source: {count} minute
fr: 1 minute
it: {count} minuto

source: {count} month
fr: 1 mois
it: {count} mese

source: {count} second
fr: 1 seconde
it: {count} secondo
