Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-Perl6/share/locale/Padre__Plugin__Perl6-*.po
Languages: es_es, fr_fr, ja, nl_nl, pl, pt_br

source: Create Perl 6...
es_es: Crear código Perl 6...
fr_fr: Créer en Perl 6...
ja: 新しいPerl 6の...
nl_nl: Maak Perl 6...
pt_br: Criar em Perl 6...

source: Class
es_es: Clase
fr_fr: Classe
ja: クラス
nl_nl: Klasse
pt_br: Classe

source: Grammar
es_es: Gramática
fr_fr: Grammaire
ja: グラマー
nl_nl: Grammatica
pt_br: Gramática

source: Package
es_es: Paquete
ja: パッケージ
nl_nl: Pakket
pt_br: Pacote

source: Module
es_es: Módulo
ja: モジュール
pt_br: Módulo

source: Inlined in Perl 5
es_es: Insertado en Perl 5
fr_fr: Inliné en Perl 5
ja: Perl 5でインライン化
nl_nl: Ingevoegd in Perl 5
pt_br: Inline em Perl 5

source: Refactor...
fr_fr: Refactoriser...
ja: リファクタリング...
pt_br: Refatorar...

source: Find variable declaration
fr_fr: Trouver la déclaration de la variable
ja: 変数宣言を検索
nl_nl: Vind variabele declaratie
pt_br: Encontrar declaração de variável

source: Perl 6 refactoring support is coming soon...
fr_fr: Le support de la refactorisation pour Perl 6 arrive bientôt...
ja: Perl 6のリファクタリングサポートは近日中に対応予定です...
nl_nl: Perl 6 refactoring ondersteuning is spoedig voorzien...
pt_br: Suporte a refatoração em Perl 6 em breve...

source: Error
fr_fr: Erreur
ja: エラー
nl_nl: Fout
pt_br: Erro

source: Rename variable
fr_fr: Renommer la variable
ja: 変数のリネーム
nl_nl: Hernoem variabele
pt_br: Renomear variável

source: Perl 6 Executable
fr_fr: Exécutable Perl 6
ja: Perl 6実行ファイル
nl_nl: Perl 6 Uitvoerbaar bestand
pt_br: Executável Perl 6

source: Perl 6 Executable (No parrot.exe)
fr_fr: Exécutable Perl 6 (sans parrot.exe)
nl_nl: Perl 6 Uitvoerbaar bestand (niet parrot.exe)
pt_br: Executável Perl 6 (sem parrot.exe)

source: Perl 6 PIR
es_es: PIR de Perl 6
fr_fr: PIR Perl 6
pt_br: PIR Perl 6

source: Export...
es_es: Exportar...
fr_fr: Exporter...
ja: エクスポート
nl_nl: Exporteer...
pt_br: Exportar...

source: Full html
es_es: HTML completo
fr_fr: HTML complet
ja: HTML(完全)
nl_nl: Compleet html
pt_br: HTML Completo

source: Simple html
es_es: HTML simple
fr_fr: HTML simple
ja: HTML(簡易)
nl_nl: Eenvoudige html
pt_br: HTML Simples

source: Snippet html
es_es: Fragmento HTML
fr_fr: extrait HTML
ja: HTML(スニペット)
pt_br: Trecho HTML

source: More Help?
es_es: ¿Necesita más ayuda?
fr_fr: Plus d'aide ?
ja: その他のヘルプ
nl_nl: Meer Hulp?
pt_br: Mais ajuda?

source: Perl 6 Introduction
es_es: Introducción a Perl 6
fr_fr: Introduction à Perl 6
nl_nl: Perl 6 Introductie
pt_br: Introdução ao Perl 6

source: Perl 6 Syntax
es_es: Sintaxis de Perl 6
fr_fr: Syntaxe Perl 6
pt_br: Sintaxe Perl 6

source: Perl 6 Objects Introduction
es_es: Introducción a los objetos en Perl 6
fr_fr: Introduction aux objets Perl 6
nl_nl: Perl 6 Objecten Introductie
pt_br: Introdução a Objetos em Perl 6

source: Perl 6 Regexes Introduction
es_es: Introducción a las expresiones regulares en Perl 6
fr_fr: Introduction aux expressions régulières Perl 6
nl_nl: Perl 6 Reguliere Expressies Introductie
pt_br: Introdução a Expressões Regulares no Perl 6

source: Visit #padre for Padre Help
es_es: Obtener ayuda para usar Padre en el canal #padre
fr_fr: Visiter #padre pour de l'aide sur Padre
nl_nl: Bezoek #padre voor Padre Hulp
pt_br: Visite #padre para ajuda com Padre

source: Visit #perl6 for Perl 6 Help
es_es: Obtener ayuda para usar Perl 6 en el canal #perl6
fr_fr: Visiter #perl6 pour de l'aide sur Perl6
nl_nl: Bezoek #perl6 voor Perl 6 Hulp
pt_br: Visite #perl6 para ajuda com Perl 6

source: Perl 6 Projects
fr_fr: Projets Perl 6
ja: Perl 6プロジェクト
nl_nl: Perl 6 Projecten
pt_br: Projetos do Perl 6

source: Maintenance
ja: メンテナンス
nl_nl: Onderhoud
pt_br: Manutenção

source: Cleanup STD.pm Lex Cache
fr_fr: Nettoyer le cache lex de STD.pm
ja: STDのレキシカルキャッシュをクリア
nl_nl: STD.pm lex cache opkuisen
pl: Wyczyść pamięć podręczną STD.pm
pt_br: Limpar Cache Lex do STD.pm

source: Preferences
es_es: Preferencias
fr_fr: Préférences
ja: 設定
nl_nl: Instellingen
pl: Ustawienia
pt_br: Preferências

source: About
es_es: Acerca de
fr_fr: A propos
ja: このプラグインについて
nl_nl: Betreft
pl: O wtyczce
pt_br: Sobre

source: Error loading template file '%s'
es_es: Error al cargar el archivo de plantilla '%s'
fr_fr: Erreur lors du chargement du fichier template '%s'
nl_nl: Fout bij het laden van sjabloonbestand '%s'
pt_br: Erro carregando arquivo de template '%s'

source: This plugin enables useful Perl 6 features on Padre IDE.
es_es: Este complemento habilita características útiles de Perl 6 en el IDE de Padre.
fr_fr: Ce greffon active des fonctionnalités Perl 6 utiles dans l'IDE Padre.
ja: このプラグインはPadre IDE上で便利なPerl 6の機能を 利用できるようにするものです。
nl_nl: Deze plugin activeert nuttige Perl 6 eigenschappen in de PADRE IDE.
pt_br: Este plugin ativa elementos úteis do Perl 6 no Padre.

source: It integrates coloring and easy access to Perl 6 help documents.
es_es: Integra el coloreado de sintaxis y un acceso sencillo a los documentos de ayuda de Perl 6.
fr_fr: Il intègre la coloration syntaxique et l'accès facile aux documents d'aide Perl 6.
ja: 色分けやPerl 6のヘルプに簡単にアクセスできるようにします。
nl_nl: Het integreert kleuren en vlotte toegang to Perl 6 help documenten.
pt_br: Integra colorização e acesso fácil a documentos de ajuda do Perl 6.

source: The following modules are used:
es_es: Se utilizan los módulos siguientes:
fr_fr: Les modules suivants sont utilisés :
ja: 利用しているモジュールは次の通りです:
nl_nl: De volgende modules worden gebruikt:
pt_br: Os seguintes módulos são usados:

source: Cannot find STD.pm lex cache
fr_fr: Ne peut trouver le cache lex de STD.pm
ja: STD.pmのレキシカルキャッシュが見つかりません
nl_nl: Kan de STD.pm lex cache niet vinden
pl: Nie znaleziono pamięci podręcznej STD.pm
pt_br: Não foi possível encontrar o cache lex do STD.pm

source: No document
es_es: Ningún documento
fr_fr: Aucun document
ja: ドキュメントがありません
nl_nl: Geen document
pt_br: Nenhum documento

source: Not a Perl 6 file
es_es: No es un archivo de Perl 6
fr_fr: Pas un fichier Perl 6
ja: Perl 6のファイルではありません
nl_nl: Geen Perl 6 bestand.
pt_br: Não é um arquivo Perl 6

source: Operation cancelled
es_es: Operación cancelada
fr_fr: Opération annulée
ja: キャンセルしました
nl_nl: Operatie geannuleerd
pt_br: Operação cancelada

source: Insert declaration for %s
es_es: Insertar declaración para %s
fr_fr: Insérer la déclaration pour %s
ja: %sの宣言を挿入する
nl_nl: Voeg declaratie voor %s in
pt_br: Insira declaração para %s

source: Insert a space after %s
es_es: Insertar un espacio después de %s
fr_fr: Insérer un espace après %s
ja: %sのあとに空白を挿入する
nl_nl: Voeg een spatie na %s in
pt_br: Insira um espaço após %s

source: Insert routine %s
es_es: Insertar rutina %s
fr_fr: Insérer la routine %s
ja: %sルーチンを挿入する
nl_nl: Voeg routine %s in
pt_br: Insira rotina %s

source: Use ~ instead of . for string concatenation
es_es: Use ~ en lugar de . para concatenar cadenas
fr_fr: Utiliser ~ à la place de . pour la concaténation de chaînes
ja: 文字列の結合には「.」ではなく「~」を使ってください
nl_nl: Gebruik ~ in plaats van . voor string samenvoeging
pt_br: Use ~ em vez de . para concatenação de strings

source: Use . for method call
es_es: Use . para invocar un método
fr_fr: Utiliser . pour les appels de méthode
ja: メソッド呼び出しには「.」を使ってください
nl_nl: Gebruik . voor methode oproep
pt_br: Use . para invocar métodos

source: Use Perl 6 constructor syntax
es_es: Use la sintaxis de constructor de Perl 6
fr_fr: Utiliser la syntaxe de construction Perl 6
ja: Perl 6のコンストラクタ構文を使ってください
nl_nl: Gebruik Perl 6 constructor syntax
pt_br: Use a sintaxe de construtor do Perl 6

source: Use loop (;;) for looping
es_es: Use loop (;;) para crear un bucle
fr_fr: Utiliser loop(;;) pour les boucles
ja: ループにはloop (;;)を使ってください
nl_nl: Gebruik loop (;;) voor looping
pt_br: Use loop (;;) para laços

source: Use [*-1] to access final element
es_es: Use [*-1] para acceder al último elemento
fr_fr: Utiliser [*-1] pour accéder au dernier élément
ja: 最後の要素にアクセスする時は[*-1]を使ってください
nl_nl: Gebruik [*-1] om het laatste element aan te roepen.
pt_br: Use [*-1] para acessar o último elemento

source: Use N.pick for a random number
es_es: Use N.pick para obtener un número aleatorio
fr_fr: Utiliser N.pick pour un nombre aléatoire
ja: ランダムな数字を指定する場合はN.pickを使ってください
nl_nl: Gebruik N.pick voor een willekeurig getal
pt_br: Use N.pick para um número aleatório

source: Use (1..N).pick for a random number
es_es: Use (1..N).pick para obtener un número aleatorio
fr_fr: Utiliser (1..N).pick pour un nombre aléatoire
ja: ランダムな数字を指定する場合は(1..N).pickを使ってください
nl_nl: Gebruik (1..N).pick voor een willekeurig getal
pt_br: Use (1..N).pick para um número aleatório

source: Use [N..*] for indefinite range
es_es: Use [N..*] para obtener un rango indefinido
fr_fr: Utiliser [N..*] pour une plage indéfinie
ja: 不定の範囲を指定する場合は[N..*]を使ってください
nl_nl: Gebruik [N..*] voor een oneindige reeks
pt_br: Use [N..*] para intervalos indefinidos

source: Use !! for conditional operator
es_es: Use !! como operador condicional
fr_fr: Utiliser !! pour l'opérateur conditionnel
ja: 条件演算子には!!を使ってください
nl_nl: Gebruik !! als voorwaardelijke operator
pt_br: Use !! para o operador condicional

source: Use ?? (...) !! to avoid precedence bugs
es_es: Use ?? (...) !! para evitar errores de prioridad
fr_fr: Utiliser ?? (...) !! pour éviter les bugs de précédence
ja: 優先順位のバグを避けるため?? (...) !!を使ってください
nl_nl: Gebruik ?? (...) !! om voorrang bugs te vermijden
pt_br: Use ?? (...) !! para evitar erros de precedência

source: Use ?? !! for the conditional operator
es_es: Use ?? !! como operador condicional
fr_fr: Utiliser ?? !! pour l'opérateur conditionnel
ja: 条件演算子には?? !!を使ってください
nl_nl: Gebruik ?? !! voor de voorwaardelijke operator
pt_br: Use ?? !! para o operador condicional

source: Use ~= for string concatenation
es_es: Use ~= para concatenar cadenas
fr_fr: Utiliser ~= pour la concaténation de chaîne
ja: 文字列結合には~=を使ってください
nl_nl: Gebruik ~= voor string samenvoeging
pt_br: Use ~= para concatenação de strings

source: Use ~~ for pattern matching
es_es: Use ~~ para detectar patrones
fr_fr: Utiliser ~~ pour la recherche de motif
ja: パターンマッチングには~~を使ってください
nl_nl: Gebruik ~~ voor het patroon vinden
pt_br: Use ~~ para expressões regulares

source: Use !~~ for negated pattern matching
es_es: Use !~~ para detectar la ausencia de patrones
fr_fr: Utiliser !~~ pour la recherche de motif inversée
ja: パターンマッチングの否定には!~~を使ってください
nl_nl: Gebruik !~~ voor het niet overeenkomende patroon vinden
pt_br: Use !~~ para expressões regulares negadas

source: Use +> for numeric right shift
es_es: Use +> para el desplazamiento numérico a la derecha
fr_fr: Utiliser +> pour shift droit numérique
ja: 数値の右シフトには+>を使ってください
nl_nl: Gebruik +> voor numerieke rechtershift
pt_br: Use +> para deslocamento numérico para a direita

source: Use ~> for string right shift
es_es: Use ~> para el desplazamiento numérico a la derecha
fr_fr: Utiliser ~> pour shift droit de chaîne
ja: 文字列の右シフトには~>を使ってください
nl_nl: Gebruik ~> voor string rechtershift
pt_br: Use ~> para deslocamento de string para a direita

source: Use +< for numeric left shift
es_es: Use +< para el desplazamiento numérico a la izquierda
fr_fr: Utiliser +< pour shift gauche numérique
ja: 数値の左シフトには+<を使ってください
nl_nl: Gebruik +< voor numerieke linkershift
pt_br: Use +< para deslocamento numérico para a esquerda

source: Use ~< for string left shift
es_es: Use ~< para el desplazamiento numérico a la izquierda
fr_fr: Utiliser ~< pour shift gauche de chaîne
ja: 文字列の左シフトには~<を使ってください
nl_nl: Gebruik ~< voor string linkershift
pt_br: Use ~< para deslocamento de string para a esquerda

source: Use $! for eval errors
es_es: Use $! para los errores de evaluación
fr_fr: Utiliser $! pour les erreurs d'évaluation
ja: evalエラーには$!を使ってください
nl_nl: Gebruik $! voor eval fouten
pt_br: Use $! para avaliar erros

source: Comment error line
es_es: Comentar línea de error
fr_fr: Erreur de commentaire ligne
ja: コメントエラー行
nl_nl: Commentaar fout lijn
pt_br: Comentar linha com erro

source: Surround with try { ... }
es_es: Incluir dentro de un bloque try { ... }
fr_fr: Encadrer avec try { ... }
ja: try { ... }でくくってください
nl_nl: Omring met try { ... }
pt_br: Envolva com try { ... }

source: Convert POD6 to XHTML
es_es: Convertir POD6 a XHTML
fr_fr: Convertir POD6 en XHTML
ja: POD6をXHTMLに変換
nl_nl: Converteer POD6 naar XHTML
pt_br: Converter POD6 para XHTML

source: Operation failed!
es_es: Error en la operación.
fr_fr: Opération échouée !
ja: 失敗しました!
nl_nl: Operatie gefaald!
pt_br: Operação falhou!

source: Convert POD6 to Text
es_es: Convertir POD6 a texto
fr_fr: Convertir POD6 en texte
ja: POD6をテキストに変換
nl_nl: Converteer POD6 naar Tekst
pt_br: Converter POD6 para Texto

source: Outline
fr_fr: Profil
ja: アウトライン
nl_nl: Uitlijning
pl: Plan
pt_br: Esboço

source: Open &Documentation
fr_fr: Ouvrir la &documentation
ja: ドキュメントを開く(&D)
nl_nl: Open &Documentatie
pl: Otwórz &dokument
pt_br: Abrir &Documentação

source: 'STD Lex Cache' folder is corrupt. Please click on 'Plugins/Perl6/Maintenance' and then 'Cleanup STD Lex Cache' and then re-open the file.
fr_fr: Le dossier 'STD Lex Cache' est corrompu. Veuillez cliquer sur 'Greffons / Perl 6' puis 'Nettoyer le cache lex de STD.pm' et réouvrir le fichier.
ja: 「STDレキシカルキャッシュ」フォルダが壊れています。「プラグイン」「Perl6」「メンテナンス」から「STDレキシカルキャッシュのクリア」をクリックしてファイルを開きなおしてください
nl_nl: 'STD Lex Cache' folder is corrupt. Gelieve te klikken op 'Plugins/Perl6/Maintenance' en dan op 'Cleanup STD Lex Cache' en heropen vervolgens het bestand.
pt_br: Diretório 'STD Lex Cache' está corrompido. Por favor clique em 'Plugins/Perl6/Manutenção' e então 'Limpar STD Lex Cache' e abra novamente o arquivo.

source: Perl 6 preferences
es_es: Preferencias de Perl 6
fr_fr: Préférences Perl 6
ja: Perl 6の設定
nl_nl: Perl 6 instellingen
pt_br: Preferências do Perl 6

source: Enable coloring
es_es: Habilitar coloreado de sintaxis
fr_fr: Activer la coloration syntaxique
ja: 色分けする
nl_nl: Activeer automatisch kleuren
pt_br: Ativar Colorização Automática

source: Script
ja: スクリプト

source: Role
es_es: Rol
ja: ロール
nl_nl: Rol

source: Perl 6 Help F2
ja: Perl 6ヘルプ F2

source: #padre for Padre Help
ja: Padreのヘルプ(#padre)

source: #perl6 for Perl 6 Help
ja: Perl 6のヘルプ(#perl6)

source: Use $::PERL_VERSION
fr_fr: Utiliser $::PERL_VERSION
ja: $::PERL_VERSIONを使ってください
nl_nl: Gebruik $::PERL_VERSION

source: Perl 6 Help (Powered by grok)
ja: Perl 6ヘルプ(grokを利用)

source: Colorizer:
ja: 色分けに使うモジュール:

source: Perl 6 Website
es_es: Sitio web de Perl 6

source: Show Perl6 Help F2
pl: Pokaż pomoc dla Perl6 F2

source: Enable Auto Coloring
pl: Włącz automatyczne kolorwanie

source: Export Full HTML
pl: Pełny eksport do HTML

source: Export Simple HTML
pl: Prosty eksport do HTML

source: Export Snippet HTML
pl: Eksportuj wycinek do HTML

source: Perl6 preferences
pl: Ustawienia Perl6

source: Syntax Highlighter:
pl: Podświetlenie składni:

source: Pick mildew Directory
pl: Wybierz katalog mildew

source: Pick rakudo Directory
pl: Wybierz katalog rakudo

source: %s is Perl 6 %s
pl: %s jest %s Perl 6
