package Number::Phone::JP::Table::Class1;

use strict;
use warnings;

our $VERSION = '0.20180904';

# Table last modified: 2018-09-04
our %TEL_TABLE = (
    # Pref => q<Assoc-Pref-Regex>,
    '01'    => '\d+', # KDDI
    '0240'  => '\d+', # ZIP Telecom
    '0241'  => '\d+', # アイ・ピー・エス
    '0242'  => '\d+', # アイ・ピー・エス
    '0243'  => '\d+', # NTTコミュニケーションズ
    '0244'  => '\d+', # NTTコミュニケーションズ
    '0245'  => '\d+', # NTTコミュニケーションズ
    '0246'  => '\d+', # NTT東日本
    '0247'  => '\d+', # 楽天コミュニケーションズ
    '0248'  => '\d+', # 楽天コミュニケーションズ
    '0249'  => '\d+', # NTT西日本
    '0251'  => '\d+', # ソフトバンク
    '0256'  => '\d+', # ソフトバンク
    '0261'  => '\d+', # KDDI
    '0262'  => '\d+', # KDDI
    '0263'  => '\d+', # KDDI
    '0264'  => '\d+', # KDDI
    '0265'  => '\d+', # KDDI
    '0266'  => '\d+', # KDDI
    '0267'  => '\d+', # KDDI
    '0270'  => '\d+', # アルテリア・ネットワークス
    '0271'  => '\d+', # ソフトバンク
    '0272'  => '\d+', # ソフトバンク
    '0273'  => '\d+', # ソフトバンク
    '0275'  => '\d+', # ソフトバンク
    '0276'  => '\d+', # ソフトバンク
    '0277'  => '\d+', # りーふねっと
    '0280'  => '\d+', # KDDI
    '0283'  => '\d+', # 安子の電話
    '0284'  => '\d+', # 安子の電話
    '0287'  => '\d+', # KDDI
    '0288'  => '\d+', # 株式会社コムスクエア
    '0291'  => '\d+', # 楽天コミュニケーションズ
    '0292'  => '\d+', # 楽天コミュニケーションズ
    '0293'  => '\d+', # ソフトバンク
    '0294'  => '\d+', # ソフトバンク
    '0296'  => '\d+', # 九州通信ネットワーク
    '0298'  => '\d+', # ソフトバンク
);

1;
__END__
