Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Meta/FeatureConstruct.*.po
Languages: ru_en

source: Aion::Meta::FeatureConstruct - конструктор акцессора, предиката, инициализатора и очистителя
ru_en: Aion::Meta::FeatureConstruct - accessor, predicate, initializer and clearer

source: Предназначен для конструирования геттеров/сеттеров из кусочков кода.
ru_en: Designed for constructing getters/setters from pieces of code.

source: Конструктор.
ru_en: Constructor.

source: Пакет, к которому относится атрибут. Геттер.
ru_en: The package to which the attribute belongs. Getter.

source: Имя атрибута. Геттер.
ru_en: Attribute name. Getter.

source: Код для записи значения. Геттер.
ru_en: Code for writing the value. Getter.

source: ## read Код для чтения значения. Геттер.
ru_en: ## read Code to read the value. Getter.

source: ## getvar Переменная для получения значения. Геттер.
ru_en: ## getvar Variable to receive the value. Getter.

source: ## ret Код возврата значения. Геттер.
ru_en: ##ret Value return code. Getter.

source: ## init_arg Ключ в хеше инициализации. Акцессор.
ru_en: ## init_arg The key is in the initialization hash. Accessor.

source: ## set Код установки значения в хеш объекта. Акцессор.
ru_en: ## set Code for setting the value to the object hash. Accessor.

source: ## get Код получения значения из хеша объекта. Акцессор.
ru_en: ## get Code for getting a value from an object hash. Accessor.

source: ## has Код проверки существования значения. Акцессор.
ru_en: ##has Code for checking the existence of a value. Accessor.

source: ## clear Код удаления значения. Акцессор.
ru_en: ## clear Code for deleting a value. Accessor.

source: ## weaken Код ослабления ссылки. Акцессор.
ru_en: ## weaken Link weakening code. Accessor.

source: ## accessor_name Имя метода-акцессора. Акцессор.
ru_en: ## accessor_name The name of the accessor method. Accessor.

source: ## reader_name Имя метода-ридера. Акцессор.
ru_en: ## reader_name Reader method name. Accessor.

source: ## writer_name Имя метода-райтера. Акцессор.
ru_en: ## writer_name Writer method name. Accessor.

source: ## predicate_name Имя метода-предиката. Акцессор.
ru_en: ## predicate_name Predicate method name. Accessor.

source: ## clearer_name Имя метода-очистителя. Акцессор.
ru_en: ## clearer_name The name of the cleanser method. Accessor.

source: ## initer Код инициализации атрибута. Акцессор.
ru_en: ##initer Attribute initialization code. Accessor.

source: ## not_specified Код инициализации, если значение не указано. Акцессор.
ru_en: ## not_specified Initialization code if no value is specified. Accessor.

source: ## getter Код геттера в акцессоре. Акцессор.
ru_en: ## getter Getter code in the accessor. Accessor.

source: ## setter Код сеттера в акцессоре. По умолчанию: '%(write)s'.
ru_en: ## setter Setter code in the accessor. Default: '%(write)s'.

source: ## selfret Код возврата из сеттера. Акцессор.
ru_en: ##selfret Return code from setter. Accessor.

source: ## add_attr($code, $unshift) Добавляет атрибут к акцессору.
ru_en: ## add_attr($code, $unshift) Adds an attribute to the accessor.

source: ## add_preset($code, $unshift) Добавляет код предустановки перед записью.
ru_en: ## add_preset($code, $unshift) Adds a preset code before recording.

source: ## add_trigger($code, $unshift) Добавляет триггер после записи.
ru_en: ## add_trigger($code, $unshift) Adds a trigger after recording.

source: ## add_cleaner($code, $unshift) Добавляет код очистки перед удалением.
ru_en: ## add_cleaner($code, $unshift) Adds cleanup code before deletion.

source: ## add_access($code, $unshift) Добавляет код в геттер перед чтением атрибута.
ru_en: ## add_access($code, $unshift) Adds code to the getter before reading the attribute.

source: ## add_release($code, $unshift) Добавляет код в геттер после чтения.
ru_en: ## add_release($code, $unshift) Adds code to the getter after reading.

source: ## initializer Генерирует код для инициализации фичи в конструкторе (`new`).
ru_en: ## initializer Generates code to initialize a feature in the constructor (`new`).

source: ## destroyer Генерирует код для деструктора.
ru_en: ## destroyer Generates code for the destructor.

source: ## accessor Генерирует код акцессора.
ru_en: ## accessor Generates an accessor code.

source: ## reader Генерирует код геттера.
ru_en: ## reader Generates getter code.

source: ## writer Генерирует код сеттера.
ru_en: ## writer Generates setter code.

source: ## predicate Генерирует код предиката.
ru_en: ## predicate Generates a predicate code.

source: ## clearer Генерирует код очистителя.
ru_en: ## clearer Generates a purifier code.
