Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Meta/Feature.*.po
Languages: ru_en

source: Aion::Meta::Feature - метаописатель фичи
ru_en: Aion::Meta::Feature - feature metadescriptor

source: Описывает фичу, которая добавляется в класс функцией `has`.
ru_en: Describes a feature that is added to the class by the `has` function.

source: ## name Имя фичи.
ru_en: ## name Feature name.

source: ## opt Хеш опций фичи.
ru_en: ## opt Feature options hash.

source: ## has Массив опций фичи в виде пар ключ-значение.
ru_en: ##has An array of feature options in the form of key-value pairs.

source: ## construct Объект конструктора фичи.
ru_en: ## construct Feature constructor object.

source: ## order () Порядковый номер фичи в классе.
ru_en: ##order() The serial number of the feature in the class.

source: ## required (;$bool) Флаг обязательности фичи в конструкторе (`new`).
ru_en: ## required (;$bool) Flag for requiring a feature in the constructor (`new`).

source: ## excessive (;$bool) Флаг избыточности фичи в конструкторе (`new`). Если она там есть должно выбрасываться исключение.
ru_en: ## excessive (;$bool) Feature redundancy flag in the constructor (`new`). If it is there, an exception should be thrown.

source: ## isa (;Object[Aion::Type]) Ограничение типа для значения фичи.
ru_en: ## isa (;Object[Aion::Type]) Type constraint on feature value.

source: ## lazy (;$bool) Флаг ленивой инициализации.
ru_en: ## lazy (;$bool) Lazy initialization flag.

source: ## builder (;$sub) Билдер значения фичи или `undef`.
ru_en: ## builder (;$sub) Feature value builder or `undef`.

source: ## default (;$value) Значение по умолчанию для фичи.
ru_en: ## default (;$value) Default value for the feature.

source: ## trigger (;$sub) Обработчик события изменения значения фичи или `undef`.
ru_en: ## trigger (;$sub) Event handler for feature value change or `undef`.

source: ## release (;$sub) Обработчик события чтения значения из фичи или `undef`.
ru_en: ## release (;$sub) Event handler for reading a value from a feature or `undef`.

source: ## cleaner (;$sub) Обработчик события удаления фичи из объекта или `undef`.
ru_en: ## cleaner (;$sub) Event handler for removing a feature from an object or `undef`.

source: ## make_reader (;$bool) Флаг создания метода-ридера.
ru_en: ## make_reader (;$bool) Flag for creating a reader method.

source: ## make_writer (;$bool) Флаг создания метода-райтера.
ru_en: ## make_writer (;$bool) Flag for creating a writer method.

source: ## make_predicate (;$bool) Флаг создания метода-предиката.
ru_en: ## make_predicate (;$bool) Flag for creating a predicate method.

source: ## make_clearer (;$bool) Флаг создания метода-очистителя.
ru_en: ## make_clearer (;$bool) Flag for creating a cleanup method.

source: ## new ($pkg, $name, @has) Конструктор фичи.
ru_en: ## new ($pkg, $name, @has) Feature designer.

source: ## stringify () Строковое представление фичи.
ru_en: ## stringify() String representation of a feature.

source: ## mk_property () Создаёт акцессор, геттер, сеттер, предикат и очиститель свойства.
ru_en: ## mk_property() Creates a property accessor, getter, setter, predicate, and purifier.

source: ## meta () Возвращает код в виде текста для доступа к метаинформации фичи.
ru_en: ## meta() Returns code as text to access the feature's meta information.

source: ## stash ($key; $val) Доступ к хранилищу свойств для вызывающего пакета.
ru_en: ## stash ($key; $val) Access the property store for the calling package.
