Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Meta/RequiresFeature.*.po
Languages: ru_en

source: Aion::Meta::RequiresFeature - требование фичи для интерфейсов
ru_en: Aion::Meta::RequiresFeature - feature requirement for interfaces

source: С помощью `req` создаёт требование к фиче которая будет описана в модуле к которому будет подключена роль или который унаследует абстрактный класс.
ru_en: Using `req` creates a requirement for a feature that will be described in the module to which the role will be connected or which will inherit the abstract class.

source: Проверяться будут только указанные аспекты в фиче.
ru_en: Only the specified aspects in the feature will be checked.

source: Конструктор.
ru_en: Constructor.

source: Возвращает имя пакета в котором описано требование к фиче.
ru_en: Returns the name of the package that describes the feature requirement.

source: Возвращает имя фичи.
ru_en: Returns the name of the feature.

source: Возвращает массив с аспектами фичи.
ru_en: Returns an array with aspects of the feature.

source: Возвращает хеш аспектов фичи.
ru_en: Returns a hash of the feature's aspects.

source: Строковое представление фичи.
ru_en: String representation of a feature.

source: Сравнивает с фичей, но только указанные аспекты.
ru_en: Compares with a feature, but only the specified aspects.
