Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Meta/Subroutine.*.po
Languages: ru_en

source: Aion::Meta::Subroutine - описывает функцию с сигнатурой
ru_en: Aion::Meta::Subroutine - describes a function with a signature

source: Служит для объявления требуемой функции в интерфейсах и обстрактных классах. При этом `referent ~~ Undef`.
ru_en: Used to declare the required function in interfaces and abstract classes. In this case, `referent ~~ Undef`.

source: А так же создаёт функцию-обёртку проверяющую сигнатуру.
ru_en: It also creates a wrapper function that checks the signature.

source: Конструктор.
ru_en: Constructor.

source: Создаёт функцию-обёртку проверяющую сигнатуру.
ru_en: Creates a wrapper function that checks the signature.

source: Сверяет свою (ожидаемую) сигнатуру с объявленной у функции в модуле и выбрасывает исключение, если сигнатуры не совпадают.
ru_en: Checks its (expected) signature against the one declared by the function in the module and throws an exception if the signatures do not match.

source: Строковое описание функции.
ru_en: String description of the function.

source: Возвращает имя пакета, в котором объявлена функция.
ru_en: Returns the name of the package in which the function is declared.

source: Возвращает имя функции.
ru_en: Returns the name of the function.

source: Возвращает сигнатуру функции.
ru_en: Returns the function signature.

source: Возвращает ссылку на оригинальную функцию.
ru_en: Returns a reference to the original function.

source: Возвращает функцию-обёртку проверяющую сигнатуру.
ru_en: Returns a wrapper function that checks the signature.
