=encoding utf8

=head1 NAME

Locale::CLDR::Locales::Si - Package for language Sinhala

=cut

package Locale::CLDR::Locales::Si;
# This file auto generated from Data\common\main\si.xml
#	on Sun 25 Feb 10:41:40 am GMT

use strict;
use warnings;
use version;

our $VERSION = version->declare('v0.44.0');

use v5.10.1;
use mro 'c3';
use utf8;
use if $^V ge v5.12.0, feature => 'unicode_strings';
use Types::Standard qw( Str Int HashRef ArrayRef CodeRef RegexpRef );
use Moo;

extends('Locale::CLDR::Locales::Root');
has 'display_name_language' => (
	is			=> 'ro',
	isa			=> CodeRef,
	init_arg	=> undef,
	default		=> sub {
		 sub {
			 my %languages = (
				'aa' => 'අෆාර්',
 				'ab' => 'ඇබ්කාසියානු',
 				'ace' => 'අචයිනිස්',
 				'ada' => 'අඩන්ග්මෙ',
 				'ady' => 'අඩිඝෙ',
 				'aeb' => 'ටියුනිසියනු අරාබි',
 				'af' => 'අෆ්‍රිකාන්ස්',
 				'agq' => 'ඇගම්',
 				'ain' => 'අයිනු',
 				'ak' => 'අකාන්',
 				'ale' => 'ඇලුඑට්',
 				'alt' => 'සතර්න් අල්ටය්',
 				'am' => 'ඇම්හාරික්',
 				'an' => 'ඇරගොනීස්',
 				'ann' => 'ඔබලෝ',
 				'anp' => 'අන්ගික',
 				'ar' => 'අරාබි',
 				'ar_001' => 'නූතන සම්මත අරාබි',
 				'arn' => 'මපුචෙ',
 				'arp' => 'ඇරපහො',
 				'ars' => 'නජ්ඩි අරාබි',
 				'as' => 'ඇසෑම්',
 				'asa' => 'අසු',
 				'ast' => 'ඇස්ටියුරියන්',
 				'atj' => 'ඇටිකමෙක්ව්',
 				'av' => 'ඇවරික්',
 				'awa' => 'අවදි',
 				'ay' => 'අයිමරා',
 				'az' => 'අසර්බයිජාන්',
 				'az@alt=short' => 'අසීරී',
 				'ba' => 'බාෂ්කිර්',
 				'ban' => 'බැලිනීස්',
 				'bas' => 'බසා',
 				'be' => 'බෙලරුසියානු',
 				'bem' => 'බෙම්බා',
 				'bez' => 'බෙනා',
 				'bg' => 'බල්ගේරියානු',
 				'bgc' => 'හර්යාන්වි',
 				'bgn' => 'බටහිර බලොචි',
 				'bho' => 'බොජ්පුරි',
 				'bi' => 'බිස්ලමා',
 				'bin' => 'බිනි',
 				'bla' => 'සික්සිකා',
 				'bm' => 'බම්බරා',
 				'bn' => 'බෙංගාලි',
 				'bo' => 'ටිබෙට්',
 				'br' => 'බ්‍රේටොන්',
 				'brx' => 'බොඩො',
 				'bs' => 'බොස්නියානු',
 				'bug' => 'බුගිනීස්',
 				'byn' => 'බ්ලින්',
 				'ca' => 'කැටලන්',
 				'cay' => 'කයුගා',
 				'ccp' => 'චක්මා',
 				'ce' => 'චෙච්නියානු',
 				'ceb' => 'සෙබුඅනො',
 				'cgg' => 'චිගා',
 				'ch' => 'චමොරො',
 				'chk' => 'චූකීස්',
 				'chm' => 'මරි',
 				'cho' => 'චොක්ටොව්',
 				'chp' => 'චිපෙවියන්',
 				'chr' => 'චෙරොකී',
 				'chy' => 'චෙයෙන්නෙ',
 				'ckb' => 'සොරානි කුර්දිෂ්',
 				'ckb@alt=menu' => 'කුර්දිෂ්, මධ්‍යම',
 				'ckb@alt=variant' => 'කුර්දිෂ්, සොරානි',
 				'clc' => 'චිල්කොටින්',
 				'co' => 'කෝසිකානු',
 				'crg' => 'මිචිෆ්',
 				'crj' => 'දකුණු නැගෙනහිර ක්‍රී',
 				'crk' => 'ප්ලේන්ස් ක්‍රී',
 				'crl' => 'උතුරු නැගෙනහිර ක්‍රී',
 				'crm' => 'මූස් ක්‍රී',
 				'crr' => 'කැරොලිනා ඇල්ගොන්කියන්',
 				'crs' => 'සෙසෙල්ව ක්‍රොල් ෆ්‍රෙන්ච්',
 				'cs' => 'චෙක්',
 				'csw' => 'මඩ වගුරු ක්‍රී',
 				'cu' => 'චර්ච් ස්ලැවික්',
 				'cv' => 'චවේෂ්',
 				'cy' => 'වෙල්ෂ්',
 				'da' => 'ඩැනිශ්',
 				'dak' => 'ඩකොටා',
 				'dar' => 'ඩාර්ග්වා',
 				'dav' => 'ටයිටා',
 				'de' => 'ජර්මන්',
 				'de_AT' => 'ඔස්ට්‍රියානු ජර්මන්',
 				'de_CH' => 'ස්විස් උසස් ජර්මන්',
 				'dgr' => 'ඩොග්‍රිබ්',
 				'dje' => 'සර්මා',
 				'doi' => 'ඩොග්රි',
 				'dsb' => 'පහළ සෝබියානු',
 				'dua' => 'ඩුආලා',
 				'dv' => 'ඩිවෙහි',
 				'dyo' => 'ජොල-ෆෝනියි',
 				'dz' => 'ඩිසොන්කා',
 				'dzg' => 'ඩසාගා',
 				'ebu' => 'එම්බු',
 				'ee' => 'ඉව්',
 				'efi' => 'එෆික්',
 				'eka' => 'එකජුක්',
 				'el' => 'ග්‍රීක',
 				'en' => 'ඉංග්‍රීසි',
 				'en_AU' => 'ඕස්ට්‍රේලියානු ඉංග්‍රීසි',
 				'en_CA' => 'කැනේඩියානු ඉංග්‍රීසි',
 				'en_GB' => 'බ්‍රිතාන්‍ය ඉංග්‍රීසි',
 				'en_GB@alt=short' => 'එ.රා ඉංග්‍රීසි',
 				'en_US' => 'ඇමෙරිකානු ඉංග්‍රීසි',
 				'en_US@alt=short' => 'එ.ජ ඉංග්‍රීසි',
 				'eo' => 'එස්පැරන්ටෝ',
 				'es' => 'ස්පාඤ්ඤ',
 				'es_419' => 'ලතින් ඇමරිකානු ස්පාඤ්ඤ',
 				'es_ES' => 'යුරෝපීය ස්පාඤ්ඤ',
 				'es_MX' => 'මෙක්සිකානු ස්පාඤ්ඤ',
 				'et' => 'එස්තෝනියානු',
 				'eu' => 'බාස්ක්',
 				'ewo' => 'එවොන්ඩො',
 				'fa' => 'පර්සියානු',
 				'fa_AF' => 'ඩාරි',
 				'ff' => 'ෆුලාහ්',
 				'fi' => 'ෆින්ලන්ත',
 				'fil' => 'පිලිපීන',
 				'fj' => 'ෆීජි',
 				'fo' => 'ෆාරෝස්',
 				'fon' => 'ෆොන්',
 				'fr' => 'ප්‍රංශ',
 				'fr_CA' => 'කැනේඩියානු ප්‍රංශ',
 				'fr_CH' => 'ස්විස් ප්‍රංශ',
 				'frc' => 'කජුන් ප්‍රංශ',
 				'frr' => 'උතුරු ෆ්‍රිසියානු',
 				'fur' => 'ෆ්‍රියුලියන්',
 				'fy' => 'බටහිර ෆ්‍රිසියානු',
 				'ga' => 'අයර්ලන්ත',
 				'gaa' => 'ගා',
 				'gag' => 'ගගාස්',
 				'gan' => 'ගැන් චයිනිස්',
 				'gd' => 'ස්කොට්ටිශ් ගෙලික්',
 				'gez' => 'ගීස්',
 				'gil' => 'ගිල්බර්ටීස්',
 				'gl' => 'ගැලීසියානු',
 				'gn' => 'ගුවාරනි',
 				'gor' => 'ගොරොන්ටාලො',
 				'gsw' => 'ස්විස් ජර්මානු',
 				'gu' => 'ගුජරාටි',
 				'guz' => 'ගුසී',
 				'gv' => 'මැන්ක්ස්',
 				'gwi' => 'ග්විචින්',
 				'ha' => 'හෝසා',
 				'hai' => 'හයිඩා',
 				'hak' => 'හකා චයිනිස්',
 				'haw' => 'හවායි',
 				'hax' => 'දකුණු හයිඩා',
 				'he' => 'හීබෲ',
 				'hi' => 'හින්දි',
 				'hi_Latn@alt=variant' => 'හිංග්ලිෂ්',
 				'hil' => 'හිලිගෙනන්',
 				'hmn' => 'මොන්ග්',
 				'hr' => 'කෝඒෂියානු',
 				'hsb' => 'ඉහළ සෝබියානු',
 				'hsn' => 'සියැන් චීන',
 				'ht' => 'හයිටි',
 				'hu' => 'හන්ගේරියානු',
 				'hup' => 'හුපා',
 				'hur' => 'හල්කොමලෙම්',
 				'hy' => 'ආර්මේනියානු',
 				'hz' => 'හෙරෙරො',
 				'ia' => 'ඉන්ටලින්ගුආ',
 				'iba' => 'ඉබන්',
 				'ibb' => 'ඉබිබියො',
 				'id' => 'ඉන්දුනීසියානු',
 				'ig' => 'ඉග්බෝ',
 				'ii' => 'සිචුආන් යී',
 				'ikt' => 'බටහිර කැනේඩියානු ඉනුක්ටිටුට්',
 				'ilo' => 'ඉලොකො',
 				'inh' => 'ඉන්ගුෂ්',
 				'io' => 'ඉඩො',
 				'is' => 'අයිස්ලන්ත',
 				'it' => 'ඉතාලි',
 				'iu' => 'ඉනුක්ටිටුට්',
 				'ja' => 'ජපන්',
 				'jbo' => 'ලොජ්බන්',
 				'jgo' => 'නොම්බා',
 				'jmc' => 'මැකාමී',
 				'jv' => 'ජාවා',
 				'ka' => 'ජෝර්ජියානු',
 				'kab' => 'කාබිල්',
 				'kac' => 'කචින්',
 				'kaj' => 'ජ්ජු',
 				'kam' => 'කැම්බා',
 				'kbd' => 'කබාර්ඩියන්',
 				'kcg' => 'ට්යප්',
 				'kde' => 'මැකොන්ඩ්',
 				'kea' => 'කබුවෙර්ඩියානු',
 				'kfo' => 'කොරො',
 				'kgp' => 'කයිංගං',
 				'kha' => 'ඛසි',
 				'khq' => 'කොයිරා චිනි',
 				'ki' => 'කිකුයු',
 				'kj' => 'කුයන්යමා',
 				'kk' => 'කසාඛ්',
 				'kkj' => 'කකො',
 				'kl' => 'කලාලිසට්',
 				'kln' => 'කලෙන්ජන්',
 				'km' => 'කමර්',
 				'kmb' => 'කිම්බුන්ඩු',
 				'kn' => 'කණ්ණඩ',
 				'ko' => 'කොරියානු',
 				'koi' => 'කොමි-පර්මියාක්',
 				'kok' => 'කොන්කනි',
 				'kpe' => 'ක්පෙලෙ',
 				'kr' => 'කනුරි',
 				'krc' => 'කරන්චි-බාකර්',
 				'krl' => 'කැරෙලියන්',
 				'kru' => 'කුරුඛ්',
 				'ks' => 'කාෂ්මීර්',
 				'ksb' => 'ශාම්බලා',
 				'ksf' => 'බාෆියා',
 				'ksh' => 'කොලොග්නියන්',
 				'ku' => 'කුර්දි',
 				'kum' => 'කුමික්',
 				'kv' => 'කොමි',
 				'kw' => 'කෝනීසියානු',
 				'kwk' => 'ක්වාක්වාලා',
 				'ky' => 'කිර්ගිස්',
 				'la' => 'ලතින්',
 				'lad' => 'ලඩිනො',
 				'lag' => 'ලංගි',
 				'lb' => 'ලක්සැම්බර්ග්',
 				'lez' => 'ලෙස්ගියන්',
 				'lg' => 'ගන්ඩා',
 				'li' => 'ලිම්බර්ගිශ්',
 				'lil' => 'ලිලූට්',
 				'lkt' => 'ලකොට',
 				'ln' => 'ලින්ගලා',
 				'lo' => 'ලාඕ',
 				'lou' => 'ලුසියානා ක්‍රියෝල්',
 				'loz' => 'ලොසි',
 				'lrc' => 'උතුරු ලුරි',
 				'lsm' => 'සාමියා',
 				'lt' => 'ලිතුවේනියානු',
 				'lu' => 'ලුබා-කටන්ගා',
 				'lua' => 'ලුබ-ලුලුඅ',
 				'lun' => 'ලුන්ඩ',
 				'luo' => 'ලුඔ',
 				'lus' => 'මිසො',
 				'luy' => 'ලුයියා',
 				'lv' => 'ලැට්වියානු',
 				'mad' => 'මදුරීස්',
 				'mag' => 'මඝහි',
 				'mai' => 'මයිතිලි',
 				'mak' => 'මකාසාර්',
 				'mas' => 'මසායි',
 				'mdf' => 'මොක්ශා',
 				'men' => 'මෙන්ඩෙ',
 				'mer' => 'මෙරු',
 				'mfe' => 'මොරිස්යෙම්',
 				'mg' => 'මලගාසි',
 				'mgh' => 'මඛුවා-මීටෝ',
 				'mgo' => 'මෙටා',
 				'mh' => 'මාශලීස්',
 				'mi' => 'මාවොරි',
 				'mic' => 'මික්මැක්',
 				'min' => 'මිනන්ග්කබාවු',
 				'mk' => 'මැසිඩෝනියානු',
 				'ml' => 'මලයාලම්',
 				'mn' => 'මොංගෝලියානු',
 				'mni' => 'මනිපුරි',
 				'moe' => 'ඉනු-අයිමුන්',
 				'moh' => 'මොහොව්ක්',
 				'mos' => 'මොස්සි',
 				'mr' => 'මරාති',
 				'ms' => 'මැලේ',
 				'mt' => 'මොල්ටිස්',
 				'mua' => 'මුන්ඩන්',
 				'mul' => 'බහු භාෂා',
 				'mus' => 'ක්‍රීක්',
 				'mwl' => 'මිරන්ඩීස්',
 				'my' => 'බුරුම',
 				'myv' => 'එර්ස්යා',
 				'mzn' => 'මැසන්ඩරනි',
 				'na' => 'නෞරු',
 				'nan' => 'මින් නන් චයිනිස්',
 				'nap' => 'නියාපොලිටන්',
 				'naq' => 'නාමා',
 				'nb' => 'නෝර්වීජියානු බොක්මල්',
 				'nd' => 'උතුරු එන්ඩිබෙලෙ',
 				'nds' => 'පහළ ජර්මන්',
 				'nds_NL' => 'පහළ සැක්සන්',
 				'ne' => 'නේපාල',
 				'new' => 'නෙවාරි',
 				'ng' => 'න්ඩොන්ගා',
 				'nia' => 'නියාස්',
 				'niu' => 'නියුඑන්',
 				'nl' => 'ලන්දේසි',
 				'nl_BE' => 'ෆ්ලෙමිශ්',
 				'nmg' => 'කුවාසිඔ',
 				'nn' => 'නෝර්වීජියානු නයිනෝර්ස්ක්',
 				'nnh' => 'න්ගියාම්බූන්',
 				'no' => 'නෝර්වීජියානු',
 				'nog' => 'නොගායි',
 				'nqo' => 'එන්‘කෝ',
 				'nr' => 'සෞත් ඩ්බේල්',
 				'nso' => 'නොදර්න් සොතො',
 				'nus' => 'නොයර්',
 				'nv' => 'නවාජො',
 				'ny' => 'න්යන්ජා',
 				'nyn' => 'නයන්කෝලෙ',
 				'oc' => 'ඔසිටාන්',
 				'ojb' => 'වයඹ ඔජිබ්වා',
 				'ojc' => 'මධ්‍යම ඔජිබ්වා',
 				'ojs' => 'ඔජි-ක්‍රී',
 				'ojw' => 'බටහිර ඔජිබ්වා',
 				'oka' => 'ඔකනගන්',
 				'om' => 'ඔරොමෝ',
 				'or' => 'ඔඩියා',
 				'os' => 'ඔසිටෙක්',
 				'pa' => 'පන්ජාබි',
 				'pag' => 'පන්ගසීනන්',
 				'pam' => 'පන්පන්ග',
 				'pap' => 'පපියමෙන්ටො',
 				'pau' => 'පලවුවන්',
 				'pcm' => 'නෛජීරියන් පෙන්ගින්',
 				'pis' => 'පිජින්',
 				'pl' => 'පෝලන්ත',
 				'pqm' => 'මලිසීට්-පස්සමකුඩි',
 				'prg' => 'පෘශියන්',
 				'ps' => 'පෂ්ටො',
 				'pt' => 'පෘතුගීසි',
 				'pt_BR' => 'බ්‍රසීල පෘතුගීසි',
 				'pt_PT' => 'යුරෝපීය පෘතුගීසි',
 				'qu' => 'ක්වීචුවා',
 				'quc' => 'කියිචේ',
 				'raj' => 'රාජස්ථානි',
 				'rap' => 'රපනුයි',
 				'rar' => 'රරොටොන්ගන්',
 				'rhg' => 'රෝහින්ග්‍යා',
 				'rm' => 'රොමෑන්ශ්',
 				'rn' => 'රුන්ඩි',
 				'ro' => 'රොමේනියානු',
 				'ro_MD' => 'මොල්ඩවිආනු',
 				'rof' => 'රෝම්බෝ',
 				'ru' => 'රුසියානු',
 				'rup' => 'ඇරොමානියානු',
 				'rw' => 'කින්යර්වන්ඩා',
 				'rwk' => 'ර්වා',
 				'sa' => 'සංස්කෘත',
 				'sad' => 'සන්ඩවෙ',
 				'sah' => 'සඛා',
 				'saq' => 'සම්බුරු',
 				'sat' => 'සෑන්ටලි',
 				'sba' => 'න්ගම්බෙ',
 				'sbp' => 'සංගු',
 				'sc' => 'සාර්ඩිනිඅන්',
 				'scn' => 'සිසිලියන්',
 				'sco' => 'ස්කොට්ස්',
 				'sd' => 'සින්ධි',
 				'sdh' => 'දකුණු කුර්දි',
 				'se' => 'උතුරු සාමි',
 				'seh' => 'සෙනා',
 				'ses' => 'කෝයිරාබොරො සෙන්නි',
 				'sg' => 'සන්ග්‍රෝ',
 				'shi' => 'ටචේල්හිට්',
 				'shn' => 'ශාන්',
 				'si' => 'සිංහල',
 				'sk' => 'ස්ලෝවැක්',
 				'sl' => 'ස්ලෝවේනියානු',
 				'slh' => 'දකුණු ලුෂූට්සීඩ්',
 				'sm' => 'සෑමොඅන්',
 				'sma' => 'දකුණු සාමි',
 				'smj' => 'ලුලේ සාමි',
 				'smn' => 'ඉනාරි සාමි',
 				'sms' => 'ස්කොල්ට් සාමි',
 				'sn' => 'ශෝනා',
 				'snk' => 'සොනින්කෙ',
 				'so' => 'සෝමාලි',
 				'sq' => 'ඇල්බේනියානු',
 				'sr' => 'සර්බියානු',
 				'srn' => 'ස්‍රන් ටොන්ගො',
 				'ss' => 'ස්වති',
 				'ssy' => 'සහො',
 				'st' => 'සතර්න් සොතො',
 				'str' => 'සාලිෂ්ස මුද්ර සන්ධිය',
 				'su' => 'සන්ඩනීසියානු',
 				'suk' => 'සුකුමා',
 				'sv' => 'ස්වීඩන්',
 				'sw' => 'ස්වාහිලි',
 				'sw_CD' => 'කොංගෝ ස්වාහිලි',
 				'swb' => 'කොමොරියන්',
 				'syr' => 'ස්‍රයෑක්',
 				'ta' => 'දෙමළ',
 				'tce' => 'දකුණු ටචෝන්',
 				'te' => 'තෙළිඟු',
 				'tem' => 'ටිම්නෙ',
 				'teo' => 'ටෙසෝ',
 				'tet' => 'ටේටම්',
 				'tg' => 'ටජික්',
 				'tgx' => 'ටැගිෂ්',
 				'th' => 'තායි',
 				'tht' => 'ටැල්ටන්',
 				'ti' => 'ටිග්‍රින්යා',
 				'tig' => 'ටීග්‍රෙ',
 				'tk' => 'ටර්ක්මෙන්',
 				'tlh' => 'ක්ලින්ගොන්',
 				'tli' => 'ට්ලින්ගිට්',
 				'tn' => 'ස්වනා',
 				'to' => 'ටොංගා',
 				'tok' => 'ටෝකි පොනා',
 				'tpi' => 'ටොක් පිසින්',
 				'tr' => 'තුර්කි',
 				'trv' => 'ටරොකො',
 				'ts' => 'සොන්ග',
 				'tt' => 'ටාටර්',
 				'ttm' => 'උතුරු ටචෝන්',
 				'tum' => 'ටුම්බුකා',
 				'tvl' => 'ටුවාලු',
 				'twq' => 'ටසවාක්',
 				'ty' => 'ටහිටියන්',
 				'tyv' => 'ටුවිනියන්',
 				'tzm' => 'මධ්‍යම ඇට්ලස් ටමසිට්',
 				'udm' => 'අඩ්මර්ට්',
 				'ug' => 'උයිගර්',
 				'uk' => 'යුක්රේනියානු',
 				'umb' => 'උබුන්ඩු',
 				'und' => 'නොදන්නා භාෂාව',
 				'ur' => 'උර්දු',
 				'uz' => 'උස්බෙක්',
 				'vai' => 'වයි',
 				've' => 'වෙන්ඩා',
 				'vi' => 'වියට්නාම්',
 				'vo' => 'වොලපූක්',
 				'vun' => 'වුන්ජෝ',
 				'wa' => 'වෑලූන්',
 				'wae' => 'වොල්සර්',
 				'wal' => 'වොලෙට්ට',
 				'war' => 'වොරෙය්',
 				'wbp' => 'වොපිරි',
 				'wo' => 'වොලොෆ්',
 				'wuu' => 'වූ චයිනිස්',
 				'xal' => 'කල්මික්',
 				'xh' => 'ශෝසා',
 				'xog' => 'සොගා',
 				'yav' => 'යන්ග්බෙන්',
 				'ybb' => 'යෙම්බා',
 				'yi' => 'යිඩිශ්',
 				'yo' => 'යොරූබා',
 				'yrl' => 'නොහීඟටු',
 				'yue' => 'කැන්ටොනීස්',
 				'yue@alt=menu' => 'චීන, කැන්ටොනීස්',
 				'zgh' => 'සම්මත මොරොක්කෝ ටමසිග්ත්',
 				'zh' => 'චීන',
 				'zh@alt=menu' => 'චීන, මැන්ඩරීන්',
 				'zh_Hans' => 'සරල චීන',
 				'zh_Hans@alt=long' => 'සරල මැන්ඩරීන් චීන',
 				'zh_Hant' => 'සාම්ප්‍රදායික චීන',
 				'zh_Hant@alt=long' => 'සාම්ප්‍රදායික මැන්ඩරීන් චීන',
 				'zu' => 'සුලු',
 				'zun' => 'සුනි',
 				'zxx' => 'වාග් විද්‍යා අන්තර්ගතයක් නැත',
 				'zza' => 'සාසා',

			);
			if (@_) {
				return $languages{$_[0]};
			}
			return \%languages;
		}
	},
);

has 'display_name_script' => (
	is			=> 'ro',
	isa			=> CodeRef,
	init_arg	=> undef,
	default		=> sub {
		sub {
			my %scripts = (
			'Adlm' => 'ඇඩ්ලම්',
 			'Arab' => 'අරාබි',
 			'Aran' => 'නස්ටාලික්',
 			'Armn' => 'ආර්මේනියානු',
 			'Beng' => 'බෙංගාලි',
 			'Bopo' => 'බොපොමොෆෝ',
 			'Brai' => 'බ්‍රේල්',
 			'Cakm' => 'චක්මා',
 			'Cans' => 'ඒකාබද්ධ කැනේඩියානු ආදිවාසී විෂය නිර්දේශ',
 			'Cher' => 'චෙරෝකී',
 			'Cyrl' => 'සිරිලික්',
 			'Deva' => 'දේවනාගරී',
 			'Ethi' => 'ඉතියෝපියානු',
 			'Geor' => 'ජෝර්ජියානු',
 			'Grek' => 'ග්‍රීක',
 			'Gujr' => 'ගුජරාටි',
 			'Guru' => 'ගුර්මුඛි',
 			'Hanb' => 'හැන්ඩ්බ්',
 			'Hang' => 'හැන්ගුල්',
 			'Hani' => 'හන්',
 			'Hans' => 'සුළුකළ',
 			'Hans@alt=stand-alone' => 'සුළුකළ හෑන්',
 			'Hant' => 'සාම්ප්‍රදායික',
 			'Hant@alt=stand-alone' => 'සම්ප්‍රදායික හෑන්',
 			'Hebr' => 'හීබෲ',
 			'Hira' => 'හිරඟනා',
 			'Hrkt' => 'ජෑපනීස් සිලබරීස්',
 			'Jamo' => 'ජාමො',
 			'Jpan' => 'ජපන්',
 			'Kana' => 'කතකනා',
 			'Khmr' => 'කමර්',
 			'Knda' => 'කණ්ණඩ',
 			'Kore' => 'කොරියානු',
 			'Laoo' => 'ලාඕ',
 			'Latn' => 'ලතින්',
 			'Mlym' => 'මලයාලම්',
 			'Mong' => 'මොන්ගෝලියානු',
 			'Mtei' => 'මෙයිටෙයි මයක්',
 			'Mymr' => 'මියන්මාර',
 			'Nkoo' => 'එන්‘කෝ',
 			'Olck' => 'ඔල් චිකි',
 			'Orya' => 'ඔරියා',
 			'Rohg' => 'හනිෆි',
 			'Sinh' => 'සිංහල',
 			'Sund' => 'සන්ඩනීස්',
 			'Syrc' => 'සිරියැක්',
 			'Taml' => 'දෙමළ',
 			'Telu' => 'තෙළිඟු',
 			'Tfng' => 'ටිෆිනාග්',
 			'Thaa' => 'තාන',
 			'Thai' => 'තායි',
 			'Tibt' => 'ටි‍බෙට්',
 			'Vaii' => 'වායි',
 			'Yiii' => 'යී',
 			'Zmth' => 'ගණිතමය සංකේත',
 			'Zsye' => 'ඉමොජි',
 			'Zsym' => 'සංකේත',
 			'Zxxx' => 'අලිඛිත',
 			'Zyyy' => 'පොදු',
 			'Zzzz' => 'නොදත් අකුරු මාලාව',

			);
			if ( @_ ) {
				return $scripts{$_[0]};
			}
			return \%scripts;
		}
	}
);

has 'display_name_region' => (
	is			=> 'ro',
	isa			=> HashRef[Str],
	init_arg	=> undef,
	default		=> sub {
		{
			'001' => 'ලෝකය',
 			'002' => 'අප්‍රිකාව',
 			'003' => 'උතුරු ඇමෙරිකාව',
 			'005' => 'දකුණු ඇමෙරිකාව',
 			'009' => 'ඕෂනියාව',
 			'011' => 'බටහිරදිග අප්‍රිකාව',
 			'013' => 'මධ්‍යම ඇමෙරිකාව',
 			'014' => 'පෙරදිග අප්‍රිකාව',
 			'015' => 'උතුරුදිග අප්‍රිකාව',
 			'017' => 'මධ්‍යම අප්‍රිකාව',
 			'018' => 'දකුණුදිග අප්‍රිකාව',
 			'019' => 'ඇමරිකාව',
 			'021' => 'උතුරුදිග ඇමෙරිකාව',
 			'029' => 'කැරීබියන්',
 			'030' => 'නැගෙනහිර ආසියාව',
 			'034' => 'දකුණු ආසියාව',
 			'035' => 'අග්නිදිග ආසියාව',
 			'039' => 'දකුණුදිග යුරෝපය',
 			'053' => 'ඕස්ට්‍රලේෂියාව',
 			'054' => 'මෙලනීසියාව',
 			'057' => 'මයික්‍රෝනීසියානු කළාපය',
 			'061' => 'පොලිනීසියාව',
 			'142' => 'ආසියාව',
 			'143' => 'මධ්‍යම ආසියාව',
 			'145' => 'බටහිර ආසියාව',
 			'150' => 'යුරෝපය',
 			'151' => 'නැගෙනහිර යුරෝපය',
 			'154' => 'උතුරු යුරෝපය',
 			'155' => 'බටහිර යුරෝපය',
 			'202' => 'උප-සහරානු අප්‍රිකාව',
 			'419' => 'ලතින් ඇමෙරිකාව',
 			'AC' => 'ඇසෙන්ෂන් දිවයින',
 			'AD' => 'ඇන්ඩෝරාව',
 			'AE' => 'එක්සත් අරාබි එමිර් රාජ්‍යය',
 			'AF' => 'ඇෆ්ගනිස්ථානය',
 			'AG' => 'ඇන්ටිගුවා සහ බාබියුඩාව',
 			'AI' => 'ඇන්ගුයිලාව',
 			'AL' => 'ඇල්බේනියාව',
 			'AM' => 'ආර්මේනියාව',
 			'AO' => 'ඇන්ගෝලාව',
 			'AQ' => 'ඇන්ටාක්ටිකාව',
 			'AR' => 'ආර්ජෙන්ටිනාව',
 			'AS' => 'ඇමරිකානු සැමෝවා',
 			'AT' => 'ඔස්ට්‍රියාව',
 			'AU' => 'ඕස්ට්‍රේලියාව',
 			'AW' => 'අරූබා',
 			'AX' => 'ඕලන්ඩ් දූපත්',
 			'AZ' => 'අසර්බයිජානය',
 			'BA' => 'බොස්නියාව සහ හර්සගොවීනාව',
 			'BB' => 'බාබඩෝස්',
 			'BD' => 'බංග්ලාදේශය',
 			'BE' => 'බෙල්ජියම',
 			'BF' => 'බර්කිනා ෆාසෝ',
 			'BG' => 'බල්ගේරියාව',
 			'BH' => 'බහරේන්',
 			'BI' => 'බුරුන්දි',
 			'BJ' => 'බෙනින්',
 			'BL' => 'ශාන්ත බර්තලෙමි',
 			'BM' => 'බර්මියුඩා',
 			'BN' => 'බෲනායි',
 			'BO' => 'බොලීවියාව',
 			'BQ' => 'කැරිබියානු නෙදර්ලන්තය',
 			'BR' => 'බ්‍රසීලය',
 			'BS' => 'බහමාස්',
 			'BT' => 'භූතානය',
 			'BV' => 'බුවට් දුපත්',
 			'BW' => 'බොට්ස්වානා',
 			'BY' => 'බෙලරුස්',
 			'BZ' => 'බෙලීස්',
 			'CA' => 'කැනඩාව',
 			'CC' => 'කොකෝස් දූපත්',
 			'CD' => 'කොංගෝව (ඩීආර්සී)',
 			'CF' => 'මධ්‍යම අප්‍රිකානු ජනරජය',
 			'CG' => 'කොංගො - බ්‍රසාවිල්',
 			'CG@alt=variant' => 'කොංගෝ (ජනරජය)',
 			'CH' => 'ස්විස්ටර්ලන්තය',
 			'CI' => 'කෝට් දි අයිවරි',
 			'CI@alt=variant' => 'අයිවරි කෝස්ට්',
 			'CK' => 'කුක් දූපත්',
 			'CL' => 'චිලී',
 			'CM' => 'කැමරූන්',
 			'CN' => 'චීනය',
 			'CO' => 'කොළොම්බියාව',
 			'CP' => 'ක්ලීපර්ටන් දූපත',
 			'CR' => 'කොස්ටරිකාව',
 			'CU' => 'කියුබාව',
 			'CV' => 'කේප් වර්ඩ්',
 			'CW' => 'කුරකාවෝ',
 			'CX' => 'ක්‍රිස්මස් දූපත',
 			'CY' => 'සයිප්‍රසය',
 			'CZ' => 'චෙචියාව',
 			'CZ@alt=variant' => 'චෙක් ජනරජය',
 			'DE' => 'ජර්මනිය',
 			'DG' => 'දියාගෝ ගාර්සියා',
 			'DJ' => 'ජිබුටි',
 			'DK' => 'ඩෙන්මාර්කය',
 			'DM' => 'ඩොමිනිකාව',
 			'DO' => 'ඩොමිනිකා ජනරජය',
 			'DZ' => 'ඇල්ජීරියාව',
 			'EA' => 'සෙයුටා සහ මෙලිල්ලා',
 			'EC' => 'ඉක්වදෝරය',
 			'EE' => 'එස්තෝනියාව',
 			'EG' => 'ඊජිප්තුව',
 			'EH' => 'බටහිර සහරාව',
 			'ER' => 'එරිත්‍රියාව',
 			'ES' => 'ස්පාඤ්ඤය',
 			'ET' => 'ඉතියෝපියාව',
 			'EU' => 'යුරෝපා සංගමය',
 			'EZ' => 'යුරෝ කලාපය',
 			'FI' => 'ෆින්ලන්තය',
 			'FJ' => 'ෆීජී',
 			'FK' => 'ෆෝක්ලන්ත දූපත්',
 			'FK@alt=variant' => 'ෆෝක්ලන්ත දූපත් (අයිලස් මල්වියනාස්)',
 			'FM' => 'මයික්‍රොනීසියාව',
 			'FO' => 'ෆැරෝ දූපත්',
 			'FR' => 'ප්‍රංශය',
 			'GA' => 'ගැබොන්',
 			'GB' => 'එක්සත් රාජධානිය',
 			'GB@alt=short' => 'එ.රා',
 			'GD' => 'ග්‍රැනඩාව',
 			'GE' => 'ජෝර්ජියාව',
 			'GF' => 'ප්‍රංශ ගයනාව',
 			'GG' => 'ගර්න්සිය',
 			'GH' => 'ඝානාව',
 			'GI' => 'ජිබ්‍රෝල්ටාව',
 			'GL' => 'ග්‍රීන්ලන්තය',
 			'GM' => 'ගැම්බියාව',
 			'GN' => 'ගිණියාව',
 			'GP' => 'ග්වෝඩලෝප්',
 			'GQ' => 'සමක ගිනියාව',
 			'GR' => 'ග්‍රීසිය',
 			'GS' => 'දකුණු ජෝර්ජියාව සහ දකුණු සැන්ඩ්විච් දූපත්',
 			'GT' => 'ගෝතමාලාව',
 			'GU' => 'ගුවාම්',
 			'GW' => 'ගිනි බිසව්',
 			'GY' => 'ගයනාව',
 			'HK' => 'හොංකොං විශේෂ පරිපාලන කලාපය චීනය',
 			'HK@alt=short' => 'හොංකොං',
 			'HM' => 'හර්ඩ් දූපත සහ මැක්ඩොනල්ඩ් දූපත්',
 			'HN' => 'හොන්ඩුරාස්',
 			'HR' => 'ක්‍රොඒෂියාව',
 			'HT' => 'හයිටි',
 			'HU' => 'හන්ගේරියාව',
 			'IC' => 'කැනරි සූපත්',
 			'ID' => 'ඉන්දුනීසියාව',
 			'IE' => 'අයර්ලන්තය',
 			'IL' => 'ඊශ්‍රායලය',
 			'IM' => 'අයිල් ඔෆ් මෑන්',
 			'IN' => 'ඉන්දියාව',
 			'IO' => 'බ්‍රිතාන්‍ය ඉන්දීය සාගර බල ප්‍රදේශය',
 			'IO@alt=chagos' => 'චාගෝස් දූපත් සමූහය',
 			'IQ' => 'ඉරාකය',
 			'IR' => 'ඉරානය',
 			'IS' => 'අයිස්ලන්තය',
 			'IT' => 'ඉතාලිය',
 			'JE' => 'ජර්සි',
 			'JM' => 'ජැමෙයිකාව',
 			'JO' => 'ජෝර්දානය',
 			'JP' => 'ජපානය',
 			'KE' => 'කෙන්යාව',
 			'KG' => 'කිර්ගිස්තානය',
 			'KH' => 'කාම්බෝජය',
 			'KI' => 'කිරිබති',
 			'KM' => 'කොමොරෝස්',
 			'KN' => 'ශාන්ත කිට්ස් සහ නේවිස්',
 			'KP' => 'උතුරු කොරියාව',
 			'KR' => 'දකුණු කොරියාව',
 			'KW' => 'කුවේටය',
 			'KY' => 'කේමන් දූපත්',
 			'KZ' => 'කසකස්තානය',
 			'LA' => 'ලාඕසය',
 			'LB' => 'ලෙබනනය',
 			'LC' => 'ශාන්ත ලුසියා',
 			'LI' => 'ලික්ටන්ස්ටයින්',
 			'LK' => 'ශ්‍රී ලංකාව',
 			'LR' => 'ලයිබීරියාව',
 			'LS' => 'ලෙසතෝ',
 			'LT' => 'ලිතුවේනියාව',
 			'LU' => 'ලක්ශම්බර්ග්',
 			'LV' => 'ලැට්වියාව',
 			'LY' => 'ලිබියාව',
 			'MA' => 'මොරොක්කෝව',
 			'MC' => 'මොනාකෝව',
 			'MD' => 'මොල්ඩෝවාව',
 			'ME' => 'මොන්ටෙනීග්‍රෝ',
 			'MF' => 'ශාන්ත මාර්ටින්',
 			'MG' => 'මැඩගස්කරය',
 			'MH' => 'මාෂල් දූපත්',
 			'MK' => 'උතුරු මැසිඩෝනියාව',
 			'ML' => 'මාලි',
 			'MM' => 'මියන්මාරය (බුරුමය)',
 			'MN' => 'මොන්ගෝලියාව',
 			'MO' => 'මැකාවු විශේෂ පරිපාලන කලාපය චීනය',
 			'MO@alt=short' => 'මකාවු',
 			'MP' => 'උතුරු මරියානා දූපත්',
 			'MQ' => 'මර්ටිනික්',
 			'MR' => 'මොරිටේනියාව',
 			'MS' => 'මොන්සෙරාට්',
 			'MT' => 'මෝල්ටාව',
 			'MU' => 'මුරුසිය',
 			'MV' => 'මාල දිවයින',
 			'MW' => 'මලාවි',
 			'MX' => 'මෙක්සිකෝව',
 			'MY' => 'මැලේසියාව',
 			'MZ' => 'මොසැම්බික්',
 			'NA' => 'නැමීබියාව',
 			'NC' => 'නව කැලිඩෝනියාව',
 			'NE' => 'නයිජර්',
 			'NF' => 'නෝෆෝක් දූපත',
 			'NG' => 'නයිජීරියාව',
 			'NI' => 'නිකරගුවාව',
 			'NL' => 'නෙදර්ලන්තය',
 			'NO' => 'නෝර්වේ',
 			'NP' => 'නේපාලය',
 			'NR' => 'නාවුරු',
 			'NU' => 'නියූ',
 			'NZ' => 'නවසීලන්තය',
 			'NZ@alt=variant' => 'ඔටේරෝවා නවසීලන්තය',
 			'OM' => 'ඕමානය',
 			'PA' => 'පැනමාව',
 			'PE' => 'පේරු',
 			'PF' => 'ප්‍රංශ පොලිනීසියාව',
 			'PG' => 'පැපුවා නිව් ගිනියාව',
 			'PH' => 'පිලිපීනය',
 			'PK' => 'පාකිස්තානය',
 			'PL' => 'පෝලන්තය',
 			'PM' => 'ශාන්ත පියරේ සහ මැකෝලන්',
 			'PN' => 'පිට්කෙය්න් දූපත්',
 			'PR' => 'පුවර්ටෝ රිකෝ',
 			'PS' => 'පලස්තීන රාජ්‍යය',
 			'PS@alt=short' => 'පලස්තීනය',
 			'PT' => 'පෘතුගාලය',
 			'PW' => 'පලාවු',
 			'PY' => 'පැරගුවේ',
 			'QA' => 'කටාර්',
 			'QO' => 'ඈත ඕෂනියාව',
 			'RE' => 'රීයුනියන්',
 			'RO' => 'රුමේනියාව',
 			'RS' => 'සර්බියාව',
 			'RU' => 'රුසියාව',
 			'RW' => 'රුවන්ඩාව',
 			'SA' => 'සෞදි අරාබිය',
 			'SB' => 'සොලමන් දූපත්',
 			'SC' => 'සීශෙල්ස්',
 			'SD' => 'සූඩානය',
 			'SE' => 'ස්වීඩනය',
 			'SG' => 'සිංගප්පූරුව',
 			'SH' => 'ශාන්ත හෙලේනා',
 			'SI' => 'ස්ලෝවේනියාව',
 			'SJ' => 'ස්වෙල්බර්ඩ් සහ ජේන් මයේන්',
 			'SK' => 'ස්ලෝවැකියාව',
 			'SL' => 'සියරාලියෝන්',
 			'SM' => 'සැන් මැරිනෝ',
 			'SN' => 'සෙනගාලය',
 			'SO' => 'සෝමාලියාව',
 			'SR' => 'සුරිනාමය',
 			'SS' => 'දකුණු සුඩානය',
 			'ST' => 'සාඕ තෝම් සහ ප්‍රින්සිප්',
 			'SV' => 'එල් සැල්වදෝරය',
 			'SX' => 'ශාන්ත මාර්ටෙන්',
 			'SY' => 'සිරියාව',
 			'SZ' => 'එස්වාටිනි',
 			'SZ@alt=variant' => 'ස්වාසිලන්තය',
 			'TA' => 'ට්‍රිස්ටන් ද කුන්හා',
 			'TC' => 'ටර්ක්ස් සහ කයිකොස් දූපත්',
 			'TD' => 'චැච්',
 			'TF' => 'දකුණු ප්‍රංශ දූපත් සමූහය',
 			'TG' => 'ටොගෝ',
 			'TH' => 'තායිලන්තය',
 			'TJ' => 'ටජිකිස්තානය',
 			'TK' => 'ටොකලාවු',
 			'TL' => 'ටිමෝර් - ලෙස්ත්',
 			'TL@alt=variant' => 'නැගෙනහිර ටිමෝරය',
 			'TM' => 'ටර්ක්මෙනිස්ථානය',
 			'TN' => 'ටියුනීසියාව',
 			'TO' => 'ටොංගා',
 			'TR' => 'තුර්කිය',
 			'TT' => 'ට්‍රිනිඩෑඩ් සහ ටොබැගෝ',
 			'TV' => 'ටුවාලූ',
 			'TW' => 'තායිවානය',
 			'TZ' => 'ටැන්සානියාව',
 			'UA' => 'යුක්රේනය',
 			'UG' => 'උගන්ඩාව',
 			'UM' => 'එක්සත් ජනපද ඈත දූපත්',
 			'UN' => 'එක්සත් ජාතීන්',
 			'US' => 'එක්සත් ජනපදය',
 			'US@alt=short' => 'එ.ජ',
 			'UY' => 'උරුගුවේ',
 			'UZ' => 'උස්බෙකිස්ථානය',
 			'VA' => 'වතිකානු නගරය',
 			'VC' => 'ශාන්ත වින්සන්ට් සහ ග්‍රෙනඩින්ස්',
 			'VE' => 'වෙනිසියුලාව',
 			'VG' => 'බ්‍රිතාන්‍ය වර්ජින් දූපත්',
 			'VI' => 'ඇමරිකානු වර්ජින් දූපත්',
 			'VN' => 'වියට්නාමය',
 			'VU' => 'වනුවාටු',
 			'WF' => 'වැලිස් සහ ෆුටුනා',
 			'WS' => 'සැමෝවා',
 			'XA' => 'ව්‍යාජ-උච්චාරණ',
 			'XB' => 'ව්‍යාජ-බිඩි',
 			'XK' => 'කොසෝවෝ',
 			'YE' => 'යේමනය',
 			'YT' => 'මයෝට්',
 			'ZA' => 'දකුණු අප්‍රිකාව',
 			'ZM' => 'සැම්බියාව',
 			'ZW' => 'සිම්බාබ්වේ',
 			'ZZ' => 'හඳුනා නොගත් කළාපය',

		}
	},
);

has 'display_name_key' => (
	is			=> 'ro',
	isa			=> HashRef[Str],
	init_arg	=> undef,
	default		=> sub {
		{
			'calendar' => 'දින දර්ශනය',
 			'cf' => 'මුදල් ආකෘති',
 			'collation' => 'පෙළගැස්ම',
 			'currency' => 'විනිමය',
 			'hc' => 'පැය චක්‍රය',
 			'lb' => 'පේළි කඩන විලාසය',
 			'ms' => 'මිනුම් ක්‍රමය',
 			'numbers' => 'ඉලක්කම්',

		}
	},
);

has 'display_name_type' => (
	is			=> 'ro',
	isa			=> HashRef[HashRef[Str]],
	init_arg	=> undef,
	default		=> sub {
		{
			'calendar' => {
 				'buddhist' => q{බොදු දින දර්ශනය},
 				'chinese' => q{චීන දින දර්ශනය},
 				'coptic' => q{කොප්ටික් දින දර්ශනය},
 				'dangi' => q{ඩැන්ගී දින දර්ශනය},
 				'ethiopic' => q{ඉතියෝපියානු දින දර්ශනය},
 				'ethiopic-amete-alem' => q{ඉතියෝපික් ඇමේට් ඇලම් දින දර්ශනය},
 				'gregorian' => q{ග්‍රෙගරියානු දින දර්ශනය},
 				'hebrew' => q{හීබෲ දින දර්ශනය},
 				'islamic' => q{හිජ්රි දින දර්ශනය},
 				'islamic-civil' => q{හිජ්රි දින දර්ශනය (වගුව, සිවිල් වීර කාව්‍යය)},
 				'islamic-umalqura' => q{හිජ්රි දින දර්ශනය (උම් අල් කුරා)},
 				'iso8601' => q{අඑස්ඔ-8601 දින දර්ශනය},
 				'japanese' => q{ජපන් දින දර්ශනය},
 				'persian' => q{පර්සියානු දින දර්ශනය},
 				'roc' => q{මින්ගා දින දර්ශනය},
 			},
 			'cf' => {
 				'account' => q{ගිණුම්කරණ මුදල් ආකෘති},
 				'standard' => q{සම්මත මුදල් ආකෘති},
 			},
 			'collation' => {
 				'dictionary' => q{ශබ්දකෝෂ පෙළගැස්ම},
 				'ducet' => q{යුනිකේත පෙරනිමි පෙළගැස්ම},
 				'search' => q{සාමාන්‍ය සෙවීම},
 				'standard' => q{සම්මත පෙළගැස්ම},
 			},
 			'hc' => {
 				'h11' => q{පැය 12 ක්‍රමය},
 				'h12' => q{පැය 12 ක්‍රමය},
 				'h23' => q{පැය 24 ක්‍රමය},
 				'h24' => q{පැය 24 ක්‍රමය},
 			},
 			'lb' => {
 				'loose' => q{ලිහිල් කඩන විලාසය},
 				'normal' => q{සාමාන්‍ය පේළි කඩන විලාසය},
 				'strict' => q{තද පේළි කඩන විලාසය},
 			},
 			'ms' => {
 				'metric' => q{මෙට්‍රික් ක්‍රමය},
 				'uksystem' => q{රාජකීය මිනුම් ක්‍රමය},
 				'ussystem' => q{එජ මිනුම් ක්‍රමය},
 			},
 			'numbers' => {
 				'arab' => q{ඉන්දු අරාබි ඉලක්කම්},
 				'arabext' => q{වැඩි කළ ඉන්දු අරාබි ඉලක්කම්},
 				'armn' => q{ඇමරිකානු සංඛ්‍යාංකන},
 				'armnlow' => q{ඇමරිකානු කුඩා සංඛ්‍යාංකන},
 				'beng' => q{බෙංගාලි ඉලක්කම්},
 				'cakm' => q{චක්මා ඉලක්කම්},
 				'deva' => q{දේවනාගරී ඉලක්කම්},
 				'ethi' => q{ඉතියෝපියානු සංඛ්‍යාංකන},
 				'fullwide' => q{සම්පූර්ණ පළල ඉලක්කම්},
 				'geor' => q{ජෝජියානු සංඛ්‍යාංකන},
 				'grek' => q{ග්‍රීක සංඛ්‍යාංකන},
 				'greklow' => q{ග්‍රීක කුඩා සංඛ්‍යාංකන},
 				'gujr' => q{ගුජරාටි ඉලක්කම්},
 				'guru' => q{ගුර්මුකී ඉලක්කම්},
 				'hanidec' => q{චීන දශමය සංඛ්‍යාංකන},
 				'hans' => q{සුළුකළ චීන සංඛ්‍යාංකන},
 				'hansfin' => q{සුළුකළ චීන මුල්‍යමය සංඛ්‍යාංකන},
 				'hant' => q{සාම්ප්‍රදායික චීන සංඛ්‍යාංකන},
 				'hantfin' => q{සාම්ප්‍රදායික චීන මුල්‍යමය සංඛ්‍යාංකන},
 				'hebr' => q{හීබෲ සංඛ්‍යාංකන},
 				'java' => q{ජාවානු ඉලක්කම්},
 				'jpan' => q{ජපාන සංඛ්‍යාංකන},
 				'jpanfin' => q{ජපාන මුල්‍යමය සංඛ්‍යාංකන},
 				'khmr' => q{කමර් ඉලක්කම්},
 				'knda' => q{කන්නඩ ඉලක්කම්},
 				'laoo' => q{ලාඕ ඉලක්කම්},
 				'latn' => q{බටහිර ඉලක්කම්},
 				'mlym' => q{මලයාලම් ඉලක්කම්},
 				'mtei' => q{මීටේයි මයෙක් ඉලක්කම්},
 				'mymr' => q{බුරුම ඉලක්කම්},
 				'olck' => q{ඔල් චිකි ඉලක්කම්},
 				'orya' => q{ඔරියා ඉලක්කම්},
 				'roman' => q{රෝමානු සංඛ්‍යාංකන},
 				'romanlow' => q{රෝමානු කුඩා සංඛ්‍යාංකන},
 				'taml' => q{සාම්ප්‍රදායික දෙමළ සංඛ්‍යාංකන},
 				'tamldec' => q{දෙමළ ඉලක්කම්},
 				'telu' => q{තෙළිඟු ඉලක්කම්},
 				'thai' => q{තායි ඉලක්කම්},
 				'tibt' => q{ටිබෙට ඉලක්කම්},
 				'vaii' => q{වායි ඉලක්කම්},
 			},

		}
	},
);

has 'display_name_measurement_system' => (
	is			=> 'ro',
	isa			=> HashRef[Str],
	init_arg	=> undef,
	default		=> sub {
		{
			'metric' => q{මෙට්රික්},
 			'UK' => q{එංගලන්ත},
 			'US' => q{ඇමරිකානු},

		}
	},
);

has 'display_name_code_patterns' => (
	is			=> 'ro',
	isa			=> HashRef[Str],
	init_arg	=> undef,
	default		=> sub {
		{
			'language' => '{0} භාෂාව: සිංහල',
 			'script' => '{0} අකුරු මාලාව: සිංහල',
 			'region' => 'කලාපය: {0}',

		}
	},
);

has 'characters' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> $^V ge v5.18.0
	? eval <<'EOT'
	sub {
		no warnings 'experimental::regex_sets';
		return {
			auxiliary => qr{[​‌‍ ඎ ඏ ඐ ඦ ෳ]},
			index => ['අ', 'ආ', 'ඇ', 'ඈ', 'ඉ', 'ඊ', 'උ', 'ඌ', 'ඍ', 'එ', 'ඒ', 'ඓ', 'ඔ', 'ඕ', 'ඖ', 'ක', 'ඛ', 'ග', 'ඝ', 'ඞ', 'ඟ', 'ච', 'ඡ', 'ජ', 'ඣ', 'ඥ', 'ඤ', 'ට', 'ඨ', 'ඩ', 'ඪ', 'ණ', 'ඬ', 'ත', 'ථ', 'ද', 'ධ', 'න', 'ඳ', 'ප', 'ඵ', 'බ', 'භ', 'ම', 'ඹ', 'ය', 'ර', 'ල', 'ව', 'ශ', 'ෂ', 'ස', 'හ', 'ළ', 'ෆ'],
			main => qr{[අ ආ ඇ ඈ ඉ ඊ උ ඌ ඍ එ ඒ ඓ ඔ ඕ ඖ ං ඃ ක ඛ ග ඝ ඞ ඟ ච ඡ ජ ඣ ඥ ඤ ට ඨ ඩ ඪ ණ ඬ ත ථ ද ධ න ඳ ප ඵ බ භ ම ඹ ය ර ල ව ශ ෂ ස හ ළ ෆ ා ැ ෑ ි ී ු ූ ෘ ෲ ෟ ෙ ේ ෛ ො ෝ ෞ ්]},
			punctuation => qr{[\- ‐‑ – — , ; \: ! ? . … '‘’ "“” ( ) \[ \] § @ * / \& # † ‡ ′ ″]},
		};
	},
EOT
: sub {
		return { index => ['අ', 'ආ', 'ඇ', 'ඈ', 'ඉ', 'ඊ', 'උ', 'ඌ', 'ඍ', 'එ', 'ඒ', 'ඓ', 'ඔ', 'ඕ', 'ඖ', 'ක', 'ඛ', 'ග', 'ඝ', 'ඞ', 'ඟ', 'ච', 'ඡ', 'ජ', 'ඣ', 'ඥ', 'ඤ', 'ට', 'ඨ', 'ඩ', 'ඪ', 'ණ', 'ඬ', 'ත', 'ථ', 'ද', 'ධ', 'න', 'ඳ', 'ප', 'ඵ', 'බ', 'භ', 'ම', 'ඹ', 'ය', 'ර', 'ල', 'ව', 'ශ', 'ෂ', 'ස', 'හ', 'ළ', 'ෆ'], };
},
);


has 'duration_units' => (
	is			=> 'ro',
	isa			=> HashRef[Str],
	init_arg	=> undef,
	default		=> sub { {
				hm => 'h.mm',
				hms => 'h.mm.ss',
				ms => 'm.ss',
			} }
);

has 'units' => (
	is			=> 'ro',
	isa			=> HashRef[HashRef[HashRef[Str]]],
	init_arg	=> undef,
	default		=> sub { {
				'long' => {
					# Long Unit Identifier
					'' => {
						'name' => q(කාර්ඩිනල් දිශාව),
					},
					# Core Unit Identifier
					'' => {
						'name' => q(කාර්ඩිනල් දිශාව),
					},
					# Long Unit Identifier
					'1024p1' => {
						'1' => q(කිබි{0}),
					},
					# Core Unit Identifier
					'1024p1' => {
						'1' => q(කිබි{0}),
					},
					# Long Unit Identifier
					'1024p3' => {
						'1' => q(ගිබි{0}),
					},
					# Core Unit Identifier
					'1024p3' => {
						'1' => q(ගිබි{0}),
					},
					# Long Unit Identifier
					'1024p4' => {
						'1' => q(ටෙබි{0}),
					},
					# Core Unit Identifier
					'1024p4' => {
						'1' => q(ටෙබි{0}),
					},
					# Long Unit Identifier
					'1024p6' => {
						'1' => q(එක්ස්බි{0}),
					},
					# Core Unit Identifier
					'1024p6' => {
						'1' => q(එක්ස්බි{0}),
					},
					# Long Unit Identifier
					'1024p7' => {
						'1' => q(සෙබි{0}),
					},
					# Core Unit Identifier
					'1024p7' => {
						'1' => q(සෙබි{0}),
					},
					# Long Unit Identifier
					'1024p8' => {
						'1' => q(යොබේ{0}),
					},
					# Core Unit Identifier
					'1024p8' => {
						'1' => q(යොබේ{0}),
					},
					# Long Unit Identifier
					'10p-1' => {
						'1' => q(ඩෙසි{0}),
					},
					# Core Unit Identifier
					'1' => {
						'1' => q(ඩෙසි{0}),
					},
					# Long Unit Identifier
					'10p-12' => {
						'1' => q(පිකෝ{0}),
					},
					# Core Unit Identifier
					'12' => {
						'1' => q(පිකෝ{0}),
					},
					# Long Unit Identifier
					'10p-15' => {
						'1' => q(ෆෙම්ටෝ{0}),
					},
					# Core Unit Identifier
					'15' => {
						'1' => q(ෆෙම්ටෝ{0}),
					},
					# Long Unit Identifier
					'10p-18' => {
						'1' => q(ඇටෝ{0}),
					},
					# Core Unit Identifier
					'18' => {
						'1' => q(ඇටෝ{0}),
					},
					# Long Unit Identifier
					'10p-2' => {
						'1' => q(සෙන්ටි{0}),
					},
					# Core Unit Identifier
					'2' => {
						'1' => q(සෙන්ටි{0}),
					},
					# Long Unit Identifier
					'10p-21' => {
						'1' => q(සෙප්ටෝ{0}),
					},
					# Core Unit Identifier
					'21' => {
						'1' => q(සෙප්ටෝ{0}),
					},
					# Long Unit Identifier
					'10p-24' => {
						'1' => q(යොක්ටෝ{0}),
					},
					# Core Unit Identifier
					'24' => {
						'1' => q(යොක්ටෝ{0}),
					},
					# Long Unit Identifier
					'10p-27' => {
						'1' => q(රොන්ටෝ{0}),
					},
					# Core Unit Identifier
					'27' => {
						'1' => q(රොන්ටෝ{0}),
					},
					# Long Unit Identifier
					'10p-3' => {
						'1' => q(මිලි{0}),
					},
					# Core Unit Identifier
					'3' => {
						'1' => q(මිලි{0}),
					},
					# Long Unit Identifier
					'10p-30' => {
						'1' => q(ක්වෙක්ටෝ{0}),
					},
					# Core Unit Identifier
					'30' => {
						'1' => q(ක්වෙක්ටෝ{0}),
					},
					# Long Unit Identifier
					'10p-6' => {
						'1' => q(මයික්‍රො{0}),
					},
					# Core Unit Identifier
					'6' => {
						'1' => q(මයික්‍රො{0}),
					},
					# Long Unit Identifier
					'10p-9' => {
						'1' => q(නැනෝ{0}),
					},
					# Core Unit Identifier
					'9' => {
						'1' => q(නැනෝ{0}),
					},
					# Long Unit Identifier
					'10p1' => {
						'1' => q(ඩෙකා{0}),
					},
					# Core Unit Identifier
					'10p1' => {
						'1' => q(ඩෙකා{0}),
					},
					# Long Unit Identifier
					'10p12' => {
						'1' => q(ටෙරා{0}),
					},
					# Core Unit Identifier
					'10p12' => {
						'1' => q(ටෙරා{0}),
					},
					# Long Unit Identifier
					'10p15' => {
						'1' => q(පෙටා{0}),
					},
					# Core Unit Identifier
					'10p15' => {
						'1' => q(පෙටා{0}),
					},
					# Long Unit Identifier
					'10p18' => {
						'1' => q(එක්සා{0}),
					},
					# Core Unit Identifier
					'10p18' => {
						'1' => q(එක්සා{0}),
					},
					# Long Unit Identifier
					'10p2' => {
						'1' => q(හෙක්ටෝ{0}),
					},
					# Core Unit Identifier
					'10p2' => {
						'1' => q(හෙක්ටෝ{0}),
					},
					# Long Unit Identifier
					'10p21' => {
						'1' => q(සෙටා{0}),
					},
					# Core Unit Identifier
					'10p21' => {
						'1' => q(සෙටා{0}),
					},
					# Long Unit Identifier
					'10p24' => {
						'1' => q(යොටා{0}),
					},
					# Core Unit Identifier
					'10p24' => {
						'1' => q(යොටා{0}),
					},
					# Long Unit Identifier
					'10p27' => {
						'1' => q(රොන්නා{0}),
					},
					# Core Unit Identifier
					'10p27' => {
						'1' => q(රොන්නා{0}),
					},
					# Long Unit Identifier
					'10p3' => {
						'1' => q(කිලෝ{0}),
					},
					# Core Unit Identifier
					'10p3' => {
						'1' => q(කිලෝ{0}),
					},
					# Long Unit Identifier
					'10p30' => {
						'1' => q(ක්වෙට්ටා{0}),
					},
					# Core Unit Identifier
					'10p30' => {
						'1' => q(ක්වෙට්ටා{0}),
					},
					# Long Unit Identifier
					'10p6' => {
						'1' => q(මෙගා{0}),
					},
					# Core Unit Identifier
					'10p6' => {
						'1' => q(මෙගා{0}),
					},
					# Long Unit Identifier
					'acceleration-g-force' => {
						'one' => q(g-බලය {0}),
						'other' => q(g-බලය {0}),
					},
					# Core Unit Identifier
					'g-force' => {
						'one' => q(g-බලය {0}),
						'other' => q(g-බලය {0}),
					},
					# Long Unit Identifier
					'acceleration-meter-per-square-second' => {
						'name' => q(තත්පර වර්ගයට මීටර),
						'one' => q(තත්පර වර්ගයට මීටර {0}),
						'other' => q(තත්පර වර්ගයට මීටර {0}),
					},
					# Core Unit Identifier
					'meter-per-square-second' => {
						'name' => q(තත්පර වර්ගයට මීටර),
						'one' => q(තත්පර වර්ගයට මීටර {0}),
						'other' => q(තත්පර වර්ගයට මීටර {0}),
					},
					# Long Unit Identifier
					'angle-radian' => {
						'one' => q(රේඩියන් {0}),
						'other' => q(රේඩියන් {0}),
					},
					# Core Unit Identifier
					'radian' => {
						'one' => q(රේඩියන් {0}),
						'other' => q(රේඩියන් {0}),
					},
					# Long Unit Identifier
					'angle-revolution' => {
						'name' => q(පරිභ්‍රමණය),
						'one' => q(පරිභ්‍රමණ {0}),
						'other' => q(පරිභ්‍රමණය {0}),
					},
					# Core Unit Identifier
					'revolution' => {
						'name' => q(පරිභ්‍රමණය),
						'one' => q(පරිභ්‍රමණ {0}),
						'other' => q(පරිභ්‍රමණය {0}),
					},
					# Long Unit Identifier
					'area-hectare' => {
						'one' => q(හෙක්ටයාර් {0}),
						'other' => q(හෙක්ටයාර් {0}),
					},
					# Core Unit Identifier
					'hectare' => {
						'one' => q(හෙක්ටයාර් {0}),
						'other' => q(හෙක්ටයාර් {0}),
					},
					# Long Unit Identifier
					'area-square-centimeter' => {
						'name' => q(වර්ග සෙන්ටිමීටර),
						'one' => q(වර්ග සෙන්ටිමීටර {0}),
						'other' => q(වර්ග සෙන්ටිමීටර {0}),
						'per' => q(වර්ග සෙන්ටිමීටරයට {0}),
					},
					# Core Unit Identifier
					'square-centimeter' => {
						'name' => q(වර්ග සෙන්ටිමීටර),
						'one' => q(වර්ග සෙන්ටිමීටර {0}),
						'other' => q(වර්ග සෙන්ටිමීටර {0}),
						'per' => q(වර්ග සෙන්ටිමීටරයට {0}),
					},
					# Long Unit Identifier
					'area-square-inch' => {
						'one' => q(වර්ග අඟල් {0}),
						'other' => q(වර්ග අඟල් {0}),
						'per' => q(වර්ග අඟලට {0}),
					},
					# Core Unit Identifier
					'square-inch' => {
						'one' => q(වර්ග අඟල් {0}),
						'other' => q(වර්ග අඟල් {0}),
						'per' => q(වර්ග අඟලට {0}),
					},
					# Long Unit Identifier
					'area-square-kilometer' => {
						'name' => q(වර්ග කිලෝමීටර්),
						'one' => q(වර්ග කිලෝමීටර් {0}),
						'other' => q(වර්ග කිලෝමීටර් {0}),
					},
					# Core Unit Identifier
					'square-kilometer' => {
						'name' => q(වර්ග කිලෝමීටර්),
						'one' => q(වර්ග කිලෝමීටර් {0}),
						'other' => q(වර්ග කිලෝමීටර් {0}),
					},
					# Long Unit Identifier
					'area-square-meter' => {
						'one' => q(වර්ග මීටර් {0}),
						'other' => q(වර්ග මීටර් {0}),
						'per' => q(වර්ග මීටරයට {0}),
					},
					# Core Unit Identifier
					'square-meter' => {
						'one' => q(වර්ග මීටර් {0}),
						'other' => q(වර්ග මීටර් {0}),
						'per' => q(වර්ග මීටරයට {0}),
					},
					# Long Unit Identifier
					'area-square-mile' => {
						'one' => q(වර්ග සැතපුම් {0}),
						'other' => q(වර්ග සැතපුම් {0}),
						'per' => q({0} කට වර්ග සැතපුම්),
					},
					# Core Unit Identifier
					'square-mile' => {
						'one' => q(වර්ග සැතපුම් {0}),
						'other' => q(වර්ග සැතපුම් {0}),
						'per' => q({0} කට වර්ග සැතපුම්),
					},
					# Long Unit Identifier
					'area-square-yard' => {
						'one' => q(වර්ග යාර {0}),
						'other' => q(වර්ග යාර {0}),
					},
					# Core Unit Identifier
					'square-yard' => {
						'one' => q(වර්ග යාර {0}),
						'other' => q(වර්ග යාර {0}),
					},
					# Long Unit Identifier
					'concentr-item' => {
						'name' => q(අයිතම),
					},
					# Core Unit Identifier
					'item' => {
						'name' => q(අයිතම),
					},
					# Long Unit Identifier
					'concentr-milligram-ofglucose-per-deciliter' => {
						'name' => q(ඩෙසිලීටරයකට මිලිග්‍රෑම්),
						'one' => q(ඩෙසිලීටරයකට මිලිග්‍රෑම් {0}),
						'other' => q(ඩෙසිලීටරයකට මිලිග්‍රෑම් {0}),
					},
					# Core Unit Identifier
					'milligram-ofglucose-per-deciliter' => {
						'name' => q(ඩෙසිලීටරයකට මිලිග්‍රෑම්),
						'one' => q(ඩෙසිලීටරයකට මිලිග්‍රෑම් {0}),
						'other' => q(ඩෙසිලීටරයකට මිලිග්‍රෑම් {0}),
					},
					# Long Unit Identifier
					'concentr-millimole-per-liter' => {
						'name' => q(ලීටරයකට මිලිමෝල්),
						'one' => q(ලීටරයකට මිලිමෝල් {0}),
						'other' => q(ලීටරයකට මිලිමෝල් {0}),
					},
					# Core Unit Identifier
					'millimole-per-liter' => {
						'name' => q(ලීටරයකට මිලිමෝල්),
						'one' => q(ලීටරයකට මිලිමෝල් {0}),
						'other' => q(ලීටරයකට මිලිමෝල් {0}),
					},
					# Long Unit Identifier
					'concentr-percent' => {
						'one' => q(ප්‍රතිශතය {0}),
						'other' => q(ප්‍රතිශතය {0}),
					},
					# Core Unit Identifier
					'percent' => {
						'one' => q(ප්‍රතිශතය {0}),
						'other' => q(ප්‍රතිශතය {0}),
					},
					# Long Unit Identifier
					'concentr-permille' => {
						'name' => q(ප්‍රතිසහශ්‍රක),
						'one' => q(ප්‍රතිසහශ්‍රක {0}),
						'other' => q(ප්‍රතිසහශ්‍රක {0}),
					},
					# Core Unit Identifier
					'permille' => {
						'name' => q(ප්‍රතිසහශ්‍රක),
						'one' => q(ප්‍රතිසහශ්‍රක {0}),
						'other' => q(ප්‍රතිසහශ්‍රක {0}),
					},
					# Long Unit Identifier
					'concentr-permillion' => {
						'name' => q(මිලියනයට කොටස්),
						'one' => q(මිලියනයට කොටස් {0}),
						'other' => q(මිලියනයට කොටස් {0}),
					},
					# Core Unit Identifier
					'permillion' => {
						'name' => q(මිලියනයට කොටස්),
						'one' => q(මිලියනයට කොටස් {0}),
						'other' => q(මිලියනයට කොටස් {0}),
					},
					# Long Unit Identifier
					'concentr-permyriad' => {
						'one' => q({0} පර්මැරියඩ්),
						'other' => q({0} පර්මැරියඩ්),
					},
					# Core Unit Identifier
					'permyriad' => {
						'one' => q({0} පර්මැරියඩ්),
						'other' => q({0} පර්මැරියඩ්),
					},
					# Long Unit Identifier
					'consumption-liter-per-100-kilometer' => {
						'name' => q(කිලෝමීටර 100ට ලීටර),
						'one' => q(කිලෝමීටර 100ට ලීටර {0}),
						'other' => q(කිලෝමීටර 100ට ලීටර {0}),
					},
					# Core Unit Identifier
					'liter-per-100-kilometer' => {
						'name' => q(කිලෝමීටර 100ට ලීටර),
						'one' => q(කිලෝමීටර 100ට ලීටර {0}),
						'other' => q(කිලෝමීටර 100ට ලීටර {0}),
					},
					# Long Unit Identifier
					'consumption-liter-per-kilometer' => {
						'name' => q(කිලෝ මීටරයට ලීටරය),
						'one' => q(කිලෝ මීටරයට ලීටරය {0}),
						'other' => q(කිලෝ මීටරයට ලීටරය {0}),
					},
					# Core Unit Identifier
					'liter-per-kilometer' => {
						'name' => q(කිලෝ මීටරයට ලීටරය),
						'one' => q(කිලෝ මීටරයට ලීටරය {0}),
						'other' => q(කිලෝ මීටරයට ලීටරය {0}),
					},
					# Long Unit Identifier
					'consumption-mile-per-gallon' => {
						'name' => q(ගැලුමට හැතැප්ම),
						'one' => q(ගැලුමට හැතැප්ම {0}),
						'other' => q(ගැලුමට හැතැප්ම {0}),
					},
					# Core Unit Identifier
					'mile-per-gallon' => {
						'name' => q(ගැලුමට හැතැප්ම),
						'one' => q(ගැලුමට හැතැප්ම {0}),
						'other' => q(ගැලුමට හැතැප්ම {0}),
					},
					# Long Unit Identifier
					'consumption-mile-per-gallon-imperial' => {
						'name' => q(ඉම්පීරියල් ගැලුමට හැතැප්ම),
						'one' => q({0} ඉම්පීරියල් ගැලුමට හැතැප්ම),
						'other' => q({0} ඉම්පීරියල් ගැලුමට හැතැප්ම),
					},
					# Core Unit Identifier
					'mile-per-gallon-imperial' => {
						'name' => q(ඉම්පීරියල් ගැලුමට හැතැප්ම),
						'one' => q({0} ඉම්පීරියල් ගැලුමට හැතැප්ම),
						'other' => q({0} ඉම්පීරියල් ගැලුමට හැතැප්ම),
					},
					# Long Unit Identifier
					'digital-gigabit' => {
						'name' => q(ගිගාබීට්),
						'one' => q(ගිගාබීට් {0}),
						'other' => q(ගිගාබීට් {0}),
					},
					# Core Unit Identifier
					'gigabit' => {
						'name' => q(ගිගාබීට්),
						'one' => q(ගිගාබීට් {0}),
						'other' => q(ගිගාබීට් {0}),
					},
					# Long Unit Identifier
					'digital-gigabyte' => {
						'name' => q(ගිගාබයිට්‌),
						'one' => q(ගිගාබයිට්‌ {0}),
						'other' => q(ගිගාබයිට්‌ {0}),
					},
					# Core Unit Identifier
					'gigabyte' => {
						'name' => q(ගිගාබයිට්‌),
						'one' => q(ගිගාබයිට්‌ {0}),
						'other' => q(ගිගාබයිට්‌ {0}),
					},
					# Long Unit Identifier
					'digital-kilobit' => {
						'name' => q(කිලෝබිට්),
						'one' => q(කිලෝබිට් {0}),
						'other' => q(කිලෝබිට් {0}),
					},
					# Core Unit Identifier
					'kilobit' => {
						'name' => q(කිලෝබිට්),
						'one' => q(කිලෝබිට් {0}),
						'other' => q(කිලෝබිට් {0}),
					},
					# Long Unit Identifier
					'digital-kilobyte' => {
						'name' => q(කිලෝබයිට්),
						'one' => q(කිලෝබයිට් {0}),
						'other' => q(කිලෝබයිට් {0}),
					},
					# Core Unit Identifier
					'kilobyte' => {
						'name' => q(කිලෝබයිට්),
						'one' => q(කිලෝබයිට් {0}),
						'other' => q(කිලෝබයිට් {0}),
					},
					# Long Unit Identifier
					'digital-megabit' => {
						'name' => q(මෙගාබීට්),
						'one' => q(මෙගාබීට් {0}),
						'other' => q(මෙගාබීට් {0}),
					},
					# Core Unit Identifier
					'megabit' => {
						'name' => q(මෙගාබීට්),
						'one' => q(මෙගාබීට් {0}),
						'other' => q(මෙගාබීට් {0}),
					},
					# Long Unit Identifier
					'digital-megabyte' => {
						'name' => q(මෙගාබයිට්),
						'one' => q(මෙගාබයිට් {0}),
						'other' => q(මෙගාබයිට් {0}),
					},
					# Core Unit Identifier
					'megabyte' => {
						'name' => q(මෙගාබයිට්),
						'one' => q(මෙගාබයිට් {0}),
						'other' => q(මෙගාබයිට් {0}),
					},
					# Long Unit Identifier
					'digital-petabyte' => {
						'name' => q(පෙටාබයිට්),
						'one' => q(පෙටාබයිට් {0}),
						'other' => q(පෙටාබයිට් {0}),
					},
					# Core Unit Identifier
					'petabyte' => {
						'name' => q(පෙටාබයිට්),
						'one' => q(පෙටාබයිට් {0}),
						'other' => q(පෙටාබයිට් {0}),
					},
					# Long Unit Identifier
					'digital-terabit' => {
						'name' => q(ටෙරාබිට්),
						'one' => q(ටෙරාබිට් {0}),
						'other' => q(ටෙරාබිට් {0}),
					},
					# Core Unit Identifier
					'terabit' => {
						'name' => q(ටෙරාබිට්),
						'one' => q(ටෙරාබිට් {0}),
						'other' => q(ටෙරාබිට් {0}),
					},
					# Long Unit Identifier
					'digital-terabyte' => {
						'name' => q(ටෙරාබයිට්),
						'one' => q(ටෙරාබයිට් {0}),
						'other' => q(ටෙරාබයිට් {0}),
					},
					# Core Unit Identifier
					'terabyte' => {
						'name' => q(ටෙරාබයිට්),
						'one' => q(ටෙරාබයිට් {0}),
						'other' => q(ටෙරාබයිට් {0}),
					},
					# Long Unit Identifier
					'duration-century' => {
						'name' => q(සියවස),
						'one' => q(සියවස් {0}),
						'other' => q(සියවස් {0}),
					},
					# Core Unit Identifier
					'century' => {
						'name' => q(සියවස),
						'one' => q(සියවස් {0}),
						'other' => q(සියවස් {0}),
					},
					# Long Unit Identifier
					'duration-day' => {
						'per' => q(දිනයට {0}),
					},
					# Core Unit Identifier
					'day' => {
						'per' => q(දිනයට {0}),
					},
					# Long Unit Identifier
					'duration-microsecond' => {
						'name' => q(මයික්‍රොතත්පර),
						'one' => q(මයික්‍රොතත්පර {0}),
						'other' => q(මයික්‍රොතත්පර {0}),
					},
					# Core Unit Identifier
					'microsecond' => {
						'name' => q(මයික්‍රොතත්පර),
						'one' => q(මයික්‍රොතත්පර {0}),
						'other' => q(මයික්‍රොතත්පර {0}),
					},
					# Long Unit Identifier
					'duration-millisecond' => {
						'one' => q(මිලිතත්පර {0}),
						'other' => q(මිලිතත්පර {0}),
					},
					# Core Unit Identifier
					'millisecond' => {
						'one' => q(මිලිතත්පර {0}),
						'other' => q(මිලිතත්පර {0}),
					},
					# Long Unit Identifier
					'duration-minute' => {
						'name' => q(මිනිත්තු),
						'one' => q(මිනිත්තු {0}),
						'other' => q(මිනිත්තු {0}),
						'per' => q(මිනිත්තුවට {0}),
					},
					# Core Unit Identifier
					'minute' => {
						'name' => q(මිනිත්තු),
						'one' => q(මිනිත්තු {0}),
						'other' => q(මිනිත්තු {0}),
						'per' => q(මිනිත්තුවට {0}),
					},
					# Long Unit Identifier
					'duration-month' => {
						'per' => q(මාසයට {0}),
					},
					# Core Unit Identifier
					'month' => {
						'per' => q(මාසයට {0}),
					},
					# Long Unit Identifier
					'duration-nanosecond' => {
						'name' => q(නැනෝතත්පර),
						'one' => q(නැනෝතත්පර {0}),
						'other' => q(නැනෝතත්පර {0}),
					},
					# Core Unit Identifier
					'nanosecond' => {
						'name' => q(නැනෝතත්පර),
						'one' => q(නැනෝතත්පර {0}),
						'other' => q(නැනෝතත්පර {0}),
					},
					# Long Unit Identifier
					'duration-quarter' => {
						'one' => q(කාල {0}),
						'other' => q(කාල {0}),
					},
					# Core Unit Identifier
					'quarter' => {
						'one' => q(කාල {0}),
						'other' => q(කාල {0}),
					},
					# Long Unit Identifier
					'duration-second' => {
						'one' => q(තත්පර {0}),
						'other' => q(තත්පර {0}),
					},
					# Core Unit Identifier
					'second' => {
						'one' => q(තත්පර {0}),
						'other' => q(තත්පර {0}),
					},
					# Long Unit Identifier
					'duration-week' => {
						'per' => q(සතියට {0}),
					},
					# Core Unit Identifier
					'week' => {
						'per' => q(සතියට {0}),
					},
					# Long Unit Identifier
					'duration-year' => {
						'per' => q(වසරට {0}),
					},
					# Core Unit Identifier
					'year' => {
						'per' => q(වසරට {0}),
					},
					# Long Unit Identifier
					'electric-ampere' => {
						'name' => q(ඇම්පියර),
						'one' => q(ඇම්පියර {0}),
						'other' => q(ඇම්පියර {0}),
					},
					# Core Unit Identifier
					'ampere' => {
						'name' => q(ඇම්පියර),
						'one' => q(ඇම්පියර {0}),
						'other' => q(ඇම්පියර {0}),
					},
					# Long Unit Identifier
					'electric-milliampere' => {
						'name' => q(මිලි ඇම්පියර),
						'one' => q(මිලි ඇම්පියර {0}),
						'other' => q(මිලි ඇම්පියරය {0}),
					},
					# Core Unit Identifier
					'milliampere' => {
						'name' => q(මිලි ඇම්පියර),
						'one' => q(මිලි ඇම්පියර {0}),
						'other' => q(මිලි ඇම්පියරය {0}),
					},
					# Long Unit Identifier
					'electric-ohm' => {
						'one' => q(ඕම් {0}),
						'other' => q(ඕම් {0}),
					},
					# Core Unit Identifier
					'ohm' => {
						'one' => q(ඕම් {0}),
						'other' => q(ඕම් {0}),
					},
					# Long Unit Identifier
					'electric-volt' => {
						'one' => q(වෝල්ට් {0}),
						'other' => q(වෝල්ට් {0}),
					},
					# Core Unit Identifier
					'volt' => {
						'one' => q(වෝල්ට් {0}),
						'other' => q(වෝල්ට් {0}),
					},
					# Long Unit Identifier
					'energy-british-thermal-unit' => {
						'name' => q(බ්‍රිතාන්‍ය තාප ඒකක),
						'one' => q({0} බ්‍රිතාන්‍ය තාප ඒකක),
						'other' => q({0} බ්‍රිතාන්‍ය තාප ඒකක),
					},
					# Core Unit Identifier
					'british-thermal-unit' => {
						'name' => q(බ්‍රිතාන්‍ය තාප ඒකක),
						'one' => q({0} බ්‍රිතාන්‍ය තාප ඒකක),
						'other' => q({0} බ්‍රිතාන්‍ය තාප ඒකක),
					},
					# Long Unit Identifier
					'energy-calorie' => {
						'name' => q(කැලරි),
						'one' => q(කැලරි {0}),
						'other' => q(කැලරි {0}),
					},
					# Core Unit Identifier
					'calorie' => {
						'name' => q(කැලරි),
						'one' => q(කැලරි {0}),
						'other' => q(කැලරි {0}),
					},
					# Long Unit Identifier
					'energy-electronvolt' => {
						'one' => q({0} ඉලේට්‍රෝන වෝල්ට්),
						'other' => q({0} ඉලේට්‍රෝන වෝල්ට්),
					},
					# Core Unit Identifier
					'electronvolt' => {
						'one' => q({0} ඉලේට්‍රෝන වෝල්ට්),
						'other' => q({0} ඉලේට්‍රෝන වෝල්ට්),
					},
					# Long Unit Identifier
					'energy-foodcalorie' => {
						'name' => q(කැලරි),
						'one' => q(කැලරි {0}),
						'other' => q(කැලරි {0}),
					},
					# Core Unit Identifier
					'foodcalorie' => {
						'name' => q(කැලරි),
						'one' => q(කැලරි {0}),
						'other' => q(කැලරි {0}),
					},
					# Long Unit Identifier
					'energy-joule' => {
						'one' => q(ජුල් {0}),
						'other' => q(ජුල් {0}),
					},
					# Core Unit Identifier
					'joule' => {
						'one' => q(ජුල් {0}),
						'other' => q(ජුල් {0}),
					},
					# Long Unit Identifier
					'energy-kilocalorie' => {
						'name' => q(කිලෝ කැලරි),
						'one' => q(කිලෝ කැලරි {0}),
						'other' => q(කිලෝ කැලරි {0}),
					},
					# Core Unit Identifier
					'kilocalorie' => {
						'name' => q(කිලෝ කැලරි),
						'one' => q(කිලෝ කැලරි {0}),
						'other' => q(කිලෝ කැලරි {0}),
					},
					# Long Unit Identifier
					'energy-kilojoule' => {
						'one' => q(කිලෝ ජුල් {0}),
						'other' => q(කිලෝ ජුල් {0}),
					},
					# Core Unit Identifier
					'kilojoule' => {
						'one' => q(කිලෝ ජුල් {0}),
						'other' => q(කිලෝ ජුල් {0}),
					},
					# Long Unit Identifier
					'energy-kilowatt-hour' => {
						'name' => q(කිලෝවොට්-පැය),
						'one' => q(කිලෝවොට්-පැය {0}),
						'other' => q(කිලෝවොට්-පැය {0}),
					},
					# Core Unit Identifier
					'kilowatt-hour' => {
						'name' => q(කිලෝවොට්-පැය),
						'one' => q(කිලෝවොට්-පැය {0}),
						'other' => q(කිලෝවොට්-පැය {0}),
					},
					# Long Unit Identifier
					'energy-therm-us' => {
						'name' => q(එක්සත් ජනපද තාප ඒකක),
						'one' => q(එක්සත් ජනපද තාප ඒකක {0}),
						'other' => q(එක්සත් ජනපද තාප ඒකක {0}),
					},
					# Core Unit Identifier
					'therm-us' => {
						'name' => q(එක්සත් ජනපද තාප ඒකක),
						'one' => q(එක්සත් ජනපද තාප ඒකක {0}),
						'other' => q(එක්සත් ජනපද තාප ඒකක {0}),
					},
					# Long Unit Identifier
					'force-kilowatt-hour-per-100-kilometer' => {
						'name' => q(කිලෝමීටර 100 කට කිලෝවොට් පැය),
						'one' => q(කිලෝමීටර 100 කට කිලෝවොට් පැය {0}),
						'other' => q(කිලෝමීටර 100 කට කිලෝවොට් පැය {0}),
					},
					# Core Unit Identifier
					'kilowatt-hour-per-100-kilometer' => {
						'name' => q(කිලෝමීටර 100 කට කිලෝවොට් පැය),
						'one' => q(කිලෝමීටර 100 කට කිලෝවොට් පැය {0}),
						'other' => q(කිලෝමීටර 100 කට කිලෝවොට් පැය {0}),
					},
					# Long Unit Identifier
					'force-newton' => {
						'one' => q({0} නිව්ටන්),
						'other' => q({0} නිව්ටන්),
					},
					# Core Unit Identifier
					'newton' => {
						'one' => q({0} නිව්ටන්),
						'other' => q({0} නිව්ටන්),
					},
					# Long Unit Identifier
					'force-pound-force' => {
						'name' => q(බලයට රාත්තල්),
						'one' => q({0} බලයට රාත්තල්),
						'other' => q({0} බලයට රාත්තල්),
					},
					# Core Unit Identifier
					'pound-force' => {
						'name' => q(බලයට රාත්තල්),
						'one' => q({0} බලයට රාත්තල්),
						'other' => q({0} බලයට රාත්තල්),
					},
					# Long Unit Identifier
					'frequency-gigahertz' => {
						'name' => q(ගිගාහට්ස්),
						'one' => q(ගිගාහට්ස් {0}),
						'other' => q(ගිගාහට්ස් {0}),
					},
					# Core Unit Identifier
					'gigahertz' => {
						'name' => q(ගිගාහට්ස්),
						'one' => q(ගිගාහට්ස් {0}),
						'other' => q(ගිගාහට්ස් {0}),
					},
					# Long Unit Identifier
					'frequency-hertz' => {
						'name' => q(හට්ස්),
						'one' => q(හට්ස් {0}),
						'other' => q(හට්ස් {0}),
					},
					# Core Unit Identifier
					'hertz' => {
						'name' => q(හට්ස්),
						'one' => q(හට්ස් {0}),
						'other' => q(හට්ස් {0}),
					},
					# Long Unit Identifier
					'frequency-kilohertz' => {
						'name' => q(කිලෝහට්ස්),
						'one' => q(කිලෝහට්ස් {0}),
						'other' => q(කිලෝහට්ස් {0}),
					},
					# Core Unit Identifier
					'kilohertz' => {
						'name' => q(කිලෝහට්ස්),
						'one' => q(කිලෝහට්ස් {0}),
						'other' => q(කිලෝහට්ස් {0}),
					},
					# Long Unit Identifier
					'frequency-megahertz' => {
						'name' => q(මෙගාහර්ට්ස්),
						'one' => q(මෙගාහර්ට්ස් {0}),
						'other' => q(මෙගාහර්ට්ස් {0}),
					},
					# Core Unit Identifier
					'megahertz' => {
						'name' => q(මෙගාහර්ට්ස්),
						'one' => q(මෙගාහර්ට්ස් {0}),
						'other' => q(මෙගාහර්ට්ස් {0}),
					},
					# Long Unit Identifier
					'graphics-dot' => {
						'one' => q({0}තිත),
						'other' => q(තිත් {0}),
					},
					# Core Unit Identifier
					'dot' => {
						'one' => q({0}තිත),
						'other' => q(තිත් {0}),
					},
					# Long Unit Identifier
					'graphics-dot-per-centimeter' => {
						'name' => q(සෙන්ටිමීටරයකට තිත්),
						'one' => q(සෙන්ටිමීටරයකට තිත් {0}),
						'other' => q(සෙන්ටිමීටරයකට තිත් {0}),
					},
					# Core Unit Identifier
					'dot-per-centimeter' => {
						'name' => q(සෙන්ටිමීටරයකට තිත්),
						'one' => q(සෙන්ටිමීටරයකට තිත් {0}),
						'other' => q(සෙන්ටිමීටරයකට තිත් {0}),
					},
					# Long Unit Identifier
					'graphics-dot-per-inch' => {
						'name' => q(අඟලකට තිත්),
						'one' => q(අඟලකට තිත් {0}),
						'other' => q(අඟලකට තිත් {0}),
					},
					# Core Unit Identifier
					'dot-per-inch' => {
						'name' => q(අඟලකට තිත්),
						'one' => q(අඟලකට තිත් {0}),
						'other' => q(අඟලකට තිත් {0}),
					},
					# Long Unit Identifier
					'graphics-em' => {
						'name' => q(යතුරු ලියන එම්),
					},
					# Core Unit Identifier
					'em' => {
						'name' => q(යතුරු ලියන එම්),
					},
					# Long Unit Identifier
					'graphics-megapixel' => {
						'one' => q(මෙගාපික්සල් {0}),
						'other' => q(මෙගාපික්සල් {0}),
					},
					# Core Unit Identifier
					'megapixel' => {
						'one' => q(මෙගාපික්සල් {0}),
						'other' => q(මෙගාපික්සල් {0}),
					},
					# Long Unit Identifier
					'graphics-pixel' => {
						'one' => q(පික්සල් {0}),
						'other' => q(පික්සල් {0}),
					},
					# Core Unit Identifier
					'pixel' => {
						'one' => q(පික්සල් {0}),
						'other' => q(පික්සල් {0}),
					},
					# Long Unit Identifier
					'graphics-pixel-per-centimeter' => {
						'name' => q(සෙන්ටිමීටරයකට පික්සල්),
						'one' => q(සෙන්ටිමීටරයකට පික්සල් {0}),
						'other' => q(සෙන්ටිමීටරයකට පික්සල් {0}),
					},
					# Core Unit Identifier
					'pixel-per-centimeter' => {
						'name' => q(සෙන්ටිමීටරයකට පික්සල්),
						'one' => q(සෙන්ටිමීටරයකට පික්සල් {0}),
						'other' => q(සෙන්ටිමීටරයකට පික්සල් {0}),
					},
					# Long Unit Identifier
					'graphics-pixel-per-inch' => {
						'name' => q(අඟලකට පික්සල්),
						'one' => q(අඟලකට පික්සල් {0}),
						'other' => q(අඟලකට පික්සල් {0}),
					},
					# Core Unit Identifier
					'pixel-per-inch' => {
						'name' => q(අඟලකට පික්සල්),
						'one' => q(අඟලකට පික්සල් {0}),
						'other' => q(අඟලකට පික්සල් {0}),
					},
					# Long Unit Identifier
					'length-astronomical-unit' => {
						'name' => q(නක්ෂත්‍ර ඒකක),
						'one' => q(නක්ෂත්‍ර ඒකක {0}),
						'other' => q(නක්ෂත්‍ර ඒකක {0}),
					},
					# Core Unit Identifier
					'astronomical-unit' => {
						'name' => q(නක්ෂත්‍ර ඒකක),
						'one' => q(නක්ෂත්‍ර ඒකක {0}),
						'other' => q(නක්ෂත්‍ර ඒකක {0}),
					},
					# Long Unit Identifier
					'length-centimeter' => {
						'name' => q(සෙන්ටිමීටර්),
						'one' => q(සෙන්ටිමීටර් {0}),
						'other' => q(සෙන්ටිමීටර් {0}),
						'per' => q(සෙන්ටිමීටරයට {0}),
					},
					# Core Unit Identifier
					'centimeter' => {
						'name' => q(සෙන්ටිමීටර්),
						'one' => q(සෙන්ටිමීටර් {0}),
						'other' => q(සෙන්ටිමීටර් {0}),
						'per' => q(සෙන්ටිමීටරයට {0}),
					},
					# Long Unit Identifier
					'length-decimeter' => {
						'name' => q(ඩෙසිමීටර),
						'one' => q(ඩෙසිමීටර {0}),
						'other' => q(ඩෙසිමීටර {0}),
					},
					# Core Unit Identifier
					'decimeter' => {
						'name' => q(ඩෙසිමීටර),
						'one' => q(ඩෙසිමීටර {0}),
						'other' => q(ඩෙසිමීටර {0}),
					},
					# Long Unit Identifier
					'length-earth-radius' => {
						'name' => q(පෘථිවි අරය),
						'one' => q(පෘථිවි අර {0}),
						'other' => q(පෘථිවි අර {0}),
					},
					# Core Unit Identifier
					'earth-radius' => {
						'name' => q(පෘථිවි අරය),
						'one' => q(පෘථිවි අර {0}),
						'other' => q(පෘථිවි අර {0}),
					},
					# Long Unit Identifier
					'length-fathom' => {
						'one' => q({0} බඹය),
						'other' => q(බඹ {0}),
					},
					# Core Unit Identifier
					'fathom' => {
						'one' => q({0} බඹය),
						'other' => q(බඹ {0}),
					},
					# Long Unit Identifier
					'length-foot' => {
						'per' => q(අඩියට {0}),
					},
					# Core Unit Identifier
					'foot' => {
						'per' => q(අඩියට {0}),
					},
					# Long Unit Identifier
					'length-furlong' => {
						'one' => q({0} පර්ලොමය),
						'other' => q(පර්ලොම {0}),
					},
					# Core Unit Identifier
					'furlong' => {
						'one' => q({0} පර්ලොමය),
						'other' => q(පර්ලොම {0}),
					},
					# Long Unit Identifier
					'length-inch' => {
						'per' => q(අඟලයට {0}),
					},
					# Core Unit Identifier
					'inch' => {
						'per' => q(අඟලයට {0}),
					},
					# Long Unit Identifier
					'length-kilometer' => {
						'name' => q(කිලෝමීටර්),
						'one' => q(කිලෝමීටර් {0}),
						'other' => q(කිලෝමීටර් {0}),
						'per' => q(කිලෝමීටරයට {0}),
					},
					# Core Unit Identifier
					'kilometer' => {
						'name' => q(කිලෝමීටර්),
						'one' => q(කිලෝමීටර් {0}),
						'other' => q(කිලෝමීටර් {0}),
						'per' => q(කිලෝමීටරයට {0}),
					},
					# Long Unit Identifier
					'length-light-year' => {
						'one' => q(ආලෝක වර්ෂ {0}),
						'other' => q(ආලෝක වර්ෂ {0}),
					},
					# Core Unit Identifier
					'light-year' => {
						'one' => q(ආලෝක වර්ෂ {0}),
						'other' => q(ආලෝක වර්ෂ {0}),
					},
					# Long Unit Identifier
					'length-meter' => {
						'one' => q(මීටර් {0}),
						'other' => q(මීටර් {0}),
						'per' => q(මීටරයට {0}),
					},
					# Core Unit Identifier
					'meter' => {
						'one' => q(මීටර් {0}),
						'other' => q(මීටර් {0}),
						'per' => q(මීටරයට {0}),
					},
					# Long Unit Identifier
					'length-micrometer' => {
						'name' => q(මයික්‍රෝමීටර),
						'one' => q(මයික්‍රෝමීටර {0}),
						'other' => q(මයික්‍රෝමීටර {0}),
					},
					# Core Unit Identifier
					'micrometer' => {
						'name' => q(මයික්‍රෝමීටර),
						'one' => q(මයික්‍රෝමීටර {0}),
						'other' => q(මයික්‍රෝමීටර {0}),
					},
					# Long Unit Identifier
					'length-mile' => {
						'one' => q(සැතපුම් {0}),
						'other' => q(සැතපුම් {0}),
					},
					# Core Unit Identifier
					'mile' => {
						'one' => q(සැතපුම් {0}),
						'other' => q(සැතපුම් {0}),
					},
					# Long Unit Identifier
					'length-mile-scandinavian' => {
						'name' => q(ස්කැන්ඩිනේවියානු සැතපුම්),
						'one' => q(ස්කැන්ඩිනේවියානු සැතපුම් {0}),
						'other' => q(ස්කැන්ඩිනේවියානු සැතපුම් {0}),
					},
					# Core Unit Identifier
					'mile-scandinavian' => {
						'name' => q(ස්කැන්ඩිනේවියානු සැතපුම්),
						'one' => q(ස්කැන්ඩිනේවියානු සැතපුම් {0}),
						'other' => q(ස්කැන්ඩිනේවියානු සැතපුම් {0}),
					},
					# Long Unit Identifier
					'length-millimeter' => {
						'name' => q(මිලිමීටර්),
						'one' => q(මිලිමීටර් {0}),
						'other' => q(මිලිමීටර් {0}),
					},
					# Core Unit Identifier
					'millimeter' => {
						'name' => q(මිලිමීටර්),
						'one' => q(මිලිමීටර් {0}),
						'other' => q(මිලිමීටර් {0}),
					},
					# Long Unit Identifier
					'length-nanometer' => {
						'name' => q(නැනෝමීටර),
						'one' => q(නැනෝමීටර {0}),
						'other' => q(නැනෝමීටර {0}),
					},
					# Core Unit Identifier
					'nanometer' => {
						'name' => q(නැනෝමීටර),
						'one' => q(නැනෝමීටර {0}),
						'other' => q(නැනෝමීටර {0}),
					},
					# Long Unit Identifier
					'length-nautical-mile' => {
						'name' => q(නාවුක සැතපුම්),
						'one' => q(නාවුක සැතපුම් {0}),
						'other' => q(නාවුක සැතපුම් {0}),
					},
					# Core Unit Identifier
					'nautical-mile' => {
						'name' => q(නාවුක සැතපුම්),
						'one' => q(නාවුක සැතපුම් {0}),
						'other' => q(නාවුක සැතපුම් {0}),
					},
					# Long Unit Identifier
					'length-parsec' => {
						'one' => q(පාර්සෙක් {0}),
						'other' => q(පාර්සෙක් {0}),
					},
					# Core Unit Identifier
					'parsec' => {
						'one' => q(පාර්සෙක් {0}),
						'other' => q(පාර්සෙක් {0}),
					},
					# Long Unit Identifier
					'length-picometer' => {
						'one' => q(පිකොමිටර් {0}),
						'other' => q(පිකොමිටර් {0}),
					},
					# Core Unit Identifier
					'picometer' => {
						'one' => q(පිකොමිටර් {0}),
						'other' => q(පිකොමිටර් {0}),
					},
					# Long Unit Identifier
					'length-point' => {
						'one' => q(පොයින්ට් {0}),
						'other' => q(පොයින්ට් {0}),
					},
					# Core Unit Identifier
					'point' => {
						'one' => q(පොයින්ට් {0}),
						'other' => q(පොයින්ට් {0}),
					},
					# Long Unit Identifier
					'length-solar-radius' => {
						'one' => q({0} සූර්ය අරය),
						'other' => q({0} සූර්ය අරය),
					},
					# Core Unit Identifier
					'solar-radius' => {
						'one' => q({0} සූර්ය අරය),
						'other' => q({0} සූර්ය අරය),
					},
					# Long Unit Identifier
					'light-candela' => {
						'one' => q({0} කැන්ඩෙලා),
						'other' => q(කැන්ඩෙලා {0}),
					},
					# Core Unit Identifier
					'candela' => {
						'one' => q({0} කැන්ඩෙලා),
						'other' => q(කැන්ඩෙලා {0}),
					},
					# Long Unit Identifier
					'light-lumen' => {
						'one' => q({0} ලූමනය),
						'other' => q(ලූමන {0}),
					},
					# Core Unit Identifier
					'lumen' => {
						'one' => q({0} ලූමනය),
						'other' => q(ලූමන {0}),
					},
					# Long Unit Identifier
					'light-lux' => {
						'one' => q(ලක්ස් {0}),
						'other' => q(ලක්ස් {0}),
					},
					# Core Unit Identifier
					'lux' => {
						'one' => q(ලක්ස් {0}),
						'other' => q(ලක්ස් {0}),
					},
					# Long Unit Identifier
					'light-solar-luminosity' => {
						'one' => q({0} සූර්ය දීප්ති),
						'other' => q({0} සූර්ය දීප්ති),
					},
					# Core Unit Identifier
					'solar-luminosity' => {
						'one' => q({0} සූර්ය දීප්ති),
						'other' => q({0} සූර්ය දීප්ති),
					},
					# Long Unit Identifier
					'mass-carat' => {
						'one' => q(කැරට් {0}),
						'other' => q(කැරට් {0}),
					},
					# Core Unit Identifier
					'carat' => {
						'one' => q(කැරට් {0}),
						'other' => q(කැරට් {0}),
					},
					# Long Unit Identifier
					'mass-dalton' => {
						'one' => q({0} ඩෝල්ටන්),
						'other' => q({0} ඩෝල්ටන්),
					},
					# Core Unit Identifier
					'dalton' => {
						'one' => q({0} ඩෝල්ටන්),
						'other' => q({0} ඩෝල්ටන්),
					},
					# Long Unit Identifier
					'mass-earth-mass' => {
						'one' => q({0} පෘථිවි ස්කන්ධ),
						'other' => q({0} පෘථිවි ස්කන්ධ),
					},
					# Core Unit Identifier
					'earth-mass' => {
						'one' => q({0} පෘථිවි ස්කන්ධ),
						'other' => q({0} පෘථිවි ස්කන්ධ),
					},
					# Long Unit Identifier
					'mass-grain' => {
						'one' => q({0} ඇබිත්ත),
						'other' => q(ඇබිති {0}),
					},
					# Core Unit Identifier
					'grain' => {
						'one' => q({0} ඇබිත්ත),
						'other' => q(ඇබිති {0}),
					},
					# Long Unit Identifier
					'mass-gram' => {
						'one' => q(ග්‍රෑම් {0}),
						'other' => q(ග්‍රෑම් {0}),
						'per' => q(ග්‍රෑමයට {0}),
					},
					# Core Unit Identifier
					'gram' => {
						'one' => q(ග්‍රෑම් {0}),
						'other' => q(ග්‍රෑම් {0}),
						'per' => q(ග්‍රෑමයට {0}),
					},
					# Long Unit Identifier
					'mass-kilogram' => {
						'name' => q(කිලෝග්‍රෑම්),
						'one' => q(කිලෝග්‍රෑම් {0}),
						'other' => q(කිලෝග්‍රෑම් {0}),
						'per' => q(කිලෝග්‍රෑමයට {0}),
					},
					# Core Unit Identifier
					'kilogram' => {
						'name' => q(කිලෝග්‍රෑම්),
						'one' => q(කිලෝග්‍රෑම් {0}),
						'other' => q(කිලෝග්‍රෑම් {0}),
						'per' => q(කිලෝග්‍රෑමයට {0}),
					},
					# Long Unit Identifier
					'mass-microgram' => {
						'name' => q(මයික්‍රෝ ග්‍රෑම්),
						'one' => q(මයික්‍රෝ ග්‍රෑම් {0}),
						'other' => q(මයික්‍රෝ ග්‍රෑම් {0}),
					},
					# Core Unit Identifier
					'microgram' => {
						'name' => q(මයික්‍රෝ ග්‍රෑම්),
						'one' => q(මයික්‍රෝ ග්‍රෑම් {0}),
						'other' => q(මයික්‍රෝ ග්‍රෑම් {0}),
					},
					# Long Unit Identifier
					'mass-milligram' => {
						'name' => q(මිලිග්‍රෑම්),
						'one' => q(මිලිග්‍රෑම් {0}),
						'other' => q(මිලිග්‍රෑම් {0}),
					},
					# Core Unit Identifier
					'milligram' => {
						'name' => q(මිලිග්‍රෑම්),
						'one' => q(මිලිග්‍රෑම් {0}),
						'other' => q(මිලිග්‍රෑම් {0}),
					},
					# Long Unit Identifier
					'mass-ounce' => {
						'name' => q(අවුන්ස),
						'one' => q(අවුන්ස {0}),
						'other' => q(අවුන්ස {0}),
						'per' => q(අවුන්සයට {0}),
					},
					# Core Unit Identifier
					'ounce' => {
						'name' => q(අවුන්ස),
						'one' => q(අවුන්ස {0}),
						'other' => q(අවුන්ස {0}),
						'per' => q(අවුන්සයට {0}),
					},
					# Long Unit Identifier
					'mass-ounce-troy' => {
						'name' => q(ට්‍රෝයි අවුන්ස),
						'one' => q(ට්‍රෝයි අවුන්ස {0}),
						'other' => q(ට්‍රෝයි අවුන්ස {0}),
					},
					# Core Unit Identifier
					'ounce-troy' => {
						'name' => q(ට්‍රෝයි අවුන්ස),
						'one' => q(ට්‍රෝයි අවුන්ස {0}),
						'other' => q(ට්‍රෝයි අවුන්ස {0}),
					},
					# Long Unit Identifier
					'mass-pound' => {
						'one' => q(රාත්තල් {0}),
						'other' => q(රාත්තල් {0}),
						'per' => q(රාත්තලට {0}),
					},
					# Core Unit Identifier
					'pound' => {
						'one' => q(රාත්තල් {0}),
						'other' => q(රාත්තල් {0}),
						'per' => q(රාත්තලට {0}),
					},
					# Long Unit Identifier
					'mass-solar-mass' => {
						'one' => q({0} සූර්ය ස්කන්ධ),
						'other' => q({0} සූර්ය ස්කන්ධ),
					},
					# Core Unit Identifier
					'solar-mass' => {
						'one' => q({0} සූර්ය ස්කන්ධ),
						'other' => q({0} සූර්ය ස්කන්ධ),
					},
					# Long Unit Identifier
					'mass-stone' => {
						'one' => q({0} ගල),
						'other' => q(ගල් {0}),
					},
					# Core Unit Identifier
					'stone' => {
						'one' => q({0} ගල),
						'other' => q(ගල් {0}),
					},
					# Long Unit Identifier
					'mass-tonne' => {
						'name' => q(මෙට්ට්‍රික් ටොන්),
						'one' => q(මෙට්ට්‍රික් ටොන් {0}),
						'other' => q(මෙට්ට්‍රික් ටොන් {0}),
					},
					# Core Unit Identifier
					'tonne' => {
						'name' => q(මෙට්ට්‍රික් ටොන්),
						'one' => q(මෙට්ට්‍රික් ටොන් {0}),
						'other' => q(මෙට්ට්‍රික් ටොන් {0}),
					},
					# Long Unit Identifier
					'per' => {
						'1' => q({1} ට {0} බැගින්),
					},
					# Core Unit Identifier
					'per' => {
						'1' => q({1} ට {0} බැගින්),
					},
					# Long Unit Identifier
					'power-gigawatt' => {
						'name' => q(ගිගා වොට්),
						'one' => q(ගිගා වොට් {0}),
						'other' => q(ගිගා වොට් {0}),
					},
					# Core Unit Identifier
					'gigawatt' => {
						'name' => q(ගිගා වොට්),
						'one' => q(ගිගා වොට් {0}),
						'other' => q(ගිගා වොට් {0}),
					},
					# Long Unit Identifier
					'power-horsepower' => {
						'name' => q(අශ්වබල),
						'one' => q(අශ්වබල {0}),
						'other' => q(අශ්වබල {0}),
					},
					# Core Unit Identifier
					'horsepower' => {
						'name' => q(අශ්වබල),
						'one' => q(අශ්වබල {0}),
						'other' => q(අශ්වබල {0}),
					},
					# Long Unit Identifier
					'power-kilowatt' => {
						'name' => q(කිලෝ වොට්),
						'one' => q(කිලෝ වොට් {0}),
						'other' => q(කිලෝ වොට් {0}),
					},
					# Core Unit Identifier
					'kilowatt' => {
						'name' => q(කිලෝ වොට්),
						'one' => q(කිලෝ වොට් {0}),
						'other' => q(කිලෝ වොට් {0}),
					},
					# Long Unit Identifier
					'power-megawatt' => {
						'name' => q(මෙගාවොට්),
						'one' => q(මෙගාවොට් {0}),
						'other' => q(මෙගාවොට් {0}),
					},
					# Core Unit Identifier
					'megawatt' => {
						'name' => q(මෙගාවොට්),
						'one' => q(මෙගාවොට් {0}),
						'other' => q(මෙගාවොට් {0}),
					},
					# Long Unit Identifier
					'power-milliwatt' => {
						'name' => q(මිලිවොට්),
						'one' => q(මිලිවොට් {0}),
						'other' => q(මිලිවොට් {0}),
					},
					# Core Unit Identifier
					'milliwatt' => {
						'name' => q(මිලිවොට්),
						'one' => q(මිලිවොට් {0}),
						'other' => q(මිලිවොට් {0}),
					},
					# Long Unit Identifier
					'power2' => {
						'1' => q(වර්ගය {0}),
						'one' => q(වර්ග {0}),
						'other' => q(වර්ග {0}),
					},
					# Core Unit Identifier
					'power2' => {
						'1' => q(වර්ගය {0}),
						'one' => q(වර්ග {0}),
						'other' => q(වර්ග {0}),
					},
					# Long Unit Identifier
					'power3' => {
						'1' => q(ඝන {0}),
						'one' => q(ඝන {0}),
						'other' => q(ඝන {0}),
					},
					# Core Unit Identifier
					'power3' => {
						'1' => q(ඝන {0}),
						'one' => q(ඝන {0}),
						'other' => q(ඝන {0}),
					},
					# Long Unit Identifier
					'pressure-atmosphere' => {
						'name' => q(වායුගෝල),
						'one' => q(වායුගෝල {0}),
						'other' => q(වායුගෝල {0}),
					},
					# Core Unit Identifier
					'atmosphere' => {
						'name' => q(වායුගෝල),
						'one' => q(වායුගෝල {0}),
						'other' => q(වායුගෝල {0}),
					},
					# Long Unit Identifier
					'pressure-hectopascal' => {
						'one' => q(හෙක්ටොපැස්කල් {0}),
						'other' => q(හෙක්ටොපැස්කල් {0}),
					},
					# Core Unit Identifier
					'hectopascal' => {
						'one' => q(හෙක්ටොපැස්කල් {0}),
						'other' => q(හෙක්ටොපැස්කල් {0}),
					},
					# Long Unit Identifier
					'pressure-inch-ofhg' => {
						'name' => q(රසදිය අඟල්),
						'one' => q(රසදිය අඟල් {0}),
						'other' => q(රසදිය අඟල් {0}),
					},
					# Core Unit Identifier
					'inch-ofhg' => {
						'name' => q(රසදිය අඟල්),
						'one' => q(රසදිය අඟල් {0}),
						'other' => q(රසදිය අඟල් {0}),
					},
					# Long Unit Identifier
					'pressure-kilopascal' => {
						'name' => q(කිලෝ පැස්කල්),
						'one' => q({0} කිලෝ පැස්කල්),
						'other' => q({0} කිලෝ පැස්කල්),
					},
					# Core Unit Identifier
					'kilopascal' => {
						'name' => q(කිලෝ පැස්කල්),
						'one' => q({0} කිලෝ පැස්කල්),
						'other' => q({0} කිලෝ පැස්කල්),
					},
					# Long Unit Identifier
					'pressure-megapascal' => {
						'name' => q(මෙගාපැස්කල්),
						'one' => q({0} මෙගාපැස්කල්),
						'other' => q({0} මෙගාපැස්කල්),
					},
					# Core Unit Identifier
					'megapascal' => {
						'name' => q(මෙගාපැස්කල්),
						'one' => q({0} මෙගාපැස්කල්),
						'other' => q({0} මෙගාපැස්කල්),
					},
					# Long Unit Identifier
					'pressure-millibar' => {
						'one' => q(මිලිබාර් {0}),
						'other' => q(මිලිබාර් {0}),
					},
					# Core Unit Identifier
					'millibar' => {
						'one' => q(මිලිබාර් {0}),
						'other' => q(මිලිබාර් {0}),
					},
					# Long Unit Identifier
					'pressure-millimeter-ofhg' => {
						'name' => q(රසදිය මිලිමීටර),
						'one' => q(රසදිය මිලිමීටර {0}),
						'other' => q(රසදිය මිලිමීටර {0}),
					},
					# Core Unit Identifier
					'millimeter-ofhg' => {
						'name' => q(රසදිය මිලිමීටර),
						'one' => q(රසදිය මිලිමීටර {0}),
						'other' => q(රසදිය මිලිමීටර {0}),
					},
					# Long Unit Identifier
					'pressure-pascal' => {
						'name' => q(පැස්කල්),
						'one' => q(පැස්කල් {0}),
						'other' => q(පැස්කල් {0}),
					},
					# Core Unit Identifier
					'pascal' => {
						'name' => q(පැස්කල්),
						'one' => q(පැස්කල් {0}),
						'other' => q(පැස්කල් {0}),
					},
					# Long Unit Identifier
					'pressure-pound-force-per-square-inch' => {
						'name' => q(වර්ග අඟලකට රාත්තල්),
						'one' => q(වර්ග අඟලකට රාත්තල් {0}),
						'other' => q(වර්ග අඟලකට රාත්තල් {0}),
					},
					# Core Unit Identifier
					'pound-force-per-square-inch' => {
						'name' => q(වර්ග අඟලකට රාත්තල්),
						'one' => q(වර්ග අඟලකට රාත්තල් {0}),
						'other' => q(වර්ග අඟලකට රාත්තල් {0}),
					},
					# Long Unit Identifier
					'speed-beaufort' => {
						'name' => q(බියුෆෝර්ට්),
						'one' => q(බියුෆෝර්ට් {0}),
						'other' => q(බියුෆෝර්ට් {0}),
					},
					# Core Unit Identifier
					'beaufort' => {
						'name' => q(බියුෆෝර්ට්),
						'one' => q(බියුෆෝර්ට් {0}),
						'other' => q(බියුෆෝර්ට් {0}),
					},
					# Long Unit Identifier
					'speed-kilometer-per-hour' => {
						'one' => q(පැයට කිලෝමීටර් {0}),
						'other' => q(පැයට කිලෝමීටර් {0}),
					},
					# Core Unit Identifier
					'kilometer-per-hour' => {
						'one' => q(පැයට කිලෝමීටර් {0}),
						'other' => q(පැයට කිලෝමීටර් {0}),
					},
					# Long Unit Identifier
					'speed-knot' => {
						'name' => q(නාවික සැතපුම්),
						'one' => q(නාවික සැතපුම් {0}),
						'other' => q(නාවික සැතපුම් {0}),
					},
					# Core Unit Identifier
					'knot' => {
						'name' => q(නාවික සැතපුම්),
						'one' => q(නාවික සැතපුම් {0}),
						'other' => q(නාවික සැතපුම් {0}),
					},
					# Long Unit Identifier
					'speed-meter-per-second' => {
						'one' => q(තත්පරයට මීටර් {0}),
						'other' => q(තත්පරයට මීටර් {0}),
					},
					# Core Unit Identifier
					'meter-per-second' => {
						'one' => q(තත්පරයට මීටර් {0}),
						'other' => q(තත්පරයට මීටර් {0}),
					},
					# Long Unit Identifier
					'speed-mile-per-hour' => {
						'one' => q(පැයට සැතපුම් {0}),
						'other' => q(පැයට සැතපුම් {0}),
					},
					# Core Unit Identifier
					'mile-per-hour' => {
						'one' => q(පැයට සැතපුම් {0}),
						'other' => q(පැයට සැතපුම් {0}),
					},
					# Long Unit Identifier
					'temperature-celsius' => {
						'one' => q(සෙල්සියස් අංශක {0}),
						'other' => q(සෙල්සියස් අංශක {0}),
					},
					# Core Unit Identifier
					'celsius' => {
						'one' => q(සෙල්සියස් අංශක {0}),
						'other' => q(සෙල්සියස් අංශක {0}),
					},
					# Long Unit Identifier
					'temperature-fahrenheit' => {
						'name' => q(ෆැරන්හයිට් අංශක),
						'one' => q(ෆැරන්හයිට් අංශක {0}),
						'other' => q(ෆැරන්හයිට් අංශක {0}),
					},
					# Core Unit Identifier
					'fahrenheit' => {
						'name' => q(ෆැරන්හයිට් අංශක),
						'one' => q(ෆැරන්හයිට් අංශක {0}),
						'other' => q(ෆැරන්හයිට් අංශක {0}),
					},
					# Long Unit Identifier
					'temperature-kelvin' => {
						'name' => q(කෙල්වින් අංශක),
						'one' => q(කෙල්වින් අංශක {0}),
						'other' => q(කෙල්වින් අංශක {0}),
					},
					# Core Unit Identifier
					'kelvin' => {
						'name' => q(කෙල්වින් අංශක),
						'one' => q(කෙල්වින් අංශක {0}),
						'other' => q(කෙල්වින් අංශක {0}),
					},
					# Long Unit Identifier
					'torque-newton-meter' => {
						'name' => q(නිව්ටන්-මීටර්),
						'one' => q({0} නිව්ටන්-මීටර්),
						'other' => q({0} නිව්ටන්-මීටර්),
					},
					# Core Unit Identifier
					'newton-meter' => {
						'name' => q(නිව්ටන්-මීටර්),
						'one' => q({0} නිව්ටන්-මීටර්),
						'other' => q({0} නිව්ටන්-මීටර්),
					},
					# Long Unit Identifier
					'torque-pound-force-foot' => {
						'name' => q(රාත්තල්-පාදය),
						'one' => q({0} රාත්තල්-පාදය),
						'other' => q({0} රාත්තල්-පාදය),
					},
					# Core Unit Identifier
					'pound-force-foot' => {
						'name' => q(රාත්තල්-පාදය),
						'one' => q({0} රාත්තල්-පාදය),
						'other' => q({0} රාත්තල්-පාදය),
					},
					# Long Unit Identifier
					'volume-acre-foot' => {
						'one' => q(අක්කර-අඩි {0}),
						'other' => q(අක්කර-අඩි {0}),
					},
					# Core Unit Identifier
					'acre-foot' => {
						'one' => q(අක්කර-අඩි {0}),
						'other' => q(අක්කර-අඩි {0}),
					},
					# Long Unit Identifier
					'volume-bushel' => {
						'one' => q({0} බුසල),
						'other' => q(බුසල් {0}),
					},
					# Core Unit Identifier
					'bushel' => {
						'one' => q({0} බුසල),
						'other' => q(බුසල් {0}),
					},
					# Long Unit Identifier
					'volume-centiliter' => {
						'name' => q(සෙන්ටිලීටරය),
						'one' => q(සෙන්ටිලීටරය {0}),
						'other' => q(සෙන්ටිලීටරය {0}),
					},
					# Core Unit Identifier
					'centiliter' => {
						'name' => q(සෙන්ටිලීටරය),
						'one' => q(සෙන්ටිලීටරය {0}),
						'other' => q(සෙන්ටිලීටරය {0}),
					},
					# Long Unit Identifier
					'volume-cubic-centimeter' => {
						'name' => q(ඝන සෙන්ටිමීටරය),
						'one' => q(ඝන සෙන්ටිමීටරය {0}),
						'other' => q(ඝන සෙන්ටිමීටරය {0}),
						'per' => q(ඝන සෙන්ටිමීටරයට {0}),
					},
					# Core Unit Identifier
					'cubic-centimeter' => {
						'name' => q(ඝන සෙන්ටිමීටරය),
						'one' => q(ඝන සෙන්ටිමීටරය {0}),
						'other' => q(ඝන සෙන්ටිමීටරය {0}),
						'per' => q(ඝන සෙන්ටිමීටරයට {0}),
					},
					# Long Unit Identifier
					'volume-cubic-foot' => {
						'name' => q(ඝන අඩි),
						'one' => q(ඝන අඩි {0}),
						'other' => q(ඝන අඩි {0}),
					},
					# Core Unit Identifier
					'cubic-foot' => {
						'name' => q(ඝන අඩි),
						'one' => q(ඝන අඩි {0}),
						'other' => q(ඝන අඩි {0}),
					},
					# Long Unit Identifier
					'volume-cubic-inch' => {
						'name' => q(ඝන අඟල්),
						'one' => q(ඝන අඟල් {0}),
						'other' => q(ඝන අඟල් {0}),
					},
					# Core Unit Identifier
					'cubic-inch' => {
						'name' => q(ඝන අඟල්),
						'one' => q(ඝන අඟල් {0}),
						'other' => q(ඝන අඟල් {0}),
					},
					# Long Unit Identifier
					'volume-cubic-kilometer' => {
						'name' => q(ඝන කිලෝමීටර්),
						'one' => q(ඝන කිලෝමීටර් {0}),
						'other' => q(ඝන කිලෝමීටර් {0}),
					},
					# Core Unit Identifier
					'cubic-kilometer' => {
						'name' => q(ඝන කිලෝමීටර්),
						'one' => q(ඝන කිලෝමීටර් {0}),
						'other' => q(ඝන කිලෝමීටර් {0}),
					},
					# Long Unit Identifier
					'volume-cubic-meter' => {
						'name' => q(ඝන මීටර),
						'one' => q(ඝන මීටර {0}),
						'other' => q(ඝන මීටර {0}),
						'per' => q(ඝන මීටරට {0}),
					},
					# Core Unit Identifier
					'cubic-meter' => {
						'name' => q(ඝන මීටර),
						'one' => q(ඝන මීටර {0}),
						'other' => q(ඝන මීටර {0}),
						'per' => q(ඝන මීටරට {0}),
					},
					# Long Unit Identifier
					'volume-cubic-mile' => {
						'name' => q(ඝන සැතපුම්),
						'one' => q(ඝන සැතපුම් {0}),
						'other' => q(ඝන සැතපුම් {0}),
					},
					# Core Unit Identifier
					'cubic-mile' => {
						'name' => q(ඝන සැතපුම්),
						'one' => q(ඝන සැතපුම් {0}),
						'other' => q(ඝන සැතපුම් {0}),
					},
					# Long Unit Identifier
					'volume-cubic-yard' => {
						'name' => q(ඝන යාර),
						'one' => q(ඝන යාර {0}),
						'other' => q(ඝන යාර {0}),
					},
					# Core Unit Identifier
					'cubic-yard' => {
						'name' => q(ඝන යාර),
						'one' => q(ඝන යාර {0}),
						'other' => q(ඝන යාර {0}),
					},
					# Long Unit Identifier
					'volume-cup' => {
						'one' => q(කෝප්ප {0}),
						'other' => q(කෝප්ප {0}),
					},
					# Core Unit Identifier
					'cup' => {
						'one' => q(කෝප්ප {0}),
						'other' => q(කෝප්ප {0}),
					},
					# Long Unit Identifier
					'volume-cup-metric' => {
						'name' => q(මෙට්‍රික් කෝප්ප),
						'one' => q(මෙට්‍රික් කෝප්ප {0}),
						'other' => q(මෙට්‍රික් කෝප්ප {0}),
					},
					# Core Unit Identifier
					'cup-metric' => {
						'name' => q(මෙට්‍රික් කෝප්ප),
						'one' => q(මෙට්‍රික් කෝප්ප {0}),
						'other' => q(මෙට්‍රික් කෝප්ප {0}),
					},
					# Long Unit Identifier
					'volume-deciliter' => {
						'name' => q(ඩෙසිලීටර),
						'one' => q(ඩෙසිලීටරය {0}),
						'other' => q(ඩෙසිලීටරය {0}),
					},
					# Core Unit Identifier
					'deciliter' => {
						'name' => q(ඩෙසිලීටර),
						'one' => q(ඩෙසිලීටරය {0}),
						'other' => q(ඩෙසිලීටරය {0}),
					},
					# Long Unit Identifier
					'volume-dessert-spoon' => {
						'one' => q({0} අතුරුපස හැන්ද),
						'other' => q(අතුරුපස හැඳි {0}),
					},
					# Core Unit Identifier
					'dessert-spoon' => {
						'one' => q({0} අතුරුපස හැන්ද),
						'other' => q(අතුරුපස හැඳි {0}),
					},
					# Long Unit Identifier
					'volume-dessert-spoon-imperial' => {
						'one' => q({0} ඉම්පීරියල් අතුරුපස හැන්ද),
						'other' => q(ඉම්පීරියල් අතුරුපස හැඳි {0}),
					},
					# Core Unit Identifier
					'dessert-spoon-imperial' => {
						'one' => q({0} ඉම්පීරියල් අතුරුපස හැන්ද),
						'other' => q(ඉම්පීරියල් අතුරුපස හැඳි {0}),
					},
					# Long Unit Identifier
					'volume-dram' => {
						'name' => q(ඩ්‍රූම),
						'one' => q({0} ඩ්‍රූම),
						'other' => q(ඩ්‍රූම {0}),
					},
					# Core Unit Identifier
					'dram' => {
						'name' => q(ඩ්‍රූම),
						'one' => q({0} ඩ්‍රූම),
						'other' => q(ඩ්‍රූම {0}),
					},
					# Long Unit Identifier
					'volume-drop' => {
						'one' => q({0} බින්දුව),
						'other' => q(බින්දු {0}),
					},
					# Core Unit Identifier
					'drop' => {
						'one' => q({0} බින්දුව),
						'other' => q(බින්දු {0}),
					},
					# Long Unit Identifier
					'volume-fluid-ounce' => {
						'name' => q(ද්‍රව අවුන්ස),
						'one' => q(ද්‍රව අවුන්ස {0}),
						'other' => q(ද්‍රව අවුන්ස {0}),
					},
					# Core Unit Identifier
					'fluid-ounce' => {
						'name' => q(ද්‍රව අවුන්ස),
						'one' => q(ද්‍රව අවුන්ස {0}),
						'other' => q(ද්‍රව අවුන්ස {0}),
					},
					# Long Unit Identifier
					'volume-fluid-ounce-imperial' => {
						'name' => q(අධිරා. තරල අවුන්ස),
						'one' => q({0} අධිරා. තරල අවුන්ස),
						'other' => q({0} අධිරා. තරල අවුන්ස),
					},
					# Core Unit Identifier
					'fluid-ounce-imperial' => {
						'name' => q(අධිරා. තරල අවුන්ස),
						'one' => q({0} අධිරා. තරල අවුන්ස),
						'other' => q({0} අධිරා. තරල අවුන්ස),
					},
					# Long Unit Identifier
					'volume-gallon' => {
						'name' => q(ගැලුම්),
						'one' => q(ගැලුම් {0}),
						'other' => q(ගැලුම් {0}),
						'per' => q(ගැලුමට {0}),
					},
					# Core Unit Identifier
					'gallon' => {
						'name' => q(ගැලුම්),
						'one' => q(ගැලුම් {0}),
						'other' => q(ගැලුම් {0}),
						'per' => q(ගැලුමට {0}),
					},
					# Long Unit Identifier
					'volume-gallon-imperial' => {
						'name' => q(ඉම්පීරියල් ගැලුම්),
						'one' => q({0} ඉම්පී. ගැලුම),
						'other' => q({0} ඉම්පී. ගැලුම්),
						'per' => q(ඉම්පීරියල් ගැලුමකට {0}),
					},
					# Core Unit Identifier
					'gallon-imperial' => {
						'name' => q(ඉම්පීරියල් ගැලුම්),
						'one' => q({0} ඉම්පී. ගැලුම),
						'other' => q({0} ඉම්පී. ගැලුම්),
						'per' => q(ඉම්පීරියල් ගැලුමකට {0}),
					},
					# Long Unit Identifier
					'volume-hectoliter' => {
						'name' => q(හෙක්ටොලීටර්),
						'one' => q(හෙක්ටොලීටර් {0}),
						'other' => q(හෙක්ටොලීටර් {0}),
					},
					# Core Unit Identifier
					'hectoliter' => {
						'name' => q(හෙක්ටොලීටර්),
						'one' => q(හෙක්ටොලීටර් {0}),
						'other' => q(හෙක්ටොලීටර් {0}),
					},
					# Long Unit Identifier
					'volume-jigger' => {
						'one' => q({0} තැටි වාහකය),
						'other' => q(තැටි වාහක {0}),
					},
					# Core Unit Identifier
					'jigger' => {
						'one' => q({0} තැටි වාහකය),
						'other' => q(තැටි වාහක {0}),
					},
					# Long Unit Identifier
					'volume-liter' => {
						'one' => q(ලීටර් {0}),
						'other' => q(ලීටර් {0}),
						'per' => q(ලීටරයට {0}),
					},
					# Core Unit Identifier
					'liter' => {
						'one' => q(ලීටර් {0}),
						'other' => q(ලීටර් {0}),
						'per' => q(ලීටරයට {0}),
					},
					# Long Unit Identifier
					'volume-megaliter' => {
						'name' => q(මෙගාලීටර්),
						'one' => q(මෙගාලීටර් {0}),
						'other' => q(මෙගාලීටර් {0}),
					},
					# Core Unit Identifier
					'megaliter' => {
						'name' => q(මෙගාලීටර්),
						'one' => q(මෙගාලීටර් {0}),
						'other' => q(මෙගාලීටර් {0}),
					},
					# Long Unit Identifier
					'volume-milliliter' => {
						'name' => q(මිලිලීටර්),
						'one' => q(මිලිලීටර් {0}),
						'other' => q(මිලිලීටර් {0}),
					},
					# Core Unit Identifier
					'milliliter' => {
						'name' => q(මිලිලීටර්),
						'one' => q(මිලිලීටර් {0}),
						'other' => q(මිලිලීටර් {0}),
					},
					# Long Unit Identifier
					'volume-pinch' => {
						'one' => q({0} ඩිංග),
						'other' => q(ඩිංග {0}),
					},
					# Core Unit Identifier
					'pinch' => {
						'one' => q({0} ඩිංග),
						'other' => q(ඩිංග {0}),
					},
					# Long Unit Identifier
					'volume-pint' => {
						'one' => q(පයින්ට් {0}),
						'other' => q(පයින්ට් {0}),
					},
					# Core Unit Identifier
					'pint' => {
						'one' => q(පයින්ට් {0}),
						'other' => q(පයින්ට් {0}),
					},
					# Long Unit Identifier
					'volume-pint-metric' => {
						'name' => q(මෙට්‍රික් පයින්ට්),
						'one' => q(මෙට්‍රික් පයින්ට් {0}),
						'other' => q(මෙට්‍රික් පයින්ට් {0}),
					},
					# Core Unit Identifier
					'pint-metric' => {
						'name' => q(මෙට්‍රික් පයින්ට්),
						'one' => q(මෙට්‍රික් පයින්ට් {0}),
						'other' => q(මෙට්‍රික් පයින්ට් {0}),
					},
					# Long Unit Identifier
					'volume-quart' => {
						'one' => q(ක්වාට් {0}),
						'other' => q(ක්වාට් {0}),
					},
					# Core Unit Identifier
					'quart' => {
						'one' => q(ක්වාට් {0}),
						'other' => q(ක්වාට් {0}),
					},
					# Long Unit Identifier
					'volume-quart-imperial' => {
						'one' => q({0} ඉම්පීරියල් නැළිය),
						'other' => q(ඉම්පීරියල් නැළි {0}),
					},
					# Core Unit Identifier
					'quart-imperial' => {
						'one' => q({0} ඉම්පීරියල් නැළිය),
						'other' => q(ඉම්පීරියල් නැළි {0}),
					},
					# Long Unit Identifier
					'volume-tablespoon' => {
						'name' => q(මේස හැදී),
						'one' => q(මේස හැදී {0}),
						'other' => q(මේස හැදී {0}),
					},
					# Core Unit Identifier
					'tablespoon' => {
						'name' => q(මේස හැදී),
						'one' => q(මේස හැදී {0}),
						'other' => q(මේස හැදී {0}),
					},
					# Long Unit Identifier
					'volume-teaspoon' => {
						'name' => q(තේ හැදී),
						'one' => q(තේ හැදී {0}),
						'other' => q(තේ හැදී {0}),
					},
					# Core Unit Identifier
					'teaspoon' => {
						'name' => q(තේ හැදී),
						'one' => q(තේ හැදී {0}),
						'other' => q(තේ හැදී {0}),
					},
				},
				'narrow' => {
					# Long Unit Identifier
					'1024p2' => {
						'1' => q(මි{0}),
					},
					# Core Unit Identifier
					'1024p2' => {
						'1' => q(මි{0}),
					},
					# Long Unit Identifier
					'1024p5' => {
						'1' => q(පි{0}),
					},
					# Core Unit Identifier
					'1024p5' => {
						'1' => q(පි{0}),
					},
					# Long Unit Identifier
					'10p-1' => {
						'1' => q(ඩෙ{0}),
					},
					# Core Unit Identifier
					'1' => {
						'1' => q(ඩෙ{0}),
					},
					# Long Unit Identifier
					'10p-2' => {
						'1' => q(සෙ{0}),
					},
					# Core Unit Identifier
					'2' => {
						'1' => q(සෙ{0}),
					},
					# Long Unit Identifier
					'10p-21' => {
						'1' => q(සෙ{0}),
					},
					# Core Unit Identifier
					'21' => {
						'1' => q(සෙ{0}),
					},
					# Long Unit Identifier
					'10p1' => {
						'1' => q(ඩෙ{0}),
					},
					# Core Unit Identifier
					'10p1' => {
						'1' => q(ඩෙ{0}),
					},
					# Long Unit Identifier
					'10p21' => {
						'1' => q(සෙ{0}),
					},
					# Core Unit Identifier
					'10p21' => {
						'1' => q(සෙ{0}),
					},
					# Long Unit Identifier
					'10p24' => {
						'1' => q(යො{0}),
					},
					# Core Unit Identifier
					'10p24' => {
						'1' => q(යො{0}),
					},
					# Long Unit Identifier
					'10p27' => {
						'1' => q(රො{0}),
					},
					# Core Unit Identifier
					'10p27' => {
						'1' => q(රො{0}),
					},
					# Long Unit Identifier
					'10p3' => {
						'1' => q(කි{0}),
					},
					# Core Unit Identifier
					'10p3' => {
						'1' => q(කි{0}),
					},
					# Long Unit Identifier
					'10p30' => {
						'1' => q(ක්{0}),
					},
					# Core Unit Identifier
					'10p30' => {
						'1' => q(ක්{0}),
					},
					# Long Unit Identifier
					'10p9' => {
						'1' => q(ගි{0}),
					},
					# Core Unit Identifier
					'10p9' => {
						'1' => q(ගි{0}),
					},
					# Long Unit Identifier
					'acceleration-meter-per-square-second' => {
						'name' => q(මී/තව),
					},
					# Core Unit Identifier
					'meter-per-square-second' => {
						'name' => q(මී/තව),
					},
					# Long Unit Identifier
					'angle-arc-minute' => {
						'one' => q({0}′),
						'other' => q({0}′),
					},
					# Core Unit Identifier
					'arc-minute' => {
						'one' => q({0}′),
						'other' => q({0}′),
					},
					# Long Unit Identifier
					'angle-arc-second' => {
						'one' => q({0}″),
						'other' => q({0}″),
					},
					# Core Unit Identifier
					'arc-second' => {
						'one' => q({0}″),
						'other' => q({0}″),
					},
					# Long Unit Identifier
					'angle-degree' => {
						'one' => q({0}°),
						'other' => q({0}°),
					},
					# Core Unit Identifier
					'degree' => {
						'one' => q({0}°),
						'other' => q({0}°),
					},
					# Long Unit Identifier
					'area-hectare' => {
						'one' => q(හෙක් {0}),
						'other' => q({0} ha),
					},
					# Core Unit Identifier
					'hectare' => {
						'one' => q(හෙක් {0}),
						'other' => q({0} ha),
					},
					# Long Unit Identifier
					'area-square-centimeter' => {
						'one' => q(වසෙ{0}),
						'other' => q(වසෙ{0}),
					},
					# Core Unit Identifier
					'square-centimeter' => {
						'one' => q(වසෙ{0}),
						'other' => q(වසෙ{0}),
					},
					# Long Unit Identifier
					'area-square-foot' => {
						'name' => q(වඅ²),
						'one' => q({0}වඅ²),
						'other' => q({0}වඅ²),
					},
					# Core Unit Identifier
					'square-foot' => {
						'name' => q(වඅ²),
						'one' => q({0}වඅ²),
						'other' => q({0}වඅ²),
					},
					# Long Unit Identifier
					'area-square-inch' => {
						'name' => q(වඅඟ²),
						'one' => q({0}වඅඟ²),
						'other' => q({0}වඅඟ²),
						'per' => q({0}/වඅඟ²),
					},
					# Core Unit Identifier
					'square-inch' => {
						'name' => q(වඅඟ²),
						'one' => q({0}වඅඟ²),
						'other' => q({0}වඅඟ²),
						'per' => q({0}/වඅඟ²),
					},
					# Long Unit Identifier
					'area-square-kilometer' => {
						'one' => q({0} km²),
						'other' => q({0} km²),
						'per' => q({0}/ව.කී),
					},
					# Core Unit Identifier
					'square-kilometer' => {
						'one' => q({0} km²),
						'other' => q({0} km²),
						'per' => q({0}/ව.කී),
					},
					# Long Unit Identifier
					'area-square-mile' => {
						'name' => q(ව.සැ),
						'one' => q(ව.සැ{0}),
						'other' => q(ව.සැ{0}),
						'per' => q({0}/ව.සැ),
					},
					# Core Unit Identifier
					'square-mile' => {
						'name' => q(ව.සැ),
						'one' => q(ව.සැ{0}),
						'other' => q(ව.සැ{0}),
						'per' => q({0}/ව.සැ),
					},
					# Long Unit Identifier
					'area-square-yard' => {
						'name' => q(වයා),
					},
					# Core Unit Identifier
					'square-yard' => {
						'name' => q(වයා),
					},
					# Long Unit Identifier
					'concentr-percent' => {
						'name' => q(%),
					},
					# Core Unit Identifier
					'percent' => {
						'name' => q(%),
					},
					# Long Unit Identifier
					'concentr-permillion' => {
						'name' => q(මිලිකො),
					},
					# Core Unit Identifier
					'permillion' => {
						'name' => q(මිලිකො),
					},
					# Long Unit Identifier
					'concentr-permyriad' => {
						'name' => q(‱),
					},
					# Core Unit Identifier
					'permyriad' => {
						'name' => q(‱),
					},
					# Long Unit Identifier
					'consumption-liter-per-100-kilometer' => {
						'one' => q(ලී/කිමී100 {0}),
						'other' => q(ලී/කිමී100 {0}),
					},
					# Core Unit Identifier
					'liter-per-100-kilometer' => {
						'one' => q(ලී/කිමී100 {0}),
						'other' => q(ලී/කිමී100 {0}),
					},
					# Long Unit Identifier
					'consumption-mile-per-gallon' => {
						'name' => q(හැගැ),
					},
					# Core Unit Identifier
					'mile-per-gallon' => {
						'name' => q(හැගැ),
					},
					# Long Unit Identifier
					'consumption-mile-per-gallon-imperial' => {
						'name' => q(ගැහැ එ.රා.),
						'one' => q({0} ගැහැ එ.රා.),
						'other' => q({0} ගැහැ එ.රා.),
					},
					# Core Unit Identifier
					'mile-per-gallon-imperial' => {
						'name' => q(ගැහැ එ.රා.),
						'one' => q({0} ගැහැ එ.රා.),
						'other' => q({0} ගැහැ එ.රා.),
					},
					# Long Unit Identifier
					'duration-day' => {
						'one' => q(දි {0}),
						'other' => q(දි {0}),
					},
					# Core Unit Identifier
					'day' => {
						'one' => q(දි {0}),
						'other' => q(දි {0}),
					},
					# Long Unit Identifier
					'duration-millisecond' => {
						'name' => q(මිලිතත්),
					},
					# Core Unit Identifier
					'millisecond' => {
						'name' => q(මිලිතත්),
					},
					# Long Unit Identifier
					'duration-minute' => {
						'one' => q(මි {0}),
						'other' => q(මි {0}),
					},
					# Core Unit Identifier
					'minute' => {
						'one' => q(මි {0}),
						'other' => q(මි {0}),
					},
					# Long Unit Identifier
					'duration-month' => {
						'one' => q(මා {0}),
						'other' => q(මා {0}),
					},
					# Core Unit Identifier
					'month' => {
						'one' => q(මා {0}),
						'other' => q(මා {0}),
					},
					# Long Unit Identifier
					'duration-second' => {
						'name' => q(තත්),
						'one' => q(ත {0}),
						'other' => q(ත {0}),
					},
					# Core Unit Identifier
					'second' => {
						'name' => q(තත්),
						'one' => q(ත {0}),
						'other' => q(ත {0}),
					},
					# Long Unit Identifier
					'duration-week' => {
						'one' => q(ස {0}),
						'other' => q(ස {0}),
					},
					# Core Unit Identifier
					'week' => {
						'one' => q(ස {0}),
						'other' => q(ස {0}),
					},
					# Long Unit Identifier
					'duration-year' => {
						'one' => q(ව {0}),
						'other' => q(ව {0}),
					},
					# Core Unit Identifier
					'year' => {
						'one' => q(ව {0}),
						'other' => q(ව {0}),
					},
					# Long Unit Identifier
					'electric-ampere' => {
						'name' => q(ඇ),
					},
					# Core Unit Identifier
					'ampere' => {
						'name' => q(ඇ),
					},
					# Long Unit Identifier
					'electric-milliampere' => {
						'name' => q(මිඇ),
					},
					# Core Unit Identifier
					'milliampere' => {
						'name' => q(මිඇ),
					},
					# Long Unit Identifier
					'energy-electronvolt' => {
						'name' => q(ඉවෝ),
					},
					# Core Unit Identifier
					'electronvolt' => {
						'name' => q(ඉවෝ),
					},
					# Long Unit Identifier
					'energy-foodcalorie' => {
						'one' => q(කැල{0}),
						'other' => q(කැල{0}),
					},
					# Core Unit Identifier
					'foodcalorie' => {
						'one' => q(කැල{0}),
						'other' => q(කැල{0}),
					},
					# Long Unit Identifier
					'energy-kilojoule' => {
						'name' => q(කිජු),
					},
					# Core Unit Identifier
					'kilojoule' => {
						'name' => q(කිජු),
					},
					# Long Unit Identifier
					'energy-therm-us' => {
						'name' => q(එජ තාප ඒකක),
						'one' => q(එජ තාප ඒකක {0}),
						'other' => q(එජ තාප ඒකක {0}),
					},
					# Core Unit Identifier
					'therm-us' => {
						'name' => q(එජ තාප ඒකක),
						'one' => q(එජ තාප ඒකක {0}),
						'other' => q(එජ තාප ඒකක {0}),
					},
					# Long Unit Identifier
					'force-kilowatt-hour-per-100-kilometer' => {
						'one' => q({0}කිවොපැ/100කිමී),
						'other' => q({0} කිවොපැ/100කිමී),
					},
					# Core Unit Identifier
					'kilowatt-hour-per-100-kilometer' => {
						'one' => q({0}කිවොපැ/100කිමී),
						'other' => q({0} කිවොපැ/100කිමී),
					},
					# Long Unit Identifier
					'force-newton' => {
						'name' => q(නි),
					},
					# Core Unit Identifier
					'newton' => {
						'name' => q(නි),
					},
					# Long Unit Identifier
					'force-pound-force' => {
						'name' => q(බරා),
					},
					# Core Unit Identifier
					'pound-force' => {
						'name' => q(බරා),
					},
					# Long Unit Identifier
					'graphics-dot' => {
						'name' => q(තිත),
					},
					# Core Unit Identifier
					'dot' => {
						'name' => q(තිත),
					},
					# Long Unit Identifier
					'graphics-em' => {
						'name' => q(එම්),
						'one' => q(එම්{0}),
						'other' => q(එම්{0}),
					},
					# Core Unit Identifier
					'em' => {
						'name' => q(එම්),
						'one' => q(එම්{0}),
						'other' => q(එම්{0}),
					},
					# Long Unit Identifier
					'length-foot' => {
						'one' => q({0}'),
						'other' => q({0}'),
					},
					# Core Unit Identifier
					'foot' => {
						'one' => q({0}'),
						'other' => q({0}'),
					},
					# Long Unit Identifier
					'length-inch' => {
						'one' => q({0}″),
						'other' => q({0}″),
					},
					# Core Unit Identifier
					'inch' => {
						'one' => q({0}″),
						'other' => q({0}″),
					},
					# Long Unit Identifier
					'length-light-year' => {
						'name' => q(ආ.ව),
					},
					# Core Unit Identifier
					'light-year' => {
						'name' => q(ආ.ව),
					},
					# Long Unit Identifier
					'length-picometer' => {
						'name' => q(පිමී),
					},
					# Core Unit Identifier
					'picometer' => {
						'name' => q(පිමී),
					},
					# Long Unit Identifier
					'length-solar-radius' => {
						'name' => q(අ☉),
					},
					# Core Unit Identifier
					'solar-radius' => {
						'name' => q(අ☉),
					},
					# Long Unit Identifier
					'mass-dalton' => {
						'name' => q(ඩෝ),
					},
					# Core Unit Identifier
					'dalton' => {
						'name' => q(ඩෝ),
					},
					# Long Unit Identifier
					'mass-earth-mass' => {
						'name' => q(ස්⊕),
					},
					# Core Unit Identifier
					'earth-mass' => {
						'name' => q(ස්⊕),
					},
					# Long Unit Identifier
					'mass-grain' => {
						'name' => q(ඇ),
						'one' => q(ඇ {0}),
						'other' => q(ඇ {0}),
					},
					# Core Unit Identifier
					'grain' => {
						'name' => q(ඇ),
						'one' => q(ඇ {0}),
						'other' => q(ඇ {0}),
					},
					# Long Unit Identifier
					'mass-gram' => {
						'per' => q({0}/ග්‍රෑ),
					},
					# Core Unit Identifier
					'gram' => {
						'per' => q({0}/ග්‍රෑ),
					},
					# Long Unit Identifier
					'mass-kilogram' => {
						'one' => q(කිග්‍රෑ{0}),
						'other' => q(කිග්‍රෑ{0}),
						'per' => q({0}/කිග්‍රෑ),
					},
					# Core Unit Identifier
					'kilogram' => {
						'one' => q(කිග්‍රෑ{0}),
						'other' => q(කිග්‍රෑ{0}),
						'per' => q({0}/කිග්‍රෑ),
					},
					# Long Unit Identifier
					'mass-ounce' => {
						'one' => q(අවුස{0}),
						'other' => q(අවුස{0}),
					},
					# Core Unit Identifier
					'ounce' => {
						'one' => q(අවුස{0}),
						'other' => q(අවුස{0}),
					},
					# Long Unit Identifier
					'mass-pound' => {
						'name' => q(රා),
						'one' => q(රා{0}),
						'other' => q(රා{0}),
					},
					# Core Unit Identifier
					'pound' => {
						'name' => q(රා),
						'one' => q(රා{0}),
						'other' => q(රා{0}),
					},
					# Long Unit Identifier
					'mass-solar-mass' => {
						'name' => q(ස්☉),
					},
					# Core Unit Identifier
					'solar-mass' => {
						'name' => q(ස්☉),
					},
					# Long Unit Identifier
					'pressure-hectopascal' => {
						'one' => q({0} hPa),
						'other' => q({0} hPa),
					},
					# Core Unit Identifier
					'hectopascal' => {
						'one' => q({0} hPa),
						'other' => q({0} hPa),
					},
					# Long Unit Identifier
					'pressure-inch-ofhg' => {
						'name' => q(" ර),
						'one' => q(ර {0}"),
						'other' => q(ර {0}"),
					},
					# Core Unit Identifier
					'inch-ofhg' => {
						'name' => q(" ර),
						'one' => q(ර {0}"),
						'other' => q(ර {0}"),
					},
					# Long Unit Identifier
					'pressure-millibar' => {
						'one' => q(මි.බා. {0}),
						'other' => q(මි.බා. {0}),
					},
					# Core Unit Identifier
					'millibar' => {
						'one' => q(මි.බා. {0}),
						'other' => q(මි.බා. {0}),
					},
					# Long Unit Identifier
					'speed-beaufort' => {
						'one' => q(බි{0}),
						'other' => q(බි{0}),
					},
					# Core Unit Identifier
					'beaufort' => {
						'one' => q(බි{0}),
						'other' => q(බි{0}),
					},
					# Long Unit Identifier
					'speed-meter-per-second' => {
						'name' => q(මී/තත්),
					},
					# Core Unit Identifier
					'meter-per-second' => {
						'name' => q(මී/තත්),
					},
					# Long Unit Identifier
					'speed-mile-per-hour' => {
						'name' => q(පැ/සැ),
						'one' => q(පැසැ {0}),
						'other' => q(පැසැ {0}),
					},
					# Core Unit Identifier
					'mile-per-hour' => {
						'name' => q(පැ/සැ),
						'one' => q(පැසැ {0}),
						'other' => q(පැසැ {0}),
					},
					# Long Unit Identifier
					'temperature-celsius' => {
						'one' => q({0}°),
						'other' => q({0}°),
					},
					# Core Unit Identifier
					'celsius' => {
						'one' => q({0}°),
						'other' => q({0}°),
					},
					# Long Unit Identifier
					'temperature-kelvin' => {
						'name' => q(කෙ),
						'one' => q(කෙ {0}),
						'other' => q(කෙ {0}),
					},
					# Core Unit Identifier
					'kelvin' => {
						'name' => q(කෙ),
						'one' => q(කෙ {0}),
						'other' => q(කෙ {0}),
					},
					# Long Unit Identifier
					'volume-cubic-inch' => {
						'name' => q(අල්³),
					},
					# Core Unit Identifier
					'cubic-inch' => {
						'name' => q(අල්³),
					},
					# Long Unit Identifier
					'volume-cubic-kilometer' => {
						'one' => q(කිමී³ {0}),
						'other' => q({0} km³),
					},
					# Core Unit Identifier
					'cubic-kilometer' => {
						'one' => q(කිමී³ {0}),
						'other' => q({0} km³),
					},
					# Long Unit Identifier
					'volume-dessert-spoon-imperial' => {
						'name' => q(ඉම්පී. අතුරුපස හැඳි),
					},
					# Core Unit Identifier
					'dessert-spoon-imperial' => {
						'name' => q(ඉම්පී. අතුරුපස හැඳි),
					},
				},
				'short' => {
					# Long Unit Identifier
					'' => {
						'name' => q(දිශාව),
					},
					# Core Unit Identifier
					'' => {
						'name' => q(දිශාව),
					},
					# Long Unit Identifier
					'1024p1' => {
						'1' => q(කි{0}),
					},
					# Core Unit Identifier
					'1024p1' => {
						'1' => q(කි{0}),
					},
					# Long Unit Identifier
					'1024p2' => {
						'1' => q(මෙබි{0}),
					},
					# Core Unit Identifier
					'1024p2' => {
						'1' => q(මෙබි{0}),
					},
					# Long Unit Identifier
					'1024p3' => {
						'1' => q(ගි{0}),
					},
					# Core Unit Identifier
					'1024p3' => {
						'1' => q(ගි{0}),
					},
					# Long Unit Identifier
					'1024p4' => {
						'1' => q(ටි{0}),
					},
					# Core Unit Identifier
					'1024p4' => {
						'1' => q(ටි{0}),
					},
					# Long Unit Identifier
					'1024p5' => {
						'1' => q(පෙබි{0}),
					},
					# Core Unit Identifier
					'1024p5' => {
						'1' => q(පෙබි{0}),
					},
					# Long Unit Identifier
					'1024p6' => {
						'1' => q(එයි{0}),
					},
					# Core Unit Identifier
					'1024p6' => {
						'1' => q(එයි{0}),
					},
					# Long Unit Identifier
					'1024p7' => {
						'1' => q(සි{0}),
					},
					# Core Unit Identifier
					'1024p7' => {
						'1' => q(සි{0}),
					},
					# Long Unit Identifier
					'1024p8' => {
						'1' => q(යි{0}),
					},
					# Core Unit Identifier
					'1024p8' => {
						'1' => q(යි{0}),
					},
					# Long Unit Identifier
					'10p-1' => {
						'1' => q(ඩෙස{0}),
					},
					# Core Unit Identifier
					'1' => {
						'1' => q(ඩෙස{0}),
					},
					# Long Unit Identifier
					'10p-12' => {
						'1' => q(පි{0}),
					},
					# Core Unit Identifier
					'12' => {
						'1' => q(පි{0}),
					},
					# Long Unit Identifier
					'10p-15' => {
						'1' => q(ෆෙ{0}),
					},
					# Core Unit Identifier
					'15' => {
						'1' => q(ෆෙ{0}),
					},
					# Long Unit Identifier
					'10p-18' => {
						'1' => q(ඇ{0}),
					},
					# Core Unit Identifier
					'18' => {
						'1' => q(ඇ{0}),
					},
					# Long Unit Identifier
					'10p-2' => {
						'1' => q(සෙන්{0}),
					},
					# Core Unit Identifier
					'2' => {
						'1' => q(සෙන්{0}),
					},
					# Long Unit Identifier
					'10p-21' => {
						'1' => q(සෙප්{0}),
					},
					# Core Unit Identifier
					'21' => {
						'1' => q(සෙප්{0}),
					},
					# Long Unit Identifier
					'10p-24' => {
						'1' => q(යො{0}),
					},
					# Core Unit Identifier
					'24' => {
						'1' => q(යො{0}),
					},
					# Long Unit Identifier
					'10p-27' => {
						'1' => q(රො{0}),
					},
					# Core Unit Identifier
					'27' => {
						'1' => q(රො{0}),
					},
					# Long Unit Identifier
					'10p-3' => {
						'1' => q(මි{0}),
					},
					# Core Unit Identifier
					'3' => {
						'1' => q(මි{0}),
					},
					# Long Unit Identifier
					'10p-30' => {
						'1' => q(ක්{0}),
					},
					# Core Unit Identifier
					'30' => {
						'1' => q(ක්{0}),
					},
					# Long Unit Identifier
					'10p-9' => {
						'1' => q(නැ{0}),
					},
					# Core Unit Identifier
					'9' => {
						'1' => q(නැ{0}),
					},
					# Long Unit Identifier
					'10p1' => {
						'1' => q(ඩෙක{0}),
					},
					# Core Unit Identifier
					'10p1' => {
						'1' => q(ඩෙක{0}),
					},
					# Long Unit Identifier
					'10p12' => {
						'1' => q(ටෙ{0}),
					},
					# Core Unit Identifier
					'10p12' => {
						'1' => q(ටෙ{0}),
					},
					# Long Unit Identifier
					'10p15' => {
						'1' => q(පෙ{0}),
					},
					# Core Unit Identifier
					'10p15' => {
						'1' => q(පෙ{0}),
					},
					# Long Unit Identifier
					'10p18' => {
						'1' => q(එ{0}),
					},
					# Core Unit Identifier
					'10p18' => {
						'1' => q(එ{0}),
					},
					# Long Unit Identifier
					'10p2' => {
						'1' => q(හෙ{0}),
					},
					# Core Unit Identifier
					'10p2' => {
						'1' => q(හෙ{0}),
					},
					# Long Unit Identifier
					'10p21' => {
						'1' => q(සෙට{0}),
					},
					# Core Unit Identifier
					'10p21' => {
						'1' => q(සෙට{0}),
					},
					# Long Unit Identifier
					'10p24' => {
						'1' => q(යොට{0}),
					},
					# Core Unit Identifier
					'10p24' => {
						'1' => q(යොට{0}),
					},
					# Long Unit Identifier
					'10p27' => {
						'1' => q(රොනා{0}),
					},
					# Core Unit Identifier
					'10p27' => {
						'1' => q(රොනා{0}),
					},
					# Long Unit Identifier
					'10p3' => {
						'1' => q(ක{0}),
					},
					# Core Unit Identifier
					'10p3' => {
						'1' => q(ක{0}),
					},
					# Long Unit Identifier
					'10p30' => {
						'1' => q(ක්වෙ{0}),
					},
					# Core Unit Identifier
					'10p30' => {
						'1' => q(ක්වෙ{0}),
					},
					# Long Unit Identifier
					'10p6' => {
						'1' => q(මෙ{0}),
					},
					# Core Unit Identifier
					'10p6' => {
						'1' => q(මෙ{0}),
					},
					# Long Unit Identifier
					'10p9' => {
						'1' => q(ගිගා{0}),
					},
					# Core Unit Identifier
					'10p9' => {
						'1' => q(ගිගා{0}),
					},
					# Long Unit Identifier
					'acceleration-g-force' => {
						'name' => q(g-බලය),
					},
					# Core Unit Identifier
					'g-force' => {
						'name' => q(g-බලය),
					},
					# Long Unit Identifier
					'acceleration-meter-per-square-second' => {
						'name' => q(මීටර/තත්පර වර්ගයට),
						'one' => q(මී/තව {0}),
						'other' => q(මී/තව {0}),
					},
					# Core Unit Identifier
					'meter-per-square-second' => {
						'name' => q(මීටර/තත්පර වර්ගයට),
						'one' => q(මී/තව {0}),
						'other' => q(මී/තව {0}),
					},
					# Long Unit Identifier
					'angle-arc-minute' => {
						'name' => q(චාපමිනිත්තු),
						'one' => q(චාපමිනිත්තු {0}),
						'other' => q(චාපමිනිත්තු {0}),
					},
					# Core Unit Identifier
					'arc-minute' => {
						'name' => q(චාපමිනිත්තු),
						'one' => q(චාපමිනිත්තු {0}),
						'other' => q(චාපමිනිත්තු {0}),
					},
					# Long Unit Identifier
					'angle-arc-second' => {
						'name' => q(චාපතත්පර),
						'one' => q(චාපතත්පර {0}),
						'other' => q(චාපතත්පර {0}),
					},
					# Core Unit Identifier
					'arc-second' => {
						'name' => q(චාපතත්පර),
						'one' => q(චාපතත්පර {0}),
						'other' => q(චාපතත්පර {0}),
					},
					# Long Unit Identifier
					'angle-degree' => {
						'name' => q(අංශක),
						'one' => q(අංශක {0}),
						'other' => q(අංශක {0}),
					},
					# Core Unit Identifier
					'degree' => {
						'name' => q(අංශක),
						'one' => q(අංශක {0}),
						'other' => q(අංශක {0}),
					},
					# Long Unit Identifier
					'angle-radian' => {
						'name' => q(රේඩියන්),
						'one' => q(රේඩි {0}),
						'other' => q(රේඩි {0}),
					},
					# Core Unit Identifier
					'radian' => {
						'name' => q(රේඩියන්),
						'one' => q(රේඩි {0}),
						'other' => q(රේඩි {0}),
					},
					# Long Unit Identifier
					'angle-revolution' => {
						'name' => q(පරිභ්‍ර),
						'one' => q(පරිභ්‍ර {0}),
						'other' => q(පරිභ්‍ර {0}),
					},
					# Core Unit Identifier
					'revolution' => {
						'name' => q(පරිභ්‍ර),
						'one' => q(පරිභ්‍ර {0}),
						'other' => q(පරිභ්‍ර {0}),
					},
					# Long Unit Identifier
					'area-acre' => {
						'name' => q(අක්කර),
						'one' => q(අක්කර {0}),
						'other' => q(අක්කර {0}),
					},
					# Core Unit Identifier
					'acre' => {
						'name' => q(අක්කර),
						'one' => q(අක්කර {0}),
						'other' => q(අක්කර {0}),
					},
					# Long Unit Identifier
					'area-dunam' => {
						'name' => q(ඩනම්ස්),
						'one' => q({0} ඩනම්ස්),
						'other' => q({0} ඩනම්ස්),
					},
					# Core Unit Identifier
					'dunam' => {
						'name' => q(ඩනම්ස්),
						'one' => q({0} ඩනම්ස්),
						'other' => q({0} ඩනම්ස්),
					},
					# Long Unit Identifier
					'area-hectare' => {
						'name' => q(හෙක්ටයාර්),
						'one' => q(හෙක් {0}),
						'other' => q(හෙක් {0}),
					},
					# Core Unit Identifier
					'hectare' => {
						'name' => q(හෙක්ටයාර්),
						'one' => q(හෙක් {0}),
						'other' => q(හෙක් {0}),
					},
					# Long Unit Identifier
					'area-square-centimeter' => {
						'name' => q(වසෙ),
						'one' => q(වසෙ {0}),
						'other' => q(වසෙ {0}),
						'per' => q({0}/වසෙ),
					},
					# Core Unit Identifier
					'square-centimeter' => {
						'name' => q(වසෙ),
						'one' => q(වසෙ {0}),
						'other' => q(වසෙ {0}),
						'per' => q({0}/වසෙ),
					},
					# Long Unit Identifier
					'area-square-foot' => {
						'name' => q(වර්ග අඩි),
						'one' => q(වර්ග අඩි {0}),
						'other' => q(වර්ග අඩි {0}),
					},
					# Core Unit Identifier
					'square-foot' => {
						'name' => q(වර්ග අඩි),
						'one' => q(වර්ග අඩි {0}),
						'other' => q(වර්ග අඩි {0}),
					},
					# Long Unit Identifier
					'area-square-inch' => {
						'name' => q(වර්ග අඟල්),
						'one' => q(වඅ {0}),
						'other' => q(වඅ {0}),
						'per' => q({0}/වඅ),
					},
					# Core Unit Identifier
					'square-inch' => {
						'name' => q(වර්ග අඟල්),
						'one' => q(වඅ {0}),
						'other' => q(වඅ {0}),
						'per' => q({0}/වඅ),
					},
					# Long Unit Identifier
					'area-square-kilometer' => {
						'name' => q(ව.කී),
						'one' => q(ව.කී {0}),
						'other' => q(ව.කී {0}),
						'per' => q({0} කට වර්ග කිලෝමීටර්),
					},
					# Core Unit Identifier
					'square-kilometer' => {
						'name' => q(ව.කී),
						'one' => q(ව.කී {0}),
						'other' => q(ව.කී {0}),
						'per' => q({0} කට වර්ග කිලෝමීටර්),
					},
					# Long Unit Identifier
					'area-square-meter' => {
						'name' => q(වර්ග මීටර්),
						'one' => q(ව.මී {0}),
						'other' => q(ව.මී {0}),
						'per' => q({0}/ව.මී),
					},
					# Core Unit Identifier
					'square-meter' => {
						'name' => q(වර්ග මීටර්),
						'one' => q(ව.මී {0}),
						'other' => q(ව.මී {0}),
						'per' => q({0}/ව.මී),
					},
					# Long Unit Identifier
					'area-square-mile' => {
						'name' => q(වර්ග සැතපුම්),
						'one' => q(ව.සැ {0}),
						'other' => q(ව.සැ {0}),
						'per' => q({0} කට ව.සැ),
					},
					# Core Unit Identifier
					'square-mile' => {
						'name' => q(වර්ග සැතපුම්),
						'one' => q(ව.සැ {0}),
						'other' => q(ව.සැ {0}),
						'per' => q({0} කට ව.සැ),
					},
					# Long Unit Identifier
					'area-square-yard' => {
						'name' => q(වර්ග යාර),
						'one' => q(වයා {0}),
						'other' => q(වයා {0}),
					},
					# Core Unit Identifier
					'square-yard' => {
						'name' => q(වර්ග යාර),
						'one' => q(වයා {0}),
						'other' => q(වයා {0}),
					},
					# Long Unit Identifier
					'concentr-item' => {
						'name' => q(අයිතමය),
						'one' => q({0} අයිතමයක්),
						'other' => q(අයිතම {0}ක්),
					},
					# Core Unit Identifier
					'item' => {
						'name' => q(අයිතමය),
						'one' => q({0} අයිතමයක්),
						'other' => q(අයිතම {0}ක්),
					},
					# Long Unit Identifier
					'concentr-karat' => {
						'name' => q(ක්‍රාත්),
						'one' => q(ක්‍රාත් {0}),
						'other' => q(ක්‍රාත් {0}),
					},
					# Core Unit Identifier
					'karat' => {
						'name' => q(ක්‍රාත්),
						'one' => q(ක්‍රාත් {0}),
						'other' => q(ක්‍රාත් {0}),
					},
					# Long Unit Identifier
					'concentr-milligram-ofglucose-per-deciliter' => {
						'name' => q(මිග්‍රෑ/ඩෙලි),
						'one' => q({0} මිග්‍රෑ/ඩෙලි),
						'other' => q({0} මිග්‍රෑ/ඩෙලි),
					},
					# Core Unit Identifier
					'milligram-ofglucose-per-deciliter' => {
						'name' => q(මිග්‍රෑ/ඩෙලි),
						'one' => q({0} මිග්‍රෑ/ඩෙලි),
						'other' => q({0} මිග්‍රෑ/ඩෙලි),
					},
					# Long Unit Identifier
					'concentr-millimole-per-liter' => {
						'name' => q(මිලිමෝල්/ලීටර්),
						'one' => q({0} මිමෝල්/ලී),
						'other' => q({0} මිමෝල්/ලී),
					},
					# Core Unit Identifier
					'millimole-per-liter' => {
						'name' => q(මිලිමෝල්/ලීටර්),
						'one' => q({0} මිමෝල්/ලී),
						'other' => q({0} මිමෝල්/ලී),
					},
					# Long Unit Identifier
					'concentr-mole' => {
						'name' => q(මවුල),
						'one' => q({0} මවුල),
						'other' => q({0} මවුල),
					},
					# Core Unit Identifier
					'mole' => {
						'name' => q(මවුල),
						'one' => q({0} මවුල),
						'other' => q({0} මවුල),
					},
					# Long Unit Identifier
					'concentr-percent' => {
						'name' => q(ප්‍රතිශතය),
					},
					# Core Unit Identifier
					'percent' => {
						'name' => q(ප්‍රතිශතය),
					},
					# Long Unit Identifier
					'concentr-permillion' => {
						'name' => q(කොටස්/මිලියනය),
						'one' => q({0} මිලිකො),
						'other' => q({0} මිලිකො),
					},
					# Core Unit Identifier
					'permillion' => {
						'name' => q(කොටස්/මිලියනය),
						'one' => q({0} මිලිකො),
						'other' => q({0} මිලිකො),
					},
					# Long Unit Identifier
					'concentr-permyriad' => {
						'name' => q(පර්මැරියඩ්),
					},
					# Core Unit Identifier
					'permyriad' => {
						'name' => q(පර්මැරියඩ්),
					},
					# Long Unit Identifier
					'consumption-liter-per-100-kilometer' => {
						'name' => q(ලී/කිමී100),
						'one' => q(ලී/කිමී100 {0}),
						'other' => q(ලී/100කිමී {0}),
					},
					# Core Unit Identifier
					'liter-per-100-kilometer' => {
						'name' => q(ලී/කිමී100),
						'one' => q(ලී/කිමී100 {0}),
						'other' => q(ලී/100කිමී {0}),
					},
					# Long Unit Identifier
					'consumption-liter-per-kilometer' => {
						'name' => q(ලීටරය/කිමී),
						'one' => q(ලී/කිමී {0}),
						'other' => q(ලී/කිමී {0}),
					},
					# Core Unit Identifier
					'liter-per-kilometer' => {
						'name' => q(ලීටරය/කිමී),
						'one' => q(ලී/කිමී {0}),
						'other' => q(ලී/කිමී {0}),
					},
					# Long Unit Identifier
					'consumption-mile-per-gallon' => {
						'name' => q(හැතැප්ම/ගැලු),
						'one' => q(හැගැ {0}),
						'other' => q(හැගැ {0}),
					},
					# Core Unit Identifier
					'mile-per-gallon' => {
						'name' => q(හැතැප්ම/ගැලු),
						'one' => q(හැගැ {0}),
						'other' => q(හැගැ {0}),
					},
					# Long Unit Identifier
					'consumption-mile-per-gallon-imperial' => {
						'name' => q(හැතැප්ම/ගැලුම්),
						'one' => q({0} ගැහැ),
						'other' => q({0} ගැහැ),
					},
					# Core Unit Identifier
					'mile-per-gallon-imperial' => {
						'name' => q(හැතැප්ම/ගැලුම්),
						'one' => q({0} ගැහැ),
						'other' => q({0} ගැහැ),
					},
					# Long Unit Identifier
					'coordinate' => {
						'east' => q({0}නැ),
						'north' => q({0}උ),
						'south' => q({0}ද),
						'west' => q({0}බ),
					},
					# Core Unit Identifier
					'coordinate' => {
						'east' => q({0}නැ),
						'north' => q({0}උ),
						'south' => q({0}ද),
						'west' => q({0}බ),
					},
					# Long Unit Identifier
					'digital-bit' => {
						'name' => q(බීට්),
						'one' => q(බීට් {0}),
						'other' => q(බීට් {0}),
					},
					# Core Unit Identifier
					'bit' => {
						'name' => q(බීට්),
						'one' => q(බීට් {0}),
						'other' => q(බීට් {0}),
					},
					# Long Unit Identifier
					'digital-byte' => {
						'name' => q(බයිට්),
						'one' => q(බයිට් {0}),
						'other' => q(බයිට් {0}),
					},
					# Core Unit Identifier
					'byte' => {
						'name' => q(බයිට්),
						'one' => q(බයිට් {0}),
						'other' => q(බයිට් {0}),
					},
					# Long Unit Identifier
					'digital-gigabit' => {
						'name' => q(ගිබීට්),
						'one' => q(ගිබී {0}),
						'other' => q(ගිබී {0}),
					},
					# Core Unit Identifier
					'gigabit' => {
						'name' => q(ගිබීට්),
						'one' => q(ගිබී {0}),
						'other' => q(ගිබී {0}),
					},
					# Long Unit Identifier
					'digital-gigabyte' => {
						'name' => q(ගිබයිට්‌),
						'one' => q(ගිබ {0}),
						'other' => q(ගිබ {0}),
					},
					# Core Unit Identifier
					'gigabyte' => {
						'name' => q(ගිබයිට්‌),
						'one' => q(ගිබ {0}),
						'other' => q(ගිබ {0}),
					},
					# Long Unit Identifier
					'digital-kilobit' => {
						'name' => q(කිබීට්),
						'one' => q(කිබී {0}),
						'other' => q(කිබී {0}),
					},
					# Core Unit Identifier
					'kilobit' => {
						'name' => q(කිබීට්),
						'one' => q(කිබී {0}),
						'other' => q(කිබී {0}),
					},
					# Long Unit Identifier
					'digital-kilobyte' => {
						'name' => q(කිබයිට්),
						'one' => q(කිබ {0}),
						'other' => q(කිබ {0}),
					},
					# Core Unit Identifier
					'kilobyte' => {
						'name' => q(කිබයිට්),
						'one' => q(කිබ {0}),
						'other' => q(කිබ {0}),
					},
					# Long Unit Identifier
					'digital-megabit' => {
						'name' => q(මෙබීට්),
						'one' => q(මෙබි {0}),
						'other' => q(මෙබි {0}),
					},
					# Core Unit Identifier
					'megabit' => {
						'name' => q(මෙබීට්),
						'one' => q(මෙබි {0}),
						'other' => q(මෙබි {0}),
					},
					# Long Unit Identifier
					'digital-megabyte' => {
						'name' => q(මෙබයිට්),
						'one' => q(මෙබ {0}),
						'other' => q(මෙබ {0}),
					},
					# Core Unit Identifier
					'megabyte' => {
						'name' => q(මෙබයිට්),
						'one' => q(මෙබ {0}),
						'other' => q(මෙබ {0}),
					},
					# Long Unit Identifier
					'digital-petabyte' => {
						'name' => q(පෙබයිට්),
						'one' => q(පෙබ {0}),
						'other' => q(පෙබ {0}),
					},
					# Core Unit Identifier
					'petabyte' => {
						'name' => q(පෙබයිට්),
						'one' => q(පෙබ {0}),
						'other' => q(පෙබ {0}),
					},
					# Long Unit Identifier
					'digital-terabit' => {
						'name' => q(ටෙබිට්),
						'one' => q(ටේබි {0}),
						'other' => q(ටේබි {0}),
					},
					# Core Unit Identifier
					'terabit' => {
						'name' => q(ටෙබිට්),
						'one' => q(ටේබි {0}),
						'other' => q(ටේබි {0}),
					},
					# Long Unit Identifier
					'digital-terabyte' => {
						'name' => q(ටෙබයිට්),
						'one' => q(ටෙබ {0}),
						'other' => q(ටෙබ {0}),
					},
					# Core Unit Identifier
					'terabyte' => {
						'name' => q(ටෙබයිට්),
						'one' => q(ටෙබ {0}),
						'other' => q(ටෙබ {0}),
					},
					# Long Unit Identifier
					'duration-century' => {
						'name' => q(සි),
						'one' => q(සි {0}),
						'other' => q(සි {0}),
					},
					# Core Unit Identifier
					'century' => {
						'name' => q(සි),
						'one' => q(සි {0}),
						'other' => q(සි {0}),
					},
					# Long Unit Identifier
					'duration-day' => {
						'name' => q(දින),
						'one' => q(දින {0}),
						'other' => q(දින {0}),
						'per' => q({0}/දි),
					},
					# Core Unit Identifier
					'day' => {
						'name' => q(දින),
						'one' => q(දින {0}),
						'other' => q(දින {0}),
						'per' => q({0}/දි),
					},
					# Long Unit Identifier
					'duration-decade' => {
						'name' => q(දශක),
						'one' => q(දශක {0}),
						'other' => q(දශක {0}),
					},
					# Core Unit Identifier
					'decade' => {
						'name' => q(දශක),
						'one' => q(දශක {0}),
						'other' => q(දශක {0}),
					},
					# Long Unit Identifier
					'duration-hour' => {
						'name' => q(පැය),
						'one' => q(පැය {0}),
						'other' => q(පැය {0}),
						'per' => q(පැයට {0}),
					},
					# Core Unit Identifier
					'hour' => {
						'name' => q(පැය),
						'one' => q(පැය {0}),
						'other' => q(පැය {0}),
						'per' => q(පැයට {0}),
					},
					# Long Unit Identifier
					'duration-microsecond' => {
						'name' => q(මයික්‍රොතත්),
						'one' => q(මයික්‍රොතත් {0}),
						'other' => q(මයික්‍රොතත් {0}),
					},
					# Core Unit Identifier
					'microsecond' => {
						'name' => q(මයික්‍රොතත්),
						'one' => q(මයික්‍රොතත් {0}),
						'other' => q(මයික්‍රොතත් {0}),
					},
					# Long Unit Identifier
					'duration-millisecond' => {
						'name' => q(මිලිතත්පර),
						'one' => q(මිලිතත් {0}),
						'other' => q(මිලිතත් {0}),
					},
					# Core Unit Identifier
					'millisecond' => {
						'name' => q(මිලිතත්පර),
						'one' => q(මිලිතත් {0}),
						'other' => q(මිලිතත් {0}),
					},
					# Long Unit Identifier
					'duration-minute' => {
						'name' => q(මිනි),
						'one' => q(මිනි {0}),
						'other' => q(මිනි {0}),
						'per' => q({0}/මිනි),
					},
					# Core Unit Identifier
					'minute' => {
						'name' => q(මිනි),
						'one' => q(මිනි {0}),
						'other' => q(මිනි {0}),
						'per' => q({0}/මිනි),
					},
					# Long Unit Identifier
					'duration-month' => {
						'name' => q(මාස),
						'one' => q(මාස {0}),
						'other' => q(මාස {0}),
						'per' => q({0}/මා),
					},
					# Core Unit Identifier
					'month' => {
						'name' => q(මාස),
						'one' => q(මාස {0}),
						'other' => q(මාස {0}),
						'per' => q({0}/මා),
					},
					# Long Unit Identifier
					'duration-nanosecond' => {
						'name' => q(නැනෝතත්),
						'one' => q(නැත {0}),
						'other' => q(නැත {0}),
					},
					# Core Unit Identifier
					'nanosecond' => {
						'name' => q(නැනෝතත්),
						'one' => q(නැත {0}),
						'other' => q(නැත {0}),
					},
					# Long Unit Identifier
					'duration-quarter' => {
						'name' => q(කාල),
						'one' => q(කා {0}),
						'other' => q(කා {0}),
						'per' => q({0}/කා),
					},
					# Core Unit Identifier
					'quarter' => {
						'name' => q(කාල),
						'one' => q(කා {0}),
						'other' => q(කා {0}),
						'per' => q({0}/කා),
					},
					# Long Unit Identifier
					'duration-second' => {
						'name' => q(තත්පර),
						'one' => q(තත් {0}),
						'other' => q(තත් {0}),
						'per' => q(තත්පරයට {0}),
					},
					# Core Unit Identifier
					'second' => {
						'name' => q(තත්පර),
						'one' => q(තත් {0}),
						'other' => q(තත් {0}),
						'per' => q(තත්පරයට {0}),
					},
					# Long Unit Identifier
					'duration-week' => {
						'name' => q(සති),
						'one' => q(සති {0}),
						'other' => q(සති {0}),
						'per' => q({0}/ස),
					},
					# Core Unit Identifier
					'week' => {
						'name' => q(සති),
						'one' => q(සති {0}),
						'other' => q(සති {0}),
						'per' => q({0}/ස),
					},
					# Long Unit Identifier
					'duration-year' => {
						'name' => q(වසර),
						'one' => q(වසර {0}),
						'other' => q(වසර {0}),
						'per' => q({0}/ව),
					},
					# Core Unit Identifier
					'year' => {
						'name' => q(වසර),
						'one' => q(වසර {0}),
						'other' => q(වසර {0}),
						'per' => q({0}/ව),
					},
					# Long Unit Identifier
					'electric-ampere' => {
						'name' => q(ඇම්පිර),
						'one' => q(ඇ {0}),
						'other' => q(ඇ {0}),
					},
					# Core Unit Identifier
					'ampere' => {
						'name' => q(ඇම්පිර),
						'one' => q(ඇ {0}),
						'other' => q(ඇ {0}),
					},
					# Long Unit Identifier
					'electric-milliampere' => {
						'name' => q(මිලිඇම්පිර),
						'one' => q(මිඇ {0}),
						'other' => q(මිඇ {0}),
					},
					# Core Unit Identifier
					'milliampere' => {
						'name' => q(මිලිඇම්පිර),
						'one' => q(මිඇ {0}),
						'other' => q(මිඇ {0}),
					},
					# Long Unit Identifier
					'electric-ohm' => {
						'name' => q(ඕම්),
					},
					# Core Unit Identifier
					'ohm' => {
						'name' => q(ඕම්),
					},
					# Long Unit Identifier
					'electric-volt' => {
						'name' => q(වෝල්ට්),
						'one' => q(වෝ {0}),
						'other' => q(වෝ {0}),
					},
					# Core Unit Identifier
					'volt' => {
						'name' => q(වෝල්ට්),
						'one' => q(වෝ {0}),
						'other' => q(වෝ {0}),
					},
					# Long Unit Identifier
					'energy-british-thermal-unit' => {
						'name' => q(බ්‍රිතාඒ),
						'one' => q({0} බ්‍රිතාඒ),
						'other' => q({0} බ්‍රිතාඒ),
					},
					# Core Unit Identifier
					'british-thermal-unit' => {
						'name' => q(බ්‍රිතාඒ),
						'one' => q({0} බ්‍රිතාඒ),
						'other' => q({0} බ්‍රිතාඒ),
					},
					# Long Unit Identifier
					'energy-calorie' => {
						'name' => q(කැල),
						'one' => q(කැල {0}),
						'other' => q(කැල {0}),
					},
					# Core Unit Identifier
					'calorie' => {
						'name' => q(කැල),
						'one' => q(කැල {0}),
						'other' => q(කැල {0}),
					},
					# Long Unit Identifier
					'energy-electronvolt' => {
						'name' => q(ඉලේට්‍රෝන වෝල්ට්),
						'one' => q({0} ඉවෝ),
						'other' => q({0} ඉවෝ),
					},
					# Core Unit Identifier
					'electronvolt' => {
						'name' => q(ඉලේට්‍රෝන වෝල්ට්),
						'one' => q({0} ඉවෝ),
						'other' => q({0} ඉවෝ),
					},
					# Long Unit Identifier
					'energy-foodcalorie' => {
						'name' => q(කැල),
						'one' => q(කැල {0}),
						'other' => q(කැල {0}),
					},
					# Core Unit Identifier
					'foodcalorie' => {
						'name' => q(කැල),
						'one' => q(කැල {0}),
						'other' => q(කැල {0}),
					},
					# Long Unit Identifier
					'energy-joule' => {
						'name' => q(ජුල්),
						'one' => q(ජු {0}),
						'other' => q(ජු {0}),
					},
					# Core Unit Identifier
					'joule' => {
						'name' => q(ජුල්),
						'one' => q(ජු {0}),
						'other' => q(ජු {0}),
					},
					# Long Unit Identifier
					'energy-kilocalorie' => {
						'name' => q(කිකැලරි),
						'one' => q(කිකැලරි {0}),
						'other' => q(කිකැලරි {0}),
					},
					# Core Unit Identifier
					'kilocalorie' => {
						'name' => q(කිකැලරි),
						'one' => q(කිකැලරි {0}),
						'other' => q(කිකැලරි {0}),
					},
					# Long Unit Identifier
					'energy-kilojoule' => {
						'name' => q(කිලෝ ජුල්),
						'one' => q(කිජු {0}),
						'other' => q(කිජු {0}),
					},
					# Core Unit Identifier
					'kilojoule' => {
						'name' => q(කිලෝ ජුල්),
						'one' => q(කිජු {0}),
						'other' => q(කිජු {0}),
					},
					# Long Unit Identifier
					'energy-kilowatt-hour' => {
						'name' => q(කිවො-පැය),
						'one' => q(කිවො-පැය {0}),
						'other' => q(කිවො-පැය {0}),
					},
					# Core Unit Identifier
					'kilowatt-hour' => {
						'name' => q(කිවො-පැය),
						'one' => q(කිවො-පැය {0}),
						'other' => q(කිවො-පැය {0}),
					},
					# Long Unit Identifier
					'energy-therm-us' => {
						'name' => q(එක්සත් ජනපද තාප ඒකකය),
						'one' => q(එ. ජ. තාප ඒකක {0}),
						'other' => q(එ. ජ. තාප ඒකක {0}),
					},
					# Core Unit Identifier
					'therm-us' => {
						'name' => q(එක්සත් ජනපද තාප ඒකකය),
						'one' => q(එ. ජ. තාප ඒකක {0}),
						'other' => q(එ. ජ. තාප ඒකක {0}),
					},
					# Long Unit Identifier
					'force-kilowatt-hour-per-100-kilometer' => {
						'name' => q(කිවොපැ/100කිමී),
						'one' => q({0} කිවොපැ/100කිමී),
						'other' => q({0} කිවොපැ/100කිමී),
					},
					# Core Unit Identifier
					'kilowatt-hour-per-100-kilometer' => {
						'name' => q(කිවොපැ/100කිමී),
						'one' => q({0} කිවොපැ/100කිමී),
						'other' => q({0} කිවොපැ/100කිමී),
					},
					# Long Unit Identifier
					'force-newton' => {
						'name' => q(නිව්ටන්),
						'one' => q({0} නි),
						'other' => q({0} නි),
					},
					# Core Unit Identifier
					'newton' => {
						'name' => q(නිව්ටන්),
						'one' => q({0} නි),
						'other' => q({0} නි),
					},
					# Long Unit Identifier
					'force-pound-force' => {
						'name' => q(බලයට-රාත්තල්),
						'one' => q({0} බරා),
						'other' => q({0} බරා),
					},
					# Core Unit Identifier
					'pound-force' => {
						'name' => q(බලයට-රාත්තල්),
						'one' => q({0} බරා),
						'other' => q({0} බරා),
					},
					# Long Unit Identifier
					'frequency-gigahertz' => {
						'name' => q(ගිහස්),
						'one' => q(ගිහස් {0}),
						'other' => q(ගිහස් {0}),
					},
					# Core Unit Identifier
					'gigahertz' => {
						'name' => q(ගිහස්),
						'one' => q(ගිහස් {0}),
						'other' => q(ගිහස් {0}),
					},
					# Long Unit Identifier
					'frequency-hertz' => {
						'name' => q(හස්),
						'one' => q(හස් {0}),
						'other' => q(හස් {0}),
					},
					# Core Unit Identifier
					'hertz' => {
						'name' => q(හස්),
						'one' => q(හස් {0}),
						'other' => q(හස් {0}),
					},
					# Long Unit Identifier
					'frequency-kilohertz' => {
						'name' => q(කිහස්),
						'one' => q(කිහස් {0}),
						'other' => q(කිහස් {0}),
					},
					# Core Unit Identifier
					'kilohertz' => {
						'name' => q(කිහස්),
						'one' => q(කිහස් {0}),
						'other' => q(කිහස් {0}),
					},
					# Long Unit Identifier
					'frequency-megahertz' => {
						'name' => q(මෙග),
						'one' => q(මෙහ {0}),
						'other' => q(මෙහ {0}),
					},
					# Core Unit Identifier
					'megahertz' => {
						'name' => q(මෙග),
						'one' => q(මෙහ {0}),
						'other' => q(මෙහ {0}),
					},
					# Long Unit Identifier
					'graphics-dot' => {
						'name' => q(තිත්),
						'one' => q({0} තිත),
						'other' => q(තිත් {0}),
					},
					# Core Unit Identifier
					'dot' => {
						'name' => q(තිත්),
						'one' => q({0} තිත),
						'other' => q(තිත් {0}),
					},
					# Long Unit Identifier
					'graphics-dot-per-centimeter' => {
						'name' => q(සෙමීති),
						'one' => q(සෙමීති {0}),
						'other' => q(සෙමීති {0}),
					},
					# Core Unit Identifier
					'dot-per-centimeter' => {
						'name' => q(සෙමීති),
						'one' => q(සෙමීති {0}),
						'other' => q(සෙමීති {0}),
					},
					# Long Unit Identifier
					'graphics-dot-per-inch' => {
						'name' => q(අටති),
						'one' => q(අටති {0}),
						'other' => q(අටති {0}),
					},
					# Core Unit Identifier
					'dot-per-inch' => {
						'name' => q(අටති),
						'one' => q(අටති {0}),
						'other' => q(අටති {0}),
					},
					# Long Unit Identifier
					'graphics-megapixel' => {
						'name' => q(මෙගාපික්සල්),
					},
					# Core Unit Identifier
					'megapixel' => {
						'name' => q(මෙගාපික්සල්),
					},
					# Long Unit Identifier
					'graphics-pixel' => {
						'name' => q(පික්සල්),
					},
					# Core Unit Identifier
					'pixel' => {
						'name' => q(පික්සල්),
					},
					# Long Unit Identifier
					'length-astronomical-unit' => {
						'name' => q(නඒ),
						'one' => q(නඒ {0}),
						'other' => q(නඒ {0}),
					},
					# Core Unit Identifier
					'astronomical-unit' => {
						'name' => q(නඒ),
						'one' => q(නඒ {0}),
						'other' => q(නඒ {0}),
					},
					# Long Unit Identifier
					'length-centimeter' => {
						'name' => q(සෙ.මී),
						'one' => q(සෙ.මී {0}),
						'other' => q(සෙ.මී {0}),
						'per' => q({0}/සෙ.මී),
					},
					# Core Unit Identifier
					'centimeter' => {
						'name' => q(සෙ.මී),
						'one' => q(සෙ.මී {0}),
						'other' => q(සෙ.මී {0}),
						'per' => q({0}/සෙ.මී),
					},
					# Long Unit Identifier
					'length-decimeter' => {
						'name' => q(ඩෙමී),
						'one' => q(ඩෙමී {0}),
						'other' => q(ඩෙමී {0}),
					},
					# Core Unit Identifier
					'decimeter' => {
						'name' => q(ඩෙමී),
						'one' => q(ඩෙමී {0}),
						'other' => q(ඩෙමී {0}),
					},
					# Long Unit Identifier
					'length-fathom' => {
						'name' => q(බඹය),
						'one' => q(බඹ {0}),
						'other' => q(බඹ {0}),
					},
					# Core Unit Identifier
					'fathom' => {
						'name' => q(බඹය),
						'one' => q(බඹ {0}),
						'other' => q(බඹ {0}),
					},
					# Long Unit Identifier
					'length-foot' => {
						'name' => q(අඩි),
						'one' => q(අඩි {0}),
						'other' => q(අඩි {0}),
						'per' => q({0}/අඩි),
					},
					# Core Unit Identifier
					'foot' => {
						'name' => q(අඩි),
						'one' => q(අඩි {0}),
						'other' => q(අඩි {0}),
						'per' => q({0}/අඩි),
					},
					# Long Unit Identifier
					'length-furlong' => {
						'name' => q(පර්ලොම),
						'one' => q(පර්ලොම {0}),
						'other' => q(පර්ලොම {0}),
					},
					# Core Unit Identifier
					'furlong' => {
						'name' => q(පර්ලොම),
						'one' => q(පර්ලොම {0}),
						'other' => q(පර්ලොම {0}),
					},
					# Long Unit Identifier
					'length-inch' => {
						'name' => q(අඟල්),
						'one' => q(අඟල් {0}),
						'other' => q(අඟල් {0}),
						'per' => q({0}/අඟල්),
					},
					# Core Unit Identifier
					'inch' => {
						'name' => q(අඟල්),
						'one' => q(අඟල් {0}),
						'other' => q(අඟල් {0}),
						'per' => q({0}/අඟල්),
					},
					# Long Unit Identifier
					'length-kilometer' => {
						'name' => q(කි.මී),
						'one' => q(කි.මී {0}),
						'other' => q(කි.මී {0}),
						'per' => q({0}/කි.මී),
					},
					# Core Unit Identifier
					'kilometer' => {
						'name' => q(කි.මී),
						'one' => q(කි.මී {0}),
						'other' => q(කි.මී {0}),
						'per' => q({0}/කි.මී),
					},
					# Long Unit Identifier
					'length-light-year' => {
						'name' => q(ආලෝක වර්ෂ),
						'one' => q(ආ.ව {0}),
						'other' => q(ආ.ව {0}),
					},
					# Core Unit Identifier
					'light-year' => {
						'name' => q(ආලෝක වර්ෂ),
						'one' => q(ආ.ව {0}),
						'other' => q(ආ.ව {0}),
					},
					# Long Unit Identifier
					'length-meter' => {
						'name' => q(මීටර්),
						'one' => q(මී {0}),
						'other' => q(මී {0}),
						'per' => q({0}/මී),
					},
					# Core Unit Identifier
					'meter' => {
						'name' => q(මීටර්),
						'one' => q(මී {0}),
						'other' => q(මී {0}),
						'per' => q({0}/මී),
					},
					# Long Unit Identifier
					'length-micrometer' => {
						'name' => q(මමීටර),
						'one' => q(මමී {0}),
						'other' => q(මමී {0}),
					},
					# Core Unit Identifier
					'micrometer' => {
						'name' => q(මමීටර),
						'one' => q(මමී {0}),
						'other' => q(මමී {0}),
					},
					# Long Unit Identifier
					'length-mile' => {
						'name' => q(සැතපුම්),
						'one' => q(සැත {0}),
						'other' => q(සැත {0}),
					},
					# Core Unit Identifier
					'mile' => {
						'name' => q(සැතපුම්),
						'one' => q(සැත {0}),
						'other' => q(සැත {0}),
					},
					# Long Unit Identifier
					'length-mile-scandinavian' => {
						'name' => q(ස්කැන්සැත),
						'one' => q(ස්කැසැත {0}),
						'other' => q(ස්කැසැත {0}),
					},
					# Core Unit Identifier
					'mile-scandinavian' => {
						'name' => q(ස්කැන්සැත),
						'one' => q(ස්කැසැත {0}),
						'other' => q(ස්කැසැත {0}),
					},
					# Long Unit Identifier
					'length-millimeter' => {
						'name' => q(මිමී),
						'one' => q(මිමී {0}),
						'other' => q(මිමී {0}),
					},
					# Core Unit Identifier
					'millimeter' => {
						'name' => q(මිමී),
						'one' => q(මිමී {0}),
						'other' => q(මිමී {0}),
					},
					# Long Unit Identifier
					'length-nanometer' => {
						'name' => q(නැමී),
						'one' => q(නැමී {0}),
						'other' => q(නැමී {0}),
					},
					# Core Unit Identifier
					'nanometer' => {
						'name' => q(නැමී),
						'one' => q(නැමී {0}),
						'other' => q(නැමී {0}),
					},
					# Long Unit Identifier
					'length-nautical-mile' => {
						'name' => q(නාසැත),
						'one' => q(නාසැත {0}),
						'other' => q(නාසැත {0}),
					},
					# Core Unit Identifier
					'nautical-mile' => {
						'name' => q(නාසැත),
						'one' => q(නාසැත {0}),
						'other' => q(නාසැත {0}),
					},
					# Long Unit Identifier
					'length-parsec' => {
						'name' => q(පාර්සෙක්),
						'one' => q(පාසෙ {0}),
						'other' => q(පාසෙ {0}),
					},
					# Core Unit Identifier
					'parsec' => {
						'name' => q(පාර්සෙක්),
						'one' => q(පාසෙ {0}),
						'other' => q(පාසෙ {0}),
					},
					# Long Unit Identifier
					'length-picometer' => {
						'name' => q(පිකොමිටර්),
						'one' => q(පිමී {0}),
						'other' => q(පිමී {0}),
					},
					# Core Unit Identifier
					'picometer' => {
						'name' => q(පිකොමිටර්),
						'one' => q(පිමී {0}),
						'other' => q(පිමී {0}),
					},
					# Long Unit Identifier
					'length-point' => {
						'name' => q(පොයින්ට්),
						'one' => q(පො {0}),
						'other' => q(පො {0}),
					},
					# Core Unit Identifier
					'point' => {
						'name' => q(පොයින්ට්),
						'one' => q(පො {0}),
						'other' => q(පො {0}),
					},
					# Long Unit Identifier
					'length-solar-radius' => {
						'name' => q(සූර්ය අරය),
						'one' => q({0} අ☉),
						'other' => q({0} අ☉),
					},
					# Core Unit Identifier
					'solar-radius' => {
						'name' => q(සූර්ය අරය),
						'one' => q({0} අ☉),
						'other' => q({0} අ☉),
					},
					# Long Unit Identifier
					'length-yard' => {
						'name' => q(යාර),
						'one' => q(යාර {0}),
						'other' => q(යාර {0}),
					},
					# Core Unit Identifier
					'yard' => {
						'name' => q(යාර),
						'one' => q(යාර {0}),
						'other' => q(යාර {0}),
					},
					# Long Unit Identifier
					'light-candela' => {
						'name' => q(කැන්ඩෙලා),
						'one' => q(කැන්ඩෙලා {0}),
						'other' => q(කැන්ඩෙලා {0}),
					},
					# Core Unit Identifier
					'candela' => {
						'name' => q(කැන්ඩෙලා),
						'one' => q(කැන්ඩෙලා {0}),
						'other' => q(කැන්ඩෙලා {0}),
					},
					# Long Unit Identifier
					'light-lumen' => {
						'name' => q(ලූමනය),
						'one' => q(ලූමන {0}),
						'other' => q(ලූමන {0}),
					},
					# Core Unit Identifier
					'lumen' => {
						'name' => q(ලූමනය),
						'one' => q(ලූමන {0}),
						'other' => q(ලූමන {0}),
					},
					# Long Unit Identifier
					'light-lux' => {
						'name' => q(ලක්ස්),
						'one' => q(ලක් {0}),
						'other' => q(ලක් {0}),
					},
					# Core Unit Identifier
					'lux' => {
						'name' => q(ලක්ස්),
						'one' => q(ලක් {0}),
						'other' => q(ලක් {0}),
					},
					# Long Unit Identifier
					'light-solar-luminosity' => {
						'name' => q(සූර්ය දීප්ති),
						'one' => q({0} දි☉),
						'other' => q({0} දි☉),
					},
					# Core Unit Identifier
					'solar-luminosity' => {
						'name' => q(සූර්ය දීප්ති),
						'one' => q({0} දි☉),
						'other' => q({0} දි☉),
					},
					# Long Unit Identifier
					'mass-carat' => {
						'name' => q(කැරට්),
						'one' => q(කැට් {0}),
						'other' => q(කැට් {0}),
					},
					# Core Unit Identifier
					'carat' => {
						'name' => q(කැරට්),
						'one' => q(කැට් {0}),
						'other' => q(කැට් {0}),
					},
					# Long Unit Identifier
					'mass-dalton' => {
						'name' => q(ඩෝල්ටන්),
						'one' => q({0} ඩෝ),
						'other' => q({0} ඩෝ),
					},
					# Core Unit Identifier
					'dalton' => {
						'name' => q(ඩෝල්ටන්),
						'one' => q({0} ඩෝ),
						'other' => q({0} ඩෝ),
					},
					# Long Unit Identifier
					'mass-earth-mass' => {
						'name' => q(පෘථිවි ස්කන්ධ),
						'one' => q({0} ස්⊕),
						'other' => q({0} ස්⊕),
					},
					# Core Unit Identifier
					'earth-mass' => {
						'name' => q(පෘථිවි ස්කන්ධ),
						'one' => q({0} ස්⊕),
						'other' => q({0} ස්⊕),
					},
					# Long Unit Identifier
					'mass-grain' => {
						'name' => q(ඇබිත්ත),
						'one' => q(ඇබිති {0}),
						'other' => q(ඇබිති {0}),
					},
					# Core Unit Identifier
					'grain' => {
						'name' => q(ඇබිත්ත),
						'one' => q(ඇබිති {0}),
						'other' => q(ඇබිති {0}),
					},
					# Long Unit Identifier
					'mass-gram' => {
						'name' => q(ග්‍රෑම්),
						'one' => q(ග්‍රෑ. {0}),
						'other' => q(ග්‍රෑ. {0}),
						'per' => q({0}/ග්‍රෑ.),
					},
					# Core Unit Identifier
					'gram' => {
						'name' => q(ග්‍රෑම්),
						'one' => q(ග්‍රෑ. {0}),
						'other' => q(ග්‍රෑ. {0}),
						'per' => q({0}/ග්‍රෑ.),
					},
					# Long Unit Identifier
					'mass-kilogram' => {
						'name' => q(කි.ග්‍රෑ.),
						'one' => q(කි.ග්‍රෑ. {0}),
						'other' => q(කි.ග්‍රෑ. {0}),
						'per' => q({0}/කි.ග්‍රෑ.),
					},
					# Core Unit Identifier
					'kilogram' => {
						'name' => q(කි.ග්‍රෑ.),
						'one' => q(කි.ග්‍රෑ. {0}),
						'other' => q(කි.ග්‍රෑ. {0}),
						'per' => q({0}/කි.ග්‍රෑ.),
					},
					# Long Unit Identifier
					'mass-microgram' => {
						'name' => q(මග්‍රෑ),
						'one' => q(මග්‍රෑ {0}),
						'other' => q(මග්‍රෑ {0}),
					},
					# Core Unit Identifier
					'microgram' => {
						'name' => q(මග්‍රෑ),
						'one' => q(මග්‍රෑ {0}),
						'other' => q(මග්‍රෑ {0}),
					},
					# Long Unit Identifier
					'mass-milligram' => {
						'name' => q(මිග්‍රෑ),
						'one' => q(මිග්‍රෑ {0}),
						'other' => q(මිග්‍රෑ {0}),
					},
					# Core Unit Identifier
					'milligram' => {
						'name' => q(මිග්‍රෑ),
						'one' => q(මිග්‍රෑ {0}),
						'other' => q(මිග්‍රෑ {0}),
					},
					# Long Unit Identifier
					'mass-ounce' => {
						'name' => q(අවුස),
						'one' => q(අවුස {0}),
						'other' => q(අවුස {0}),
						'per' => q({0}/අවුස),
					},
					# Core Unit Identifier
					'ounce' => {
						'name' => q(අවුස),
						'one' => q(අවුස {0}),
						'other' => q(අවුස {0}),
						'per' => q({0}/අවුස),
					},
					# Long Unit Identifier
					'mass-ounce-troy' => {
						'name' => q(අවුස ට්‍රෝයි),
						'one' => q(අවුස ට්‍රෝ {0}),
						'other' => q(අවුස ට්‍රෝ {0}),
					},
					# Core Unit Identifier
					'ounce-troy' => {
						'name' => q(අවුස ට්‍රෝයි),
						'one' => q(අවුස ට්‍රෝ {0}),
						'other' => q(අවුස ට්‍රෝ {0}),
					},
					# Long Unit Identifier
					'mass-pound' => {
						'name' => q(රාත්තල්),
						'one' => q(රා {0}),
						'other' => q(රා {0}),
						'per' => q({0}/රා),
					},
					# Core Unit Identifier
					'pound' => {
						'name' => q(රාත්තල්),
						'one' => q(රා {0}),
						'other' => q(රා {0}),
						'per' => q({0}/රා),
					},
					# Long Unit Identifier
					'mass-solar-mass' => {
						'name' => q(සූර්ය ස්කන්ධ),
						'one' => q({0} ස්☉),
						'other' => q({0} ස්☉),
					},
					# Core Unit Identifier
					'solar-mass' => {
						'name' => q(සූර්ය ස්කන්ධ),
						'one' => q({0} ස්☉),
						'other' => q({0} ස්☉),
					},
					# Long Unit Identifier
					'mass-stone' => {
						'name' => q(ගල්),
						'one' => q(ගල් {0}),
						'other' => q(ගල් {0}),
					},
					# Core Unit Identifier
					'stone' => {
						'name' => q(ගල්),
						'one' => q(ගල් {0}),
						'other' => q(ගල් {0}),
					},
					# Long Unit Identifier
					'mass-ton' => {
						'name' => q(ටොන්),
						'one' => q(ටොන් {0}),
						'other' => q(ටොන් {0}),
					},
					# Core Unit Identifier
					'ton' => {
						'name' => q(ටොන්),
						'one' => q(ටොන් {0}),
						'other' => q(ටොන් {0}),
					},
					# Long Unit Identifier
					'mass-tonne' => {
						'name' => q(ටො),
						'one' => q(ටො {0}),
						'other' => q(ටො {0}),
					},
					# Core Unit Identifier
					'tonne' => {
						'name' => q(ටො),
						'one' => q(ටො {0}),
						'other' => q(ටො {0}),
					},
					# Long Unit Identifier
					'power-gigawatt' => {
						'name' => q(ගිවො),
						'one' => q(ගිවො {0}),
						'other' => q(ගිවො {0}),
					},
					# Core Unit Identifier
					'gigawatt' => {
						'name' => q(ගිවො),
						'one' => q(ගිවො {0}),
						'other' => q(ගිවො {0}),
					},
					# Long Unit Identifier
					'power-horsepower' => {
						'name' => q(අබ),
						'one' => q(අබ {0}),
						'other' => q(අබ {0}),
					},
					# Core Unit Identifier
					'horsepower' => {
						'name' => q(අබ),
						'one' => q(අබ {0}),
						'other' => q(අබ {0}),
					},
					# Long Unit Identifier
					'power-kilowatt' => {
						'name' => q(කිවො),
						'one' => q(කිවො {0}),
						'other' => q(කිවො {0}),
					},
					# Core Unit Identifier
					'kilowatt' => {
						'name' => q(කිවො),
						'one' => q(කිවො {0}),
						'other' => q(කිවො {0}),
					},
					# Long Unit Identifier
					'power-megawatt' => {
						'name' => q(මෙවො),
						'one' => q(මෙවො {0}),
						'other' => q(මෙවො {0}),
					},
					# Core Unit Identifier
					'megawatt' => {
						'name' => q(මෙවො),
						'one' => q(මෙවො {0}),
						'other' => q(මෙවො {0}),
					},
					# Long Unit Identifier
					'power-milliwatt' => {
						'name' => q(මිවො),
						'one' => q(මිවො {0}),
						'other' => q(මිවො {0}),
					},
					# Core Unit Identifier
					'milliwatt' => {
						'name' => q(මිවො),
						'one' => q(මිවො {0}),
						'other' => q(මිවො {0}),
					},
					# Long Unit Identifier
					'power-watt' => {
						'name' => q(වොට්),
						'one' => q(වොට් {0}),
						'other' => q(වොට් {0}),
					},
					# Core Unit Identifier
					'watt' => {
						'name' => q(වොට්),
						'one' => q(වොට් {0}),
						'other' => q(වොට් {0}),
					},
					# Long Unit Identifier
					'pressure-atmosphere' => {
						'name' => q(වායුගෝ),
						'one' => q(වායුගෝ {0}),
						'other' => q(වායුගෝ {0}),
					},
					# Core Unit Identifier
					'atmosphere' => {
						'name' => q(වායුගෝ),
						'one' => q(වායුගෝ {0}),
						'other' => q(වායුගෝ {0}),
					},
					# Long Unit Identifier
					'pressure-bar' => {
						'name' => q(බාර්),
						'one' => q(බාර් {0}),
						'other' => q(බාර් {0}),
					},
					# Core Unit Identifier
					'bar' => {
						'name' => q(බාර්),
						'one' => q(බාර් {0}),
						'other' => q(බාර් {0}),
					},
					# Long Unit Identifier
					'pressure-hectopascal' => {
						'name' => q(හෙක්ටොපැස්කල්),
						'one' => q(හෙ.පැ {0}),
						'other' => q(හෙ.පැ {0}),
					},
					# Core Unit Identifier
					'hectopascal' => {
						'name' => q(හෙක්ටොපැස්කල්),
						'one' => q(හෙ.පැ {0}),
						'other' => q(හෙ.පැ {0}),
					},
					# Long Unit Identifier
					'pressure-inch-ofhg' => {
						'name' => q(ර අඟ),
						'one' => q(ර අඟ {0}),
						'other' => q(ර අඟ {0}),
					},
					# Core Unit Identifier
					'inch-ofhg' => {
						'name' => q(ර අඟ),
						'one' => q(ර අඟ {0}),
						'other' => q(ර අඟ {0}),
					},
					# Long Unit Identifier
					'pressure-kilopascal' => {
						'name' => q(කිපැස්),
						'one' => q({0} කිපැස්),
						'other' => q({0} කිපැස්),
					},
					# Core Unit Identifier
					'kilopascal' => {
						'name' => q(කිපැස්),
						'one' => q({0} කිපැස්),
						'other' => q({0} කිපැස්),
					},
					# Long Unit Identifier
					'pressure-megapascal' => {
						'name' => q(මෙපැස්),
						'one' => q({0} මෙපැස්),
						'other' => q({0} මෙපැස්),
					},
					# Core Unit Identifier
					'megapascal' => {
						'name' => q(මෙපැස්),
						'one' => q({0} මෙපැස්),
						'other' => q({0} මෙපැස්),
					},
					# Long Unit Identifier
					'pressure-millibar' => {
						'name' => q(මිලිබාර්),
						'one' => q(මි.බාර් {0}),
						'other' => q(මි.බාර් {0}),
					},
					# Core Unit Identifier
					'millibar' => {
						'name' => q(මිලිබාර්),
						'one' => q(මි.බාර් {0}),
						'other' => q(මි.බාර් {0}),
					},
					# Long Unit Identifier
					'pressure-millimeter-ofhg' => {
						'name' => q(ර මිමී),
						'one' => q(ර මිමී {0}),
						'other' => q(ර මිමී {0}),
					},
					# Core Unit Identifier
					'millimeter-ofhg' => {
						'name' => q(ර මිමී),
						'one' => q(ර මිමී {0}),
						'other' => q(ර මිමී {0}),
					},
					# Long Unit Identifier
					'pressure-pascal' => {
						'name' => q(පැස්),
						'one' => q(පැස් {0}),
						'other' => q(පැස් {0}),
					},
					# Core Unit Identifier
					'pascal' => {
						'name' => q(පැස්),
						'one' => q(පැස් {0}),
						'other' => q(පැස් {0}),
					},
					# Long Unit Identifier
					'pressure-pound-force-per-square-inch' => {
						'name' => q(වඅරා),
						'one' => q(වඅරා {0}),
						'other' => q(වඅරා {0}),
					},
					# Core Unit Identifier
					'pound-force-per-square-inch' => {
						'name' => q(වඅරා),
						'one' => q(වඅරා {0}),
						'other' => q(වඅරා {0}),
					},
					# Long Unit Identifier
					'speed-beaufort' => {
						'name' => q(බිෆෝට්),
						'one' => q(බි {0}),
						'other' => q(බි {0}),
					},
					# Core Unit Identifier
					'beaufort' => {
						'name' => q(බිෆෝට්),
						'one' => q(බි {0}),
						'other' => q(බි {0}),
					},
					# Long Unit Identifier
					'speed-kilometer-per-hour' => {
						'name' => q(පැයට කිලෝමීටර්),
						'one' => q(කිමී/පැ {0}),
						'other' => q(කිමී/පැ {0}),
					},
					# Core Unit Identifier
					'kilometer-per-hour' => {
						'name' => q(පැයට කිලෝමීටර්),
						'one' => q(කිමී/පැ {0}),
						'other' => q(කිමී/පැ {0}),
					},
					# Long Unit Identifier
					'speed-knot' => {
						'name' => q(නාසැ),
						'one' => q(නාසැ {0}),
						'other' => q(නාසැ {0}),
					},
					# Core Unit Identifier
					'knot' => {
						'name' => q(නාසැ),
						'one' => q(නාසැ {0}),
						'other' => q(නාසැ {0}),
					},
					# Long Unit Identifier
					'speed-meter-per-second' => {
						'name' => q(තත්පරයට මීටර්),
						'one' => q(මී/තත් {0}),
						'other' => q(මී/තත් {0}),
					},
					# Core Unit Identifier
					'meter-per-second' => {
						'name' => q(තත්පරයට මීටර්),
						'one' => q(මී/තත් {0}),
						'other' => q(මී/තත් {0}),
					},
					# Long Unit Identifier
					'speed-mile-per-hour' => {
						'name' => q(පැයට සැතපුම්),
						'one' => q(පැ/සැ {0}),
						'other' => q(පැ/සැ {0}),
					},
					# Core Unit Identifier
					'mile-per-hour' => {
						'name' => q(පැයට සැතපුම්),
						'one' => q(පැ/සැ {0}),
						'other' => q(පැ/සැ {0}),
					},
					# Long Unit Identifier
					'temperature-celsius' => {
						'name' => q(සෙල්සියස් අංශක),
						'one' => q(සෙල්. {0}°),
						'other' => q(සෙල්. {0}°),
					},
					# Core Unit Identifier
					'celsius' => {
						'name' => q(සෙල්සියස් අංශක),
						'one' => q(සෙල්. {0}°),
						'other' => q(සෙල්. {0}°),
					},
					# Long Unit Identifier
					'temperature-fahrenheit' => {
						'name' => q(ෆැර. අ),
						'one' => q(ෆැර. {0}°),
						'other' => q(ෆැර. {0}°),
					},
					# Core Unit Identifier
					'fahrenheit' => {
						'name' => q(ෆැර. අ),
						'one' => q(ෆැර. {0}°),
						'other' => q(ෆැර. {0}°),
					},
					# Long Unit Identifier
					'temperature-kelvin' => {
						'name' => q(කෙල්. අ),
						'one' => q(කෙල්. {0}°),
						'other' => q(කෙල්. {0}°),
					},
					# Core Unit Identifier
					'kelvin' => {
						'name' => q(කෙල්. අ),
						'one' => q(කෙල්. {0}°),
						'other' => q(කෙල්. {0}°),
					},
					# Long Unit Identifier
					'torque-newton-meter' => {
						'name' => q(නි-මී),
						'one' => q({0} නි-මී),
						'other' => q({0} නි-මී),
					},
					# Core Unit Identifier
					'newton-meter' => {
						'name' => q(නි-මී),
						'one' => q({0} නි-මී),
						'other' => q({0} නි-මී),
					},
					# Long Unit Identifier
					'torque-pound-force-foot' => {
						'name' => q(රාත්-පාද),
						'one' => q({0} රාත්-පාද),
						'other' => q({0} රාත්-පාද),
					},
					# Core Unit Identifier
					'pound-force-foot' => {
						'name' => q(රාත්-පාද),
						'one' => q({0} රාත්-පාද),
						'other' => q({0} රාත්-පාද),
					},
					# Long Unit Identifier
					'volume-acre-foot' => {
						'name' => q(අක්කර-අඩි),
						'one' => q(අක්-අඩි {0}),
						'other' => q(අක්-අඩි {0}),
					},
					# Core Unit Identifier
					'acre-foot' => {
						'name' => q(අක්කර-අඩි),
						'one' => q(අක්-අඩි {0}),
						'other' => q(අක්-අඩි {0}),
					},
					# Long Unit Identifier
					'volume-barrel' => {
						'name' => q(බැරල්),
						'one' => q({0} බැරල්),
						'other' => q({0} බැරල්),
					},
					# Core Unit Identifier
					'barrel' => {
						'name' => q(බැරල්),
						'one' => q({0} බැරල්),
						'other' => q({0} බැරල්),
					},
					# Long Unit Identifier
					'volume-bushel' => {
						'name' => q(බුසල්),
						'one' => q(බුසල් {0}),
						'other' => q(බුසල් {0}),
					},
					# Core Unit Identifier
					'bushel' => {
						'name' => q(බුසල්),
						'one' => q(බුසල් {0}),
						'other' => q(බුසල් {0}),
					},
					# Long Unit Identifier
					'volume-centiliter' => {
						'name' => q(සෙලී),
						'one' => q(සෙලී {0}),
						'other' => q(සෙලී {0}),
					},
					# Core Unit Identifier
					'centiliter' => {
						'name' => q(සෙලී),
						'one' => q(සෙලී {0}),
						'other' => q(සෙලී {0}),
					},
					# Long Unit Identifier
					'volume-cubic-centimeter' => {
						'name' => q(සෙමී³),
						'one' => q(ඝසෙ {0}),
						'other' => q(ඝසෙ {0}),
						'per' => q({0}/ඝසෙ),
					},
					# Core Unit Identifier
					'cubic-centimeter' => {
						'name' => q(සෙමී³),
						'one' => q(ඝසෙ {0}),
						'other' => q(ඝසෙ {0}),
						'per' => q({0}/ඝසෙ),
					},
					# Long Unit Identifier
					'volume-cubic-foot' => {
						'name' => q(අඩි³),
						'one' => q(අඩි³ {0}),
						'other' => q(අඩි³ {0}),
					},
					# Core Unit Identifier
					'cubic-foot' => {
						'name' => q(අඩි³),
						'one' => q(අඩි³ {0}),
						'other' => q(අඩි³ {0}),
					},
					# Long Unit Identifier
					'volume-cubic-inch' => {
						'name' => q(අඟල්³),
						'one' => q(අල්³ {0}),
						'other' => q(අල්³ {0}),
					},
					# Core Unit Identifier
					'cubic-inch' => {
						'name' => q(අඟල්³),
						'one' => q(අල්³ {0}),
						'other' => q(අල්³ {0}),
					},
					# Long Unit Identifier
					'volume-cubic-kilometer' => {
						'name' => q(කිමී³),
						'one' => q(කිමී³ {0}),
						'other' => q(කිමී³ {0}),
					},
					# Core Unit Identifier
					'cubic-kilometer' => {
						'name' => q(කිමී³),
						'one' => q(කිමී³ {0}),
						'other' => q(කිමී³ {0}),
					},
					# Long Unit Identifier
					'volume-cubic-meter' => {
						'name' => q(මී³),
						'one' => q(මී³ {0}),
						'other' => q(මී³ {0}),
						'per' => q({0}/මී³),
					},
					# Core Unit Identifier
					'cubic-meter' => {
						'name' => q(මී³),
						'one' => q(මී³ {0}),
						'other' => q(මී³ {0}),
						'per' => q({0}/මී³),
					},
					# Long Unit Identifier
					'volume-cubic-mile' => {
						'name' => q(සැත³),
						'one' => q(සැත³ {0}),
						'other' => q(සැත³ {0}),
					},
					# Core Unit Identifier
					'cubic-mile' => {
						'name' => q(සැත³),
						'one' => q(සැත³ {0}),
						'other' => q(සැත³ {0}),
					},
					# Long Unit Identifier
					'volume-cubic-yard' => {
						'name' => q(යාර³),
						'one' => q(යාර³ {0}),
						'other' => q(යාර³ {0}),
					},
					# Core Unit Identifier
					'cubic-yard' => {
						'name' => q(යාර³),
						'one' => q(යාර³ {0}),
						'other' => q(යාර³ {0}),
					},
					# Long Unit Identifier
					'volume-cup' => {
						'name' => q(කෝප්ප),
						'one' => q(කෝ {0}),
						'other' => q(කෝ {0}),
					},
					# Core Unit Identifier
					'cup' => {
						'name' => q(කෝප්ප),
						'one' => q(කෝ {0}),
						'other' => q(කෝ {0}),
					},
					# Long Unit Identifier
					'volume-cup-metric' => {
						'name' => q(මෙකෝප්ප),
						'one' => q(මෙකෝ {0}),
						'other' => q(මෙකෝ {0}),
					},
					# Core Unit Identifier
					'cup-metric' => {
						'name' => q(මෙකෝප්ප),
						'one' => q(මෙකෝ {0}),
						'other' => q(මෙකෝ {0}),
					},
					# Long Unit Identifier
					'volume-deciliter' => {
						'name' => q(ඩෙලී),
						'one' => q(ඩෙලී {0}),
						'other' => q(ඩෙලී {0}),
					},
					# Core Unit Identifier
					'deciliter' => {
						'name' => q(ඩෙලී),
						'one' => q(ඩෙලී {0}),
						'other' => q(ඩෙලී {0}),
					},
					# Long Unit Identifier
					'volume-dessert-spoon' => {
						'name' => q(අතුරුපස හැන්ද),
						'one' => q(අතුරුපස හැඳි {0}),
						'other' => q(අතුරුපස හැඳි {0}),
					},
					# Core Unit Identifier
					'dessert-spoon' => {
						'name' => q(අතුරුපස හැන්ද),
						'one' => q(අතුරුපස හැඳි {0}),
						'other' => q(අතුරුපස හැඳි {0}),
					},
					# Long Unit Identifier
					'volume-dessert-spoon-imperial' => {
						'name' => q(ඉම්පීරියල් අතුරුපස හැන්ද),
						'one' => q(ඉම්පී. අතුරුපස හැඳි {0}),
						'other' => q(ඉම්පී. අතුරුපස හැඳි {0}),
					},
					# Core Unit Identifier
					'dessert-spoon-imperial' => {
						'name' => q(ඉම්පීරියල් අතුරුපස හැන්ද),
						'one' => q(ඉම්පී. අතුරුපස හැඳි {0}),
						'other' => q(ඉම්පී. අතුරුපස හැඳි {0}),
					},
					# Long Unit Identifier
					'volume-dram' => {
						'name' => q(ඩ්‍රූම තරල),
						'one' => q(ඩ්‍රූම තරල {0}),
						'other' => q(ඩ්‍රූම තරල {0}),
					},
					# Core Unit Identifier
					'dram' => {
						'name' => q(ඩ්‍රූම තරල),
						'one' => q(ඩ්‍රූම තරල {0}),
						'other' => q(ඩ්‍රූම තරල {0}),
					},
					# Long Unit Identifier
					'volume-drop' => {
						'name' => q(බින්දුව),
						'one' => q(බින්දු {0}),
						'other' => q(බින්දු {0}),
					},
					# Core Unit Identifier
					'drop' => {
						'name' => q(බින්දුව),
						'one' => q(බින්දු {0}),
						'other' => q(බින්දු {0}),
					},
					# Long Unit Identifier
					'volume-fluid-ounce' => {
						'name' => q(ද්‍රව අවු),
						'one' => q(ද්‍රව අවු {0}),
						'other' => q(ද්‍රව අවු {0}),
					},
					# Core Unit Identifier
					'fluid-ounce' => {
						'name' => q(ද්‍රව අවු),
						'one' => q(ද්‍රව අවු {0}),
						'other' => q(ද්‍රව අවු {0}),
					},
					# Long Unit Identifier
					'volume-fluid-ounce-imperial' => {
						'name' => q(අධිරා. තර අවු),
						'one' => q({0} තර අවු අධිරා.),
						'other' => q({0} තර අවු අධිරා.),
					},
					# Core Unit Identifier
					'fluid-ounce-imperial' => {
						'name' => q(අධිරා. තර අවු),
						'one' => q({0} තර අවු අධිරා.),
						'other' => q({0} තර අවු අධිරා.),
					},
					# Long Unit Identifier
					'volume-gallon' => {
						'name' => q(ගැලු),
						'one' => q(ගැලු {0}),
						'other' => q(ගැලු {0}),
						'per' => q({0}/ගැලු),
					},
					# Core Unit Identifier
					'gallon' => {
						'name' => q(ගැලු),
						'one' => q(ගැලු {0}),
						'other' => q(ගැලු {0}),
						'per' => q({0}/ගැලු),
					},
					# Long Unit Identifier
					'volume-gallon-imperial' => {
						'name' => q(ඉම්පී. ගැ),
						'one' => q({0} ගැ ඉම්පී.),
						'other' => q({0} ගැ ඉම්පී.),
						'per' => q({0}/ ගැ ඉම්පී.),
					},
					# Core Unit Identifier
					'gallon-imperial' => {
						'name' => q(ඉම්පී. ගැ),
						'one' => q({0} ගැ ඉම්පී.),
						'other' => q({0} ගැ ඉම්පී.),
						'per' => q({0}/ ගැ ඉම්පී.),
					},
					# Long Unit Identifier
					'volume-hectoliter' => {
						'name' => q(හෙලී),
						'one' => q(හෙලී {0}),
						'other' => q(හෙලී {0}),
					},
					# Core Unit Identifier
					'hectoliter' => {
						'name' => q(හෙලී),
						'one' => q(හෙලී {0}),
						'other' => q(හෙලී {0}),
					},
					# Long Unit Identifier
					'volume-jigger' => {
						'name' => q(තැටි වාහකය),
						'one' => q(තැටි වාහක {0}),
						'other' => q(තැටි වාහක {0}),
					},
					# Core Unit Identifier
					'jigger' => {
						'name' => q(තැටි වාහකය),
						'one' => q(තැටි වාහක {0}),
						'other' => q(තැටි වාහක {0}),
					},
					# Long Unit Identifier
					'volume-liter' => {
						'name' => q(ලීටර්),
						'one' => q(ලී {0}),
						'other' => q(ලී {0}),
						'per' => q({0}/ලී),
					},
					# Core Unit Identifier
					'liter' => {
						'name' => q(ලීටර්),
						'one' => q(ලී {0}),
						'other' => q(ලී {0}),
						'per' => q({0}/ලී),
					},
					# Long Unit Identifier
					'volume-megaliter' => {
						'name' => q(මෙලී),
						'one' => q(මෙලී {0}),
						'other' => q(මෙලී {0}),
					},
					# Core Unit Identifier
					'megaliter' => {
						'name' => q(මෙලී),
						'one' => q(මෙලී {0}),
						'other' => q(මෙලී {0}),
					},
					# Long Unit Identifier
					'volume-milliliter' => {
						'name' => q(මිලී),
						'one' => q(මිලී {0}),
						'other' => q(මිලී {0}),
					},
					# Core Unit Identifier
					'milliliter' => {
						'name' => q(මිලී),
						'one' => q(මිලී {0}),
						'other' => q(මිලී {0}),
					},
					# Long Unit Identifier
					'volume-pinch' => {
						'name' => q(ඩිංග),
						'one' => q(ඩිංග {0}),
						'other' => q(ඩිංග {0}),
					},
					# Core Unit Identifier
					'pinch' => {
						'name' => q(ඩිංග),
						'one' => q(ඩිංග {0}),
						'other' => q(ඩිංග {0}),
					},
					# Long Unit Identifier
					'volume-pint' => {
						'name' => q(පයින්ට්),
						'one' => q(පට් {0}),
						'other' => q(පට් {0}),
					},
					# Core Unit Identifier
					'pint' => {
						'name' => q(පයින්ට්),
						'one' => q(පට් {0}),
						'other' => q(පට් {0}),
					},
					# Long Unit Identifier
					'volume-pint-metric' => {
						'name' => q(මෙපට්),
						'one' => q(මෙපට් {0}),
						'other' => q(මෙපට් {0}),
					},
					# Core Unit Identifier
					'pint-metric' => {
						'name' => q(මෙපට්),
						'one' => q(මෙපට් {0}),
						'other' => q(මෙපට් {0}),
					},
					# Long Unit Identifier
					'volume-quart' => {
						'name' => q(ක්වාට්),
						'one' => q(ක්ට් {0}),
						'other' => q(ක්ට් {0}),
					},
					# Core Unit Identifier
					'quart' => {
						'name' => q(ක්වාට්),
						'one' => q(ක්ට් {0}),
						'other' => q(ක්ට් {0}),
					},
					# Long Unit Identifier
					'volume-quart-imperial' => {
						'name' => q(ඉම්පීරියල් නැළිය),
						'one' => q(ඉම්පීරියල් නැළි {0}),
						'other' => q(ඉම්පීරියල් නැළි {0}),
					},
					# Core Unit Identifier
					'quart-imperial' => {
						'name' => q(ඉම්පීරියල් නැළිය),
						'one' => q(ඉම්පීරියල් නැළි {0}),
						'other' => q(ඉම්පීරියල් නැළි {0}),
					},
					# Long Unit Identifier
					'volume-tablespoon' => {
						'name' => q(මේසහැදී),
						'one' => q(මේසහැදී {0}),
						'other' => q(මේසහැදී {0}),
					},
					# Core Unit Identifier
					'tablespoon' => {
						'name' => q(මේසහැදී),
						'one' => q(මේසහැදී {0}),
						'other' => q(මේසහැදී {0}),
					},
					# Long Unit Identifier
					'volume-teaspoon' => {
						'name' => q(තේහැදී),
						'one' => q(තේහැදී {0}),
						'other' => q(තේහැදී {0}),
					},
					# Core Unit Identifier
					'teaspoon' => {
						'name' => q(තේහැදී),
						'one' => q(තේහැදී {0}),
						'other' => q(තේහැදී {0}),
					},
				},
			} }
);

has 'yesstr' => (
	is			=> 'ro',
	isa			=> RegexpRef,
	init_arg	=> undef,
	default		=> sub { qr'^(?i:ඔව්|ඔ|yes|y)$' }
);

has 'nostr' => (
	is			=> 'ro',
	isa			=> RegexpRef,
	init_arg	=> undef,
	default		=> sub { qr'^(?i:නැත|නැ|no|n)$' }
);

has 'listPatterns' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
				end => q({0}, සහ {1}),
				2 => q({0} සහ {1}),
		} }
);

has 'number_symbols' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'latn' => {
			'timeSeparator' => q(.),
		},
	} }
);

has 'number_formats' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		decimalFormat => {
			'long' => {
				'1000' => {
					'one' => 'දහස 0',
					'other' => 'දහස 0',
				},
				'10000' => {
					'one' => 'දහස 00',
					'other' => 'දහස 00',
				},
				'100000' => {
					'one' => 'දහස 000',
					'other' => 'දහස 000',
				},
				'1000000' => {
					'one' => 'මිලියන 0',
					'other' => 'මිලියන 0',
				},
				'10000000' => {
					'one' => 'මිලියන 00',
					'other' => 'මිලියන 00',
				},
				'100000000' => {
					'one' => 'මිලියන 000',
					'other' => 'මිලියන 000',
				},
				'1000000000' => {
					'one' => 'බිලියන 0',
					'other' => 'බිලියන 0',
				},
				'10000000000' => {
					'one' => 'බිලියන 00',
					'other' => 'බිලියන 00',
				},
				'100000000000' => {
					'one' => 'බිලියන 000',
					'other' => 'බිලියන 000',
				},
				'1000000000000' => {
					'one' => 'ට්‍රිලියන 0',
					'other' => 'ට්‍රිලියන 0',
				},
				'10000000000000' => {
					'one' => 'ට්‍රිලියන 00',
					'other' => 'ට්‍රිලියන 00',
				},
				'100000000000000' => {
					'one' => 'ට්‍රිලියන 000',
					'other' => 'ට්‍රිලියන 000',
				},
			},
			'short' => {
				'1000' => {
					'one' => 'ද0',
					'other' => 'ද0',
				},
				'10000' => {
					'one' => 'ද00',
					'other' => 'ද00',
				},
				'100000' => {
					'one' => 'ද000',
					'other' => 'ද000',
				},
				'1000000' => {
					'one' => 'මි0',
					'other' => 'මි0',
				},
				'10000000' => {
					'one' => 'මි00',
					'other' => 'මි00',
				},
				'100000000' => {
					'one' => 'මි000',
					'other' => 'මි000',
				},
				'1000000000' => {
					'one' => 'බි0',
					'other' => 'බි0',
				},
				'10000000000' => {
					'one' => 'බි00',
					'other' => 'බි00',
				},
				'100000000000' => {
					'one' => 'බි000',
					'other' => 'බි000',
				},
				'1000000000000' => {
					'one' => 'ට්‍රි0',
					'other' => 'ට්‍රි0',
				},
				'10000000000000' => {
					'one' => 'ට්‍රි00',
					'other' => 'ට්‍රි00',
				},
				'100000000000000' => {
					'one' => 'ට්‍රි000',
					'other' => 'ට්‍රි000',
				},
			},
		},
		scientificFormat => {
			'default' => {
				'standard' => {
					'default' => '#',
				},
			},
		},
} },
);

has 'number_currency_formats' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'latn' => {
			'pattern' => {
				'default' => {
					'accounting' => {
						'negative' => '(¤#,##0.00)',
						'positive' => '¤#,##0.00',
					},
					'standard' => {
						'positive' => '¤#,##0.00',
					},
				},
			},
		},
} },
);

has 'currencies' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'AED' => {
			display_name => {
				'currency' => q(එක්සත් අරාබි එමිරේට්ස් ඩිරාම්),
			},
		},
		'AFN' => {
			display_name => {
				'currency' => q(ඇෆ්ගනිථාන ඇෆ්ගනි),
			},
		},
		'ALL' => {
			display_name => {
				'currency' => q(ඇල්බේනියානු ලෙක්),
			},
		},
		'AMD' => {
			display_name => {
				'currency' => q(ආර්මේනියානු ඩ්‍රෑම්),
			},
		},
		'ANG' => {
			display_name => {
				'currency' => q(නෙදර්ලන්ත ඇන්ටිලියන් ගිල්ඩර්),
			},
		},
		'AOA' => {
			display_name => {
				'currency' => q(ඇන්ගෝලානු ක්වන්සා),
			},
		},
		'ARS' => {
			display_name => {
				'currency' => q(ආර්ජන්ටිනා පෙසෝ),
			},
		},
		'AUD' => {
			display_name => {
				'currency' => q(ඔස්ට්‍රේලියානු ඩොලර්),
			},
		},
		'AWG' => {
			display_name => {
				'currency' => q(අරූබානු ෆ්ලෝරින්),
			},
		},
		'AZN' => {
			display_name => {
				'currency' => q(අසර්බයිජානු මනාට්),
			},
		},
		'BAM' => {
			display_name => {
				'currency' => q(බොස්නියා හර්සගොවීනා පරිවර්ත්‍ය මාර්ක්),
			},
		},
		'BBD' => {
			display_name => {
				'currency' => q(බාබේඩියානු ඩොලර්),
			},
		},
		'BDT' => {
			display_name => {
				'currency' => q(බංග්ලාදේශ් ටකා),
			},
		},
		'BGN' => {
			display_name => {
				'currency' => q(බල්ගේරියානු ලිව්),
			},
		},
		'BHD' => {
			display_name => {
				'currency' => q(බහරේන් ඩිනාර්),
			},
		},
		'BIF' => {
			display_name => {
				'currency' => q(බුරුන්දි ෆ්‍රෑන්ක්),
			},
		},
		'BMD' => {
			display_name => {
				'currency' => q(බර්මියුඩානු ඩොලර්),
			},
		},
		'BND' => {
			display_name => {
				'currency' => q(බෘනායි ඩොලර්),
			},
		},
		'BOB' => {
			display_name => {
				'currency' => q(බොලිවියානු බොලිවියානෝ),
			},
		},
		'BRL' => {
			display_name => {
				'currency' => q(බ්‍රසීල රියල්),
			},
		},
		'BSD' => {
			display_name => {
				'currency' => q(බහමානු ඩොලර්),
			},
		},
		'BTN' => {
			display_name => {
				'currency' => q(භූතාන නගුල්ට්‍රම්),
			},
		},
		'BWP' => {
			display_name => {
				'currency' => q(බොට්ස්වානා පුලා),
			},
		},
		'BYN' => {
			symbol => 'р.',
			display_name => {
				'currency' => q(බෙලරූස් රූබල්),
			},
		},
		'BYR' => {
			display_name => {
				'currency' => q(බෙලරූස් රූබල් \(2000–2016\)),
			},
		},
		'BZD' => {
			display_name => {
				'currency' => q(බෙලීස් ඩොලර්),
				'one' => q(බෙලිස් ඩොලර්),
				'other' => q(බෙලිස් ඩොලර්),
			},
		},
		'CAD' => {
			display_name => {
				'currency' => q(කැනේඩියානු ඩොලර්),
			},
		},
		'CDF' => {
			display_name => {
				'currency' => q(කොංගෝ ෆ්‍රෑන්ක්),
			},
		},
		'CHF' => {
			display_name => {
				'currency' => q(ස්විස් ෆ්‍රෑන්ක්),
			},
		},
		'CLP' => {
			display_name => {
				'currency' => q(චිලි පැසෝ),
			},
		},
		'CNH' => {
			display_name => {
				'currency' => q(චීන යුආන් \(එතෙර\)),
			},
		},
		'CNY' => {
			display_name => {
				'currency' => q(චීන යුආන්),
			},
		},
		'COP' => {
			display_name => {
				'currency' => q(කොලොම්බියානු පෙසෝ),
			},
		},
		'CRC' => {
			display_name => {
				'currency' => q(කොස්ට රිකා කොලෝන්),
			},
		},
		'CUC' => {
			display_name => {
				'currency' => q(මාරුකළ හැකි කියුබානු පැසෝ),
			},
		},
		'CUP' => {
			display_name => {
				'currency' => q(කියුබානු පැසෝ),
			},
		},
		'CVE' => {
			display_name => {
				'currency' => q(කේප් වර්ඩ් එස්කියුඩෝ),
			},
		},
		'CZK' => {
			display_name => {
				'currency' => q(චෙක් රිපබ්ලික් කොරූනා),
			},
		},
		'DJF' => {
			display_name => {
				'currency' => q(ජිබූති ෆ්‍රෑන්ක්),
			},
		},
		'DKK' => {
			display_name => {
				'currency' => q(ඩැනිෂ් ක්‍රෝන්),
			},
		},
		'DOP' => {
			display_name => {
				'currency' => q(ඩොමිනිකානු පෙසෝ),
			},
		},
		'DZD' => {
			display_name => {
				'currency' => q(ඇල්ගේරියානු ඩිනාර්),
			},
		},
		'EGP' => {
			display_name => {
				'currency' => q(ඊජිප්තු පවුම්),
			},
		},
		'ERN' => {
			display_name => {
				'currency' => q(එරිත්‍රියානු නැක්ෆා),
			},
		},
		'ETB' => {
			display_name => {
				'currency' => q(ඉතියෝපියානු බීර්),
			},
		},
		'EUR' => {
			display_name => {
				'currency' => q(යුරෝ),
			},
		},
		'FJD' => {
			display_name => {
				'currency' => q(ෆිජියන් ඩොලර්),
			},
		},
		'FKP' => {
			display_name => {
				'currency' => q(ෆෝක්ලන්ඩ් දූපත් පවුම්),
			},
		},
		'GBP' => {
			display_name => {
				'currency' => q(බ්‍රිතාන්‍ය ස්ටර්ලින් පවුම්),
			},
		},
		'GEL' => {
			display_name => {
				'currency' => q(ජෝජියානු ලැරී),
			},
		},
		'GHS' => {
			display_name => {
				'currency' => q(ඝානා සෙඩි),
			},
		},
		'GIP' => {
			display_name => {
				'currency' => q(ජිබ්‍රෝල්ටා පවුම්),
			},
		},
		'GMD' => {
			display_name => {
				'currency' => q(ගැම්බියානු දලාසි),
			},
		},
		'GNF' => {
			display_name => {
				'currency' => q(ගිනියානු ෆ්රෑන්ක්),
				'one' => q(ගිනියානු ෆ්‍රෑන්ක්),
				'other' => q(ගිනියානු ෆ්‍රෑන්ක්),
			},
		},
		'GTQ' => {
			display_name => {
				'currency' => q(ගෝතමාලානු ක්වෙට්සල්),
			},
		},
		'GYD' => {
			display_name => {
				'currency' => q(ගයනා ඩොලර්),
			},
		},
		'HKD' => {
			display_name => {
				'currency' => q(හොංකොං ඩොලර්),
			},
		},
		'HNL' => {
			display_name => {
				'currency' => q(හොන්ඩුරානු ලෙම්පිරා),
			},
		},
		'HRK' => {
			display_name => {
				'currency' => q(ක්‍රොඒෂියානු කූනා),
			},
		},
		'HTG' => {
			display_name => {
				'currency' => q(හයිටි ගෝර්ඩ්),
			},
		},
		'HUF' => {
			display_name => {
				'currency' => q(හංගේරියානු ෆරින්ට්),
			},
		},
		'IDR' => {
			display_name => {
				'currency' => q(ඉන්දුනීසියානු රුපියා),
			},
		},
		'ILS' => {
			display_name => {
				'currency' => q(ඊශ්‍රායල නව ශෙකල්),
			},
		},
		'INR' => {
			display_name => {
				'currency' => q(ඉන්දියානු රුපියල්),
			},
		},
		'IQD' => {
			display_name => {
				'currency' => q(ඉරාක ඩිනාර්),
			},
		},
		'IRR' => {
			display_name => {
				'currency' => q(ඉරාන රියාල්),
			},
		},
		'ISK' => {
			display_name => {
				'currency' => q(අයිස්ලන්තික ක්‍රෝනා),
			},
		},
		'JMD' => {
			display_name => {
				'currency' => q(ජැමෙයිකානු ඩොලර්),
			},
		},
		'JOD' => {
			display_name => {
				'currency' => q(ජෝර්දාන් ඩිනාර්),
			},
		},
		'JPY' => {
			display_name => {
				'currency' => q(ජපන් යෙන්),
			},
		},
		'KES' => {
			display_name => {
				'currency' => q(කෙන්යානු ශිලිං),
			},
		},
		'KGS' => {
			display_name => {
				'currency' => q(කිරිගිස්ථාන සම්),
			},
		},
		'KHR' => {
			display_name => {
				'currency' => q(කාම්බෝජ රියේල්),
			},
		},
		'KMF' => {
			display_name => {
				'currency' => q(කොමොරියානු ෆ්‍රෑන්ක්),
			},
		},
		'KPW' => {
			display_name => {
				'currency' => q(උතුරු කොරියානු වොන්),
			},
		},
		'KRW' => {
			display_name => {
				'currency' => q(දකුණු කොරියානු වොන්),
			},
		},
		'KWD' => {
			display_name => {
				'currency' => q(කුවේට් ඩිනාර්),
			},
		},
		'KYD' => {
			display_name => {
				'currency' => q(කේමන් දූපත් ඩොලර්),
			},
		},
		'KZT' => {
			display_name => {
				'currency' => q(කසකස්ථාන ටෙන්ග),
			},
		},
		'LAK' => {
			display_name => {
				'currency' => q(ලාඕස් කිප්),
			},
		},
		'LBP' => {
			display_name => {
				'currency' => q(ලෙබනන පවුම්),
			},
		},
		'LKR' => {
			symbol => 'රු.',
			display_name => {
				'currency' => q(ශ්‍රී ලංකා රුපියල),
			},
		},
		'LRD' => {
			display_name => {
				'currency' => q(ලයිබේරියානු ඩොලර්),
			},
		},
		'LSL' => {
			display_name => {
				'currency' => q(ලෙසෝතෝ ලොටි),
				'one' => q(ලෙසෝතෝ ලොටි),
				'other' => q(ලෙසෝතෝ ලොටිස්),
			},
		},
		'LTL' => {
			display_name => {
				'currency' => q(ලිතුවේනියානු),
			},
		},
		'LVL' => {
			display_name => {
				'currency' => q(ලැට්වියානු ලැට්ස්),
			},
		},
		'LYD' => {
			display_name => {
				'currency' => q(ලිබියානු ඩිනාර්),
			},
		},
		'MAD' => {
			display_name => {
				'currency' => q(මොරොක්කෝ ඩිර්හැම්),
			},
		},
		'MDL' => {
			display_name => {
				'currency' => q(මෝල්ඩෝවානු ලෙව්),
			},
		},
		'MGA' => {
			display_name => {
				'currency' => q(මලගාසි අරියාරි),
			},
		},
		'MKD' => {
			display_name => {
				'currency' => q(මැසඩෝනියානු ඩිනාර්),
			},
		},
		'MMK' => {
			display_name => {
				'currency' => q(බුරුම ක්යාට්),
			},
		},
		'MNT' => {
			display_name => {
				'currency' => q(මොන්ගෝලියානු ටග්‍රික්),
			},
		},
		'MOP' => {
			display_name => {
				'currency' => q(මැකනීස් පටකා),
			},
		},
		'MRO' => {
			display_name => {
				'currency' => q(මුරුසි ඔයිගුයියා \(1973–2017\)),
			},
		},
		'MRU' => {
			display_name => {
				'currency' => q(මුරුසි ඔයිගුයියා),
			},
		},
		'MUR' => {
			display_name => {
				'currency' => q(මුරිසියානු රුපියල්),
			},
		},
		'MVR' => {
			display_name => {
				'currency' => q(මාලදිවයින් රුෆියා),
			},
		},
		'MWK' => {
			display_name => {
				'currency' => q(මලාවි ක්වාචා),
			},
		},
		'MXN' => {
			display_name => {
				'currency' => q(මෙක්සිකානු ඩොලර්),
			},
		},
		'MYR' => {
			display_name => {
				'currency' => q(මැලේසියානු රින්ගිට්),
			},
		},
		'MZN' => {
			display_name => {
				'currency' => q(මොසැම්බිකන් මෙටිකල්),
			},
		},
		'NAD' => {
			display_name => {
				'currency' => q(නැමීබියානු ඩොලර්),
			},
		},
		'NGN' => {
			display_name => {
				'currency' => q(නයිජීරියානු නයිරා),
			},
		},
		'NIO' => {
			display_name => {
				'currency' => q(නිකරගුවානු කොඩෝබා),
			},
		},
		'NOK' => {
			display_name => {
				'currency' => q(නොර්වීජියන් ක්‍රෝන්),
			},
		},
		'NPR' => {
			display_name => {
				'currency' => q(නේපාල රුපියල්),
			},
		},
		'NZD' => {
			display_name => {
				'currency' => q(නවසීලන්ත ඩොලර්),
			},
		},
		'OMR' => {
			display_name => {
				'currency' => q(ඕමාන් රියාල්),
			},
		},
		'PAB' => {
			display_name => {
				'currency' => q(පැනමා බැල්බෝ),
			},
		},
		'PEN' => {
			display_name => {
				'currency' => q(පේරු සොල්),
			},
		},
		'PGK' => {
			display_name => {
				'currency' => q(පැපුවා නිව් ගිනියානු කිනා),
			},
		},
		'PHP' => {
			symbol => 'PHP',
			display_name => {
				'currency' => q(පිලිපීන පෙසෝ),
			},
		},
		'PKR' => {
			display_name => {
				'currency' => q(පාකිස්ථාන රුපියල්),
			},
		},
		'PLN' => {
			display_name => {
				'currency' => q(පොලිෂ් ස්ලොටි),
			},
		},
		'PYG' => {
			display_name => {
				'currency' => q(පැරගුවේ ගුවරානි),
			},
		},
		'QAR' => {
			display_name => {
				'currency' => q(කටාර් රියාල්),
			},
		},
		'RON' => {
			display_name => {
				'currency' => q(රොමේනියානු ලෙව්),
			},
		},
		'RSD' => {
			display_name => {
				'currency' => q(සර්බියානු ඩිනාර්),
			},
		},
		'RUB' => {
			symbol => '₽',
			display_name => {
				'currency' => q(රුසියන් රූබල්),
			},
		},
		'RWF' => {
			display_name => {
				'currency' => q(රුවන්ඩා ෆ්‍රෑන්ක්),
			},
		},
		'SAR' => {
			display_name => {
				'currency' => q(සවුදි රියාල්),
			},
		},
		'SBD' => {
			display_name => {
				'currency' => q(සොලමන් දූපත් ඩොලර්),
			},
		},
		'SCR' => {
			display_name => {
				'currency' => q(සීෂෙලියානු රුපියල),
			},
		},
		'SDG' => {
			display_name => {
				'currency' => q(සුඩාන පවුම්),
			},
		},
		'SEK' => {
			display_name => {
				'currency' => q(ස්වෙඩිෂ් ක්‍රෝනා),
			},
		},
		'SGD' => {
			display_name => {
				'currency' => q(සිංගප්පූරු ඩොලර්),
			},
		},
		'SHP' => {
			display_name => {
				'currency' => q(ශාන්ත හෙලේනා පවුම්),
			},
		},
		'SLE' => {
			display_name => {
				'currency' => q(සියරා ලියොන් ලියොන්),
			},
		},
		'SLL' => {
			display_name => {
				'currency' => q(සියරා ලියොන් ලියොන් \(1964—2022\)),
			},
		},
		'SOS' => {
			display_name => {
				'currency' => q(සෝමාලියානු ශිලිං),
			},
		},
		'SRD' => {
			display_name => {
				'currency' => q(සුරිනාම් ඩොලර්),
			},
		},
		'SSP' => {
			display_name => {
				'currency' => q(දකුණු සුඩාන පවුම්),
			},
		},
		'STD' => {
			display_name => {
				'currency' => q(සාඕ තෝම් සහ ප්‍රින්සිප් දොබ්‍රා \(1977–2017\)),
			},
		},
		'STN' => {
			display_name => {
				'currency' => q(සාඕ තෝම් සහ ප්‍රින්සිප් දොබ්‍රා),
			},
		},
		'SYP' => {
			display_name => {
				'currency' => q(සිරියානු පවුම්),
			},
		},
		'SZL' => {
			display_name => {
				'currency' => q(ස්වාසි ලිලන්ජනි),
			},
		},
		'THB' => {
			symbol => '฿',
			display_name => {
				'currency' => q(තායි බාත්),
			},
		},
		'TJS' => {
			display_name => {
				'currency' => q(තජිකිස්ථාන සමොනි),
			},
		},
		'TMT' => {
			display_name => {
				'currency' => q(තක්මෙනිස්ථාන මනාට්),
			},
		},
		'TND' => {
			display_name => {
				'currency' => q(ටියුනීසියානු ඩිනාර්),
			},
		},
		'TOP' => {
			display_name => {
				'currency' => q(ටොංගානු පාන්ගා),
			},
		},
		'TRY' => {
			display_name => {
				'currency' => q(තුර්කි ලිරා),
			},
		},
		'TTD' => {
			display_name => {
				'currency' => q(ට්‍රිනිඩෑඩ් සහ ටොබෑගෝ ඩොලර්),
			},
		},
		'TWD' => {
			symbol => 'NT$',
			display_name => {
				'currency' => q(නව තායිවාන ඩොලර්),
			},
		},
		'TZS' => {
			display_name => {
				'currency' => q(ටැන්සානියානු ශිලිං),
			},
		},
		'UAH' => {
			display_name => {
				'currency' => q(යුක්රේන හ්‍රිව්නියා),
			},
		},
		'UGX' => {
			display_name => {
				'currency' => q(උගන්ඩා ශිලිං),
			},
		},
		'USD' => {
			display_name => {
				'currency' => q(ඇමරිකානු ඩොලර්),
			},
		},
		'UYU' => {
			display_name => {
				'currency' => q(උරුගුවේ පෙසෝ),
			},
		},
		'UZS' => {
			display_name => {
				'currency' => q(උස්බෙකිස්ථාන සම්),
			},
		},
		'VEF' => {
			display_name => {
				'currency' => q(වෙනිසියුලානු බොලිවර් \(2008–2018\)),
			},
		},
		'VES' => {
			display_name => {
				'currency' => q(වෙනිසියුලානු බොලිවර්),
			},
		},
		'VND' => {
			display_name => {
				'currency' => q(වියට්නාම ඩොන්),
			},
		},
		'VUV' => {
			display_name => {
				'currency' => q(වනුවාටු වාටු),
			},
		},
		'WST' => {
			display_name => {
				'currency' => q(සැමෝවා ටාලා),
			},
		},
		'XAF' => {
			display_name => {
				'currency' => q(සිෆ්එ ෆ්රෑන්ක් බිඊඑසි),
			},
		},
		'XCD' => {
			display_name => {
				'currency' => q(නැගෙනහිර කැරිබියානු ඩොලර්),
			},
		},
		'XOF' => {
			symbol => 'සිෆ්එ',
			display_name => {
				'currency' => q(සිෆ්එ ෆ්රෑන්ක් බිසීඊඑඔ),
			},
		},
		'XPF' => {
			display_name => {
				'currency' => q(ප්‍රංශ පොලිනීසියානු ෆ්‍රෑන්ක්),
			},
		},
		'XXX' => {
			display_name => {
				'currency' => q(නොදත් මුදල්),
				'one' => q(\(නොදත් මුදල් ඒකකය\)),
				'other' => q(\(නොදත් මුදල්\)),
			},
		},
		'YER' => {
			display_name => {
				'currency' => q(යේමන රියාල්),
			},
		},
		'ZAR' => {
			display_name => {
				'currency' => q(දකුණු අප්‍රිකානු රැන්ඩ්),
			},
		},
		'ZMK' => {
			display_name => {
				'currency' => q(සැම්බියානු ක්වාචා \(1968–2012\)),
			},
		},
		'ZMW' => {
			display_name => {
				'currency' => q(සැම්බියානු ක්වාචා),
			},
		},
	} },
);


has 'calendar_months' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
			'gregorian' => {
				'format' => {
					abbreviated => {
						nonleap => [
							'ජන',
							'පෙබ',
							'මාර්තු',
							'අප්‍රේල්',
							'මැයි',
							'ජූනි',
							'ජූලි',
							'අගෝ',
							'සැප්',
							'ඔක්',
							'නොවැ',
							'දෙසැ'
						],
						leap => [
							
						],
					},
					wide => {
						nonleap => [
							'ජනවාරි',
							'පෙබරවාරි',
							'මාර්තු',
							'අප්‍රේල්',
							'මැයි',
							'ජූනි',
							'ජූලි',
							'අගෝස්තු',
							'සැප්තැම්බර්',
							'ඔක්තෝබර්',
							'නොවැම්බර්',
							'දෙසැම්බර්'
						],
						leap => [
							
						],
					},
				},
				'stand-alone' => {
					abbreviated => {
						nonleap => [
							'ජන',
							'පෙබ',
							'මාර්',
							'අප්‍රේල්',
							'මැයි',
							'ජූනි',
							'ජූලි',
							'අගෝ',
							'සැප්',
							'ඔක්',
							'නොවැ',
							'දෙසැ'
						],
						leap => [
							
						],
					},
					narrow => {
						nonleap => [
							'ජ',
							'පෙ',
							'මා',
							'අ',
							'මැ',
							'ජූ',
							'ජූ',
							'අ',
							'සැ',
							'ඔ',
							'නෙ',
							'දෙ'
						],
						leap => [
							
						],
					},
				},
			},
	} },
);

has 'calendar_days' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
			'gregorian' => {
				'format' => {
					abbreviated => {
						mon => 'සඳුදා',
						tue => 'අඟහ',
						wed => 'බදාදා',
						thu => 'බ්‍රහස්',
						fri => 'සිකු',
						sat => 'සෙන',
						sun => 'ඉරිදා'
					},
					short => {
						mon => 'සඳු',
						tue => 'අඟ',
						wed => 'බදා',
						thu => 'බ්‍රහ',
						fri => 'සිකු',
						sat => 'සෙන',
						sun => 'ඉරි'
					},
					wide => {
						mon => 'සඳුදා',
						tue => 'අඟහරුවාදා',
						wed => 'බදාදා',
						thu => 'බ්‍රහස්පතින්දා',
						fri => 'සිකුරාදා',
						sat => 'සෙනසුරාදා',
						sun => 'ඉරිදා'
					},
				},
				'stand-alone' => {
					narrow => {
						mon => 'ස',
						tue => 'අ',
						wed => 'බ',
						thu => 'බ්‍ර',
						fri => 'සි',
						sat => 'සෙ',
						sun => 'ඉ'
					},
				},
			},
	} },
);

has 'calendar_quarters' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
			'gregorian' => {
				'format' => {
					abbreviated => {0 => 'කාර්:1',
						1 => 'කාර්:2',
						2 => 'කාර්:3',
						3 => 'කාර්:4'
					},
					wide => {0 => '1 වන කාර්තුව',
						1 => '2 වන කාර්තුව',
						2 => '3 වන කාර්තුව',
						3 => '4 වන කාර්තුව'
					},
				},
			},
	} },
);

has 'day_period_data' => (
	is			=> 'ro',
	isa			=> CodeRef,
	init_arg	=> undef,
	default		=> sub { sub {
		# Time in hhmm format
		my ($self, $type, $time, $day_period_type) = @_;
		$day_period_type //= 'default';
		SWITCH:
		for ($type) {
			if ($_ eq 'generic') {
				if($day_period_type eq 'default') {
					return 'midnight' if $time == 0;
					return 'noon' if $time == 1200;
					return 'afternoon1' if $time >= 1200
						&& $time < 1400;
					return 'evening1' if $time >= 1400
						&& $time < 1800;
					return 'morning1' if $time >= 100
						&& $time < 600;
					return 'morning2' if $time >= 600
						&& $time < 1200;
					return 'night1' if $time >= 1800
						&& $time < 2400;
					return 'night2' if $time >= 0
						&& $time < 100;
				}
				if($day_period_type eq 'selection') {
					return 'afternoon1' if $time >= 1200
						&& $time < 1400;
					return 'evening1' if $time >= 1400
						&& $time < 1800;
					return 'morning1' if $time >= 100
						&& $time < 600;
					return 'morning2' if $time >= 600
						&& $time < 1200;
					return 'night1' if $time >= 1800
						&& $time < 2400;
					return 'night2' if $time >= 0
						&& $time < 100;
				}
				last SWITCH;
				}
			if ($_ eq 'gregorian') {
				if($day_period_type eq 'default') {
					return 'midnight' if $time == 0;
					return 'noon' if $time == 1200;
					return 'afternoon1' if $time >= 1200
						&& $time < 1400;
					return 'evening1' if $time >= 1400
						&& $time < 1800;
					return 'morning1' if $time >= 100
						&& $time < 600;
					return 'morning2' if $time >= 600
						&& $time < 1200;
					return 'night1' if $time >= 1800
						&& $time < 2400;
					return 'night2' if $time >= 0
						&& $time < 100;
				}
				if($day_period_type eq 'selection') {
					return 'afternoon1' if $time >= 1200
						&& $time < 1400;
					return 'evening1' if $time >= 1400
						&& $time < 1800;
					return 'morning1' if $time >= 100
						&& $time < 600;
					return 'morning2' if $time >= 600
						&& $time < 1200;
					return 'night1' if $time >= 1800
						&& $time < 2400;
					return 'night2' if $time >= 0
						&& $time < 100;
				}
				last SWITCH;
				}
		}
	} },
);

around day_period_data => sub {
    my ($orig, $self) = @_;
    return $self->$orig;
};

has 'day_periods' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'gregorian' => {
			'format' => {
				'abbreviated' => {
					'afternoon1' => q{දවල්},
					'am' => q{පෙ.ව.},
					'evening1' => q{හවස},
					'midnight' => q{මැදියම},
					'morning1' => q{පාන්දර},
					'morning2' => q{උදේ},
					'night1' => q{රෑ},
					'night2' => q{මැදියමට පසු},
					'noon' => q{මධ්‍යාහ්නය},
					'pm' => q{ප.ව.},
				},
				'narrow' => {
					'afternoon1' => q{ද},
					'am' => q{පෙ},
					'evening1' => q{හ},
					'midnight' => q{මැ},
					'morning1' => q{පා},
					'morning2' => q{උ},
					'night1' => q{රෑ},
					'night2' => q{මැ},
					'noon' => q{ම},
					'pm' => q{ප},
				},
			},
		},
	} },
);

has 'eras' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'generic' => {
		},
		'gregorian' => {
			abbreviated => {
				'0' => 'ක්‍රි.පූ.',
				'1' => 'ක්‍රි.ව.'
			},
			wide => {
				'0' => 'ක්‍රිස්තු පූර්ව',
				'1' => 'ක්‍රිස්තු වර්ෂ'
			},
		},
	} },
);

has 'date_formats' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'generic' => {
			'full' => q{G y MMMM d, EEEE},
			'long' => q{G y MMMM d},
			'medium' => q{G y MMM d},
			'short' => q{GGGGG y-MM-dd},
		},
		'gregorian' => {
			'full' => q{y MMMM d, EEEE},
			'long' => q{y MMMM d},
			'medium' => q{y MMM d},
			'short' => q{y-MM-dd},
		},
	} },
);

has 'time_formats' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'generic' => {
		},
		'gregorian' => {
			'full' => q{HH.mm.ss zzzz},
			'long' => q{HH.mm.ss z},
			'medium' => q{HH.mm.ss},
			'short' => q{HH.mm},
		},
	} },
);

has 'datetime_formats' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'generic' => {
			'full' => q{{1} {0}},
			'long' => q{{1} {0}},
			'medium' => q{{1} {0}},
			'short' => q{{1} {0}},
		},
		'gregorian' => {
			'full' => q{{1} {0}},
			'long' => q{{1} {0}},
			'medium' => q{{1} {0}},
			'short' => q{{1} {0}},
		},
	} },
);

has 'datetime_formats_available_formats' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'generic' => {
			Bh => q{B h},
			Bhm => q{B h:mm},
			Bhms => q{B h:mm:ss},
			EBhm => q{E B h:mm},
			EBhms => q{E B h:mm:ss},
			Ed => q{d E},
			MEd => q{M-d, E},
			MMMEd => q{MMM d E},
			Md => q{M-d},
			h => q{a h},
			hm => q{a h.mm},
			hms => q{a h.mm.ss},
			ms => q{mm.ss},
			yyyyM => q{G y-M},
			yyyyMEd => q{G y-M-d, E},
			yyyyMd => q{G y-M-d},
		},
		'gregorian' => {
			EHm => q{E HH.mm},
			EHms => q{E HH.mm.ss},
			Ed => q{d E},
			Ehm => q{E a h.mm},
			Ehms => q{E a h.mm.ss},
			Hm => q{HH.mm},
			Hms => q{HH.mm.ss},
			Hmsv => q{HH.mm.ss v},
			Hmv => q{HH.mm v},
			MEd => q{M-d, E},
			MMMEd => q{MMM d E},
			MMMMW => q{MMMM සතිය W},
			Md => q{M-d},
			h => q{a h},
			hm => q{a h.mm},
			hms => q{a h.mm.ss},
			hmsv => q{h.mm.ss a v},
			hmv => q{h.mm a v},
			ms => q{mm.ss},
			yM => q{y-M},
			yMEd => q{y-M-d, E},
			yMd => q{y-M-d},
			yw => q{Y සතිය w},
		},
	} },
);

has 'datetime_formats_append_item' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
	} },
);

has 'datetime_formats_interval' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default		=> sub { {
		'generic' => {
			Hm => {
				H => q{HH.mm–HH.mm},
				m => q{HH.mm–HH.mm},
			},
			Hmv => {
				H => q{HH.mm–HH.mm v},
				m => q{HH.mm–HH.mm v},
			},
			M => {
				M => q{M–M},
			},
			MEd => {
				M => q{M-d, E – M-d, E},
				d => q{M-d, E – M-d, E},
			},
			MMMEd => {
				M => q{MMM-dd, E – MMM-dd, E},
				d => q{MMM-d, E – MMM-d, E},
			},
			Md => {
				M => q{M-d – M-d},
				d => q{M-d – M-d},
			},
			fallback => '{0} – {1}',
			h => {
				a => q{a h – a h},
				h => q{a h–h},
			},
			hm => {
				a => q{a h.mm – a h.mm},
				h => q{a h.mm – h.mm},
				m => q{a h.mm – h.mm},
			},
			hmv => {
				a => q{a h.mm – a hhh.mm v},
				h => q{a h.mm – h.mm v},
				m => q{a h.mm – h.mm v},
			},
			hv => {
				a => q{a h – a h v},
				h => q{a h – h vv},
			},
			yM => {
				M => q{G y-M – y-M},
				y => q{G y-M – y-M},
			},
			yMEd => {
				M => q{G y-M-d, E – y-M-d, E},
				d => q{G y-M-d, E – y-M-d, E},
				y => q{G y-M-d, E – y-M-d, E},
			},
			yMMMEd => {
				M => q{G y MMM d, E – y MMM d, E},
				d => q{G y MMM d, E – y MMM d, E},
			},
			yMMMM => {
				M => q{G y MMMM – MMMM},
			},
			yMMMd => {
				d => q{G y MMM d – d},
			},
			yMd => {
				M => q{G y-M-d – y-M-d},
				d => q{G y-M-d – y-M-d},
				y => q{G y-M-d – y-M-d},
			},
		},
		'gregorian' => {
			GyM => {
				G => q{M/y GGGGG – M/y GGGGG},
				M => q{M/y – M/y GGGGG},
				y => q{M/y – M/y GGGGG},
			},
			GyMEd => {
				G => q{E, M/d/y GGGGG – E, M/d/y GGGGG},
				M => q{E, M/d/y – E, M/d/y GGGGG},
				d => q{E, M/d/y – E, M/d/y GGGGG},
				y => q{E, M/d/y – E, M/d/y GGGGG},
			},
			GyMd => {
				G => q{M/d/y GGGGG – M/d/y GGGGG},
				M => q{M/d/y – M/d/y GGGGG},
				d => q{M/d/y – M/d/y GGGGG},
				y => q{M/d/y – M/d/y GGGGG},
			},
			Hm => {
				H => q{HH.mm–HH.mm},
				m => q{HH.mm–HH.mm},
			},
			Hmv => {
				H => q{HH.mm–HH.mm v},
				m => q{HH.mm–HH.mm v},
			},
			M => {
				M => q{M–M},
			},
			MEd => {
				M => q{M-d, E – M-d, E},
				d => q{M-d, E – M-d, E},
			},
			MMMEd => {
				M => q{MMM-dd, E – MMM-dd, E},
				d => q{MMM-d, E – MMM-d, E},
			},
			Md => {
				M => q{M-d – M-d},
				d => q{M-d – M-d},
			},
			fallback => '{0} – {1}',
			h => {
				a => q{a h – a h},
				h => q{a h–h},
			},
			hm => {
				a => q{a h.mm – a h.mm},
				h => q{a h.mm – h.mm},
				m => q{a h.mm – h.mm},
			},
			hmv => {
				a => q{a h.mm – a h.mm v},
				h => q{a h.mm – h.mm v},
				m => q{a h.mm – h.mm v},
			},
			hv => {
				a => q{a h – a h v},
				h => q{a h – h v},
			},
			yMEd => {
				M => q{y-M-d, E – y-M-d, E},
				d => q{y-M-d, E – y-M-d, E},
				y => q{y-M-d, E – y-M-d, E},
			},
			yMMMEd => {
				M => q{y MMM d, E – y MMM d, E},
				d => q{y MMM d, E – y MMM d, E},
			},
			yMMMM => {
				M => q{y MMMM – MMMM},
			},
			yMMMd => {
				d => q{y MMM d – d},
			},
			yMd => {
				M => q{y-M-d – y-M-d},
				d => q{y-M-d – y-M-d},
				y => q{y-M-d – y-M-d},
			},
		},
	} },
);

has 'time_zone_names' => (
	is			=> 'ro',
	isa			=> HashRef,
	init_arg	=> undef,
	default	=> sub { {
		hourFormat => q(+HH.mm;-HH.mm),
		gmtFormat => q(ග්‍රිමවේ{0}),
		gmtZeroFormat => q(ග්‍රිමවේ),
		regionFormat => q({0} වේලාව),
		regionFormat => q({0} දිවාආලෝක වේලාව),
		regionFormat => q({0} සම්මත වේලාව),
		'Afghanistan' => {
			long => {
				'standard' => q#ඇෆ්ගනිස්ථාන වේලාව#,
			},
		},
		'Africa/Abidjan' => {
			exemplarCity => q#අබිජාන්#,
		},
		'Africa/Accra' => {
			exemplarCity => q#අක්රා#,
		},
		'Africa/Addis_Ababa' => {
			exemplarCity => q#අඩිස් අබාබා#,
		},
		'Africa/Algiers' => {
			exemplarCity => q#ඇල්ජියර්ස්#,
		},
		'Africa/Asmera' => {
			exemplarCity => q#අස්මාරා#,
		},
		'Africa/Bamako' => {
			exemplarCity => q#බමකො#,
		},
		'Africa/Bangui' => {
			exemplarCity => q#බන්ගුයි#,
		},
		'Africa/Banjul' => {
			exemplarCity => q#බන්ජුල්#,
		},
		'Africa/Bissau' => {
			exemplarCity => q#බිසෝ#,
		},
		'Africa/Blantyre' => {
			exemplarCity => q#බ්ලන්ටයර්#,
		},
		'Africa/Brazzaville' => {
			exemplarCity => q#බ්‍රසාවිල්#,
		},
		'Africa/Bujumbura' => {
			exemplarCity => q#බුජුම්බුරා#,
		},
		'Africa/Cairo' => {
			exemplarCity => q#කයිරෝ#,
		},
		'Africa/Casablanca' => {
			exemplarCity => q#කැසබ්ලන්කා#,
		},
		'Africa/Ceuta' => {
			exemplarCity => q#සෙයුටා#,
		},
		'Africa/Conakry' => {
			exemplarCity => q#කොනක්‍රි#,
		},
		'Africa/Dakar' => {
			exemplarCity => q#ඩකර්#,
		},
		'Africa/Dar_es_Salaam' => {
			exemplarCity => q#දාර් එස් සලාම්#,
		},
		'Africa/Djibouti' => {
			exemplarCity => q#ජිබුටි#,
		},
		'Africa/Douala' => {
			exemplarCity => q#දෞඅලා#,
		},
		'Africa/El_Aaiun' => {
			exemplarCity => q#එල් ආයුන්#,
		},
		'Africa/Freetown' => {
			exemplarCity => q#ෆ්‍රීටවුන්#,
		},
		'Africa/Gaborone' => {
			exemplarCity => q#ගැබරෝන්#,
		},
		'Africa/Harare' => {
			exemplarCity => q#හරාරේ#,
		},
		'Africa/Johannesburg' => {
			exemplarCity => q#ජොහන්නස්බර්ග්#,
		},
		'Africa/Juba' => {
			exemplarCity => q#ජුබා#,
		},
		'Africa/Kampala' => {
			exemplarCity => q#කම්පාලා#,
		},
		'Africa/Khartoum' => {
			exemplarCity => q#කාර්ටොම්#,
		},
		'Africa/Kigali' => {
			exemplarCity => q#කිගාලි#,
		},
		'Africa/Kinshasa' => {
			exemplarCity => q#කින්ශාසා#,
		},
		'Africa/Lagos' => {
			exemplarCity => q#ලාගෝස්#,
		},
		'Africa/Libreville' => {
			exemplarCity => q#ලිබ්රවිල්#,
		},
		'Africa/Lome' => {
			exemplarCity => q#ලෝම්#,
		},
		'Africa/Luanda' => {
			exemplarCity => q#ලුවන්ඩා#,
		},
		'Africa/Lubumbashi' => {
			exemplarCity => q#ලුබුම්බාශි#,
		},
		'Africa/Lusaka' => {
			exemplarCity => q#ලුසාකා#,
		},
		'Africa/Malabo' => {
			exemplarCity => q#මලබෝ#,
		},
		'Africa/Maputo' => {
			exemplarCity => q#මපුටෝ#,
		},
		'Africa/Maseru' => {
			exemplarCity => q#මසේරු#,
		},
		'Africa/Mbabane' => {
			exemplarCity => q#ම්බබානේ#,
		},
		'Africa/Mogadishu' => {
			exemplarCity => q#මොගඩිෂු#,
		},
		'Africa/Monrovia' => {
			exemplarCity => q#මොන්රොවියා#,
		},
		'Africa/Nairobi' => {
			exemplarCity => q#නයිරෝබි#,
		},
		'Africa/Ndjamena' => {
			exemplarCity => q#ද්ජමෙනා#,
		},
		'Africa/Niamey' => {
			exemplarCity => q#නියාමේ#,
		},
		'Africa/Nouakchott' => {
			exemplarCity => q#නුආක්චොට්#,
		},
		'Africa/Ouagadougou' => {
			exemplarCity => q#ඔආගඩොගො#,
		},
		'Africa/Porto-Novo' => {
			exemplarCity => q#පොර්තෝ-නොවෝ#,
		},
		'Africa/Sao_Tome' => {
			exemplarCity => q#සාඕ තෝම්#,
		},
		'Africa/Tripoli' => {
			exemplarCity => q#ට්‍රිපොලි#,
		},
		'Africa/Tunis' => {
			exemplarCity => q#ටියුනිස්#,
		},
		'Africa/Windhoek' => {
			exemplarCity => q#වින්ඩ්හොඑක්#,
		},
		'Africa_Central' => {
			long => {
				'standard' => q#මධ්‍යම අප්‍රිකානු වේලාව#,
			},
		},
		'Africa_Eastern' => {
			long => {
				'standard' => q#නැගෙනහිර අප්‍රිකානු වේලාව#,
			},
		},
		'Africa_Southern' => {
			long => {
				'standard' => q#දකුණු අප්‍රිකානු වේලාව#,
			},
		},
		'Africa_Western' => {
			long => {
				'daylight' => q#බටහිර අප්‍රිකානු ග්‍රීෂ්ම කාලය#,
				'generic' => q#බටහිර අප්‍රිකානු වේලාව#,
				'standard' => q#බටහිර අප්‍රිකානු සම්මත වේලාව#,
			},
		},
		'Alaska' => {
			long => {
				'daylight' => q#ඇලස්කා දිවාආලෝක වේලාව#,
				'generic' => q#ඇලස්කා වේලාව#,
				'standard' => q#ඇලස්කා සම්මත වේලාව#,
			},
		},
		'Amazon' => {
			long => {
				'daylight' => q#ඇමර්සන් ග්‍රීෂ්ම කාලය#,
				'generic' => q#ඇමර්සන් වේලාව#,
				'standard' => q#ඇමර්සන් සම්මත වේලාව#,
			},
		},
		'America/Adak' => {
			exemplarCity => q#ඇඩක්#,
		},
		'America/Anchorage' => {
			exemplarCity => q#ඇනකොරාජ්#,
		},
		'America/Anguilla' => {
			exemplarCity => q#ඇන්ගුයිලාව#,
		},
		'America/Antigua' => {
			exemplarCity => q#ඇන්ටිගුවා#,
		},
		'America/Araguaina' => {
			exemplarCity => q#ඇරගුඅයිනා#,
		},
		'America/Argentina/La_Rioja' => {
			exemplarCity => q#ලා රිජෝලා#,
		},
		'America/Argentina/Rio_Gallegos' => {
			exemplarCity => q#රියෝ ගලෙගොස්#,
		},
		'America/Argentina/Salta' => {
			exemplarCity => q#සොල්ටා#,
		},
		'America/Argentina/San_Juan' => {
			exemplarCity => q#සැන් ජුවාන්#,
		},
		'America/Argentina/San_Luis' => {
			exemplarCity => q#සැන් ලුවිස්#,
		},
		'America/Argentina/Tucuman' => {
			exemplarCity => q#ටුකුමන්#,
		},
		'America/Argentina/Ushuaia' => {
			exemplarCity => q#උෂුඅයියා#,
		},
		'America/Aruba' => {
			exemplarCity => q#අරූබා#,
		},
		'America/Asuncion' => {
			exemplarCity => q#අසුන්සියොන්#,
		},
		'America/Bahia' => {
			exemplarCity => q#බහියා#,
		},
		'America/Bahia_Banderas' => {
			exemplarCity => q#බහියා බන්දෙරාස්#,
		},
		'America/Barbados' => {
			exemplarCity => q#බාබඩෝස්#,
		},
		'America/Belem' => {
			exemplarCity => q#බෙලෙම්#,
		},
		'America/Belize' => {
			exemplarCity => q#බෙලීස්#,
		},
		'America/Blanc-Sablon' => {
			exemplarCity => q#බ්ලැන්ක්-සැබ්ලන්#,
		},
		'America/Boa_Vista' => {
			exemplarCity => q#බොආ විස්ටා#,
		},
		'America/Bogota' => {
			exemplarCity => q#බොගොටා#,
		},
		'America/Boise' => {
			exemplarCity => q#බොයිසි#,
		},
		'America/Buenos_Aires' => {
			exemplarCity => q#බුවනෝස් අයර්ස්#,
		},
		'America/Cambridge_Bay' => {
			exemplarCity => q#කේම්බ්‍රිජ් බොක්ක#,
		},
		'America/Campo_Grande' => {
			exemplarCity => q#කම්පෝ ග්‍රෑන්ඩ්#,
		},
		'America/Cancun' => {
			exemplarCity => q#කැන්කුන්#,
		},
		'America/Caracas' => {
			exemplarCity => q#කරකස්#,
		},
		'America/Catamarca' => {
			exemplarCity => q#කටමර්කා#,
		},
		'America/Cayenne' => {
			exemplarCity => q#කේයෙන්#,
		},
		'America/Cayman' => {
			exemplarCity => q#කේමන්#,
		},
		'America/Chicago' => {
			exemplarCity => q#චිකාගෝ#,
		},
		'America/Chihuahua' => {
			exemplarCity => q#චිහුආහුආ#,
		},
		'America/Ciudad_Juarez' => {
			exemplarCity => q#සියුඩාඩ් ජුවාරෙස්#,
		},
		'America/Coral_Harbour' => {
			exemplarCity => q#ඇටිකොකන්#,
		},
		'America/Cordoba' => {
			exemplarCity => q#කොර්දොබා#,
		},
		'America/Costa_Rica' => {
			exemplarCity => q#කොස්ටරිකා#,
		},
		'America/Creston' => {
			exemplarCity => q#ක්‍රෙස්ටන්#,
		},
		'America/Cuiaba' => {
			exemplarCity => q#කුයිඅබා#,
		},
		'America/Curacao' => {
			exemplarCity => q#කුරකාවෝ#,
		},
		'America/Danmarkshavn' => {
			exemplarCity => q#ඩෙන්මාර්ක්ශව්න්#,
		},
		'America/Dawson' => {
			exemplarCity => q#ඩෝසන්#,
		},
		'America/Dawson_Creek' => {
			exemplarCity => q#ඩෝසන් ක්‍රීක්#,
		},
		'America/Denver' => {
			exemplarCity => q#ඩෙන්වර්#,
		},
		'America/Detroit' => {
			exemplarCity => q#ඩෙත්රුවා#,
		},
		'America/Dominica' => {
			exemplarCity => q#ඩොමිනිකා#,
		},
		'America/Edmonton' => {
			exemplarCity => q#එඩ්මන්ටන්#,
		},
		'America/Eirunepe' => {
			exemplarCity => q#එයිරුනේප්#,
		},
		'America/El_Salvador' => {
			exemplarCity => q#එල්සැල්වදෝර්#,
		},
		'America/Fort_Nelson' => {
			exemplarCity => q#ෆෝට් නෙල්සන්#,
		},
		'America/Fortaleza' => {
			exemplarCity => q#ෆොර්ටලේසා#,
		},
		'America/Glace_Bay' => {
			exemplarCity => q#ග්ලේස් බොක්ක#,
		},
		'America/Godthab' => {
			exemplarCity => q#නූක්#,
		},
		'America/Goose_Bay' => {
			exemplarCity => q#ගූස් බොක්ක#,
		},
		'America/Grand_Turk' => {
			exemplarCity => q#ග්රෑන්ඩ් ටර්ක්#,
		},
		'America/Grenada' => {
			exemplarCity => q#ග්‍රැනඩා#,
		},
		'America/Guadeloupe' => {
			exemplarCity => q#ග්වාඩ්ලෝප්#,
		},
		'America/Guatemala' => {
			exemplarCity => q#ගෝතමාලාව#,
		},
		'America/Guayaquil' => {
			exemplarCity => q#ගුඅයාකුයිල්#,
		},
		'America/Guyana' => {
			exemplarCity => q#ගයනාව#,
		},
		'America/Halifax' => {
			exemplarCity => q#හලිෆැක්ස්#,
		},
		'America/Havana' => {
			exemplarCity => q#හවානා#,
		},
		'America/Hermosillo' => {
			exemplarCity => q#හෙමොසිලෝ#,
		},
		'America/Indiana/Knox' => {
			exemplarCity => q#නොක්ස්, ඉන්දියානා#,
		},
		'America/Indiana/Marengo' => {
			exemplarCity => q#මරෙන්ගෝ, ඉන්දියානා#,
		},
		'America/Indiana/Petersburg' => {
			exemplarCity => q#පීටර්ස්බර්ග්, ඉන්දියානා#,
		},
		'America/Indiana/Tell_City' => {
			exemplarCity => q#ටෙල් නගරය, ඉන්දියානා#,
		},
		'America/Indiana/Vevay' => {
			exemplarCity => q#වෙවේ, ඉන්දියානා#,
		},
		'America/Indiana/Vincennes' => {
			exemplarCity => q#වින්සනස්, ඉන්දියානා#,
		},
		'America/Indiana/Winamac' => {
			exemplarCity => q#විනමැක්, ඉන්දියානා#,
		},
		'America/Indianapolis' => {
			exemplarCity => q#ඉන්ඩියානපොලිස්#,
		},
		'America/Inuvik' => {
			exemplarCity => q#ඉනුවික්#,
		},
		'America/Iqaluit' => {
			exemplarCity => q#ඉකාලුයිට්#,
		},
		'America/Jamaica' => {
			exemplarCity => q#ජැමෙයිකා#,
		},
		'America/Jujuy' => {
			exemplarCity => q#ජුජුයි#,
		},
		'America/Juneau' => {
			exemplarCity => q#ජූනෝ#,
		},
		'America/Kentucky/Monticello' => {
			exemplarCity => q#මොන්ටිසෙලෝ, කෙන්ටකි#,
		},
		'America/Kralendijk' => {
			exemplarCity => q#ක්‍රලෙන්දිජ්ක්#,
		},
		'America/La_Paz' => {
			exemplarCity => q#ලා පස්#,
		},
		'America/Lima' => {
			exemplarCity => q#ලීමා#,
		},
		'America/Los_Angeles' => {
			exemplarCity => q#ලොස් ඇන්ජලීස්#,
		},
		'America/Louisville' => {
			exemplarCity => q#ලුවිස්විල්#,
		},
		'America/Lower_Princes' => {
			exemplarCity => q#ලෝවර් ප්‍රින්සස් ක්වාටර්#,
		},
		'America/Maceio' => {
			exemplarCity => q#මසේයියෝ#,
		},
		'America/Managua' => {
			exemplarCity => q#මනගුආ#,
		},
		'America/Manaus' => {
			exemplarCity => q#මැනෝස්#,
		},
		'America/Marigot' => {
			exemplarCity => q#මැරිගොට්#,
		},
		'America/Martinique' => {
			exemplarCity => q#මාටිනික්#,
		},
		'America/Matamoros' => {
			exemplarCity => q#මටමොරොස්#,
		},
		'America/Mazatlan' => {
			exemplarCity => q#මසට්ලාන්#,
		},
		'America/Mendoza' => {
			exemplarCity => q#මෙන්ඩෝසා#,
		},
		'America/Menominee' => {
			exemplarCity => q#මෙනොමිනී#,
		},
		'America/Merida' => {
			exemplarCity => q#මෙරිඩා#,
		},
		'America/Metlakatla' => {
			exemplarCity => q#මෙට්ලකට්ලා#,
		},
		'America/Mexico_City' => {
			exemplarCity => q#මෙක්සිකෝ නගරය#,
		},
		'America/Miquelon' => {
			exemplarCity => q#මිකියුලන්#,
		},
		'America/Moncton' => {
			exemplarCity => q#මොන්ක්ටන්#,
		},
		'America/Monterrey' => {
			exemplarCity => q#මොන්ටෙරේ#,
		},
		'America/Montevideo' => {
			exemplarCity => q#මොන්ටෙවිඩියෝ#,
		},
		'America/Montserrat' => {
			exemplarCity => q#මොන්ට්සේරාට්#,
		},
		'America/Nassau' => {
			exemplarCity => q#නස්සෝ#,
		},
		'America/New_York' => {
			exemplarCity => q#නිව්යෝක්#,
		},
		'America/Nipigon' => {
			exemplarCity => q#නිපිගන්#,
		},
		'America/Nome' => {
			exemplarCity => q#නෝම්#,
		},
		'America/Noronha' => {
			exemplarCity => q#නොරොන්හා#,
		},
		'America/North_Dakota/Beulah' => {
			exemplarCity => q#බියුලා, උතුරු ඩකෝටා#,
		},
		'America/North_Dakota/Center' => {
			exemplarCity => q#මධ්‍යම, උතුරු ඩකෝටා#,
		},
		'America/North_Dakota/New_Salem' => {
			exemplarCity => q#නව සලෙම්ම, උතුරු ඩකෝටා#,
		},
		'America/Ojinaga' => {
			exemplarCity => q#ඔජිනගා#,
		},
		'America/Panama' => {
			exemplarCity => q#පැනමා#,
		},
		'America/Pangnirtung' => {
			exemplarCity => q#පැන්නීටන්#,
		},
		'America/Paramaribo' => {
			exemplarCity => q#පැරාමරිබෝ#,
		},
		'America/Phoenix' => {
			exemplarCity => q#ෆීනික්ස්#,
		},
		'America/Port-au-Prince' => {
			exemplarCity => q#පොර්ට්-ඕ-ප්‍රින්ස්#,
		},
		'America/Port_of_Spain' => {
			exemplarCity => q#පොර්ට් ඔෆ් ස්පෙයින්#,
		},
		'America/Porto_Velho' => {
			exemplarCity => q#පොර්තෝ වෙල්හෝ#,
		},
		'America/Puerto_Rico' => {
			exemplarCity => q#පුවටොරිකෝව#,
		},
		'America/Punta_Arenas' => {
			exemplarCity => q#පුන්ටා ඇරිනාස්#,
		},
		'America/Rainy_River' => {
			exemplarCity => q#රෙයිනි ගඟ#,
		},
		'America/Rankin_Inlet' => {
			exemplarCity => q#රැන්කින් පිවිසුම#,
		},
		'America/Recife' => {
			exemplarCity => q#රෙසිෆ්#,
		},
		'America/Regina' => {
			exemplarCity => q#රෙජිනා#,
		},
		'America/Resolute' => {
			exemplarCity => q#රෙසොලුට්#,
		},
		'America/Rio_Branco' => {
			exemplarCity => q#රියෝ බ්‍රන්කෝ#,
		},
		'America/Santa_Isabel' => {
			exemplarCity => q#සැන්ටා ඉසබෙල්#,
		},
		'America/Santarem' => {
			exemplarCity => q#සන්ටරේම්#,
		},
		'America/Santiago' => {
			exemplarCity => q#සන්තියාගෝ#,
		},
		'America/Santo_Domingo' => {
			exemplarCity => q#සැන්ටෝ ඩොමින්ගෝ#,
		},
		'America/Sao_Paulo' => {
			exemplarCity => q#සාවෝ පෝලො#,
		},
		'America/Scoresbysund' => {
			exemplarCity => q#ඉටොකොර්ටෝමිට්#,
		},
		'America/Sitka' => {
			exemplarCity => q#සිට්කා#,
		},
		'America/St_Barthelemy' => {
			exemplarCity => q#ශාන්ත බර්තලෙමි#,
		},
		'America/St_Johns' => {
			exemplarCity => q#ශාන්ත ජෝන්ගේ#,
		},
		'America/St_Kitts' => {
			exemplarCity => q#ශාන්ත කිට්ස්#,
		},
		'America/St_Lucia' => {
			exemplarCity => q#ශාන්ත ලුසියා#,
		},
		'America/St_Thomas' => {
			exemplarCity => q#ශාන්ත තෝමස්#,
		},
		'America/St_Vincent' => {
			exemplarCity => q#ශාන්ත වින්ට්සන්#,
		},
		'America/Swift_Current' => {
			exemplarCity => q#ස්විෆ්ට් කරන්ට්#,
		},
		'America/Tegucigalpa' => {
			exemplarCity => q#ටෙගුසිගල්පා#,
		},
		'America/Thule' => {
			exemplarCity => q#තුලේ#,
		},
		'America/Thunder_Bay' => {
			exemplarCity => q#තන්ඩර් බොක්ක#,
		},
		'America/Tijuana' => {
			exemplarCity => q#ටිජුආනා#,
		},
		'America/Toronto' => {
			exemplarCity => q#ටොරන්ටෝ#,
		},
		'America/Tortola' => {
			exemplarCity => q#ටොර්ටෝලා#,
		},
		'America/Vancouver' => {
			exemplarCity => q#වැන්කුවර්#,
		},
		'America/Whitehorse' => {
			exemplarCity => q#වයිට්හෝර්ස්#,
		},
		'America/Winnipeg' => {
			exemplarCity => q#විනිපෙග්#,
		},
		'America/Yakutat' => {
			exemplarCity => q#යකුටට්#,
		},
		'America/Yellowknife' => {
			exemplarCity => q#යෙලෝනයිෆ්#,
		},
		'America_Central' => {
			long => {
				'daylight' => q#උතුරු ඇමරිකානු මධ්‍යම දිවාආලෝක වේලාව#,
				'generic' => q#උතුරු ඇමරිකානු මධ්‍යම වේලාව#,
				'standard' => q#උතුරු ඇමරිකානු මධ්‍යම සම්මත වේලාව#,
			},
		},
		'America_Eastern' => {
			long => {
				'daylight' => q#උතුරු ඇමරිකානු නැගෙනහිර දිවාආලෝක වේලාව#,
				'generic' => q#උතුරු ඇමරිකානු නැගෙනහිර වේලාව#,
				'standard' => q#උතුරු ඇමරිකානු නැගෙනහිර සම්මත වේලාව#,
			},
		},
		'America_Mountain' => {
			long => {
				'daylight' => q#උතුරු ඇමරිකානු කඳුකර දිවාආලෝක වේලාව#,
				'generic' => q#උතුරු ඇමරිකානු කඳුකර වේලාව#,
				'standard' => q#උතුරු ඇමරිකානු කඳුකර සම්මත වේලාව#,
			},
		},
		'America_Pacific' => {
			long => {
				'daylight' => q#උතුරු ඇමරිකානු පැසිෆික් දිවාආලෝක වේලාව#,
				'generic' => q#උතුරු ඇමරිකානු පැසිෆික් වේලාව#,
				'standard' => q#උතුරු ඇමරිකානු පැසිෆික් සම්මත වේලාව#,
			},
		},
		'Antarctica/Casey' => {
			exemplarCity => q#කැසේ#,
		},
		'Antarctica/Davis' => {
			exemplarCity => q#ඩේවිස්#,
		},
		'Antarctica/DumontDUrville' => {
			exemplarCity => q#ඩුමොන්ට් ඩු‘ර්විල්#,
		},
		'Antarctica/Macquarie' => {
			exemplarCity => q#මක්කුවරි#,
		},
		'Antarctica/Mawson' => {
			exemplarCity => q#මව්සන්#,
		},
		'Antarctica/McMurdo' => {
			exemplarCity => q#මැක්මුර්ඩෝ#,
		},
		'Antarctica/Palmer' => {
			exemplarCity => q#පැල්මර්#,
		},
		'Antarctica/Rothera' => {
			exemplarCity => q#රොතෙරා#,
		},
		'Antarctica/Syowa' => {
			exemplarCity => q#සියෝවා#,
		},
		'Antarctica/Troll' => {
			exemplarCity => q#ට්‍රෝල්#,
		},
		'Antarctica/Vostok' => {
			exemplarCity => q#වොස්ටොක්#,
		},
		'Apia' => {
			long => {
				'daylight' => q#අපියා දිවා වේලාව#,
				'generic' => q#අපියා වේලාව#,
				'standard' => q#අපියා සම්මත වේලාව#,
			},
		},
		'Arabian' => {
			long => {
				'daylight' => q#අරාබි දහවල් වේලාව#,
				'generic' => q#අරාබි වේලාව#,
				'standard' => q#අරාබි සම්මත වේලාව#,
			},
		},
		'Arctic/Longyearbyen' => {
			exemplarCity => q#ලෝන්ග්ඉයර්බියෙන්#,
		},
		'Argentina' => {
			long => {
				'daylight' => q#ආර්ජන්ටිනා ග්‍රීෂ්ම කාලය#,
				'generic' => q#ආර්ජන්ටිනා වේලාව#,
				'standard' => q#ආර්ජන්ටිනා සම්මත වේලාව#,
			},
		},
		'Argentina_Western' => {
			long => {
				'daylight' => q#බටහිර ආර්ජන්ටිනා ග්‍රීෂ්ම කාලය#,
				'generic' => q#බටහිර ආර්ජන්ටිනා වේලාව#,
				'standard' => q#බටහිර ආර්ජන්ටිනා සම්මත වේලාව#,
			},
		},
		'Armenia' => {
			long => {
				'daylight' => q#ආමේනියානු ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ආමේනියානු වේලාව#,
				'standard' => q#ආමේනියානු සම්මත වේලාව#,
			},
		},
		'Asia/Aden' => {
			exemplarCity => q#ඒඩ්න්#,
		},
		'Asia/Almaty' => {
			exemplarCity => q#අල්මටි#,
		},
		'Asia/Amman' => {
			exemplarCity => q#අම්මාන්#,
		},
		'Asia/Anadyr' => {
			exemplarCity => q#ඇනාදිය්ර්#,
		},
		'Asia/Aqtau' => {
			exemplarCity => q#අක්ටෝ#,
		},
		'Asia/Aqtobe' => {
			exemplarCity => q#අක්ටෝබ්#,
		},
		'Asia/Ashgabat' => {
			exemplarCity => q#අශ්ගබැට්#,
		},
		'Asia/Atyrau' => {
			exemplarCity => q#ඇටිරවු#,
		},
		'Asia/Baghdad' => {
			exemplarCity => q#බැග්ඩෑඩ්#,
		},
		'Asia/Bahrain' => {
			exemplarCity => q#බහරේන්#,
		},
		'Asia/Baku' => {
			exemplarCity => q#බාකු#,
		},
		'Asia/Bangkok' => {
			exemplarCity => q#බැංකොක්#,
		},
		'Asia/Barnaul' => {
			exemplarCity => q#බර්නෞල්#,
		},
		'Asia/Beirut' => {
			exemplarCity => q#බීරුට්#,
		},
		'Asia/Bishkek' => {
			exemplarCity => q#බිශ්කෙක්#,
		},
		'Asia/Brunei' => {
			exemplarCity => q#බෲනායි#,
		},
		'Asia/Calcutta' => {
			exemplarCity => q#කල්කටා#,
		},
		'Asia/Chita' => {
			exemplarCity => q#චිටා#,
		},
		'Asia/Choibalsan' => {
			exemplarCity => q#චොයිබල්සාන්#,
		},
		'Asia/Colombo' => {
			exemplarCity => q#කොළඹ#,
		},
		'Asia/Damascus' => {
			exemplarCity => q#ඩැමස්කස්#,
		},
		'Asia/Dhaka' => {
			exemplarCity => q#ඩකා#,
		},
		'Asia/Dili' => {
			exemplarCity => q#ඩිලි#,
		},
		'Asia/Dubai' => {
			exemplarCity => q#ඩුබායි#,
		},
		'Asia/Dushanbe' => {
			exemplarCity => q#ඩුශන්බේ#,
		},
		'Asia/Famagusta' => {
			exemplarCity => q#ෆැමගුස්ටා#,
		},
		'Asia/Gaza' => {
			exemplarCity => q#ගාසා#,
		},
		'Asia/Hebron' => {
			exemplarCity => q#හෙබ්රෝන්#,
		},
		'Asia/Hong_Kong' => {
			exemplarCity => q#හොංකොං#,
		},
		'Asia/Hovd' => {
			exemplarCity => q#හොව්ඩ්#,
		},
		'Asia/Irkutsk' => {
			exemplarCity => q#ඉරකුට්ස්ක්#,
		},
		'Asia/Jakarta' => {
			exemplarCity => q#ජකර්තා#,
		},
		'Asia/Jayapura' => {
			exemplarCity => q#ජයපුර#,
		},
		'Asia/Jerusalem' => {
			exemplarCity => q#ජෙරුසලම#,
		},
		'Asia/Kabul' => {
			exemplarCity => q#කාබුල්#,
		},
		'Asia/Kamchatka' => {
			exemplarCity => q#කම්චට්කා#,
		},
		'Asia/Karachi' => {
			exemplarCity => q#කරච්චිචි#,
		},
		'Asia/Katmandu' => {
			exemplarCity => q#කත්මන්ඩු#,
		},
		'Asia/Khandyga' => {
			exemplarCity => q#ඛන්ඩිගා#,
		},
		'Asia/Krasnoyarsk' => {
			exemplarCity => q#ක්‍රස්නෝයාර්ස්ක්#,
		},
		'Asia/Kuala_Lumpur' => {
			exemplarCity => q#ක්වාලාලම්පූර්#,
		},
		'Asia/Kuching' => {
			exemplarCity => q#කුචිං#,
		},
		'Asia/Kuwait' => {
			exemplarCity => q#කුවේට්#,
		},
		'Asia/Macau' => {
			exemplarCity => q#මැකාවු#,
		},
		'Asia/Magadan' => {
			exemplarCity => q#මගඩන්#,
		},
		'Asia/Makassar' => {
			exemplarCity => q#මක්ස්සාර්#,
		},
		'Asia/Manila' => {
			exemplarCity => q#මැනිලා#,
		},
		'Asia/Muscat' => {
			exemplarCity => q#මස්කට්#,
		},
		'Asia/Nicosia' => {
			exemplarCity => q#නිකෝසියා#,
		},
		'Asia/Novokuznetsk' => {
			exemplarCity => q#නොවොකුස්නේට්ස්ක්#,
		},
		'Asia/Novosibirsk' => {
			exemplarCity => q#නොවොසිබර්ස්ක්#,
		},
		'Asia/Omsk' => {
			exemplarCity => q#ඔම්ස්ක්#,
		},
		'Asia/Oral' => {
			exemplarCity => q#ඔරාල්#,
		},
		'Asia/Phnom_Penh' => {
			exemplarCity => q#නොම් පෙන්#,
		},
		'Asia/Pontianak' => {
			exemplarCity => q#පොන්ටියනක්#,
		},
		'Asia/Pyongyang' => {
			exemplarCity => q#ප්යෝන්ග්යැන්ග්#,
		},
		'Asia/Qatar' => {
			exemplarCity => q#කටාර්#,
		},
		'Asia/Qostanay' => {
			exemplarCity => q#කොස්තානේ#,
		},
		'Asia/Qyzylorda' => {
			exemplarCity => q#ක්යිසිලෝර්ඩා#,
		},
		'Asia/Rangoon' => {
			exemplarCity => q#රැංගුන්#,
		},
		'Asia/Riyadh' => {
			exemplarCity => q#රියාද්#,
		},
		'Asia/Saigon' => {
			exemplarCity => q#හෝචි මිං නගරය#,
		},
		'Asia/Sakhalin' => {
			exemplarCity => q#සක්හලින්#,
		},
		'Asia/Samarkand' => {
			exemplarCity => q#සාමාර්කන්ඩ්#,
		},
		'Asia/Seoul' => {
			exemplarCity => q#සෝල්#,
		},
		'Asia/Shanghai' => {
			exemplarCity => q#ෂැන්හයි#,
		},
		'Asia/Singapore' => {
			exemplarCity => q#සිංගප්පූරුව#,
		},
		'Asia/Srednekolymsk' => {
			exemplarCity => q#ශ්‍රෙඩ්නෙකෝලිම්සක්#,
		},
		'Asia/Taipei' => {
			exemplarCity => q#තායිපෙ#,
		},
		'Asia/Tashkent' => {
			exemplarCity => q#ටෂ්කෙන්ට්#,
		},
		'Asia/Tbilisi' => {
			exemplarCity => q#ට්බිලිසි#,
		},
		'Asia/Tehran' => {
			exemplarCity => q#ටෙහෙරාන්#,
		},
		'Asia/Thimphu' => {
			exemplarCity => q#තිම්පු#,
		},
		'Asia/Tokyo' => {
			exemplarCity => q#ටෝකියෝ#,
		},
		'Asia/Tomsk' => {
			exemplarCity => q#ටොම්ස්ක්#,
		},
		'Asia/Ulaanbaatar' => {
			exemplarCity => q#උලාන්බාටර්#,
		},
		'Asia/Urumqi' => {
			exemplarCity => q#උරුම්කි#,
		},
		'Asia/Ust-Nera' => {
			exemplarCity => q#උස්ට්-නෙරා#,
		},
		'Asia/Vientiane' => {
			exemplarCity => q#වියැන්ටියන්#,
		},
		'Asia/Vladivostok' => {
			exemplarCity => q#ව්ලඩිවොස්ටොක්#,
		},
		'Asia/Yakutsk' => {
			exemplarCity => q#යකුට්ස්ක්#,
		},
		'Asia/Yekaterinburg' => {
			exemplarCity => q#යෙකටරින්බර්ග්#,
		},
		'Asia/Yerevan' => {
			exemplarCity => q#යෙරෙවන්#,
		},
		'Atlantic' => {
			long => {
				'daylight' => q#අත්ලාන්තික් දිවාආලෝක වේලාව#,
				'generic' => q#අත්ලාන්තික් වේලාව#,
				'standard' => q#අත්ලාන්තික් සම්මත වේලාව#,
			},
		},
		'Atlantic/Azores' => {
			exemplarCity => q#ඇසොරේ#,
		},
		'Atlantic/Bermuda' => {
			exemplarCity => q#බර්මියුඩා#,
		},
		'Atlantic/Canary' => {
			exemplarCity => q#කැනරි#,
		},
		'Atlantic/Cape_Verde' => {
			exemplarCity => q#කේප් වර්ඩ්#,
		},
		'Atlantic/Faeroe' => {
			exemplarCity => q#ෆාරෝ#,
		},
		'Atlantic/Madeira' => {
			exemplarCity => q#මඩෙයිරා#,
		},
		'Atlantic/Reykjavik' => {
			exemplarCity => q#රෙයික්ජාවික්#,
		},
		'Atlantic/South_Georgia' => {
			exemplarCity => q#දකුණු ජෝර්ජියාව#,
		},
		'Atlantic/St_Helena' => {
			exemplarCity => q#ශා. හෙලේනා#,
		},
		'Atlantic/Stanley' => {
			exemplarCity => q#ස්ටැන්ලි#,
		},
		'Australia/Adelaide' => {
			exemplarCity => q#ඇඩිලේඩ්#,
		},
		'Australia/Brisbane' => {
			exemplarCity => q#බ්‍රිස්බේන්#,
		},
		'Australia/Broken_Hill' => {
			exemplarCity => q#බ්‍රෝකන් හිල්#,
		},
		'Australia/Currie' => {
			exemplarCity => q#කුරී#,
		},
		'Australia/Darwin' => {
			exemplarCity => q#ඩාවින්#,
		},
		'Australia/Eucla' => {
			exemplarCity => q#ඉයුක්ලා#,
		},
		'Australia/Hobart' => {
			exemplarCity => q#හෝබාර්ට්#,
		},
		'Australia/Lindeman' => {
			exemplarCity => q#ලින්ඩේමන්#,
		},
		'Australia/Lord_Howe' => {
			exemplarCity => q#ලෝර්ඩ් හෝව්#,
		},
		'Australia/Melbourne' => {
			exemplarCity => q#මෙල්බෝර්න්#,
		},
		'Australia/Perth' => {
			exemplarCity => q#පර්ත්#,
		},
		'Australia/Sydney' => {
			exemplarCity => q#සිඩ්නි#,
		},
		'Australia_Central' => {
			long => {
				'daylight' => q#මධ්‍යම ඔස්ට්‍රේලියානු දහවල් වේලාව#,
				'generic' => q#මධ්‍යම ඕස්ට්‍රේලියානු වේලාව#,
				'standard' => q#ඕස්ට්‍රේලියානු සම්මත වේලාව#,
			},
		},
		'Australia_CentralWestern' => {
			long => {
				'daylight' => q#මධ්‍යම බටහිර ඔස්ට්‍රේලියානු දහවල් වේලාව#,
				'generic' => q#මධ්‍යම බටහිර ඔස්ට්‍රේලියානු වේලාව#,
				'standard' => q#මධ්‍යම බටහිර ඔස්ට්‍රේලියානු සම්මත වේලාව#,
			},
		},
		'Australia_Eastern' => {
			long => {
				'daylight' => q#නැඟෙනහිර ඕස්ට්‍රේලියානු දහවල් වේලාව#,
				'generic' => q#නැගෙනහිර ඕස්ට්‍රේලියානු වේලාව#,
				'standard' => q#නැගෙනහිර ඕස්ට්‍රේලියානු සම්මත වේලාව#,
			},
		},
		'Australia_Western' => {
			long => {
				'daylight' => q#බටහිර ඔස්ට්‍රේලියානු දහවල් වේලාව#,
				'generic' => q#බටහිර ඕස්ට්‍රේලියානු වේලාව#,
				'standard' => q#බටහිර ඕස්ට්‍රේලියානු සම්මත වේලාව#,
			},
		},
		'Azerbaijan' => {
			long => {
				'daylight' => q#අසර්බයිජාන් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#අසර්බයිජාන් වේලාව#,
				'standard' => q#අසර්බයිජාන් සම්මත වේලාව#,
			},
		},
		'Azores' => {
			long => {
				'daylight' => q#ඇසොර්ස් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ඇසොර්ස් වේලාව#,
				'standard' => q#ඇසොර්ස් සම්මත වේලාව#,
			},
		},
		'Bangladesh' => {
			long => {
				'daylight' => q#බංගලාදේශ ග්‍රීෂ්ම කාලය#,
				'generic' => q#බංගලාදේශ වේලාව#,
				'standard' => q#බංගලාදේශ සම්මත වේලාව#,
			},
		},
		'Bhutan' => {
			long => {
				'standard' => q#භුතාන වේලාව#,
			},
		},
		'Bolivia' => {
			long => {
				'standard' => q#බොලිවියා වේලාව#,
			},
		},
		'Brasilia' => {
			long => {
				'daylight' => q#බ්‍රසීල ග්‍රීෂ්ම කාලය#,
				'generic' => q#බ්‍රසීල වේලාව#,
				'standard' => q#බ්‍රසීල සම්මත වේලාව#,
			},
		},
		'Brunei' => {
			long => {
				'standard' => q#බෘනායි දරුස්සලාම් වේලාව#,
			},
		},
		'Cape_Verde' => {
			long => {
				'daylight' => q#කේප්වේඩ් ග්‍රීෂ්ම කාලය#,
				'generic' => q#කේප්වේඩ් වේලාව#,
				'standard' => q#කේප්වේඩ් සම්මත වේලාව#,
			},
		},
		'Chamorro' => {
			long => {
				'standard' => q#චමොරෝ වේලාව#,
			},
		},
		'Chatham' => {
			long => {
				'daylight' => q#චැතම් දිවා වේලාව#,
				'generic' => q#චැතම් වේලාව#,
				'standard' => q#චැතම් සම්මත වේලාව#,
			},
		},
		'Chile' => {
			long => {
				'daylight' => q#චිලී ග්‍රීෂ්ම කාලය#,
				'generic' => q#චිලී වේලාව#,
				'standard' => q#චිලී සම්මත වේලාව#,
			},
		},
		'China' => {
			long => {
				'daylight' => q#චීන දහවල් වේලාව#,
				'generic' => q#චීන වේලාව#,
				'standard' => q#චීන සම්මත වේලාව#,
			},
		},
		'Choibalsan' => {
			long => {
				'daylight' => q#චොයිබල්සාන් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#චොයිබල්සාන් වේලාව#,
				'standard' => q#චොයිබල්සාන් සම්මත වේලාව#,
			},
		},
		'Christmas' => {
			long => {
				'standard' => q#ක්‍රිස්මස් දුපත් වේලාව#,
			},
		},
		'Cocos' => {
			long => {
				'standard' => q#කොකෝස් දුපත් වේලාව#,
			},
		},
		'Colombia' => {
			long => {
				'daylight' => q#කොලොම්බියා ග්‍රීෂ්ම කාලය#,
				'generic' => q#කොලොම්බියා වේලාව#,
				'standard' => q#කොලොම්බියා සම්මත වේලාව#,
			},
		},
		'Cook' => {
			long => {
				'daylight' => q#කුක් දුපත් භාග ග්‍රීෂ්ම වේලාව#,
				'generic' => q#කුක් දුපත් වේලාව#,
				'standard' => q#කුක් දුපත් සම්මත වේලාව#,
			},
		},
		'Cuba' => {
			long => {
				'daylight' => q#කියුබානු දිවාආලෝක වේලාව#,
				'generic' => q#කියුබානු වේලාව#,
				'standard' => q#කියුබානු සම්මත වේලාව#,
			},
		},
		'Davis' => {
			long => {
				'standard' => q#ඩාවිස් වේලාව#,
			},
		},
		'DumontDUrville' => {
			long => {
				'standard' => q#දුමොන්ත්-ඩ්උර්විල් වේලාව#,
			},
		},
		'East_Timor' => {
			long => {
				'standard' => q#නැගෙනහිර ටිමෝර් වේලාව#,
			},
		},
		'Easter' => {
			long => {
				'daylight' => q#ඊස්ටර් දූපත් ග්‍රීෂ්ම කාලය#,
				'generic' => q#ඊස්ටර් දූපත් වේලාව#,
				'standard' => q#ඊස්ටර් දූපත් සම්මත වේලාව#,
			},
		},
		'Ecuador' => {
			long => {
				'standard' => q#ඉක්වදෝර් වේලාව#,
			},
		},
		'Etc/UTC' => {
			long => {
				'standard' => q#සමකක්ෂ සාර්ව වේලාව#,
			},
		},
		'Etc/Unknown' => {
			exemplarCity => q#හඳුනා නොගත් නගරය#,
		},
		'Europe/Amsterdam' => {
			exemplarCity => q#ඇම්ස්ටර්ඩෑම්#,
		},
		'Europe/Andorra' => {
			exemplarCity => q#ඇන්ඩෝරාව#,
		},
		'Europe/Astrakhan' => {
			exemplarCity => q#අස්ට්‍රඛාන්#,
		},
		'Europe/Athens' => {
			exemplarCity => q#ඇතැන්ස්#,
		},
		'Europe/Belgrade' => {
			exemplarCity => q#බෙල්ග්‍රේඩ්ඩ්#,
		},
		'Europe/Berlin' => {
			exemplarCity => q#බර්ලින්#,
		},
		'Europe/Bratislava' => {
			exemplarCity => q#බ්‍රටිස්ලවා#,
		},
		'Europe/Brussels' => {
			exemplarCity => q#බ්‍රසල්ස්#,
		},
		'Europe/Bucharest' => {
			exemplarCity => q#බුකාරෙස්ට්#,
		},
		'Europe/Budapest' => {
			exemplarCity => q#බුඩාපෙස්ට්#,
		},
		'Europe/Busingen' => {
			exemplarCity => q#බුසින්ජෙන්#,
		},
		'Europe/Chisinau' => {
			exemplarCity => q#චිසිනෝ#,
		},
		'Europe/Copenhagen' => {
			exemplarCity => q#කෝපන්හේගන්#,
		},
		'Europe/Dublin' => {
			exemplarCity => q#ඩබ්ලින්#,
			long => {
				'daylight' => q#අයර්ලන්ත සම්මත වේලාව#,
			},
		},
		'Europe/Gibraltar' => {
			exemplarCity => q#ජිබ්රෝල්ටා#,
		},
		'Europe/Guernsey' => {
			exemplarCity => q#ගුවන්සේ#,
		},
		'Europe/Helsinki' => {
			exemplarCity => q#හෙල්සින්කි#,
		},
		'Europe/Isle_of_Man' => {
			exemplarCity => q#අයිල් ඔෆ් මෑන්#,
		},
		'Europe/Istanbul' => {
			exemplarCity => q#ඉස්තාන්බුල්#,
		},
		'Europe/Jersey' => {
			exemplarCity => q#ජර්සි#,
		},
		'Europe/Kaliningrad' => {
			exemplarCity => q#කලිනින්ග්‍රෑඩ්#,
		},
		'Europe/Kiev' => {
			exemplarCity => q#කිව්#,
		},
		'Europe/Kirov' => {
			exemplarCity => q#කිරොව්#,
		},
		'Europe/Lisbon' => {
			exemplarCity => q#ලිස්බන්#,
		},
		'Europe/Ljubljana' => {
			exemplarCity => q#ල්ජුබුල්ජනා#,
		},
		'Europe/London' => {
			exemplarCity => q#ලන්ඩන්#,
			long => {
				'daylight' => q#බ්‍රිතාන්‍ය ගිම්හාන වේලාව#,
			},
		},
		'Europe/Luxembourg' => {
			exemplarCity => q#ලක්සැම්බර්ග්#,
		},
		'Europe/Madrid' => {
			exemplarCity => q#මැඩ්රිඩ්#,
		},
		'Europe/Malta' => {
			exemplarCity => q#මෝල්ටා#,
		},
		'Europe/Mariehamn' => {
			exemplarCity => q#මරියෙහම්න්#,
		},
		'Europe/Minsk' => {
			exemplarCity => q#මින්ස්ක්#,
		},
		'Europe/Monaco' => {
			exemplarCity => q#මොනැකෝ#,
		},
		'Europe/Moscow' => {
			exemplarCity => q#මොස්කව්#,
		},
		'Europe/Oslo' => {
			exemplarCity => q#ඔස්ලෝ#,
		},
		'Europe/Paris' => {
			exemplarCity => q#පැරිස්#,
		},
		'Europe/Podgorica' => {
			exemplarCity => q#පොඩ්ගොරිකා#,
		},
		'Europe/Prague' => {
			exemplarCity => q#ප්‍රෙග්#,
		},
		'Europe/Riga' => {
			exemplarCity => q#රිගා#,
		},
		'Europe/Rome' => {
			exemplarCity => q#රෝමය#,
		},
		'Europe/Samara' => {
			exemplarCity => q#සමරා#,
		},
		'Europe/San_Marino' => {
			exemplarCity => q#සැන් මැරිනෝ#,
		},
		'Europe/Sarajevo' => {
			exemplarCity => q#සරාජෙවෝ#,
		},
		'Europe/Saratov' => {
			exemplarCity => q#සරටොව්#,
		},
		'Europe/Simferopol' => {
			exemplarCity => q#සිම්ෆෙරෝපොල්#,
		},
		'Europe/Skopje' => {
			exemplarCity => q#ස්කොප්ජේ#,
		},
		'Europe/Sofia' => {
			exemplarCity => q#සොෆියා#,
		},
		'Europe/Stockholm' => {
			exemplarCity => q#ස්ටොක්හෝම්#,
		},
		'Europe/Tallinn' => {
			exemplarCity => q#ටලින්#,
		},
		'Europe/Tirane' => {
			exemplarCity => q#ටිරානේ#,
		},
		'Europe/Ulyanovsk' => {
			exemplarCity => q#උල්යනොව්ස්ක්#,
		},
		'Europe/Uzhgorod' => {
			exemplarCity => q#උස්ගොරෝඩ්#,
		},
		'Europe/Vaduz' => {
			exemplarCity => q#වඩුස්#,
		},
		'Europe/Vatican' => {
			exemplarCity => q#වතිකානුව#,
		},
		'Europe/Vienna' => {
			exemplarCity => q#වියනා#,
		},
		'Europe/Vilnius' => {
			exemplarCity => q#විල්නියුස්#,
		},
		'Europe/Volgograd' => {
			exemplarCity => q#වොල්ගොග්‍රෑඩ්#,
		},
		'Europe/Warsaw' => {
			exemplarCity => q#වර්සෝ#,
		},
		'Europe/Zagreb' => {
			exemplarCity => q#සග්රෙබ්#,
		},
		'Europe/Zaporozhye' => {
			exemplarCity => q#සපොරෝසියේ#,
		},
		'Europe/Zurich' => {
			exemplarCity => q#සූරිච්#,
		},
		'Europe_Central' => {
			long => {
				'daylight' => q#මධ්‍යම යුරෝපීය ග්‍රීෂ්ම වේලාව#,
				'generic' => q#මධ්‍යම යුරෝපීය වේලාව#,
				'standard' => q#මධ්‍යම යුරෝපීය සම්මත වේලාව#,
			},
		},
		'Europe_Eastern' => {
			long => {
				'daylight' => q#නැගෙනහිර යුරෝපීය ග්‍රීෂ්ම වේලාව#,
				'generic' => q#නැගෙනහිර යුරෝපීය වේලාව#,
				'standard' => q#නැගෙනහිර යුරෝපීය සම්මත වේලාව#,
			},
		},
		'Europe_Further_Eastern' => {
			long => {
				'standard' => q#තවත්-නැගෙනහිර යුරෝපීය වේලාව#,
			},
		},
		'Europe_Western' => {
			long => {
				'daylight' => q#බටහිර යුරෝපීය ග්‍රීෂ්ම වේලාව#,
				'generic' => q#බටහිර යුරෝපීය වේලාව#,
				'standard' => q#බටහිර යුරෝපීය සම්මත වේලාව#,
			},
		},
		'Falkland' => {
			long => {
				'daylight' => q#ෆෝක්ලන්ඩ් දූපත් ග්‍රීෂ්ම කාලය#,
				'generic' => q#ෆෝක්ලන්ඩ් දූපත් වේලාව#,
				'standard' => q#ෆෝක්ලන්ඩ් දූපත් සම්මත වේලාව#,
			},
		},
		'Fiji' => {
			long => {
				'daylight' => q#ෆිජි ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ෆිජි වේලාව#,
				'standard' => q#ෆිජි සම්මත වේලාව#,
			},
		},
		'French_Guiana' => {
			long => {
				'standard' => q#ප්‍රංශ ගයනා වේලාව#,
			},
		},
		'French_Southern' => {
			long => {
				'standard' => q#ප්‍රංශ දකුණුදිග සහ ඇන්ටාර්ක්ටික් වේලාව#,
			},
		},
		'GMT' => {
			long => {
				'standard' => q#ග්‍රිනිච් මධ්‍යම වේලාව#,
			},
		},
		'Galapagos' => {
			long => {
				'standard' => q#ගලපගොස් වේලාව#,
			},
		},
		'Gambier' => {
			long => {
				'standard' => q#ගැම්බියර් වේලාව#,
			},
		},
		'Georgia' => {
			long => {
				'daylight' => q#ජෝර්ජියානු ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ජෝර්ජියානු වේලාව#,
				'standard' => q#ජෝර්ජියානු සම්මත වේලාව#,
			},
		},
		'Gilbert_Islands' => {
			long => {
				'standard' => q#ගිල්බර්ට් දුපත් වේලාව#,
			},
		},
		'Greenland_Eastern' => {
			long => {
				'daylight' => q#නැගෙනහිර ග්‍රීන්ලන්ත ග්‍රීෂ්ම කාලය#,
				'generic' => q#නැගෙනහිර ග්‍රීන්ලන්ත වේලාව#,
				'standard' => q#නැගෙනහිර ග්‍රීන්ලන්ත සම්මත වේලාව#,
			},
		},
		'Greenland_Western' => {
			long => {
				'daylight' => q#බටහිර ග්‍රීන්ලන්ත ග්‍රීෂ්ම කාලය#,
				'generic' => q#බටහිර ග්‍රීන්ලන්ත වේලාව#,
				'standard' => q#බටහිර ග්‍රීන්ලන්ත සම්මත වේලාව#,
			},
		},
		'Gulf' => {
			long => {
				'standard' => q#ගල්ෆ් වේලාව#,
			},
		},
		'Guyana' => {
			long => {
				'standard' => q#ගයනා වේලාව#,
			},
		},
		'Hawaii_Aleutian' => {
			long => {
				'daylight' => q#හවායි-අලෙයුතියාන් දිවාආලෝක වේලාව#,
				'generic' => q#හවායි-අලෙයුතියාන් වේලාව#,
				'standard' => q#හවායි-අලෙයුතියාන් සම්මත වේලාව#,
			},
		},
		'Hong_Kong' => {
			long => {
				'daylight' => q#හොංකොං ග්‍රීෂ්ම වේලාව#,
				'generic' => q#හොංකොං වේලාව#,
				'standard' => q#හොංකොං සම්මත වේලාව#,
			},
		},
		'Hovd' => {
			long => {
				'daylight' => q#හොව්ඩ් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#හොව්ඩ් වේලාව#,
				'standard' => q#හොව්ඩ් සම්මත වේලාව#,
			},
		},
		'India' => {
			long => {
				'standard' => q#ඉන්දියානු වේලාව#,
			},
		},
		'Indian/Antananarivo' => {
			exemplarCity => q#ඇන්ටනානරිවෝ#,
		},
		'Indian/Chagos' => {
			exemplarCity => q#චාගොස්#,
		},
		'Indian/Christmas' => {
			exemplarCity => q#ක්‍රිස්මස්#,
		},
		'Indian/Cocos' => {
			exemplarCity => q#කොකොස්#,
		},
		'Indian/Comoro' => {
			exemplarCity => q#කොමොරෝ#,
		},
		'Indian/Kerguelen' => {
			exemplarCity => q#කෙර්ගුඑලෙන්#,
		},
		'Indian/Mahe' => {
			exemplarCity => q#මාහේ#,
		},
		'Indian/Maldives' => {
			exemplarCity => q#මාල දිවයින#,
		},
		'Indian/Mauritius' => {
			exemplarCity => q#මුරුසිය#,
		},
		'Indian/Mayotte' => {
			exemplarCity => q#මයෝටි#,
		},
		'Indian/Reunion' => {
			exemplarCity => q#රියුනියන්#,
		},
		'Indian_Ocean' => {
			long => {
				'standard' => q#ඉන්දියන් සාගර වේලාව#,
			},
		},
		'Indochina' => {
			long => {
				'standard' => q#ඉන්දුචීන වේලාව#,
			},
		},
		'Indonesia_Central' => {
			long => {
				'standard' => q#මධ්‍යම ඉන්දුනීසියානු වේලාව#,
			},
		},
		'Indonesia_Eastern' => {
			long => {
				'standard' => q#නැගෙනහිර ඉන්දුනීසියානු වේලාව#,
			},
		},
		'Indonesia_Western' => {
			long => {
				'standard' => q#බටහිර ඉන්දුනීසියානු වේලාව#,
			},
		},
		'Iran' => {
			long => {
				'daylight' => q#ඉරාන දිවා කාලය#,
				'generic' => q#ඉරාන වේලාව#,
				'standard' => q#ඉරාන සම්මත වේලාව#,
			},
		},
		'Irkutsk' => {
			long => {
				'daylight' => q#ඉර්කුට්ස්ක් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ඉර්කුට්ස්ක් වේලාව#,
				'standard' => q#ඉර්කුට්ස්ක් සම්මත වේලාව#,
			},
		},
		'Israel' => {
			long => {
				'daylight' => q#ඊශ්‍රායල දහවල් වේලාව#,
				'generic' => q#ඊශ්‍රායල වේලාව#,
				'standard' => q#ඊශ්‍රායල සම්මත වේලාව#,
			},
		},
		'Japan' => {
			long => {
				'daylight' => q#ජපාන දහවල් වේලාව#,
				'generic' => q#ජපාන වේලාව#,
				'standard' => q#ජපාන සම්මත වේලාව#,
			},
		},
		'Kazakhstan_Eastern' => {
			long => {
				'standard' => q#නැගෙනහිර කසකස්තාන වේලාව#,
			},
		},
		'Kazakhstan_Western' => {
			long => {
				'standard' => q#බටහිර කසකස්තාන වේලාව#,
			},
		},
		'Korea' => {
			long => {
				'daylight' => q#කොරියානු දහවල් වේලාව#,
				'generic' => q#කොරියානු වේලාව#,
				'standard' => q#කොරියානු සම්මත වේලාව#,
			},
		},
		'Kosrae' => {
			long => {
				'standard' => q#කොස්රේ වේලාව#,
			},
		},
		'Krasnoyarsk' => {
			long => {
				'daylight' => q#ක්‍රස්නොයාර්ස්ක් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ක්‍රස්නොයාර්ස්ක් වේලාව#,
				'standard' => q#ක්‍රස්නොයාර්ස්ක් සම්මත වේලාව#,
			},
		},
		'Kyrgystan' => {
			long => {
				'standard' => q#කිර්ගිස්තාන වේලාව#,
			},
		},
		'Lanka' => {
			long => {
				'standard' => q#ශ්‍රී ලංකා වේලාව#,
			},
		},
		'Line_Islands' => {
			long => {
				'standard' => q#ලයින් දුපත් වේලාව#,
			},
		},
		'Lord_Howe' => {
			long => {
				'daylight' => q#ලෝර්ඩ් හෝව් දිවා වේලාව#,
				'generic' => q#ලෝර්ඩ් හෝව් වේලාව#,
				'standard' => q#ලෝර්ඩ් හෝව් සම්මත වේලාව#,
			},
		},
		'Macquarie' => {
			long => {
				'standard' => q#මැක්කුඅරි දුපත් වේලාව#,
			},
		},
		'Magadan' => {
			long => {
				'daylight' => q#මෙගඩන් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#මෙගඩන් වේලාව#,
				'standard' => q#මෙගඩන් සම්මත වේලාව#,
			},
		},
		'Malaysia' => {
			long => {
				'standard' => q#මැලේසියානු වේලාව#,
			},
		},
		'Maldives' => {
			long => {
				'standard' => q#මාලදිවයින් වේලාව#,
			},
		},
		'Marquesas' => {
			long => {
				'standard' => q#මාර්කුඑසාස් වේලාව#,
			},
		},
		'Marshall_Islands' => {
			long => {
				'standard' => q#මාර්ෂල් දුපත් වේලාව#,
			},
		},
		'Mauritius' => {
			long => {
				'daylight' => q#මුරුසි ග්‍රීෂ්ම කාලය#,
				'generic' => q#මුරුසි වේලාව#,
				'standard' => q#මුරුසි සම්මත වේලාව#,
			},
		},
		'Mawson' => {
			long => {
				'standard' => q#මොව්සන් වේලාව#,
			},
		},
		'Mexico_Northwest' => {
			long => {
				'daylight' => q#වයඹ මෙක්සිකෝ දිවාආලෝක වේලාව#,
				'generic' => q#වයඹ මෙක්සිකෝ වේලාව#,
				'standard' => q#වයඹ මෙක්සිකෝ සම්මත වේලාව#,
			},
		},
		'Mexico_Pacific' => {
			long => {
				'daylight' => q#මෙක්සිකෝ පැසිෆික් දිවාආලෝක වේලාව#,
				'generic' => q#මෙක්සිකෝ පැසිෆික් වේලාව#,
				'standard' => q#මෙක්සිකෝ පැසිෆික් සම්මත වේලාව#,
			},
		},
		'Mongolia' => {
			long => {
				'daylight' => q#උලාන් බාටර් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#උලාන් බාටර් වේලාව#,
				'standard' => q#උලාන් බාටර් සම්මත වේලාව#,
			},
		},
		'Moscow' => {
			long => {
				'daylight' => q#මොස්කව් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#මොස්කව් වේලාව#,
				'standard' => q#මොස්කව් සම්මත වේලාව#,
			},
		},
		'Myanmar' => {
			long => {
				'standard' => q#මියන්මාර් වේලාව#,
			},
		},
		'Nauru' => {
			long => {
				'standard' => q#නාවුරු වේලාව#,
			},
		},
		'Nepal' => {
			long => {
				'standard' => q#නේපාල වේලාව#,
			},
		},
		'New_Caledonia' => {
			long => {
				'daylight' => q#නව සෙලඩොනියානු ග්‍රීෂ්ම වේලාව#,
				'generic' => q#නව සෙලඩොනියානු වේලාව#,
				'standard' => q#නව සෙලඩොනියානු සම්මත වේලාව#,
			},
		},
		'New_Zealand' => {
			long => {
				'daylight' => q#නවසීලන්ත දිවා වේලාව#,
				'generic' => q#නවසීලන්ත වේලාව#,
				'standard' => q#නවසීලන්ත සම්මත වේලාව#,
			},
		},
		'Newfoundland' => {
			long => {
				'daylight' => q#නිව්ෆවුන්ලන්ත දිවාආලෝක වේලාව#,
				'generic' => q#නිව්ෆවුන්ලන්ත වේලාව#,
				'standard' => q#නිව්ෆවුන්ලන්ත සම්මත වේලාව#,
			},
		},
		'Niue' => {
			long => {
				'standard' => q#නියු වේලාව#,
			},
		},
		'Norfolk' => {
			long => {
				'daylight' => q#නොෆොල්ක් දුපත් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#නොෆොල්ක් දුපත් වේලාව#,
				'standard' => q#නොෆොල්ක් දුපත් සම්මත වේලාව#,
			},
		},
		'Noronha' => {
			long => {
				'daylight' => q#ෆර්නැන්ඩෝ ඩි නොරොන්හා ග්‍රීෂ්ම කාලය#,
				'generic' => q#ෆර්නැන්ඩෝ ඩි නොරොන්හා වේලාව#,
				'standard' => q#ෆර්නැන්ඩෝ ඩි නොරොන්හා සම්මත වේලාව#,
			},
		},
		'Novosibirsk' => {
			long => {
				'daylight' => q#නොවසිබිර්ස්ක් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#නොවසිබිර්ස්ක් වේලාව#,
				'standard' => q#නොවසිබිර්ස්ක් සම්මත වේලාව#,
			},
		},
		'Omsk' => {
			long => {
				'daylight' => q#ඔම්ස්ක් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ඔම්ස්ක් වේලාව#,
				'standard' => q#ඔම්ස්ක් සම්මත වේලාව#,
			},
		},
		'Pacific/Apia' => {
			exemplarCity => q#ඇපියා#,
		},
		'Pacific/Auckland' => {
			exemplarCity => q#ඕක්ලන්ඩ්#,
		},
		'Pacific/Bougainville' => {
			exemplarCity => q#බෝගන්විලා#,
		},
		'Pacific/Chatham' => {
			exemplarCity => q#චැතම්#,
		},
		'Pacific/Easter' => {
			exemplarCity => q#ඊස්ටර්#,
		},
		'Pacific/Efate' => {
			exemplarCity => q#එෆාත්#,
		},
		'Pacific/Enderbury' => {
			exemplarCity => q#එන්ඩර්බරි#,
		},
		'Pacific/Fakaofo' => {
			exemplarCity => q#ෆාකාඕෆෝ#,
		},
		'Pacific/Fiji' => {
			exemplarCity => q#ෆීජි#,
		},
		'Pacific/Funafuti' => {
			exemplarCity => q#ෆුනෆුටි#,
		},
		'Pacific/Galapagos' => {
			exemplarCity => q#ගලපගෝස්#,
		},
		'Pacific/Gambier' => {
			exemplarCity => q#ගම්බියෙර්#,
		},
		'Pacific/Guadalcanal' => {
			exemplarCity => q#ගුවාඩල්කැනල්#,
		},
		'Pacific/Guam' => {
			exemplarCity => q#ගුවාම්#,
		},
		'Pacific/Honolulu' => {
			exemplarCity => q#හොනොලුලු#,
		},
		'Pacific/Johnston' => {
			exemplarCity => q#ජොන්ස්ටන්#,
		},
		'Pacific/Kanton' => {
			exemplarCity => q#කැන්ටන්#,
		},
		'Pacific/Kiritimati' => {
			exemplarCity => q#කිරිමටි#,
		},
		'Pacific/Kosrae' => {
			exemplarCity => q#කොස්රේ#,
		},
		'Pacific/Kwajalein' => {
			exemplarCity => q#ක්වාජලෙයින්#,
		},
		'Pacific/Majuro' => {
			exemplarCity => q#මජුරෝ#,
		},
		'Pacific/Marquesas' => {
			exemplarCity => q#මාකුවෙසාස්#,
		},
		'Pacific/Midway' => {
			exemplarCity => q#මිඩ්වේ#,
		},
		'Pacific/Nauru' => {
			exemplarCity => q#නවුරු#,
		},
		'Pacific/Niue' => {
			exemplarCity => q#නියු#,
		},
		'Pacific/Norfolk' => {
			exemplarCity => q#නෝෆෝක්#,
		},
		'Pacific/Noumea' => {
			exemplarCity => q#නෝමියා#,
		},
		'Pacific/Pago_Pago' => {
			exemplarCity => q#පගෝ පගෝ#,
		},
		'Pacific/Palau' => {
			exemplarCity => q#පලාවු#,
		},
		'Pacific/Pitcairn' => {
			exemplarCity => q#පිට්කෙයාන්#,
		},
		'Pacific/Ponape' => {
			exemplarCity => q#පොන්පෙයි#,
		},
		'Pacific/Port_Moresby' => {
			exemplarCity => q#පොර්ට් මොරෙස්බි#,
		},
		'Pacific/Rarotonga' => {
			exemplarCity => q#රරෝටෝන්ගා#,
		},
		'Pacific/Saipan' => {
			exemplarCity => q#සයිපාන්#,
		},
		'Pacific/Tahiti' => {
			exemplarCity => q#ටහිති#,
		},
		'Pacific/Tarawa' => {
			exemplarCity => q#ටරාවා#,
		},
		'Pacific/Tongatapu' => {
			exemplarCity => q#ටොන්ගටාපු#,
		},
		'Pacific/Truk' => {
			exemplarCity => q#චූක්#,
		},
		'Pacific/Wake' => {
			exemplarCity => q#වේක්#,
		},
		'Pacific/Wallis' => {
			exemplarCity => q#වැලිස්#,
		},
		'Pakistan' => {
			long => {
				'daylight' => q#පාකිස්ථාන ග්‍රීෂ්ම කාලය#,
				'generic' => q#පාකිස්ථාන වේලාව#,
				'standard' => q#පාකිස්ථාන සම්මත වේලාව#,
			},
		},
		'Palau' => {
			long => {
				'standard' => q#පලාවු වේලාව#,
			},
		},
		'Papua_New_Guinea' => {
			long => {
				'standard' => q#පැපුවා නිව් ගිනීයා වේලාව#,
			},
		},
		'Paraguay' => {
			long => {
				'daylight' => q#පැරගුවේ ග්‍රීෂ්ම කාලය#,
				'generic' => q#පැරගුවේ වේලාව#,
				'standard' => q#පැරගුවේ සම්මත වේලාව#,
			},
		},
		'Peru' => {
			long => {
				'daylight' => q#පේරු ග්‍රීෂ්ම කාලය#,
				'generic' => q#පේරු වේලාව#,
				'standard' => q#පේරු සම්මත වේලාව#,
			},
		},
		'Philippines' => {
			long => {
				'daylight' => q#පිලිපීන ග්‍රීෂ්ම වේලාව#,
				'generic' => q#පිලිපීන වේලාව#,
				'standard' => q#පිලිපීන සම්මත වේලාව#,
			},
		},
		'Phoenix_Islands' => {
			long => {
				'standard' => q#ෆීනික්ස් දුපත් වේලාව#,
			},
		},
		'Pierre_Miquelon' => {
			long => {
				'daylight' => q#ශාන්ත පියරේ සහ මැකෝලන් දිවාආලෝක වේලාව#,
				'generic' => q#ශාන්ත පියරේ සහ මැකෝලන් වේලාව#,
				'standard' => q#ශාන්ත පියරේ සහ මැකෝලන් සම්මත වේලාව#,
			},
		},
		'Pitcairn' => {
			long => {
				'standard' => q#පිට්කෙයාන් වේලාව#,
			},
		},
		'Ponape' => {
			long => {
				'standard' => q#පොනපේ වේලාව#,
			},
		},
		'Pyongyang' => {
			long => {
				'standard' => q#ප්යොන්ග්යන් වේලාව#,
			},
		},
		'Reunion' => {
			long => {
				'standard' => q#රියුනියන් වේලාව#,
			},
		},
		'Rothera' => {
			long => {
				'standard' => q#රොතෙරා වේලාව#,
			},
		},
		'Sakhalin' => {
			long => {
				'daylight' => q#සඛලින් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#සඛලින් වේලාව#,
				'standard' => q#සඛලින් සම්මත වේලාව#,
			},
		},
		'Samoa' => {
			long => {
				'daylight' => q#සැමෝවා ග්‍රීෂ්ම වේලාව#,
				'generic' => q#සැමෝවා වේලාව#,
				'standard' => q#සැමෝවා සම්මත වේලාව#,
			},
		},
		'Seychelles' => {
			long => {
				'standard' => q#සීෂෙල්ස් වේලාව#,
			},
		},
		'Singapore' => {
			long => {
				'standard' => q#සිංගප්පුරු වේලාව#,
			},
		},
		'Solomon' => {
			long => {
				'standard' => q#සොලොමන් දූපත් වේලාව#,
			},
		},
		'South_Georgia' => {
			long => {
				'standard' => q#දකුණු ජෝජියා වේලාව#,
			},
		},
		'Suriname' => {
			long => {
				'standard' => q#සුරිනාම වේලාව#,
			},
		},
		'Syowa' => {
			long => {
				'standard' => q#ස්යෝවා වේලාව#,
			},
		},
		'Tahiti' => {
			long => {
				'standard' => q#ටාහිටි වේලාව#,
			},
		},
		'Taipei' => {
			long => {
				'daylight' => q#තායිපේ දහවල් වේලාව#,
				'generic' => q#තායිපේ වේලාව#,
				'standard' => q#තායිපේ සම්මත වේලාව#,
			},
		},
		'Tajikistan' => {
			long => {
				'standard' => q#ටජිකිස්තාන වේලාව#,
			},
		},
		'Tokelau' => {
			long => {
				'standard' => q#ටොකෙලාවු වේලාව#,
			},
		},
		'Tonga' => {
			long => {
				'daylight' => q#ටොංගා ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ටොංගා වේලාව#,
				'standard' => q#ටොංගා සම්මත වේලාව#,
			},
		},
		'Truk' => {
			long => {
				'standard' => q#චුක් වේලාව#,
			},
		},
		'Turkmenistan' => {
			long => {
				'daylight' => q#ටර්ක්මෙනිස්තාන ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ටර්ක්මෙනිස්තාන වේලාව#,
				'standard' => q#ටර්ක්මෙනිස්තාන සම්මත වේලාව#,
			},
		},
		'Tuvalu' => {
			long => {
				'standard' => q#ටුවාලු වේලාව#,
			},
		},
		'Uruguay' => {
			long => {
				'daylight' => q#උරුගුවේ ග්‍රීෂ්ම කාලය#,
				'generic' => q#උරුගුවේ වේලාව#,
				'standard' => q#උරුගුවේ සම්මත වේලාව#,
			},
		},
		'Uzbekistan' => {
			long => {
				'daylight' => q#උස්බෙකිස්තාන ග්‍රීෂ්ම වේලාව#,
				'generic' => q#උස්බෙකිස්තාන වේලාව#,
				'standard' => q#උස්බෙකිස්තාන සම්මත වේලාව#,
			},
		},
		'Vanuatu' => {
			long => {
				'daylight' => q#වනුආටු ගිම්හාන වේලාව#,
				'generic' => q#වනුආටු වේලාව#,
				'standard' => q#වනුආටු සම්මත වේලාව#,
			},
		},
		'Venezuela' => {
			long => {
				'standard' => q#වෙනිසියුලා වේලාව#,
			},
		},
		'Vladivostok' => {
			long => {
				'daylight' => q#ව්ලදිවෝස්ටෝක් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#ව්ලදිවෝස්ටෝක් වේලාව#,
				'standard' => q#ව්ලදිවෝස්ටෝක් සම්මත වේලාව#,
			},
		},
		'Volgograd' => {
			long => {
				'daylight' => q#වොල්ගොග්‍රාඩ් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#වොල්ගොග්‍රාඩ් වේලාව#,
				'standard' => q#වොල්ගොග්‍රාඩ් සම්මත වේලාව#,
			},
		},
		'Vostok' => {
			long => {
				'standard' => q#වොස්ටොක් වේලාව#,
			},
		},
		'Wake' => {
			long => {
				'standard' => q#වේක් දූපත් වේලාව#,
			},
		},
		'Wallis' => {
			long => {
				'standard' => q#වැලිස් සහ ෆුටුනා වේලාව#,
			},
		},
		'Yakutsk' => {
			long => {
				'daylight' => q#යකුට්ස්ක් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#යකුට්ස්ක් වේලාව#,
				'standard' => q#යකුට්ස්ක් සම්මත වේලාව#,
			},
		},
		'Yekaterinburg' => {
			long => {
				'daylight' => q#යෙකටෙරින්බර්ග් ග්‍රීෂ්ම වේලාව#,
				'generic' => q#යෙකටෙරින්බර්ග් වේලාව#,
				'standard' => q#යෙකටෙරින්බර්ග් සම්මත වේලාව#,
			},
		},
		'Yukon' => {
			long => {
				'standard' => q#යුකොන් වේලාව#,
			},
		},
	 } }
);
no Moo;

1;

# vim: tabstop=4
