# automatically generated file, don't edit



# Copyright 2011 David Cantrell, derived from data from libphonenumber
# http://code.google.com/p/libphonenumber/
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
package Number::Phone::StubCountry::GR;
use base qw(Number::Phone::StubCountry);

use strict;
use warnings;
use utf8;
our $VERSION = 1.20220307120118;

my $formatters = [
                {
                  'format' => '$1 $2 $3',
                  'leading_digits' => '
            21|
            7
          ',
                  'pattern' => '(\\d{2})(\\d{4})(\\d{4})'
                },
                {
                  'format' => '$1 $2',
                  'leading_digits' => '
            2(?:
              2|
              3[2-57-9]|
              4[2-469]|
              5[2-59]|
              6[2-9]|
              7[2-69]|
              8[2-49]
            )|
            5
          ',
                  'pattern' => '(\\d{4})(\\d{6})'
                },
                {
                  'format' => '$1 $2 $3',
                  'leading_digits' => '[2689]',
                  'pattern' => '(\\d{3})(\\d{3})(\\d{4})'
                },
                {
                  'format' => '$1 $2 $3',
                  'leading_digits' => '8',
                  'pattern' => '(\\d{3})(\\d{3,4})(\\d{5})'
                }
              ];

my $validators = {
                'fixed_line' => '
          2(?:
            1\\d\\d|
            2(?:
              2[1-46-9]|
              [36][1-8]|
              4[1-7]|
              5[1-4]|
              7[1-5]|
              [89][1-9]
            )|
            3(?:
              1\\d|
              2[1-57]|
              [35][1-3]|
              4[13]|
              7[1-7]|
              8[124-6]|
              9[1-79]
            )|
            4(?:
              1\\d|
              2[1-8]|
              3[1-4]|
              4[13-5]|
              6[1-578]|
              9[1-5]
            )|
            5(?:
              1\\d|
              [29][1-4]|
              3[1-5]|
              4[124]|
              5[1-6]
            )|
            6(?:
              1\\d|
              [269][1-6]|
              3[1245]|
              4[1-7]|
              5[13-9]|
              7[14]|
              8[1-5]
            )|
            7(?:
              1\\d|
              2[1-5]|
              3[1-6]|
              4[1-7]|
              5[1-57]|
              6[135]|
              9[125-7]
            )|
            8(?:
              1\\d|
              2[1-5]|
              [34][1-4]|
              9[1-57]
            )
          )\\d{6}
        ',
                'geographic' => '
          2(?:
            1\\d\\d|
            2(?:
              2[1-46-9]|
              [36][1-8]|
              4[1-7]|
              5[1-4]|
              7[1-5]|
              [89][1-9]
            )|
            3(?:
              1\\d|
              2[1-57]|
              [35][1-3]|
              4[13]|
              7[1-7]|
              8[124-6]|
              9[1-79]
            )|
            4(?:
              1\\d|
              2[1-8]|
              3[1-4]|
              4[13-5]|
              6[1-578]|
              9[1-5]
            )|
            5(?:
              1\\d|
              [29][1-4]|
              3[1-5]|
              4[124]|
              5[1-6]
            )|
            6(?:
              1\\d|
              [269][1-6]|
              3[1245]|
              4[1-7]|
              5[13-9]|
              7[14]|
              8[1-5]
            )|
            7(?:
              1\\d|
              2[1-5]|
              3[1-6]|
              4[1-7]|
              5[1-57]|
              6[135]|
              9[125-7]
            )|
            8(?:
              1\\d|
              2[1-5]|
              [34][1-4]|
              9[1-57]
            )
          )\\d{6}
        ',
                'mobile' => '
          68[57-9]\\d{7}|
          (?:
            69|
            94
          )\\d{8}
        ',
                'pager' => '',
                'personal_number' => '70\\d{8}',
                'specialrate' => '(
          8(?:
            0[16]|
            12|
            [27]5|
            50
          )\\d{7}
        )|(90[19]\\d{7})|(5005000\\d{3})',
                'toll_free' => '800\\d{7,9}',
                'voip' => ''
              };
my %areanames = ();
$areanames{en} = {"302757", "Leonidio",
"302299", "Markopoulo\ Mesogaias",
"302743", "Xylokastro",
"302647", "Fyteies",
"302653", "Asprangeli",
"302792", "Kastri\ Kynourias",
"302291", "Lagonisi",
"302533", "Xylagani",
"302223", "Aliveri",
"302295", "Afidnes",
"302468", "Neapoli",
"302467", "Kastoria",
"302229", "Eretria",
"302754", "Kranidi",
"302432", "Kalabaka",
"30251", "Kavala",
"302655", "Konitsa",
"302644", "Thermo",
"302266", "Lidoriki",
"302531", "Komotini",
"302722", "Messene",
"302221", "Chalcis",
"302832", "Spyli",
"302535", "Nea\ Kallisti",
"302293", "Agia\ Sotira",
"302332", "Naousa\,\ Imathia",
"302651", "Ioannina",
"302464", "Servia",
"302741", "Corinth",
"302242", "Kos",
"302286", "Santorini",
"302372", "Arnaia",
"302556", "Kyprinos",
"302384", "Aridaia",
"302659", "Kalentzi",
"302524", "Paranesti",
"302234", "Amfikleia",
"302765", "Kopanaki",
"302664", "Filiates",
"302274", "Psara\,\ Chios",
"302376", "Stratoni",
"302552", "Orestiada",
"302246", "Salakos\,\ Rhodes",
"302282", "Andros",
"302844", "Tzermadio",
"302351", "Korinos",
"302632", "Aitoliko",
"302761", "Kyparissia",
"302444", "Palamas",
"302262", "Thebes",
"302684", "Kanalaki",
"302763", "Gargalianoi",
"302594", "Nea\ Peramos\,\ Kavala",
"302237", "Karpenisi",
"302238", "Stylida",
"302353", "Aiginio",
"302796", "Levidi",
"302674", "Sami\,\ Cephalonia",
"302893", "Pyrgos\,\ Crete",
"302825", "Vamos",
"302264", "Thisvi",
"302735", "Molaoi",
"302682", "Preveza",
"302321", "Serres",
"302493", "Elassona",
"302842", "Ierapetra",
"302425", "Feres\,\ Magnesia",
"302541", "Xanthi",
"302634", "Nafpaktos",
"302386", "Amyntaio",
"302662", "Lefkimmi",
"302272", "Kardamyla",
"30271", "Tripoli",
"302554", "Soufli",
"302421", "Volos",
"302284", "Paros",
"302325", "Irakleia\,\ Serres",
"302393", "Lagkadikia",
"302821", "Chania",
"302731", "Sparti",
"302522", "Prosotsani",
"302232", "Domokos",
"302895", "Ano\ Viannos",
"302267", "Distomo",
"302733", "Gytheio",
"302823", "Kandanos",
"302391", "Chalkidona",
"302495", "Gonnoi\/Makrychori",
"302423", "Kala\ Nera",
"302399", "Kallikrateia",
"302268", "Aliartos",
"302287", "Milos",
"302491", "Farsala",
"302323", "Sidirokastro",
"302288", "Kea",
"302395", "Sochos",
"302891", "Arkalochori",
"302592", "Eleftheroupoli",
"302377", "Ierissos\/Mount\ Athos",
"302253", "Kalloni\,\ Lesbos",
"302247", "Leros",
"302691", "Aigio",
"302695", "Zakynthos",
"302623", "Lechaina",
"302244", "Archangelos\,\ Rhodes",
"302462", "Grevena",
"302374", "Kassandreia",
"302621", "Burgas",
"302382", "Giannitsa",
"302666", "Paramythia",
"302236", "Makrakomi",
"302642", "Amfilochia",
"302797", "Tropaia",
"302834", "Perama\ Mylopotamou",
"302724", "Meligalas",
"302693", "Kato\ Achaia",
"302625", "Krestena",
"302434", "Pyli",
"302752", "Nafplio",
"302251", "Mytilene",
"302228", "Messapia",
"302463", "Ptolemaida",
"302396", "Vasilika",
"302227", "Kireas",
"302294", "Rafina",
"302643", "Vonitsa",
"302657", "Delvinaki",
"302753", "Lygourio",
"302658", "Zitsa",
"302747", "Stymfalia",
"302692", "Kalavryta",
"302385", "Florina",
"302298", "Troezen\/Poros\/Hydra\/Spetses",
"302252", "Agiasos\/Plomari",
"302751", "Argos",
"302465", "Siatista",
"302641", "Agrinio",
"302297", "Aegina",
"302224", "Karystos",
"302534", "Iasmos",
"302736", "Kythera",
"302645", "Lefkada",
"302755", "Astros",
"302744", "Loutraki",
"302461", "Kozani",
"302426", "Zagora",
"302622", "Amaliada",
"302381", "Edessa",
"302685", "Athamania",
"302822", "Kissamos",
"302445", "Mouzaki",
"302732", "Molaoi",
"302231", "Lamia",
"302521", "Drama",
"302661", "Corfu",
"302341", "Kilkis",
"302626", "Andritsaina",
"302271", "Chios",
"302422", "Almyros",
"302841", "Agios\ Nikolaos",
"302542", "Stavroupoli",
"302275", "Agios\ Kirykos",
"302665", "Igoumenitsa",
"302593", "Thasos",
"302441", "Karditsa",
"302235", "Kamena\ Vourla",
"302681", "Arta",
"302322", "Nigrita",
"302683", "Filippiada",
"302443", "Sofades",
"302892", "Moires\,\ Heraklion",
"302591", "Chrysoupoli",
"302696", "Akrata",
"302843", "Sitia",
"302492", "Tyrnavos",
"302273", "Samos",
"302663", "Corfu\ Island",
"302343", "Polykastro",
"302523", "Kato\ Nevrokopi",
"302233", "Atalanta",
"302392", "Peraia\,\ Thessaloniki",
"302226", "Aidipsos",
"302671", "Argostoli",
"302261", "Livadeia",
"30261", "Patras",
"302324", "Nea\ Zichni",
"302397", "Asprovalta",
"302285", "Naxos",
"302544", "Echinos",
"302555", "Feres\,\ Evros",
"302352", "Litochoro",
"302631", "Messolonghi",
"302635", "Mataranga",
"302551", "Alexandroupoli",
"302424", "Skopelos",
"302746", "Nemea",
"302281", "Ano\ Syros",
"302656", "Metsovo",
"302289", "Mykonos",
"302897", "Limenas\ Chersonisou",
"302734", "Neapoli\,\ Voies",
"302265", "Amfissa",
"302824", "Kolymvari",
"302296", "Megara",
"302394", "Lagkadas",
"302327", "Rodopoli",
"302283", "Tinos",
"302553", "Didymoteicho",
"3021", "Athens\/Piraeus\/Salamina",
"302427", "Skiathos",
"302494", "Agia",
"302263", "Vilia",
"302894", "Agia\ Varvara",
"302433", "Farkadona",
"302694", "Chalandritsa",
"302833", "Amari\,\ Rethymno",
"302723", "Pylos",
"302795", "Vytina",
"302333", "Alexandria",
"302292", "Lavrio",
"302791", "Megalopolis",
"302373", "Nea\ Moudania",
"302243", "Kalymnos",
"302742", "Kiato",
"302241", "Rhodes",
"302371", "Polygyros",
"30231", "Thessaloniki",
"302624", "Olympia",
"302725", "Koroni",
"302331", "Veria",
"302532", "Sapes",
"302721", "Kalamata",
"30241", "Larissa",
"302222", "Kymi",
"302831", "Rethymno",
"302375", "Nikiti",
"302245", "Karpathos",
"30281", "Heraklion",
"302254", "Agios\ Efstratios",
"302431", "Trikala",};
$areanames{el} = {"302323", "Σιδηρόκαστρο",
"302395", "Σοχός",
"302288", "Κέα",
"302592", "Ελευθερούπολη",
"302891", "Αρκαλοχώρι",
"302287", "Μήλος",
"302491", "Φάρσαλα",
"302495", "Γόννοι\/Μακρυχώρι",
"302423", "Καλά\ Νερά",
"302399", "Καλλικράτεια",
"302268", "Αλίαρτος",
"302267", "Δίστομο",
"302895", "Άνω\ Βιάννος",
"302823", "Κάντανος",
"302733", "Γύθειο",
"302391", "Χαλκηδόνα",
"302325", "Ηράκλεια\,\ Σερρών",
"302393", "Λαγκαδίκια",
"302731", "Σπάρτη",
"302522", "Προσοτσάνη",
"302232", "Δομοκός",
"302821", "Χανιά",
"302662", "Λευκίμμη",
"302386", "Αμύνταιο",
"302272", "Καρδάμυλα",
"30271", "Τρίπολη",
"302421", "Βόλος",
"302554", "Σουφλί",
"302284", "Πάρος",
"302493", "Ελασσόνα",
"302541", "Ξάνθη",
"302842", "Ιεράπετρα",
"302425", "Βελεστίνο",
"302634", "Ναύπακτος",
"302893", "Πύργος\,\ Κρήτη",
"302674", "Σάμη",
"302735", "Σκάλα",
"302825", "Βάμος",
"302264", "Δόμβραινα",
"302682", "Πρέβεζα",
"302321", "Σέρρες",
"302693", "Κάτω\ Αχαΐα",
"302625", "Κρέστενα",
"302752", "Ναύπλιο",
"302434", "Πύλη",
"302251", "Μυτιλήνη",
"302642", "Αμφιλοχία",
"302724", "Μελιγαλάς",
"302834", "Πέραμα\ Μυλοποτάμου",
"302797", "Τροπαία",
"302236", "Μακρακώμη",
"302244", "Αρχάγγελος",
"302462", "Γρεβενά",
"302374", "Κασσάνδρεια",
"302621", "Πύργος",
"302666", "Παραμυθιά",
"302382", "Γιαννιτσά",
"302695", "Ζάκυνθος",
"302623", "Λεχαινά",
"302253", "Καλλονή\/Μήθυμνα",
"302377", "Άγιον\ Όρος\/Ιερισσός",
"302247", "Λέρος",
"302691", "Αίγιο",
"302286", "Θήρα",
"302242", "Κως",
"302741", "Κόρινθος",
"302464", "Σέρβια",
"302556", "Κυπρίνος",
"302372", "Αρναία",
"302384", "Αριδαία",
"302659", "Καλέντζι\ Δωδώνης",
"302535", "Νέα\ Καλλίστη",
"302293", "Άγιος\ Σωτήρας",
"302332", "Νάουσα",
"302651", "Ιωάννινα",
"302644", "Θερμό",
"302655", "Κόνιτσα\/Πέρδικα\ Δωδώνης",
"302266", "Λιδορίκι",
"302832", "Σπήλι",
"302531", "Κομοτηνή",
"302722", "Μεσσήνη",
"302221", "Χαλκίδα",
"302229", "Ερέτρια",
"302754", "Κρανίδι",
"30251", "Καβάλα",
"302432", "Καλαμπάκα",
"302467", "Καστοριά",
"302223", "Αλιβέρι",
"302533", "Ξυλαγανή",
"302295", "Αφίδναι",
"302468", "Νεάπολη",
"302647", "Νέο\ Χαλκιόπουλο\/Φυτείες",
"302653", "Καρυές\ Ασπραγγέλων",
"302291", "Λαγονήσι",
"302792", "Καστρί\ Κυνουρίας",
"302757", "Λεωνίδιο",
"302299", "Μαρκόπουλο",
"302743", "Ξυλόκαστρο",
"302796", "Λεβίδι",
"302353", "Αιγίνιο",
"302238", "Στυλίδα",
"302763", "Γαργαλιάνοι",
"302237", "Καρπενήσι",
"302594", "Νέα\ Πέραμος\ Καβάλας",
"302444", "Παλαμάς",
"302761", "Κυπαρισσία",
"302262", "Θήβα",
"302684", "Καναλλάκι",
"302844", "Τζερμιάδο",
"302351", "Κατερίνη",
"302632", "Αιτωλικό",
"302664", "Φιλιάτες",
"302274", "Βολισσός",
"302552", "Ορεστιάδα",
"302376", "Στρατώνι",
"302282", "Άνδρος",
"302246", "Τήλος\/Σύμη\/Χάλκη\/Μεγίστη",
"302765", "Κοπανάκι",
"302234", "Αμφίκλεια",
"302524", "Παρανέστι",
"302263", "Βίλια",
"302894", "Αγία\ Βαρβάρα\,\ Ηράκλειο\ Κρήτης",
"302494", "Αγιά",
"302427", "Σκιάθος",
"302283", "Τήνος",
"3021", "Αθήνα\/Πειραιάς\/Σαλαμίνα",
"302553", "Διδυμότειχο",
"302296", "Μέγαρα\/Νέα\ Πέραμος",
"302327", "Ροδόπολη\,\ Σερρών",
"302394", "Λαγκαδάς",
"302656", "Μέτσοβο",
"302265", "Άμφισσα",
"302824", "Κολυμβάρι",
"302734", "Νεάπολη",
"302897", "Λιμένας\ Χερσονήσου",
"302289", "Μύκονος",
"302635", "Ματαράγκα",
"302424", "Σκόπελος",
"302551", "Αλεξανδρούπολη",
"302281", "Σύρος",
"302746", "Νεμέα",
"302285", "Νάξος",
"302555", "Φέρες",
"302544", "Εχίνος",
"302631", "Μεσολόγγι",
"302352", "Λιτόχωρο",
"302671", "Αργοστόλι",
"302226", "Αιδηψός",
"302261", "Λειβαδιά",
"302397", "Ασπροβάλτα",
"30261", "Πάτρα",
"302324", "Νέα\ Ζίχνη",
"302375", "Νικήτη",
"302431", "Τρίκαλα",
"302254", "Άγιος\ Ευστράτιος\/Μούδρος\/Μύρινα",
"30281", "Ηράκλειο",
"302245", "Κάρπαθος",
"302831", "Ρέθυμνο",
"302222", "Κύμη",
"302721", "Καλαμάτα",
"30241", "Λάρισα",
"302532", "Σάπες",
"302725", "Κορώνη\ Πυλίας",
"302331", "Βέροια",
"302742", "Κιάτο",
"302241", "Ρόδος",
"302371", "Πολύγυρος",
"30231", "Θεσσαλονίκη",
"302624", "Αρχαία\ Ολυμπία",
"302373", "Νέα\ Μουδανιά",
"302243", "Κάλυμνος",
"302333", "Αλεξάνδρεια",
"302791", "Μεγαλόπολη",
"302292", "Λαύριο",
"302723", "Πύλος",
"302833", "Αμάρι",
"302795", "Βυτίνα",
"302433", "Φαρκαδόνα",
"302694", "Χαλανδρίτσα",
"302744", "Λουτράκι",
"302461", "Κοζάνη",
"302755", "Άστρος",
"302426", "Ζαγορά",
"302622", "Αμαλιάδα",
"302381", "Έδεσσα",
"302736", "Κύθηρα",
"302645", "Λευκάδα",
"302641", "Αγρίνιο",
"302534", "Ίασμος",
"302224", "Κάρυστος",
"302297", "Αίγινα",
"302298", "Μέθανα\/Πόρος\/Σπέτσες",
"302385", "Φλώρινα",
"302465", "Σιάτιστα",
"302751", "Άργος",
"302252", "Αγιάσος\/Πλωμάρι",
"302658", "Ζίτσα",
"302753", "Λυγουριό",
"302747", "Καλιανοί",
"302692", "Καλάβρυτα",
"302643", "Βόνιτσα",
"302657", "Δελβινάκι",
"302396", "Βασιλικά",
"302294", "Ραφήνα",
"302227", "Μαντούδι",
"302228", "Ψαχνά",
"302463", "Πτολεμαΐδα",
"302523", "Κάτω\ Νευροκόπι",
"302233", "Αταλάντη",
"302392", "Περαία",
"302273", "Σάμος",
"302343", "Πολύκαστρο",
"302663", "Σκριπερό",
"302696", "Ακράτα",
"302843", "Σητεία",
"302492", "Τύρναβος",
"302683", "Φιλιππιάδα",
"302443", "Σοφάδες",
"302591", "Χρυσούπολη",
"302892", "Μοίρες\,\ Ηράκλειο",
"302593", "Θάσος",
"302235", "Καμμένα\ Βούρλα",
"302441", "Καρδίτσα",
"302681", "Άρτα",
"302322", "Νιγρίτα",
"302542", "Σταυρούπολη",
"302841", "Άγιος\ Νικόλαος",
"302275", "Άγιος\ Κήρυκος",
"302665", "Ηγουμενίτσα",
"302661", "Κέρκυρα",
"302341", "Κιλκίς",
"302271", "Χίος",
"302626", "Ανδρίτσαινα",
"302422", "Αλμυρός",
"302685", "Βουργαρέλι",
"302732", "Μολάοι",
"302231", "Λαμία",
"302521", "Δράμα",
"302445", "Μουζάκι",
"302822", "Κίσσαμος",};

    sub new {
      my $class = shift;
      my $number = shift;
      $number =~ s/(^\+30|\D)//g;
      my $self = bless({ number => $number, formatters => $formatters, validators => $validators, areanames => \%areanames}, $class);
        return $self->is_valid() ? $self : undef;
    }
1;