# automatically generated file, don't edit



# Copyright 2011 David Cantrell, derived from data from libphonenumber
# http://code.google.com/p/libphonenumber/
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
package Number::Phone::StubCountry::KZ;
use base qw(Number::Phone::StubCountry);

use strict;
use warnings;
use utf8;
our $VERSION = 1.20220903144941;

my $formatters = [];

my $validators = {
                'fixed_line' => '
          (?:
            33622|
            7(?:
              1(?:
                0(?:
                  [23]\\d|
                  4[0-3]|
                  59|
                  63
                )|
                1(?:
                  [23]\\d|
                  4[0-79]|
                  59
                )|
                2(?:
                  [23]\\d|
                  59
                )|
                3(?:
                  2\\d|
                  3[0-79]|
                  4[0-35-9]|
                  59
                )|
                4(?:
                  [24]\\d|
                  3[013-9]|
                  5[1-9]
                )|
                5(?:
                  2\\d|
                  3[1-9]|
                  4[0-7]|
                  59
                )|
                6(?:
                  [2-4]\\d|
                  5[19]|
                  61
                )|
                72\\d|
                8(?:
                  [27]\\d|
                  3[1-46-9]|
                  4[0-5]
                )
              )|
              2(?:
                1(?:
                  [23]\\d|
                  4[46-9]|
                  5[3469]
                )|
                2(?:
                  2\\d|
                  3[0679]|
                  46|
                  5[12679]
                )|
                3(?:
                  [2-4]\\d|
                  5[139]
                )|
                4(?:
                  2\\d|
                  3[1-35-9]|
                  59
                )|
                5(?:
                  [23]\\d|
                  4[0-246-8]|
                  59|
                  61
                )|
                6(?:
                  2\\d|
                  3[1-9]|
                  4[0-4]|
                  59
                )|
                7(?:
                  [2379]\\d|
                  40|
                  5[279]
                )|
                8(?:
                  [23]\\d|
                  4[0-3]|
                  59
                )|
                9(?:
                  2\\d|
                  3[124578]|
                  59
                )
              )
            )
          )\\d{5}
        ',
                'geographic' => '
          (?:
            33622|
            7(?:
              1(?:
                0(?:
                  [23]\\d|
                  4[0-3]|
                  59|
                  63
                )|
                1(?:
                  [23]\\d|
                  4[0-79]|
                  59
                )|
                2(?:
                  [23]\\d|
                  59
                )|
                3(?:
                  2\\d|
                  3[0-79]|
                  4[0-35-9]|
                  59
                )|
                4(?:
                  [24]\\d|
                  3[013-9]|
                  5[1-9]
                )|
                5(?:
                  2\\d|
                  3[1-9]|
                  4[0-7]|
                  59
                )|
                6(?:
                  [2-4]\\d|
                  5[19]|
                  61
                )|
                72\\d|
                8(?:
                  [27]\\d|
                  3[1-46-9]|
                  4[0-5]
                )
              )|
              2(?:
                1(?:
                  [23]\\d|
                  4[46-9]|
                  5[3469]
                )|
                2(?:
                  2\\d|
                  3[0679]|
                  46|
                  5[12679]
                )|
                3(?:
                  [2-4]\\d|
                  5[139]
                )|
                4(?:
                  2\\d|
                  3[1-35-9]|
                  59
                )|
                5(?:
                  [23]\\d|
                  4[0-246-8]|
                  59|
                  61
                )|
                6(?:
                  2\\d|
                  3[1-9]|
                  4[0-4]|
                  59
                )|
                7(?:
                  [2379]\\d|
                  40|
                  5[279]
                )|
                8(?:
                  [23]\\d|
                  4[0-3]|
                  59
                )|
                9(?:
                  2\\d|
                  3[124578]|
                  59
                )
              )
            )
          )\\d{5}
        ',
                'mobile' => '
          7(?:
            0[0-25-8]|
            47|
            6[0-4]|
            7[15-8]|
            85
          )\\d{7}
        ',
                'pager' => '',
                'personal_number' => '808\\d{7}',
                'specialrate' => '(809\\d{7})',
                'toll_free' => '
          8(?:
            00|
            108\\d{3}
          )\\d{7}
        ',
                'voip' => '751\\d{7}'
              };
my %areanames = ();
$areanames{en} = {"7415", "Kamchatka\ Region",
"772252", "Karaul",
"771535", "Novoishimski",
"772830", "Alakolsky\ District",
"772237", "Ayagoz",
"772342", "Katon\-Karagai",
"772643", "Shu",
"77245", "Kyzylorda\ Region",
"77122", "Atyrau",
"772937", "Kuryk",
"7811", "Pskov",
"7877", "Republic\ of\ Adygeya",
"77152", "Petropavlovsk",
"772834", "Ushtobe",
"772333", "Samarskoye",
"772632", "Merke",
"7814", "Republic\ of\ Karelia",
"772757", "Akshi",
"772156", "Shakhtinsk",
"772537", "Saryagash",
"771841", "Aktogai",
"771648", "Derzhavinsk",
"7388", "Republic\ of\ Altai",
"771235", "Dossor",
"771451", "Sarykol",
"771134", "Zhympity",
"771337", "Alga",
"771039", "Priozersk",
"77232", "Ust\-Kamenogorsk",
"771533", "Saumalkol",
"771430", "Arkalyk",
"77279", "Almaty",
"771349", "Shalkarsky\ District",
"772776", "Shelek",
"7486", "Orel",
"7841", "Penza",
"7351", "Chelyabinsk",
"7487", "Tula",
"771446", "Uzunkolsky\ District",
"772938", "Fort\ Shevchenko",
"7861", "Krasnodar\ Territory",
"771542", "Kishkenekol",
"771130", "Peremetnoye",
"771639", "Stepnyak",
"771233", "Ganyushkino",
"740", "Kaliningrad",
"771146", "Akzhaiksky\ District",
"7844", "Volgograd",
"7423", "Primorie\ territory",
"771434", "Denisovka",
"7395", "Irkutsk",
"772335", "Zyryanovsk",
"772538", "Turara\ Ryskulova",
"771647", "Esil",
"7484", "Kaluga",
"771139", "Taskala",
"771646", "Makinsk",
"772331", "Glubokoye",
"7866", "Kabardino\-Balkarian\ Republic",
"771034", "Zhezdy",
"771630", "Burabay",
"7867", "Republic\ of\ North\ Ossetia",
"771453", "Auliekol",
"771843", "Maisky\ District",
"771147", "Akzhaiksky\ District",
"7835", "Chuvashi\ Republic",
"772777", "Kegen",
"771832", "Irtyshsk",
"771030", "Atasu",
"771447", "Karabalyksky\ District",
"771439", "Torgai",
"7481", "Smolensk",
"7847", "Republic\ of\ Kalmykia",
"7846", "Samara",
"771336", "Khromtau",
"772641", "Akkol",
"771340", "Khobdinsky\ District",
"771231", "Akkystau",
"772536", "Kentau",
"77187", "Ekibastuz",
"771455", "Zatobolsk",
"771845", "Pavlodar\ Area",
"772540", "Arys",
"736", "Simferopol",
"772132", "Nurinsky\ District",
"7343", "Ekaterinburg",
"7472", "Belgorod",
"772839", "Sarkand",
"771651", "Kabanbai\ Batyr",
"7302", "Chita",
"772544", "Shaulder",
"772778", "Chundzha",
"771448", "Oktyabrskoye",
"7475", "Tambov",
"7871", "Chechen\ Republic",
"7817", "Vologda",
"7816", "Veliky\ Novgorod",
"771531", "Bulayevo",
"772432", "Shiyeli",
"772236", "Beskaragai",
"771539", "Beskol",
"771454", "Karamendy",
"7482", "Tver",
"771844", "Irtyshsky\ District",
"771642", "Egendykol",
"771343", "Irgiz",
"7834", "Republic\ of\ Mordovia",
"771033", "Agadyr",
"772831", "Zharkent",
"772638", "Tole\ bi",
"771547", "Zhambylsky\ District",
"771836", "Sharbakty",
"7831", "Nizhni\ Novgorod",
"771042", "Zharyk",
"771840", "Bayanaul",
"772348", "Kokpekty",
"7485", "Yaroslavl",
"771239", "Makat",
"771633", "Ereimentau",
"771332", "Uil",
"7390", "Republic\ of\ Khakassia",
"771431", "Rudny",
"7872", "Republic\ of\ Daghestan",
"77272983", "Kaskelen",
"77162", "Kokshetau\/Krasni\ Yar",
"772532", "Abai",
"771035", "Ulytau",
"772353", "Novaya\ Shulba",
"77213", "Aktau\/Temirtau",
"772752", "Otegen\ Batyra",
"771345", "Karauylkeldy",
"7879", "Mineranye\ Vody",
"7474", "Lipetsk",
"7301", "Republic\ of\ Buryatia",
"772637", "Sarykemer",
"772932", "Beineu",
"771635", "Zhaksy",
"7416", "Amur\ Region",
"772144", "Kiyevka",
"7712302", "Tengizshevroil",
"772347", "Kalbatau",
"77102", "Zhezkazgan",
"7471", "Kursk",
"772339", "Kurchum",
"772436", "Terenozek",
"7498", "Moscow",
"772257", "Shulbinsk",
"771131", "Darinskoye",
"771135", "Zhanibek",
"772842", "Kogaly",
"7411", "Republic\ of\ Sakha",
"772644", "Karatau",
"772437", "Zhosaly",
"733", "Baikonur",
"772256", "Kainar",
"77142", "Kostanai",
"771631", "Shortandy",
"771838", "Koktobe",
"772330", "Zyryanovsky\ District",
"7815", "Murmansk",
"772346", "Aksuat",
"772725", "Otegen\ Batyra",
"7383", "Novosibirsk",
"771341", "Khobda",
"77112", "Uralsk",
"772640", "Moiynkumsky\ District",
"7812", "St\ Petersburg",
"772149", "Osakarovka",
"772636", "Kordai",
"772334", "Tavricheskoye",
"771435", "Zhitikara",
"772833", "Usharal",
"771031", "Aksu\-Ayuly",
"772137", "Saran",
"77273", "Almaty",
"771534", "Sergeyevka",
"7394", "Republic\ of\ Tuva",
"77282", "Taldykorgan",
"771459", "Kostanai\ Region",
"772438", "Aiteke\ bi",
"7869", "Sevastopol",
"7836", "Republic\ of\ Marij\ El",
"772541", "Myrzakent",
"772772", "Kapchagai",
"771837", "Aksu",
"771133", "Aksai",
"771442", "Fyodorovka",
"77135", "Aktobe\ Region",
"7862", "Sochi",
"771230", "Atyrau\ Region",
"7845", "Saratov",
"7865", "Stavropol\ territory",
"7352", "Kurgan",
"7842", "Ulyanovsk",
"771142", "Taipak",
"772835", "Tekeli",
"771433", "Lisakovsk",
"771546", "Talshik",
"7391", "Krasnoyarsk\ Territory",
"772138", "Gabidena\ Mustafina",
"771234", "Indernborski",
"772351", "Borodulikha",
"772533", "Turkestan",
"771141", "Zhangala",
"7381", "Omsk",
"77132", "Aktobe\/Kargalinskoye",
"771238", "Miyaly",
"772337", "Serebryansk",
"771645", "Stepnogorsk",
"7818", "Arkhangelsk",
"771538", "Beskol",
"771335", "Shalkar",
"7413", "Magadan",
"772146", "Karkaralinsk",
"772639", "Saudakent",
"772542", "Asykata",
"772771", "Kaskelen",
"771441", "Karabalyk",
"7384", "Kemerovo",
"7821", "Komi\ Republic",
"77222", "Semey",
"771342", "Badamsha",
"771643", "Atbasar",
"77106", "Satpaev",
"771237", "Kulsary",
"77292", "Aktau",
"772338", "Bozanbai\/Molodezhnyi",
"772535", "Shardara",
"771456", "Kachar",
"771032", "Karazhal",
"7848", "Tolyatti",
"771537", "Timiryazevo",
"772841", "Kapal",
"771043", "Zhairem",
"772935", "Zhetybai",
"771333", "Kandyagash",
"771632", "Zerenda",
"77272956", "Talgar",
"771834", "Uspenka",
"77252", "Shymkent",
"772148", "Molodezhnoye",
"7833", "Kirov",
"772931", "Shetpe",
"7820", "Cherepovets",
"771540", "Kishkenekol",
"771443", "Borovskoi",
"771132", "Fyodorovka",
"772773", "Bakanas",
"771536", "Taiynsha",
"771236", "Makhambet",
"771143", "Akzhaik",
"772531", "Aksukent",
"7712303", "Tengizs",
"771457", "Dzhangildinsky\ District",
"771544", "Presnovka",
"771839", "Akku",
"772775", "Esik",
"7473", "Voronezh",
"772147", "Egindybulak",
"771041", "Aktau\,\ Zhezkazgan",
"771445", "Ubaganskoye",
"772843", "Lepsy",
"772344", "Akzhar",
"7342", "Perm",
"7878", "Karachayevo\-Cherkessian\ Republic",
"77274", "Karassaisky\ District",
"7495", "Moscow",
"7349", "Yamalo\-Nenets\ Autonomous\ District",
"771331", "Martuk",
"772340", "Zaisan",
"7499", "Moscow",
"771641", "Astrakhanka",
"772336", "Ridder",
"772439", "Aralsky\ District",
"771458", "Kostanai\ Region",
"772634", "Zhanatas",
"772832", "Zhansugurov",
"7492", "Vladimir",
"771145", "Karatobe\ District",
"7855", "Naberezhnye\ Chelny",
"7345", "Tyumen",
"772153", "Topar",
"771637", "Korgalzhyn",
"772548", "Shayan",
"772774", "Talgar",
"772345", "Shar",
"771444", "Uzunkol",
"771140", "Saikhin",
"77272", "Almaty",
"771532", "Smirnovo",
"77262", "Taraz",
"772431", "Zhalagash",
"7717", "Astana",
"771136", "Chapayev",
"771649", "Zhaksynsky\ District",
"7483", "Bryansk",
"771543", "Yavlenka",
"771440", "Amangeldy",
"772770", "Uzynagash",
"772131", "Abai",
"771037", "Aktogai",
"771232", "Atyrau\ Region",
"771436", "Taranovskoye",
"771339", "Komsomolskoye",
"771347", "Aitekebisky\ District",
"7427", "Chukotka\ Autonomous\ District",
"7426", "Jewish\ Autonomous\ Region",
"771144", "Kaztalovka",
"772635", "Bauyrzhan\ Mamyshuly",
"77145834", "Krasnogorsk",
"771831", "Zhelezinka",
"771638", "Akkol",
"772547", "Lenger",
"772759", "Almaty\ Region",
"7491", "Ryazan",
"772642", "Moiynkum",
"772343", "Terekty",
"7873", "Ingushi\ Republic",
"772539", "Kazygurt",
"772332", "Shemonaikha",
"772633", "Asa",
"772239", "Makanchi",
"771038", "Shashubai",
"772154", "Botakara",
"771348", "Shalkarsky\ District",
"772840", "Saryozek",
"771545", "Zhambylsky\ District",
"7494", "Kostroma",
"7851", "Astrakhan",
"772836", "Karabulak",
"7341", "Udmurtian\ Republic",
"772230", "Urdzhar",
"771541", "Mamlutka",
"7385", "Altai\ Territory",
"772837", "Kabanbai",
"7347", "Republic\ of\ Bashkortostan",
"7346", "Surgut",
"771438", "Amangeldy",
"77182", "Pavlodar",
"77224", "Barshatas",
"772534", "Zhetysai",
"7496", "Moscow",
"771138", "Zhalpaktal",
"772159", "Karaganda\ Region",
"772546", "Sholakkorgan",
"7813", "Leningrad\ region",
"7382", "Tomsk",
"772934", "Zhanaozen",
"772530", "Temirlanovka",
"772433", "Aralsk",
"77125", "Atyrau\ Region",
"772779", "Narynkol",
"771346", "Shubarkuduk",
"771449", "Taranovskoye",
"771330", "Khromtau\ District",
"772631", "Kulan",
"7863", "Rostov",
"772838", "Balpyk\ bi",
"77242", "Kyzylorda",
"771452", "Karasu",
"771036", "Balkhash",
"771437", "Kamysty",
"7421", "Khabarovsk\ Territory",
"771644", "Arshaly",
"771040", "Zhairem\ \(GOK\)",
"771842", "Aktogaisky\ District",
"771137", "Chingirlau",
"772251", "Kurchatov",
"771833", "Terenkol",
"772435", "Zhanakorgan",
"7424", "Sakhalin\ Region",
"771334", "Emba",
"771636", "Shuchinsk",
"7843", "Republic\ of\ Tatarstan",
"7353", "Orenburg",
"771149", "Zelenovsky\ District",
"771640", "Balkashino",
"77212", "Karaganda",
"772341", "Ulken\ Naryn",};
$areanames{ru} = {"771445", "Алтынсаринский\ р\-н",
"772843", "Лепсы",
"772344", "Тарбагатайский\ р\-н",
"7342", "Пермский\ край",
"7473", "Воронежская\ обл\.",
"772775", "Енбекшиказахский\ р\-н",
"772147", "Каркаралинский\ р\-н",
"771041", "Актау\,\ Жезказган",
"7495", "Московская\ обл\.",
"7878", "Республика\ Карачаево\-Черкесская",
"77274", "Карасайский\ р\-н",
"7349", "Ямало\-Ненецкий\ АО",
"771331", "Мартукский\ р\-н",
"771641", "Астраханский\ р\-н",
"7499", "г\.\ Москва",
"772340", "Зайсанский\ р\-н",
"772439", "Аральский\ р\-н",
"771458", "Костанайская\ область",
"772336", "Риддер",
"772634", "Жанатас",
"772832", "Аксуский\ р\-н",
"7492", "Владимирская\ обл\.",
"771145", "Каратобинский\ р\-н",
"7855", "Республика\ Татарстан",
"772153", "Абайский\ р\-н",
"7345", "Тюменская\ обл\.",
"772148", "Осакаровский\ р\-н",
"7820", "Вологодская\ обл\.",
"772931", "Мангистауский\ р\-н",
"7833", "Кировская\ обл\.",
"772773", "Балхашский\ р\-н",
"771540", "Уалихановский\ р\-н",
"771443", "Мендыкаринский\ р\-н",
"771132", "Теректинский\ р\-н",
"771536", "Тайыншинский\ р\-н",
"772531", "Аксукент",
"771236", "Махамбетский\ р\-н",
"771143", "Теректинский\ р\-н",
"771457", "Джангильдинский\ р\-н",
"7712303", "Тензиз",
"771544", "Жамбылский\ р\-н",
"771839", "Лебяжинский\ р\-н",
"77222", "Семипалатинск",
"7821", "Республика\ Коми",
"77106", "Сатпаев",
"771342", "Каргалинский\ р\-н",
"771643", "Атбасарский\ р\-н",
"77292", "Актау",
"771237", "Жылыойский\ р\-н",
"772535", "Шардара",
"771456", "Качар",
"771032", "Каражал",
"772338", "Уланский\ р\-н",
"7848", "Самарская\ обл\.",
"771043", "Жайрем\ \(поселок\)",
"771537", "Тимирязевский\ р\-н",
"772841", "Аксуский\ р\-н",
"772935", "Каракиянский\ р\-н",
"77252", "Шымкент",
"771632", "Зерендинский\ р\-н",
"771333", "Мугалжарский\ р\-н",
"77272956", "Талгар",
"771834", "Успенский\ р\-н",
"7381", "Омская\ обл\.",
"771141", "Жангалинский\ р\-н",
"77132", "Актобе\/Актюбинск",
"772533", "Туркестан",
"771238", "Кзылкогинский\ р\-н",
"771645", "Степногорск",
"772337", "Серебрянск",
"7818", "Архангельская\ обл\.",
"771335", "Шалкарский\ р\-н",
"7413", "Магаданская\ обл\.",
"771538", "Кызылжарский\ р\-н",
"772639", "Сарысуский\ р\-н",
"772146", "Каркаралинск",
"771441", "Карабалыкский\ р\-н",
"7384", "Кемеровская\ обл\.",
"772542", "Асыката",
"772771", "Карасайский\ р\-н",
"771449", "Тарановский\ р\-н",
"77125", "Атырауская\ область",
"772779", "Райымбекский\ р\-н",
"771346", "Темирский\ р\-н",
"772631", "Турара\ Рыскулова\ р\-н",
"7863", "Ростовская\ обл\.",
"772838", "Коксуский\ р\-н",
"77242", "Кызылорда",
"771330", "Хромтауский\ р\-н",
"771452", "Карасуский\ р\-н",
"771036", "Балхаш",
"7421", "Хабаровский\ край",
"771644", "Аршалынский\ р\-н",
"771040", "Жайрем\ \(ГОК\)",
"771842", "Актогайский\ р\-н",
"771437", "Камыстинский\ р\-н",
"771833", "Качирский\ р\-н",
"772435", "Жанакорганский\ р\-н",
"771334", "Мугалжарский\ р\-н",
"7424", "Сахалинская\ обл\.",
"771137", "Чингирлауский\ р\-н",
"772251", "Курчатов",
"771149", "Акжаикский\ р\-н",
"7843", "Республика\ Татарстан",
"771636", "Щучинский\ р\-н",
"7353", "Оренбургская\ обл\.",
"77212", "Караганда",
"772341", "Катон\-Карагайский\ р\-н",
"771640", "Сандыктауский\ р\-н",
"772230", "Урджарский\ р\-н",
"771541", "Мамлютский\ р\-н",
"7385", "Алтайский\ край",
"772837", "Алакольский\ р\-н",
"7346", "Ханты\ \-\ Мансийский\ \-\ Югра\ АО",
"7347", "Республика\ Башкортостан",
"77224", "Эмельтау",
"772534", "Жетысай",
"771438", "Амангельдинский\ р\-н",
"77182", "Павлодар",
"7496", "г\.\ Москва",
"771138", "Казталовский\ р\-н",
"772159", "Карагандинская\ область",
"7382", "Томская\ обл\.",
"772934", "Жанаозен",
"772546", "Шолаккорган",
"7813", "Ленинградская\ обл\.",
"772530", "Темирлановка",
"772433", "Аральский\ р\-н",
"772759", "Алматинская\ область",
"771831", "Железинский\ р\-н",
"771638", "Аккольский\ р\-н",
"772547", "Ленгер",
"7491", "Рязанская\ обл\.",
"772642", "Мойынкумский\ р\-н",
"772343", "Курчумский\ р\-н",
"7873", "Республика\ Ингушетия",
"772539", "Казыгурт",
"772239", "Урджарский\ р\-н",
"771038", "Сыры\-Шаган",
"772332", "Шемонаихинский\ р\-н",
"772633", "Жамбылский\ р\-н",
"772154", "Бухар\-Жырауский\ р\-н",
"772840", "Кербулакский\ р\-н",
"771545", "Жамбылский\ р\-н",
"771348", "Шалкарский\ р\-н",
"7494", "Костромская\ обл\.",
"772836", "Ескельдинский\ р\-н",
"7851", "Астраханская\ обл\.",
"7341", "Республика\ Удмуртская",
"772345", "Жарминский\ р\-н",
"771444", "Узункольский\ р\-н",
"771637", "Коргалжынский\ р\-н",
"772548", "Шаян",
"772774", "Талгарский\ р\-н",
"77262", "Тараз",
"772431", "Жалагашский\ р\-н",
"771140", "Бокейординский\ р\-н",
"77272", "Алма\-Ата",
"771532", "Аккайынский\ р\-н",
"771649", "Жаксынский\ р\-н",
"7483", "Брянская\ обл\.",
"7717", "Астана",
"771136", "Акжаикский\ р\-н",
"772770", "Жамбылский\ р\-н",
"772131", "Абайский\ р\-н",
"771037", "Актогайский\ р\-н",
"771440", "Амангельдинский\ р\-н",
"771543", "Есильский\ р\-н",
"771339", "Айтекебийский\ р\-н",
"771232", "Атырауская\ область",
"771436", "Тарановский\ р\-н",
"7426", "Еврейская\ автономная\ обл\.",
"771144", "Казталовский\ р\-н",
"772635", "Жуалынский\ р\-н",
"771347", "Айтекебийский\ р\-н",
"7427", "Чукотский\ АО",
"77145834", "Красногорск",
"771455", "Костанайский\ р\-н",
"77187", "Экибастуз",
"772536", "Кентау",
"771231", "Исатайский\ р\-н",
"771845", "Павлодар",
"772540", "Арыс",
"736", "Республика\ Крым",
"772132", "Нуринский\ р\-н",
"7472", "Белгородская\ обл\.",
"7343", "Свердловская\ обл",
"772839", "Саркандский\ р\-н",
"771651", "Целиноградский\ р\-н",
"7302", "Забайкальский\ край",
"7493", "Ивановская\ обл\.",
"771448", "Карасуский\ р\-н",
"7475", "Тамбовская\ обл\.",
"772544", "Шаульдер",
"772778", "Уйгурский\ р\-н",
"7816", "Новгородская\ обл\.",
"7871", "Республика\ Чеченская",
"7817", "Вологодская\ обл\.",
"772432", "Шиелийский\ р\-н",
"772236", "Бескарагайский\ р\-н",
"771531", "Магжана\ Жумабаева\ р\-н",
"771646", "Буландинский\ р\-н",
"7484", "Калужская\ обл\.",
"771139", "Таскалинский\ р\-н",
"771630", "Боровое",
"771034", "Улытауский\ р\-н",
"7867", "Республика\ Северная\ Осетия\ \-\ Алания",
"7866", "Республика\ Кабардино\-Балкарская",
"772331", "Глубоковский\ р\-н",
"771453", "Аулиекольский\ р\-н",
"771147", "Акжаикский\ р\-н",
"771843", "Майский\ р\-н",
"7835", "Чувашская\ Республика\ \-\ Чувашия",
"771447", "Карабалыкский\ р\-н",
"772777", "Райымбекский\ р\-н",
"771832", "Иртышский\ р\-н",
"771030", "Жана\-Аркинский\ р\-н",
"771336", "Хромтауский\ р\-н",
"7846", "Самарская\ обл\.",
"771439", "Джангильдинский\ р\-н",
"7481", "Смоленская\ обл\.",
"7847", "Республика\ Калмыкия",
"771340", "Хобдинский\ р\-н",
"772641", "Таласский\ р\-н",
"771337", "Алгинский\ р\-н",
"771134", "Сырымский\ р\-н",
"771039", "Приозерск",
"771430", "Аркалык",
"771533", "Айыртауский\ р\-н",
"77279", "Алматы",
"77232", "Усть\-Каменогорск",
"7841", "Пензенская\ обл\.",
"7351", "Челябинская\ обл\.",
"771446", "Узункольский\ р\-н",
"7487", "Тульская\ обл\.",
"772938", "Тупкараганский\ р\-н",
"772776", "Енбекшиказахский\ р\-н",
"771349", "Шалкарский\ р\-н",
"7486", "Орловская\ обл\.",
"771542", "Уалихановский\ р\-н",
"771130", "Зеленовский\ р\-н",
"7861", "Краснодарский\ край",
"740", "Калининградская\ обл\.",
"771233", "Курмангазинский\ р\-н",
"771146", "Акжаикский\ р\-н",
"7844", "Волгоградская\ обл\.",
"771639", "Енбекшилдерский\ р\-н",
"772538", "имени\ Турара\ Рыскулова",
"771647", "Есильский\ р\-н",
"771434", "Денисовский\ р\-н",
"7423", "Приморский\ край",
"7395", "Иркутская\ обл\.",
"772335", "Зыряновск",
"7415", "Камчатский\ край",
"772252", "Абайский\ р\-н",
"771535", "Габита\ Мусрепова\ р\-н",
"772830", "Алакольский\ р\-н",
"772237", "Аязог",
"772643", "Шуский\ р\-н",
"772342", "Катон\-Карагайский\ р\-н",
"77245", "Кызылординская\ область",
"772937", "Каракиянский\ р\-н",
"7877", "Республика\ Адыгея",
"7811", "Псковская\ обл\.",
"77122", "Атырау",
"772834", "Каратальский\ р\-н",
"772333", "Кокпектинский\ р\-н",
"772632", "Меркенский\ р\-н",
"77152", "Петропавловск",
"7814", "Республика\ Карелия",
"772757", "Акший",
"772537", "Сарыагаш",
"7388", "Республика\ Алтай",
"771648", "Жаркаинский\ р\-н",
"771841", "Актогайский\ р\-н",
"772156", "Шахтинск",
"771451", "Сарыкольский\ р\-н",
"771235", "Макатский\ р\-н",
"77282", "Талдыкорган",
"771459", "Костанайская\ область",
"772438", "Казалинский\ р\-н",
"771534", "Шал\ Акына\ р\-н",
"7394", "Республика\ Тыва",
"7836", "Республика\ Марий\ Эл",
"7869", "г\.\ Севастополь",
"771133", "Бурлинский\ р\-н",
"771442", "Федоровский\ р\-н",
"77135", "Актюбинская\ область",
"772541", "Мырзакент",
"771837", "Аксуский\ р\-н",
"772772", "Капчагай",
"771230", "Атырауская\ область",
"7845", "Саратовская\ обл\.",
"7862", "Краснодарский\ край",
"7352", "Курганская\ обл\.",
"7842", "Ульяновская\ обл\.",
"771142", "Акжаикский\ р\-н",
"771433", "Лисаковск",
"772835", "Текели",
"7865", "Ставропольский\ край",
"771546", "Акжарский\ р\-н",
"772138", "Бухар\-Жырауский\ р\-н",
"7391", "Красноярский\ край",
"772351", "Бородулихинский\ р\-н",
"771234", "Индерский\ р\-н",
"772437", "Кармакшинский\ р\-н",
"771135", "Жанибекский\ р\-н",
"772842", "Кербулакский\ р\-н",
"7411", "Республика\ Саха\ \/Якутия\/",
"772644", "Таласский\ р\-н",
"772256", "Алгабас",
"733", "Байконыр",
"772330", "Зыряновский\ р\-н",
"77142", "Костанай",
"771631", "Шортандинский\ р\-н",
"771838", "Майский\ р\-он",
"7815", "Мурманская\ обл\.",
"772346", "Тарбагатайский\ р\-н",
"772725", "Отеген\-Батыр",
"772640", "Мойынкумский\ р\-н",
"7812", "г\.\ Санкт\-Петербург",
"771341", "Хобдинский\ р\-н",
"7383", "Новосибирская\ обл\.",
"77112", "Уральск",
"772636", "Кордай",
"772149", "Осакаровский\ р\-н",
"771031", "Шетский\ р\-н",
"772137", "Сарань",
"772334", "Уланский\ р\-н",
"772833", "Алакольский\ р\-н",
"771435", "Житикаринский\ р\-н",
"77273", "Алма\-Ата",
"772532", "Абая",
"771035", "Улытауский\ р\-н",
"7872", "Республика\ Дагестан",
"771431", "Рудный",
"77272983", "Каскелен",
"77162", "Кокшетау",
"772752", "Илийский\ р\-н",
"772353", "Бородулихинский\ р\-н",
"77213", "Темиртау",
"7301", "Республика\ Бурятия",
"7474", "Липецкая\ обл\.",
"772637", "Байзакский\ р\-н",
"771345", "Байганинский\ р\-н",
"7879", "Ставропольский\ край",
"772932", "Бейнеуский\ р\-н",
"77102", "Жезказган",
"772347", "Жарминский\ р\-н",
"7471", "Курская\ обл\.",
"771635", "Жаксынский\ р\-н",
"7416", "Амурская\ обл\.",
"772144", "Нуринский\ р\-н",
"7712302", "Тенгизшевройл",
"772436", "Сырдарьинский\ р\-н",
"7498", "Московская\ обл\.",
"772339", "Курчумский\ р\-н",
"772257", "Шульбинск",
"771131", "Зеленовский\ р\-н",
"771454", "Наурзумский\ р\-н",
"771539", "Кызылжарский\ р\-н",
"771844", "Иртышский\ р\-н",
"771642", "Егиндыкольский\ р\-н",
"771343", "Иргизский\ р\-н",
"7482", "Тверская\ обл\.",
"7834", "Республика\ Мордовия",
"772831", "Панфиловский\ р\-н",
"772638", "Шуский\ р\-н",
"771547", "Жамбылский\ р\-н",
"771033", "Шетский\ р\-н",
"7831", "Нижегородская\ обл\.",
"771836", "Щербактинский\ р\-н",
"772348", "Кокпектинский\ р\-н",
"771042", "Акой",
"771840", "Баянаульский\ р\-н",
"7485", "Ярославская\ обл\.",
"771633", "Ерейментауский\ р\-н",
"771332", "Уилский\ р\-н",
"7390", "Республика\ Хакасия",
"771239", "Макатский\ р\-н",};

    sub new {
      my $class = shift;
      my $number = shift;
      $number =~ s/(^\+7|\D)//g;
      my $self = bless({ number => $number, formatters => $formatters, validators => $validators, areanames => \%areanames}, $class);
      return $self if ($self->is_valid());
      $number =~ s/^(?:8)//;
      $self = bless({ number => $number, formatters => $formatters, validators => $validators, areanames => \%areanames}, $class);
      return $self->is_valid() ? $self : undef;
    }
1;