# automatically generated file, don't edit



# Copyright 2026 David Cantrell, derived from data from libphonenumber
# http://code.google.com/p/libphonenumber/
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
package Number::Phone::StubCountry::RU;
use base qw(Number::Phone::StubCountry);

use strict;
use warnings;
use utf8;
our $VERSION = 1.20260306161714;

my $formatters = [
                {
                  'format' => '$1-$2-$3',
                  'intl_format' => 'NA',
                  'leading_digits' => '[0-79]',
                  'pattern' => '(\\d{3})(\\d{2})(\\d{2})'
                },
                {
                  'format' => '$1 $2 $3 $4',
                  'leading_digits' => '
            7(?:
              1(?:
                [0-356]2|
                4[29]|
                7|
                8[27]
              )|
              2(?:
                13[03-69]|
                62[013-9]
              )
            )|
            72[1-57-9]2
          ',
                  'national_rule' => '8 ($1)',
                  'pattern' => '(\\d{4})(\\d{2})(\\d{2})(\\d{2})'
                },
                {
                  'format' => '$1 $2 $3 $4',
                  'leading_digits' => '
            7(?:
              1(?:
                0(?:
                  [356]|
                  4[023]
                )|
                [18]|
                2(?:
                  3[013-9]|
                  5
                )|
                3[45]|
                43[013-79]|
                5(?:
                  3[1-8]|
                  4[1-7]|
                  5
                )|
                6(?:
                  3[0-35-9]|
                  [4-6]
                )
              )|
              2(?:
                1(?:
                  3[178]|
                  [45]
                )|
                [24-689]|
                3[35]|
                7[457]
              )
            )|
            7(?:
              14|
              23
            )4[0-8]|
            71(?:
              33|
              45
            )[1-79]
          ',
                  'national_rule' => '8 ($1)',
                  'pattern' => '(\\d{5})(\\d)(\\d{2})(\\d{2})'
                },
                {
                  'format' => '$1 $2 $3',
                  'leading_digits' => '7',
                  'national_rule' => '8 ($1)',
                  'pattern' => '(\\d{3})(\\d{3})(\\d{4})'
                },
                {
                  'format' => '$1 $2-$3-$4',
                  'leading_digits' => '
            [349]|
            8(?:
              [02-7]|
              1[1-8]
            )
          ',
                  'national_rule' => '8 ($1)',
                  'pattern' => '(\\d{3})(\\d{3})(\\d{2})(\\d{2})'
                },
                {
                  'format' => '$1 $2 $3 $4',
                  'leading_digits' => '8',
                  'national_rule' => '8 ($1)',
                  'pattern' => '(\\d{4})(\\d{4})(\\d{3})(\\d{3})'
                }
              ];

my $validators = {
                'fixed_line' => '
          (?:
            3(?:
              0[12]|
              36|
              4[1-35-79]|
              5[1-3]|
              65|
              8[1-58]|
              9[0145]
            )|
            4(?:
              01|
              1[1356]|
              2[13467]|
              7[1-5]|
              8[1-7]|
              9[1-689]
            )|
            8(?:
              1[1-8]|
              2[01]|
              3[13-6]|
              4[0-8]|
              5[15-7]|
              6[0-35-79]|
              7[1-37-9]
            )
          )\\d{7}
        ',
                'geographic' => '
          (?:
            3(?:
              0[12]|
              36|
              4[1-35-79]|
              5[1-3]|
              65|
              8[1-58]|
              9[0145]
            )|
            4(?:
              01|
              1[1356]|
              2[13467]|
              7[1-5]|
              8[1-7]|
              9[1-689]
            )|
            8(?:
              1[1-8]|
              2[01]|
              3[13-6]|
              4[0-8]|
              5[15-7]|
              6[0-35-79]|
              7[1-37-9]
            )
          )\\d{7}
        ',
                'mobile' => '9\\d{9}',
                'pager' => '',
                'personal_number' => '808\\d{7}',
                'specialrate' => '(80[39]\\d{7})',
                'toll_free' => '
          8(?:
            0[04]|
            108\\d{3}
          )\\d{7}
        ',
                'voip' => ''
              };
my %areanames = ();
$areanames{en} = {"7844", "Volgograd",
"772344", "Akzhar",
"771839", "Akku",
"771337", "Alga",
"77292", "Aktau",
"772341", "Ulken\ Naryn",
"772330", "Zyryanovsky\ District",
"7857", "Luhansk\ People\'s\ Republic",
"77182", "Pavlodar",
"7347", "Republic\ of\ Bashkortostan",
"7384", "Kemerovo",
"771444", "Uzunkol",
"772251", "Kurchatov",
"771643", "Atbasar",
"7391", "Krasnoyarsk\ Territory",
"772437", "Zhosaly",
"772635", "Bauyrzhan\ Mamyshuly",
"771032", "Karazhal",
"772543", "Aqsumbe",
"771535", "Novoishimski",
"771441", "Karabalyk",
"771430", "Arkalyk",
"7821", "Komi\ Republic",
"772149", "Osakarovka",
"7862", "Sochi",
"7815", "Murmansk",
"772338", "Bozanbai\/Molodezhnyi",
"771143", "Akzhaik",
"7343", "Ekaterinburg",
"77145834", "Krasnogorsk",
"771332", "Uil",
"771536", "Taiynsha",
"771438", "Amangeldy",
"771037", "Aktogai",
"771239", "Makat",
"772432", "Shiyeli",
"771845", "Pavlodar\ Area",
"736", "Simferopol",
"77122", "Atyrau",
"772636", "Kordai",
"772833", "Usharal",
"7482", "Tver",
"771637", "Korgalzhyn",
"772842", "Kogaly",
"771435", "Zhitikara",
"771541", "Mamlutka",
"772644", "Karatau",
"771544", "Presnovka",
"7385", "Altai\ Territory",
"7851", "Astrakhan",
"772641", "Akkol",
"77125", "Atyrau\ Region",
"772537", "Saryagash",
"7341", "Udmurtian\ Republic",
"772335", "Zyryanovsk",
"771457", "Dzhangildinsky\ District",
"7712303", "Tengizs",
"771343", "Irgiz",
"771231", "Akkystau",
"772138", "Gabidena\ Mustafina",
"77187", "Ekibastuz",
"7390", "Republic\ of\ Khakassia",
"7845", "Saratov",
"771132", "Fyodorovka",
"771234", "Indernborski",
"772752", "Otegen\ Batyra",
"772777", "Kegen",
"7820", "Cherepovets",
"7346", "Surgut",
"772931", "Shetpe",
"771840", "Bayanaul",
"771043", "Zhairem",
"772532", "Abai",
"772638", "Tole\ bi",
"771831", "Zhelezinka",
"7499", "Moscow",
"771538", "Beskol",
"771632", "Zerenda",
"771436", "Taranovskoye",
"772934", "Zhanaozen",
"771834", "Uspenka",
"771137", "Chingirlau",
"772772", "Kapchagai",
"772144", "Kiyevka",
"772757", "Akshi",
"771449", "Taranovskoye",
"771452", "Karasu",
"7814", "Republic\ of\ Karelia",
"772336", "Ridder",
"7856", "Donetsk\ People\'s\ Republic",
"77185", "Shaldai",
"771439", "Torgai",
"7471", "Kursk",
"772346", "Aksuat",
"7416", "Amur\ Region",
"772131", "Abai",
"771238", "Miyaly",
"7848", "Tolyatti",
"771147", "Akzhaiksky\ District",
"7484", "Kaluga",
"77142", "Kostanai",
"7491", "Ryazan",
"772339", "Kurchum",
"771446", "Uzunkolsky\ District",
"7831", "Nizhni\ Novgorod",
"772837", "Kabanbai",
"771642", "Egendykol",
"7388", "Republic\ of\ Altai",
"771844", "Irtyshsky\ District",
"772256", "Kainar",
"77232", "Ust\-Kamenogorsk",
"772153", "Topar",
"77279", "Almaty",
"772542", "Asykata",
"771841", "Aktogai",
"771033", "Agadyr",
"772237", "Ayagoz",
"771142", "Taipak",
"7836", "Republic\ of\ Marij\ El",
"7382", "Tomsk",
"772345", "Shar",
"771333", "Kandyagash",
"771230", "Atyrau\ Region",
"77272", "Almaty",
"7352", "Kurgan",
"772148", "Molodezhnoye",
"772938", "Fort\ Shevchenko",
"771534", "Sergeyevka",
"7411", "Republic\ of\ Sakha",
"772547", "Lenger",
"772640", "Moiynkumsky\ District",
"772631", "Kulan",
"771838", "Koktobe",
"7842", "Ulyanovsk",
"7349", "Yamalo\-Nenets\ Autonomous\ District",
"772832", "Zhansugurov",
"771445", "Ubaganskoye",
"771531", "Bulayevo",
"771540", "Kishkenekol",
"771647", "Esil",
"772433", "Aralsk",
"77149", "Kostanai",
"772634", "Zhanatas",
"7496", "Moscow",
"772935", "Zhetybai",
"7413", "Magadan",
"772843", "Lepsy",
"771448", "Oktyabrskoye",
"771546", "Talshik",
"7812", "St\ Petersburg",
"7878", "Karachayevo\-Cherkessian\ Republic",
"77152", "Petropavlovsk",
"7485", "Yaroslavl",
"7717", "Astana",
"7424", "Sakhalin\ Region",
"771342", "Badamsha",
"772639", "Saudakent",
"772348", "Kokpekty",
"771539", "Beskol",
"771236", "Makhambet",
"771133", "Aksai",
"77262", "Taraz",
"772533", "Turkestan",
"771042", "Zharyk",
"771440", "Amangeldy",
"771545", "Zhambylsky\ District",
"771431", "Rudny",
"7833", "Kirov",
"771434", "Denisovka",
"77272983", "Kaskelen",
"772353", "Novaya\ Shulba",
"77212", "Karaganda",
"771633", "Ereimentau",
"771836", "Sharbakty",
"771651", "Kabanbai\ Batyr",
"772340", "Zaisan",
"77224", "Barshatas",
"7865", "Stavropol\ territory",
"772773", "Bakanas",
"772331", "Glubokoye",
"772146", "Karkaralinsk",
"7302", "Chita",
"771235", "Dossor",
"7473", "Voronezh",
"772334", "Tavricheskoye",
"771453", "Auliekol",
"7818", "Arkhangelsk",
"7872", "Republic\ of\ Daghestan",
"771347", "Aitekebisky\ District",
"7834", "Republic\ of\ Mordovia",
"771146", "Akzhaiksky\ District",
"771340", "Khobdinsky\ District",
"7427", "Chukotka\ Autonomous\ District",
"771331", "Martuk",
"7866", "Kabardino\-Balkarian\ Republic",
"772347", "Kalbatau",
"771334", "Emba",
"77245", "Kyzylorda\ Region",
"772257", "Shulbinsk",
"7474", "Lipetsk",
"771139", "Taskala",
"771533", "Saumalkol",
"772759", "Almaty\ Region",
"772545", "Ikan",
"772431", "Zhalagash",
"77112", "Uralsk",
"772633", "Asa",
"771645", "Stepnogorsk",
"772836", "Karabulak",
"7481", "Smolensk",
"771447", "Karabalyksky\ District",
"7494", "Kostroma",
"77135", "Aktobe\ Region",
"772342", "Katon\-Karagai",
"771639", "Stepnyak",
"77252", "Shymkent",
"772236", "Beskaragai",
"77162", "Kokshetau\/Krasni\ Yar",
"7486", "Orel",
"771145", "Karatobe\ District",
"771348", "Shalkarsky\ District",
"772539", "Kazygurt",
"77213", "Aktau\/Temirtau",
"7423", "Primorie\ territory",
"771646", "Makinsk",
"772835", "Tekeli",
"771442", "Fyodorovka",
"771843", "Maisky\ District",
"771040", "Zhairem\ \(GOK\)",
"771031", "Aksu\-Ayuly",
"771459", "Kostanai\ Region",
"772252", "Karaul",
"771034", "Zhezdy",
"7861", "Krasnodar\ Territory",
"772779", "Narynkol",
"772546", "Sholakkorgan",
"7879", "Mineranye\ Vody",
"772154", "Botakara",
"771547", "Zhambylsky\ District",
"771640", "Balkashino",
"772351", "Borodulikha",
"771631", "Shortandy",
"772838", "Balpyk\ bi",
"772534", "Zhetysai",
"7421", "Khabarovsk\ Territory",
"7495", "Moscow",
"7475", "Tambov",
"772932", "Beineu",
"7863", "Rostov",
"771832", "Irtyshsk",
"772531", "Aksukent",
"772540", "Arys",
"771433", "Lisakovsk",
"771451", "Sarykol",
"771039", "Priozersk",
"772159", "Karaganda\ Region",
"771237", "Kulsary",
"772774", "Talgar",
"772230", "Urdzhar",
"771454", "Karamendy",
"7835", "Chuvashi\ Republic",
"7487", "Tula",
"77102", "Zhezkazgan",
"771345", "Karauylkeldy",
"772333", "Samarskoye",
"772771", "Kaskelen",
"77272956", "Talgar",
"772937", "Kuryk",
"771339", "Komsomolskoye",
"771837", "Aksu",
"772548", "Shayan",
"772642", "Moiynkum",
"771542", "Kishkenekol",
"771648", "Derzhavinsk",
"772841", "Kapal",
"772830", "Alakolsky\ District",
"7483", "Bryansk",
"77273", "Almaty",
"77132", "Aktobe\/Kargalinskoye",
"771131", "Darinskoye",
"771140", "Saikhin",
"772439", "Aralsky\ District",
"7342", "Perm",
"771346", "Shubarkuduk",
"7426", "Jewish\ Autonomous\ Region",
"7860", "Kherson\ Region",
"771134", "Zhympity",
"7867", "Republic\ of\ North\ Ossetia",
"7415", "Kamchatka\ Region",
"772147", "Egindybulak",
"771232", "Atyrau\ Region",
"77242", "Kyzylorda",
"771144", "Kaztalovka",
"7381", "Omsk",
"771458", "Kostanai\ Region",
"7855", "Naberezhnye\ Chelny",
"772137", "Saran",
"7394", "Republic\ of\ Tuva",
"771130", "Peremetnoye",
"771141", "Zhangala",
"7351", "Chelyabinsk",
"740", "Kaliningrad",
"772778", "Chundzha",
"771336", "Khromtau",
"7841", "Penza",
"771035", "Ulytau",
"772840", "Saryozek",
"771532", "Smirnovo",
"772831", "Zharkent",
"771638", "Akkol",
"733", "Baikonur",
"77274", "Karassaisky\ District",
"7345", "Tyumen",
"7498", "Moscow",
"772834", "Ushtobe",
"7877", "Republic\ of\ Adygeya",
"771349", "Shalkarsky\ District",
"772538", "Turara\ Ryskulova",
"772632", "Merke",
"772436", "Terenozek",
"7813", "Leningrad\ region",
"7846", "Samara",
"771138", "Zhalpaktal",
"7472", "Belgorod",
"772725", "Otegen\ Batyra",
"771335", "Shalkar",
"7712302", "Tengizshevroil",
"772343", "Terekty",
"772770", "Uzynagash",
"7817", "Vologda",
"7492", "Vladimir",
"7873", "Ingushi\ Republic",
"772132", "Nurinsky\ District",
"771644", "Arshaly",
"772530", "Temirlanovka",
"772637", "Sarykemer",
"772435", "Zhanakorgan",
"771842", "Koktobe",
"772541", "Myrzakent",
"771443", "Borovskoi",
"771641", "Astrakhanka",
"771537", "Timiryazevo",
"771630", "Burabay",
"771036", "Balkhash",
"772544", "Shaulder",
"772156", "Shakhtinsk",
"772239", "Makanchi",
"772536", "Kentau",
"772438", "Aiteke\ bi",
"77222", "Semey",
"771636", "Shuchinsk",
"771041", "Aktau\,\ Zhezkazgan",
"771833", "Terenkol",
"771030", "Atasu",
"7847", "Republic\ of\ Kalmykia",
"7301", "Republic\ of\ Buryatia",
"771135", "Zhanibek",
"772776", "Shelek",
"772332", "Shemonaikha",
"771456", "Kachar",
"7816", "Veliky\ Novgorod",
"7871", "Chechen\ Republic",
"771649", "Zhaksynsky\ District",
"7395", "Irkutsk",
"7869", "Sevastopol",
"772643", "Shu",
"771038", "Shashubai",
"771437", "Kamysty",
"771635", "Zhaksy",
"7843", "Republic\ of\ Tatarstan",
"7811", "Pskov",
"771149", "Zelenovsky\ District",
"77106", "Satpaev",
"771543", "Yavlenka",
"772535", "Shardara",
"772839", "Sarkand",
"771455", "Zatobolsk",
"772337", "Serebryansk",
"7383", "Novosibirsk",
"771233", "Ganyushkino",
"771136", "Chapayev",
"77282", "Taldykorgan",
"7353", "Orenburg",
"772775", "Esik",
"771341", "Khobda",
"771330", "Khromtau\ District",};
$areanames{ru} = {"771844", "Иртышский\ р\-н",
"7388", "Республика\ Алтай",
"772339", "Курчумский\ р\-н",
"771642", "Егиндыкольский\ р\-н",
"772837", "Алакольский\ р\-н",
"7831", "Нижегородская\ обл\.",
"771446", "Узункольский\ р\-н",
"77279", "Алматы",
"771033", "Шетский\ р\-н",
"771841", "Актогайский\ р\-н",
"772542", "Асыката",
"772153", "Абайский\ р\-н",
"77232", "Усть\-Каменогорск",
"772256", "Алгабас",
"772131", "Абайский\ р\-н",
"7848", "Самарская\ обл\.",
"771238", "Кзылкогинский\ р\-н",
"7471", "Курская\ обл\.",
"771439", "Джангильдинский\ р\-н",
"772346", "Тарбагатайский\ р\-н",
"7416", "Амурская\ обл\.",
"7491", "Рязанская\ обл\.",
"7484", "Калужская\ обл\.",
"771147", "Акжаикский\ р\-н",
"77142", "Костанай",
"7842", "Ульяновская\ обл\.",
"772631", "Турара\ Рыскулова\ р\-н",
"771838", "Майский\ р\-он",
"772640", "Мойынкумский\ р\-н",
"772547", "Ленгер",
"7349", "Ямало\-Ненецкий\ АО",
"771534", "Шал\ Акына\ р\-н",
"772938", "Тупкараганский\ р\-н",
"7411", "Республика\ Саха\ \/Якутия\/",
"772634", "Жанатас",
"7496", "г\.\ Москва",
"771647", "Есильский\ р\-н",
"771540", "Уалихановский\ р\-н",
"771531", "Магжана\ Жумабаева\ р\-н",
"771445", "Алтынсаринский\ р\-н",
"772832", "Аксуский\ р\-н",
"77149", "Костанай",
"772433", "Аральский\ р\-н",
"7382", "Томская\ обл\.",
"772237", "Аязог",
"7836", "Республика\ Марий\ Эл",
"771142", "Акжаикский\ р\-н",
"77272", "Алматы",
"771230", "Атырауская\ область",
"772148", "Осакаровский\ р\-н",
"7352", "Курганская\ обл\.",
"772345", "Жарминский\ р\-н",
"771333", "Мугалжарский\ р\-н",
"771342", "Каргалинский\ р\-н",
"7424", "Сахалинская\ обл\.",
"772639", "Сарысуский\ р\-н",
"77152", "Петропавловск",
"7717", "Астана",
"7485", "Ярославская\ обл\.",
"77262", "Тараз",
"771133", "Бурлинский\ р\-н",
"771236", "Махамбетский\ р\-н",
"772348", "Кокпектинский\ р\-н",
"771539", "Кызылжарский\ р\-н",
"7413", "Магаданская\ обл\.",
"772843", "Лепсы",
"772935", "Каракиянский\ р\-н",
"7878", "Республика\ Карачаево\-Черкесская",
"7812", "г\.\ Санкт\-Петербург",
"771546", "Акжарский\ р\-н",
"771448", "Карасуский\ р\-н",
"772146", "Каркаралинск",
"7302", "Забайкальский\ край",
"7473", "Воронежская\ обл\.",
"771235", "Макатский\ р\-н",
"772773", "Балхашский\ р\-н",
"772331", "Глубоковский\ р\-н",
"7865", "Ставропольский\ край",
"772340", "Зайсанский\ р\-н",
"77224", "Эмельтау",
"771651", "Целиноградский\ р\-н",
"771453", "Аулиекольский\ р\-н",
"771347", "Айтекебийский\ р\-н",
"7872", "Республика\ Дагестан",
"7818", "Архангельская\ обл\.",
"7493", "Ивановская\ обл\.",
"772334", "Уланский\ р\-н",
"7833", "Кировская\ обл\.",
"771042", "Акой",
"772533", "Туркестан",
"771431", "Рудный",
"771545", "Жамбылский\ р\-н",
"771440", "Амангельдинский\ р\-н",
"771633", "Ерейментауский\ р\-н",
"772353", "Бородулихинский\ р\-н",
"77212", "Караганда",
"771836", "Щербактинский\ р\-н",
"77272983", "Каскелен",
"771434", "Денисовский\ р\-н",
"7391", "Красноярский\ край",
"771643", "Атбасарский\ р\-н",
"772635", "Жуалынский\ р\-н",
"772437", "Кармакшинский\ р\-н",
"7347", "Республика\ Башкортостан",
"772251", "Курчатов",
"771444", "Узункольский\ р\-н",
"7384", "Кемеровская\ обл\.",
"7821", "Республика\ Коми",
"7862", "Краснодарский\ край",
"772149", "Осакаровский\ р\-н",
"772543", "Аксумбе",
"771032", "Каражал",
"771430", "Аркалык",
"771441", "Карабалыкский\ р\-н",
"771535", "Габита\ Мусрепова\ р\-н",
"771839", "Лебяжинский\ р\-н",
"771337", "Алгинский\ р\-н",
"772344", "Тарбагатайский\ р\-н",
"7844", "Волгоградская\ обл\.",
"77182", "Павлодар",
"772330", "Зыряновский\ р\-н",
"7857", "Луга́нская\ Наро́дная\ Респу́блика",
"772341", "Катон\-Карагайский\ р\-н",
"77292", "Актау",
"771239", "Макатский\ р\-н",
"771438", "Амангельдинский\ р\-н",
"771536", "Тайыншинский\ р\-н",
"771037", "Актогайский\ р\-н",
"772636", "Кордай",
"77122", "Атырау",
"736", "Республика\ Крым",
"772432", "Шиелийский\ р\-н",
"771845", "Павлодар",
"7482", "Тверская\ обл\.",
"772833", "Алакольский\ р\-н",
"771143", "Теректинский\ р\-н",
"7343", "Свердловская\ обл",
"772338", "Уланский\ р\-н",
"7815", "Мурманская\ обл\.",
"771332", "Уилский\ р\-н",
"77145834", "Красногорск",
"771231", "Исатайский\ р\-н",
"772138", "Бухар\-Жырауский\ р\-н",
"7390", "Республика\ Хакасия",
"77187", "Экибастуз",
"771457", "Джангильдинский\ р\-н",
"772335", "Зыряновск",
"7341", "Республика\ Удмуртская",
"771343", "Иргизский\ р\-н",
"7712303", "Тензиз",
"772752", "Илийский\ р\-н",
"771234", "Индерский\ р\-н",
"7820", "Вологодская\ обл\.",
"772777", "Райымбекский\ р\-н",
"7845", "Саратовская\ обл\.",
"771132", "Теректинский\ р\-н",
"772644", "Таласский\ р\-н",
"771541", "Мамлютский\ р\-н",
"771435", "Житикаринский\ р\-н",
"772842", "Кербулакский\ р\-н",
"771637", "Коргалжынский\ р\-н",
"772537", "Сарыагаш",
"77125", "Атырауская\ область",
"772641", "Таласский\ р\-н",
"7385", "Алтайский\ край",
"771544", "Жамбылский\ р\-н",
"7851", "Астраханская\ обл\.",
"772772", "Капчагай",
"772144", "Нуринский\ р\-н",
"772757", "Акший",
"771137", "Чингирлауский\ р\-н",
"77185", "Шалдай",
"771449", "Тарановский\ р\-н",
"7856", "Донецкая\ Народная\ Республика",
"7814", "Республика\ Карелия",
"772336", "Риддер",
"771452", "Карасуский\ р\-н",
"772638", "Шуский\ р\-н",
"771831", "Железинский\ р\-н",
"772532", "Абая",
"771043", "Жайрем\ \(поселок\)",
"771840", "Баянаульский\ р\-н",
"7346", "Ханты\ \-\ Мансийский\ \-\ Югра\ АО",
"772931", "Мангистауский\ р\-н",
"771834", "Успенский\ р\-н",
"7499", "г\.\ Москва",
"772934", "Жанаозен",
"771436", "Тарановский\ р\-н",
"771632", "Зерендинский\ р\-н",
"771538", "Кызылжарский\ р\-н",
"733", "Байконыр",
"77274", "Карасайский\ р\-н",
"771035", "Улытауский\ р\-н",
"7841", "Пензенская\ обл\.",
"772831", "Панфиловский\ р\-н",
"771638", "Аккольский\ р\-н",
"771532", "Аккайынский\ р\-н",
"772840", "Кербулакский\ р\-н",
"771349", "Шалкарский\ р\-н",
"7813", "Ленинградская\ обл\.",
"772436", "Сырдарьинский\ р\-н",
"772632", "Меркенский\ р\-н",
"772538", "имени\ Турара\ Рыскулова",
"7498", "Московская\ обл\.",
"7345", "Тюменская\ обл\.",
"7877", "Республика\ Адыгея",
"772834", "Каратальский\ р\-н",
"772137", "Сарань",
"7394", "Республика\ Тыва",
"7381", "Омская\ обл\.",
"771144", "Казталовский\ р\-н",
"771458", "Костанайская\ область",
"7855", "Республика\ Татарстан",
"740", "Калининградская\ обл\.",
"772778", "Уйгурский\ р\-н",
"771336", "Хромтауский\ р\-н",
"771141", "Жангалинский\ р\-н",
"771130", "Зеленовский\ р\-н",
"7351", "Челябинская\ обл\.",
"772541", "Мырзакент",
"771842", "Майский\ р\-он",
"772435", "Жанакорганский\ р\-н",
"772530", "Темирлановка",
"772637", "Байзакский\ р\-н",
"771443", "Мендыкаринский\ р\-н",
"771644", "Аршалынский\ р\-н",
"772544", "Шаульдер",
"772156", "Шахтинск",
"771537", "Тимирязевский\ р\-н",
"771630", "Боровое",
"771641", "Астраханский\ р\-н",
"771036", "Балхаш",
"7712302", "Тенгизшевройл",
"771335", "Шалкарский\ р\-н",
"772725", "Отеген\-Батыр",
"7472", "Белгородская\ обл\.",
"772770", "Жамбылский\ р\-н",
"772343", "Курчумский\ р\-н",
"7846", "Самарская\ обл\.",
"771138", "Казталовский\ р\-н",
"7873", "Республика\ Ингушетия",
"772132", "Нуринский\ р\-н",
"7817", "Вологодская\ обл\.",
"7492", "Владимирская\ обл\.",
"772776", "Енбекшиказахский\ р\-н",
"7301", "Республика\ Бурятия",
"7847", "Республика\ Калмыкия",
"771135", "Жанибекский\ р\-н",
"7869", "г\.\ Севастополь",
"7395", "Иркутская\ обл\.",
"7816", "Новгородская\ обл\.",
"771456", "Качар",
"772332", "Шемонаихинский\ р\-н",
"771649", "Жаксынский\ р\-н",
"7871", "Республика\ Чеченская",
"772438", "Казалинский\ р\-н",
"772536", "Кентау",
"772239", "Урджарский\ р\-н",
"771636", "Щучинский\ р\-н",
"77222", "Семипалатинск",
"771030", "Жана\-Аркинский\ р\-н",
"771833", "Качирский\ р\-н",
"771041", "Актау\,\ Жезказган",
"7383", "Новосибирская\ обл\.",
"772839", "Саркандский\ р\-н",
"772337", "Серебрянск",
"771455", "Костанайский\ р\-н",
"772775", "Енбекшиказахский\ р\-н",
"7353", "Оренбургская\ обл\.",
"771330", "Хромтауский\ р\-н",
"771341", "Хобдинский\ р\-н",
"771136", "Акжаикский\ р\-н",
"771233", "Курмангазинский\ р\-н",
"77282", "Талдыкорган",
"7843", "Республика\ Татарстан",
"771038", "Сыры\-Шаган",
"772643", "Шуский\ р\-н",
"771635", "Жаксынский\ р\-н",
"771437", "Камыстинский\ р\-н",
"771543", "Есильский\ р\-н",
"77106", "Сатпаев",
"772535", "Шардара",
"7811", "Псковская\ обл\.",
"771149", "Акжаикский\ р\-н",
"772759", "Алматинская\ область",
"771533", "Айыртауский\ р\-н",
"772431", "Жалагашский\ р\-н",
"772545", "Икан",
"771139", "Таскалинский\ р\-н",
"7474", "Липецкая\ обл\.",
"772257", "Шульбинск",
"7494", "Костромская\ обл\.",
"77135", "Актюбинская\ область",
"772633", "Жамбылский\ р\-н",
"77112", "Уральск",
"771447", "Карабалыкский\ р\-н",
"772836", "Ескельдинский\ р\-н",
"7481", "Смоленская\ обл\.",
"771645", "Степногорск",
"771331", "Мартукский\ р\-н",
"7427", "Чукотский\ АО",
"771340", "Хобдинский\ р\-н",
"771146", "Акжаикский\ р\-н",
"7834", "Республика\ Мордовия",
"77245", "Кызылординская\ область",
"771334", "Мугалжарский\ р\-н",
"772347", "Жарминский\ р\-н",
"7866", "Республика\ Кабардино\-Балкарская",
"771442", "Федоровский\ р\-н",
"772835", "Текели",
"7423", "Приморский\ край",
"771646", "Буландинский\ р\-н",
"771031", "Шетский\ р\-н",
"771459", "Костанайская\ область",
"771040", "Жайрем\ \(ГОК\)",
"771843", "Майский\ р\-н",
"7879", "Ставропольский\ край",
"772546", "Шолаккорган",
"772779", "Райымбекский\ р\-н",
"772154", "Бухар\-Жырауский\ р\-н",
"772252", "Абайский\ р\-н",
"7861", "Краснодарский\ край",
"771034", "Улытауский\ р\-н",
"77252", "Шымкент",
"772342", "Катон\-Карагайский\ р\-н",
"771639", "Енбекшилдерский\ р\-н",
"771348", "Шалкарский\ р\-н",
"77213", "Темиртау",
"772539", "Казыгурт",
"77162", "Кокшетау",
"772236", "Бескарагайский\ р\-н",
"771145", "Каратобинский\ р\-н",
"7486", "Орловская\ обл\.",
"771237", "Жылыойский\ р\-н",
"772159", "Карагандинская\ область",
"772774", "Талгарский\ р\-н",
"771451", "Сарыкольский\ р\-н",
"771039", "Приозерск",
"771345", "Байганинский\ р\-н",
"772333", "Кокпектинский\ р\-н",
"772771", "Карасайский\ р\-н",
"771454", "Наурзумский\ р\-н",
"772230", "Урджарский\ р\-н",
"77102", "Жезказган",
"7487", "Тульская\ обл\.",
"7835", "Чувашская\ Республика\ \-\ Чувашия",
"772534", "Жетысай",
"7495", "Московская\ обл\.",
"7421", "Хабаровский\ край",
"771631", "Шортандинский\ р\-н",
"772838", "Коксуский\ р\-н",
"771547", "Жамбылский\ р\-н",
"771640", "Сандыктауский\ р\-н",
"772351", "Бородулихинский\ р\-н",
"772540", "Арыс",
"772531", "Аксукент",
"7863", "Ростовская\ обл\.",
"771832", "Иртышский\ р\-н",
"771433", "Лисаковск",
"772932", "Бейнеуский\ р\-н",
"7475", "Тамбовская\ обл\.",
"7342", "Пермский\ край",
"772439", "Аральский\ р\-н",
"771346", "Темирский\ р\-н",
"7426", "Еврейская\ автономная\ обл\.",
"771140", "Бокейординский\ р\-н",
"771131", "Зеленовский\ р\-н",
"772147", "Каркаралинский\ р\-н",
"77242", "Кызылорда",
"771232", "Атырауская\ область",
"771134", "Сырымский\ р\-н",
"7860", "Херсонская\ область",
"7415", "Камчатский\ край",
"7867", "Республика\ Северная\ Осетия\ \-\ Алания",
"771339", "Айтекебийский\ р\-н",
"772642", "Мойынкумский\ р\-н",
"772548", "Шаян",
"771837", "Аксуский\ р\-н",
"77272956", "Талгар",
"772937", "Каракиянский\ р\-н",
"7483", "Брянская\ обл\.",
"77132", "Актобе\/Актюбинск",
"77273", "Алматы",
"772830", "Алакольский\ р\-н",
"772841", "Аксуский\ р\-н",
"771648", "Жаркаинский\ р\-н",
"771542", "Уалихановский\ р\-н",};
my $timezones = {
               '' => [
                       'Asia/Almaty',
                       'Asia/Anadyr',
                       'Asia/Aqtobe',
                       'Asia/Irkutsk',
                       'Asia/Kamchatka',
                       'Asia/Krasnoyarsk',
                       'Asia/Magadan',
                       'Asia/Novosibirsk',
                       'Asia/Omsk',
                       'Asia/Sakhalin',
                       'Asia/Vladivostok',
                       'Asia/Yakutsk',
                       'Asia/Yekaterinburg',
                       'Europe/Bucharest',
                       'Europe/Moscow',
                       'Europe/Samara'
                     ],
               '301' => [
                          'Asia/Irkutsk'
                        ],
               '302' => [
                          'Asia/Yakutsk'
                        ],
               '33' => [
                         'Asia/Yekaterinburg'
                       ],
               '34' => [
                         'Asia/Yekaterinburg'
                       ],
               '341' => [
                          'Europe/Samara'
                        ],
               '35' => [
                         'Asia/Yekaterinburg'
                       ],
               '36' => [
                         'Europe/Moscow'
                       ],
               '381' => [
                          'Asia/Omsk'
                        ],
               '382' => [
                          'Asia/Novosibirsk'
                        ],
               '383' => [
                          'Asia/Novosibirsk'
                        ],
               '384' => [
                          'Asia/Krasnoyarsk'
                        ],
               '385' => [
                          'Asia/Krasnoyarsk'
                        ],
               '388' => [
                          'Asia/Krasnoyarsk'
                        ],
               '390' => [
                          'Asia/Krasnoyarsk'
                        ],
               '391' => [
                          'Asia/Krasnoyarsk'
                        ],
               '394' => [
                          'Asia/Krasnoyarsk'
                        ],
               '395' => [
                          'Asia/Irkutsk'
                        ],
               '40' => [
                         'Europe/Bucharest'
                       ],
               '411' => [
                          'Asia/Yakutsk'
                        ],
               '413' => [
                          'Asia/Magadan'
                        ],
               '415' => [
                          'Asia/Kamchatka'
                        ],
               '416' => [
                          'Asia/Yakutsk'
                        ],
               '421' => [
                          'Asia/Vladivostok'
                        ],
               '423' => [
                          'Asia/Vladivostok'
                        ],
               '424' => [
                          'Asia/Sakhalin'
                        ],
               '426' => [
                          'Asia/Vladivostok'
                        ],
               '427' => [
                          'Asia/Anadyr'
                        ],
               '47' => [
                         'Europe/Moscow'
                       ],
               '48' => [
                         'Europe/Moscow'
                       ],
               '49' => [
                         'Europe/Moscow'
                       ],
               '7' => [
                        'Asia/Almaty',
                        'Asia/Aqtobe'
                      ],
               '71' => [
                         'Asia/Almaty'
                       ],
               '711' => [
                          'Asia/Aqtobe'
                        ],
               '712' => [
                          'Asia/Aqtobe'
                        ],
               '713' => [
                          'Asia/Aqtobe'
                        ],
               '72' => [
                         'Asia/Almaty'
                       ],
               '729' => [
                          'Asia/Aqtobe'
                        ],
               '79' => [
                         'Asia/Almaty'
                       ],
               '800' => [
                          'Asia/Almaty',
                          'Asia/Aqtobe',
                          'Europe/Moscow'
                        ],
               '803' => [
                          'Europe/Moscow'
                        ],
               '804' => [
                          'Europe/Moscow'
                        ],
               '808' => [
                          'Asia/Almaty',
                          'Asia/Aqtobe',
                          'Europe/Moscow'
                        ],
               '809' => [
                          'Asia/Almaty',
                          'Asia/Aqtobe',
                          'Europe/Moscow'
                        ],
               '81' => [
                         'Europe/Moscow'
                       ],
               '810' => [
                          'Asia/Almaty',
                          'Asia/Aqtobe',
                          'Europe/Moscow'
                        ],
               '82' => [
                         'Europe/Moscow'
                       ],
               '83' => [
                         'Europe/Moscow'
                       ],
               '840' => [
                          'Europe/Bucharest',
                          'Europe/Moscow'
                        ],
               '841' => [
                          'Europe/Moscow'
                        ],
               '842' => [
                          'Europe/Samara'
                        ],
               '843' => [
                          'Europe/Moscow'
                        ],
               '844' => [
                          'Europe/Moscow'
                        ],
               '845' => [
                          'Europe/Moscow'
                        ],
               '846' => [
                          'Europe/Samara'
                        ],
               '847' => [
                          'Europe/Moscow'
                        ],
               '848' => [
                          'Europe/Samara'
                        ],
               '851' => [
                          'Europe/Samara'
                        ],
               '855' => [
                          'Europe/Moscow'
                        ],
               '856' => [
                          'Europe/Moscow'
                        ],
               '857' => [
                          'Europe/Moscow'
                        ],
               '86' => [
                         'Europe/Moscow'
                       ],
               '87' => [
                         'Europe/Moscow'
                       ],
               '9' => [
                        'Europe/Moscow'
                      ]
             };

    sub new {
      my $class = shift;
      my $number = shift;
      $number =~ s/(^\+7|\D)//g;
      my $self = bless({ country_code => '7', number => $number, formatters => $formatters, validators => $validators, timezones => $timezones, areanames => \%areanames}, $class);
      return $self if ($self->is_valid());
      $number =~ s/^(?:8)//;
      $self = bless({ country_code => '7', number => $number, formatters => $formatters, validators => $validators, areanames => \%areanames}, $class);
      return $self->is_valid() ? $self : undef;
    }
1;