Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Pleroma.*.po
Languages: ru_en

source: Aion::Pleroma - контейнер эонов
ru_en: Aion::Pleroma - container of aeons

source: Реализует паттерн контейнера зависимостей.
ru_en: Implements the dependency container pattern.

source: Эон создаётся при запросе из контейнера через метод `get` или `resolve`, либо через аспект `eon` как ленивый `default`. Ленивость можно отменить через аспект `lazy`.
ru_en: An eon is created when requesting from a container via the `get` or `resolve` method, or via the `eon` aspect as a lazy `default`. Laziness can be canceled via the `lazy` aspect.

source: Контейнер находится в переменной `$Aion::pleroma` и его можно заменить с помощью `local`.
ru_en: The container is in the `$Aion::pleroma` variable and can be replaced with `local`.

source: Конфигурацию для создания эонов получает из конфига `PLEROMA` и файла аннотаций (создаётся пакетом `Aion::Annotation`). Файл аннотаций можно заменить через конфиг `INI`.
ru_en: The configuration for creating eons is obtained from the `PLEROMA` config and the annotation file (created by the `Aion::Annotation` package). The annotation file can be replaced via the `INI` config.

source: Файл с аннотациями.
ru_en: Annotation file.

source: Конфигурация: ключ => 'класс#метод_класса'.
ru_en: Configuration: key => 'class#class_method'.

source: Файл lib/Ex/Eon/AnimalEon.pm:
ru_en: File lib/Ex/Eon/AnimalEon.pm:

source: Файл etc/annotation/eon.ann:
ru_en: File etc/annotation/eon.ann:

source: Совокупность порождённых эонов.
ru_en: The totality of generated eons.

source: Получить эон из контейнера.
ru_en: Receive an eon from the container.

source: Получить эон из контейнера или исключение, если его там нет.
ru_en: Get an eon from the container or an exception if it is not there.
