Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Type.*.po
Languages: ru_en

source: Aion::Type - класс валидаторов
ru_en: Aion::Type - class of validators

source: Порождает валидаторы. Используется в `Aion::Types::subtype`.
ru_en: Spawns validators. Used in `Aion::Types::subtype`.

source: Конструктор.
ru_en: Constructor.

source: * name (Str) — Название типа. * args (ArrayRef) — Список аргументов типа. * init (CodeRef) — Инициализатор типа. * test (CodeRef) — Чекер. * a_test (CodeRef) — Чекер значений для типов с необязательными аргументами. * coerce (ArrayRef[Tuple[Aion::Type, CodeRef]]) — Массив пар: тип и переход.
ru_en: * name (Str) — Type name. * args (ArrayRef) — List of type arguments. * init (CodeRef) — Type initializer. * test (CodeRef) - Checker. * a_test (CodeRef) — Value checker for types with optional arguments. * coerce (ArrayRef[Tuple[Aion::Type, CodeRef]]) - Array of pairs: type and transition.

source: Строковое преобразование объекта (имя с аргументами):
ru_en: String conversion of object (name with arguments):

source: Операции так же преобразуются в строку:
ru_en: Operations are also converted to a string:

source: Операции — это объекты `Aion::Type` со специальными именами:
ru_en: Operations are `Aion::Type` objects with special names:

source: Тестирует, что `$_` принадлежит классу.
ru_en: Tests that `$_` belongs to a class.

source: Инициализатор валидатора.
ru_en: Validator initializer.

source: Проверяет, принадлежит ли аргумент классу.
ru_en: Checks whether the argument belongs to the class.

source: Проверяет, что аргумент не принадлежит классу.
ru_en: Checks that the argument does not belong to the class.

source: Привести `$value` к типу, если приведение из типа и функции находится в `$self->{coerce}`.
ru_en: Cast `$value` to type if the cast from type and function is in `$self->{coerce}`.

source: Формирует сообщение ошибки.
ru_en: Generates an error message.

source: Проверяет `$element` и выбрасывает сообщение `detail`, если элемент не принадлежит классу.
ru_en: Checks `$element` and throws a `detail` message if the element does not belong to the class.

source: Переводит `$val` в строку.
ru_en: Converts `$val` to a string.

source: Определяет, что тип является подтипом другого `$type`.
ru_en: Specifies that a type is a subtype of another `$type`.

source: Создаёт подпрограмму без аргументов, которая возвращает тип.
ru_en: Creates a subroutine with no arguments that returns a type.

source: Свойство `init` не может использоваться с `make`.
ru_en: The `init` property cannot be used with `make`.

source: Создает подпрограмму с аргументами, которая возвращает тип.
ru_en: Creates a subroutine with arguments that returns a type.

source: Если подпрограмма не может быть создана, то выбрасывается исключение.
ru_en: If the routine cannot be created, an exception is thrown.

source: Типы равны, если они имеют одинаковое имя, одинаковое количество аргументов, родительский элемент и аргументы равны.
ru_en: Types are equal if they have the same name, the same number of arguments, the parent element, and the arguments are equal.

source: Обратная операция к `equal`.
ru_en: The reverse operation of `equal`.

source: Список аргументов.
ru_en: List of arguments.

source: Имя типа.
ru_en: Type name.

source: Родительский тип.
ru_en: Parent type.

source: Акцессор сообщения. Использует `&message` для генерации сообщения об ошибке.
ru_en: Message accessor. Uses `&message` to generate an error message.

source: Акцессор заголовка (используется для создания схемы **swagger**).
ru_en: Header accessor (used to create the **swagger** schema).

source: Акцессор описания (используется для создания схемы **swagger**).
ru_en: Description accessor (used to create a **swagger** schema).

source: Делает объект вызываемым.
ru_en: Makes the object callable.

source: Стрингифицирует объект.
ru_en: Strings an object.

source: Создает новый тип как объединение `$a` и `$b`.
ru_en: Creates a new type as the union of `$a` and `$b`.

source: Создает новый тип как пересечение `$a` и `$b`.
ru_en: Creates a new type as the intersection of `$a` and `$b`.

source: Создает новый тип как исключение из `$a`.
ru_en: Creates a new type as an exception to `$a`.

source: `$a` равно `$b`.
ru_en: `$a` is equal to `$b`.

source: `$a` не равно `$b`.
ru_en: `$a` is not equal to `$b`.
