Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion/i18n/Aion/Types.*.po
Languages: ru_en

source: Aion::Types - библиотека стандартных валидаторов и служит для создания новых валидаторов
ru_en: Aion::Types - a library of standard validators and it is used to create new validators

source: Этот модуль экспортирует подпрограммы:
ru_en: This module exports routines:

source: * `subtype`, `as`, `init_where`, `where`, `awhere`, `message` — для создания валидаторов. * `SELF`, `ARGS`, `A`, `B`, `C`, `D`, `M`, `N` — для использования в валидаторах типа и его аргументов. * `coerce`, `from`, `via` — для создания конвертора значений из одного класса в другой.
ru_en: * `subtype`, `as`, `init_where`, `where`, `awhere`, `message` - for creating validators. * `SELF`, `ARGS`, `A`, `B`, `C`, `D`, `M`, `N` - for use in validators of a type and its arguments. * `coerce`, `from`, `via` - to create a value converter from one class to another.

source: Иерархия валидаторов:
ru_en: Validator hierarchy:

source: Создаёт новый тип.
ru_en: Creates a new type.

source: `where` и `message` — это синтаксический сахар, а `subtype` можно использовать без них.
ru_en: `where` and `message` are syntactic sugar, and `subtype` can be used without them.

source: Используется с `subtype` для расширения создаваемого типа `$super_type`.
ru_en: Used with `subtype` to extend the created `$super_type` type.

source: Инициализирует тип с новыми аргументами. Используется с `subtype`.
ru_en: Initializes a type with new arguments. Used with `subtype`.

source: Использует `$code` как тест. Значение для теста передаётся в `$_`.
ru_en: Uses `$code` as a test. The value for the test is passed to `$_`.

source: Используется с `subtype`. Необходимо, если у типа есть аргументы.
ru_en: Used with `subtype`. Required if the type has arguments.

source: Используется с `subtype`.
ru_en: Used with `subtype`.

source: Если тип может быть с аргументами и без, то используется для проверки набора с аргументами, а `where` — без.
ru_en: If the type can be with or without arguments, then it is used to check the set with arguments, and `where` - without.

source: Необходимо, если аргументы необязательны.
ru_en: Required if arguments are optional.

source: Текущий тип. `SELF` используется в `init_where`, `where` и `awhere`.
ru_en: Current type. `SELF` is used in `init_where`, `where` and `awhere`.

source: Аргументы текущего типа. В скалярном контексте возвращает ссылку на массив, а в контексте массива возвращает список. Используется в `init_where`, `where` и `awhere`.
ru_en: Arguments of the current type. In a scalar context, it returns a reference to an array, and in an array context, it returns a list. Used in `init_where`, `where` and `awhere`.

source: Первый, второй, третий и пятый аргумент типа.
ru_en: The first, second, third and fifth type arguments.

source: Используется в `init_where`, `where` и `awhere`.
ru_en: Used in `init_where`, `where` and `awhere`.

source: `M` и `N` сокращение для `SELF->{M}` и `SELF->{N}`.
ru_en: `M` and `N` are shorthand for `SELF->{M}` and `SELF->{N}`.

source: Используется с `subtype` для вывода сообщения об ошибке, если значение исключает тип. В `$code` используется: `SELF` - текущий тип, `ARGS`, `A`, `B`, `C`, `D` - аргументы типа (если есть) и проверочное значение в `$_`. Его можно преобразовать в строку с помощью `SELF->val_to_str($_)`.
ru_en: Used with `subtype` to print an error message if the value excludes the type. `$code` uses: `SELF` - the current type, `ARGS`, `A`, `B`, `C`, `D` - type arguments (if any) and a test value in `$_`. It can be converted to a string using `SELF->val_to_str($_)`.

source: Добавляет новое приведение (`$via`) к `$type` из `$from` типа.
ru_en: Adds a new cast (`$via`) to `$type` from `$from` type.

source: `coerce` выбрасывает исключения:
ru_en: `coerce` throws exceptions:

source: Стандартные приведения:
ru_en: Standard casts:

source: Синтаксический сахар для `coerce`.
ru_en: Syntactic sugar for `coerce`.

source: Проверяет сигнатуру подпрограммы: аргументы и результаты.
ru_en: Checks the signature of a subroutine: arguments and results.

source: Тип верхнего уровня в иерархии. Сопоставляет всё.
ru_en: The top level type in the hierarchy. Compares everything.

source: Тип верхнего уровня в конструкторах иерархии создает новые типы из любых типов.
ru_en: The top-level type in hierarchy constructors creates new types from any types.

source: Союз нескольких типов. Аналогичен оператору `$type1 | $type2`.
ru_en: Union of several types. Similar to the `$type1 | $type2`.

source: Пересечение нескольких типов. Аналогичен оператору `$type1 & $type2`.
ru_en: The intersection of several types. Similar to the `$type1 & $type2` operator.

source: Исключение нескольких типов. Аналогичен оператору `~ $type`.
ru_en: Exclusion of several types. Similar to the `~$type` operator.

source: Если `Exclude` имеет много аргументов, то это аналог `~ ($type1 | $type2 ...)`.
ru_en: If `Exclude` has many arguments, then it is analogous to `~ ($type1 | $type2 ...)`.

source: Дополнительные ключи в `Dict`.
ru_en: Additional keys in `Dict`.

source: Если подпрограмма возвращает разные значения в контексте массива и скаляра, то используется тип `Wantarray` с типом `A` для контекста массива и типом `S` для скалярного контекста.
ru_en: If the routine returns different values in array and scalar contexts, then the `Wantarray` type is used with type `A` for the array context and type `S` for the scalar context.

source: Тип верхнего уровня в иерархии скалярных типов.
ru_en: The top-level type in the hierarchy of scalar types.

source: Перечисление.
ru_en: Enumeration.

source: `undef` или тип в `[]`.
ru_en: `undef` or type in `[]`.

source: Только `undef`.
ru_en: Only `undef`.

source: Всё за исключением `undef`.
ru_en: Everything except `undef`.

source: Определённые значения без ссылок.
ru_en: Defined values without references.

source: Определяет значение длины от `A` до `B` или от 0 до `A`, если `B` отсутствует.
ru_en: Specifies a length value from `A` to `B`, or from 0 to `A` if `B` is missing.

source: Perl версии.
ru_en: Perl version.

source: Строки, включая числа.
ru_en: Strings, including numbers.

source: Строки Unicode с флагом utf8 или если декодирование в utf8 происходит без ошибок.
ru_en: Unicode strings with the utf8 flag or if decoding to utf8 occurs without errors.

source: Бинарные строки без флага utf8 и октетов с номерами меньше 128.
ru_en: Binary strings without the utf8 flag and octets with numbers less than 128.

source: Строка начинается с `S`.
ru_en: The line starts with `S`.

source: Строка заканчивается на `S`.
ru_en: The line ends with `S`.

source: Строка с одним или несколькими символами, не являющимися пробелами.
ru_en: A string containing one or more non-blank characters.

source: Строки с `@`.
ru_en: Lines with `@`.

source: Формат телефонов — знак плюс и семь или больше цифр.
ru_en: The telephone format is a plus sign and seven or more digits.

source: URL-адреса веб-сайтов — это строка с префиксом http:// или https://.
ru_en: Website URLs are a string prefixed with http:// or https://.

source: Пути начинаются с косой черты.
ru_en: Paths start with a slash.

source: HTML начинается с `<!doctype html` или `<html`.
ru_en: HTML starts with `<!doctype html` or `<html`.

source: Дата в формате `yyyy-mm-dd`.
ru_en: Date in `yyyy-mm-dd` format.

source: Дата и время в формате `yyyy-mm-dd HH:MM:SS`.
ru_en: Date and time in the format `yyyy-mm-dd HH:MM:SS`.

source: Сопоставляет строку с регулярным выражением.
ru_en: Matches a string against a regular expression.

source: Имя класса — это пакет с методом `new`.
ru_en: The class name is a package with a `new` method.

source: Имя роли — это пакет без метода `new`, с `@ISA` или с одним любым методом.
ru_en: The role name is a package without the `new` method, with `@ISA`, or with any one method.

source: Рациональные числа.
ru_en: Rational numbers.

source: Числа.
ru_en: Numbers.

source: Положительные числа.
ru_en: Positive numbers.

source: Машинное число с плавающей запятой составляет 4 байта.
ru_en: A machine floating point number is 4 bytes.

source: Машинное число с плавающей запятой составляет 8 байт.
ru_en: A machine floating point number is 8 bytes.

source: Числа между `from` и `to`.
ru_en: Numbers between `from` and `to`.

source: Целые числа.
ru_en: Whole numbers.

source: Рассчитывает максимальное и минимальное числа, которые поместятся в `N` байт и проверяет ограничение между ними.
ru_en: Calculates the maximum and minimum numbers that will fit in `N` bytes and checks the constraint between them.

source: Положительные целые числа.
ru_en: Positive integers.

source: Рассчитывает максимальное число, которое поместится в `N` байт (полагая, что в байтах нет отрицательного бита) и проверяет ограничение от 0 до этого числа.
ru_en: Calculates the maximum number that will fit in `N` bytes (assuming there is no negative bit in the bytes) and checks the limit from 0 to that number.

source: Целые числа 1+.
ru_en: Integers 1+.

source: Ссылка.
ru_en: Link.

source: Ссылка на связанную переменную.
ru_en: Link to the associated variable.

source: Функция позволяет присваивание.
ru_en: The function allows assignment.

source: Но с `:lvalue` не работает.
ru_en: But it doesn't work with `:lvalue`.

source: Формат.
ru_en: Format.

source: Подпрограмма.
ru_en: Subroutine.

source: Подпрограмма с телом.
ru_en: Subroutine with body.

source: Подпрограмма без тела.
ru_en: Subroutine without body.

source: Ссылка на подпрограмму с соответствующей сигнатурой.
ru_en: A link to a subroutine with the corresponding signature.

source: Подпрограммы без тела не оборачиваются в обработчик сигнатуры, а сигнатура запоминается для валидации соответствия впоследствии объявленной подпрограммы с телом. Поэтому функция не имеет сигнатуры.
ru_en: Subroutines without a body are not wrapped in a signature handler, and the signature is remembered to validate the conformity of a subsequently declared subroutine with a body. Therefore the function has no signature.

source: Регулярное выражение.
ru_en: Regular expression.

source: Ссылка на скаляр или ссылка на ссылку.
ru_en: A reference to a scalar or a reference to a reference.

source: Ссылка на скаляр.
ru_en: Reference to a scalar.

source: Ссылка на ссылку.
ru_en: Link to link.

source: Ссылка на глоб.
ru_en: Link to global

source: Файловый описатель.
ru_en: File descriptor.

source: Ссылки на массивы.
ru_en: Array references.

source: Ограничивает массивы от `A` до `B` элементов или от 0 до `A`, если `B` отсутствует.
ru_en: Limits arrays from `A` to `B` elements, or from 0 to `A` if `B` is missing.

source: Ссылки на хеши.
ru_en: Links to hashes.

source: Благословлённые ссылки.
ru_en: Blessed links.

source: Благословенные ссылки на объекты текущего пакета.
ru_en: Blessed references to objects of the current package.

source: Как `HashRef`, но с типом для ключей.
ru_en: Like `HashRef`, but with a key type.

source: Тьюпл.
ru_en: Tuple.

source: Тьюпл повторённый один или несколько раз.
ru_en: Tuple repeated one or more times.

source: Словарь.
ru_en: Dictionary.

source: Хэш имеет перечисленные свойства. Кроме них он может иметь и другие.
ru_en: A hash has the following properties. In addition to them, he may have others.

source: Объект или строка.
ru_en: Object or string.

source: Объект или класс имеет перечисленные методы. Кроме них может иметь и другие.
ru_en: An object or class has listed methods. In addition to them, there may be others.

source: Объект или класс с перегруженными операторами.
ru_en: An object or class with overloaded operators.

source: И у него есть операторы указанные операторы.
ru_en: And it has operators specified operators.

source: Класс или объект наследует классы из списка.
ru_en: A class or object inherits classes from a list.

source: Класс или объект имеет указанные роли.
ru_en: A class or object has the specified roles.

source: Проверяет 1, 0, "", undef или объект с перегруженным оператором `bool` или `0+` как `JSON::PP::Boolean`. Во втором случае вызывает оператор `0+` и проверяет результат как `Bool`.
ru_en: Tests for 1, 0, "", undef, or an object with an overloaded `bool` or `0+` operator as `JSON::PP::Boolean`. In the second case, it calls the `0+` operator and checks the result as `Bool`.

source: `BoolLike` вызывает оператор `0+` и проверяет результат.
ru_en: `BoolLike` calls the `0+` operator and checks the result.

source: Строка или объект с перегруженным оператором `""`.
ru_en: A string or object overloaded with the `""` operator.

source: Регулярное выражение или объект с перегруженным оператором `qr`.
ru_en: A regular expression or object with an overload of the `qr` operator.

source: Подпрограмма или объект с перегруженным оператором `&{}`.
ru_en: A subroutine or object with an overload of the `&{}` operator.

source: Массивы или объекты с перегруженным оператором или `@{}`.
ru_en: Arrays or objects with an overloaded operator or `@{}`.

source: Хэши или объекты с перегруженным оператором `%{}`.
ru_en: Hashes or objects with the `%{}` operator overloaded.

source: Сктроковый тип с преобразованием массивов в строку через разделитель.
ru_en: String type with conversion of arrays to a string through a delimiter.
