Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/A/Aion-Format/i18n/Aion/Format/Url.*.po
Languages: ru_en

source: Aion::Format::Url - утилиты для кодирования и декодирования URL-адресов
ru_en: Aion::Format::Url - utilities for encoding and decoding URLs

source: Утилиты для кодирования и декодирования URL-адресов.
ru_en: Utilities for encoding and decoding URLs.

source: Экранирует `$scalar` для части поиска URL.
ru_en: Escapes `$scalar` for the search part of the URL.

source: Генерирует поисковую часть URL-адреса.
ru_en: Generates the search portion of the URL.

source: 1. Ключи со значениями `undef` отбрасываются. 1. Значение `1` используется для ключа без значения. 1. Ключи преобразуются в алфавитном порядке.
ru_en: 1. Keys with `undef` values are discarded. 1. The value `1` is used for a key without a value. 1. Keys are converted in alphabetical order.

source: Парсит поисковую часть URL-адреса.
ru_en: Parses the search part of the URL.

source: Используется для парсинга ключей и значений в параметре URL.
ru_en: Used to parse keys and values in a URL parameter.

source: Обратный к `to_url_param`.
ru_en: Reverse to `to_url_param`.

source: Парсит и нормализует URL.
ru_en: Parses and normalizes URLs.

source: * `$url` — URL-адрес или его часть для парсинга. * `$onpage` — URL-адрес страницы с `$url`. Если `$url` не завершен, то он дополняется отсюда. Необязательный. По умолчанию использует конфигурацию `$onpage = 'off://off'`. * `$dir` (bool): 1 — нормализовать URL-путь с "/" на конце, если это каталог. 0 — без «/».
ru_en: * `$url` - URL or part of it to be parsed. * `$onpage` is the URL of the page with `$url`. If `$url` is not complete, then it is completed from here. Optional. By default it uses the `$onpage = 'off://off'` configuration. * `$dir` (bool): 1 - normalize the URL path with a "/" at the end if it is a directory. 0 - without "/".

source: Нормализует URL.
ru_en: Normalizes the URL.

source: Использует `parse_url` и возвращает ссылку.
ru_en: Uses `parse_url` and returns a link.
