package Firewall::Policy::Element::Destination;

#------------------------------------------------------------------------------
# 加载扩展模块
#------------------------------------------------------------------------------
use Moose;
use namespace::autoclean;

#------------------------------------------------------------------------------
# 继承 Firewall::Policy::Element::Role 角色
#------------------------------------------------------------------------------
with 'Firewall::Policy::Element::Role';

__PACKAGE__->meta->make_immutable;
1;
