{"L<https://github.com/greymd/teip>\n":"L<https://github.com/greymd/teip>\n","L<App::Greple::xlate>\n":"L<App::Greple::xlate>\n","Because B<deepl> works better for single line input, you can change command part as this:\n":"Поскольку B<deepl> лучше работает для однострочного ввода, вы можете изменить часть команды следующим образом:\n","Also, B<teip> cannot handle multiple lines of data as a single unit, while B<greple> can execute individual commands on a data chunk consisting of multiple lines.\n":"Кроме того, B<teip> не может обрабатывать несколько строк данных как единое целое, в то время как B<greple> может выполнять отдельные команды на куске данных, состоящем из нескольких строк.\n","Invoke new command individually for every matched part.\n":"Вызвать новую команду индивидуально для каждой сопоставленной детали.\n","App::Greple::tee - module to replace matched text by the external command result\n":"App::Greple::tee - модуль для замены совпадающего текста на результат внешней команды\n","By default, the command is executed as a single process, and all matched data is sent to it mixed together. If the matched text does not end with newline, it is added before and removed after. Data are mapped line by line, so the number of lines of input and output data must be identical.\n":"По умолчанию команда выполняется как один процесс, и все совпавшие данные передаются ему вперемешку. Если совпадающий текст не заканчивается новой строкой, она добавляется до и удаляется после. Данные сопоставляются построчно, поэтому количество строк входных и выходных данных должно быть одинаковым.\n","Filter command follows module declaration (C<-Mtee>) and terminates by two dashes (C<-->). For example, next command call command C<tr> command with C<a-z A-Z> arguments for the matched word in the data.\n":"Команда фильтрации следует за объявлением модуля (C<-Mtee>) и заканчивается двумя тире (C<-->). Например, следующая команда вызывает команду C<tr> с аргументами C<a-z A-Z> для найденного слова в данных.\n","L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n":"L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n","Lines of input and output data do not have to be identical when used with B<--discrete> option.\n":"Строки входных и выходных данных не должны быть одинаковыми при использовании опции B<--discrete>.\n","The dedicated module L<App::Greple::xlate::deepl> is more effective for this purpose, though. In fact, the implementation hint of B<tee> module came from B<xlate> module.\n":"Однако для этой цели более эффективен специализированный модуль L<App::Greple::xlate::deepl>. Фактически, подсказка для реализации модуля B<tee> пришла из модуля B<xlate>.\n","Using B<--discrete> option, individual command is called for each matched part. You can tell the difference by following commands.\n":"При использовании опции B<--discrete> для каждой сопоставленной детали вызывается отдельная команда. Разницу можно определить по следующим командам.\n","Next command will find some indented part in LICENSE document.\n":"Следующая команда обнаружит в документе LICENSE часть с отступами.\n","Next command will find text blocks inside L<perlpod(1)> style document included in Perl module file.\n":"Следующая команда найдет текстовые блоки внутри документа стиля L<perlpod(1)>, включенного в файл модуля Perl.\n","L<https://github.com/tecolicom/Greple>\n":"L<https://github.com/tecolicom/Greple>\n","Because B<greple> is designed to process document files, it has many features that are appropriate for it, such as match area controls. It might be worth using B<greple> to take advantage of those features.\n":"Поскольку B<greple> предназначен для обработки файлов документов, он имеет много функций, которые подходят для этого, например, управление областью соответствия. Возможно, стоит использовать B<greple>, чтобы воспользоваться этими возможностями.\n","Above command convert all matched words from lower-case to upper-case. Actually this example itself is not so useful because B<greple> can do the same thing more effectively with B<--cm> option.\n":"Приведенная выше команда преобразует все совпадающие слова из нижнего регистра в верхний. На самом деле этот пример не так полезен, потому что B<greple> может сделать то же самое более эффективно с помощью опции B<--cm>.\n","First of all, whenever you can do it with the B<teip> command, use it. It is an excellent tool and much faster than B<greple>.\n":"Прежде всего, всегда, когда вы можете сделать это с помощью команды B<teip>, используйте ее. Это отличный инструмент и намного быстрее, чем B<greple>.\n","You can reformat this part by using B<tee> module with B<ansifold> command:\n":"Вы можете переформатировать эту часть, используя модуль B<tee> с командой B<ansifold>:\n","You can translate them by DeepL service by executing the above command convined with B<-Mtee> module which calls B<deepl> command like this:\n":"Вы можете перевести их с помощью сервиса DeepL, выполнив приведенную выше команду, соединенную с модулем B<-Mtee>, который вызывает команду B<deepl> следующим образом:\n","Greple's B<-Mtee> module sends matched text part to the given filter command, and replace them by the command result. The idea is derived from the command called B<teip>. It is like bypassing partial data to the external filter command.\n":"Модуль Greple's B<-Mtee> посылает совпавшие части текста заданной команде фильтра и заменяет их результатом команды. Идея взята из команды B<teip>. Это подобно обходу частичных данных внешней командой фильтрации.\n"}