{"Because B<deepl> works better for single line input, you can change command part as this:\n":"Оскільки B<deepl> краще працює з однорядковим введенням, ви можете змінити частину команди таким чином:\n","You can reformat this part by using B<tee> module with B<ansifold> command:\n":"Ви можете переформатувати цю частину за допомогою модуля B<tee> з командою B<ansifold>:\n","L<App::Greple::xlate>\n":"L<App::Greple::xlate>.\n","Next command will find text blocks inside L<perlpod(1)> style document included in Perl module file.\n":"Наступна команда знайде текстові блоки у документі стилю L<perlpod(1)>, включеному до файлу модуля Perl.\n","You can translate them by DeepL service by executing the above command convined with B<-Mtee> module which calls B<deepl> command like this:\n":"Ви можете перекласти їх за допомогою сервісу DeepL, виконавши наведену вище команду, узгоджену з модулем B<-Mtee>, який викликає команду B<deepl> таким чином:\n","L<https://github.com/tecolicom/Greple>\n":"L<https://github.com/tecolicom/Greple>\n","Using B<--discrete> option, individual command is called for each matched part. You can tell the difference by following commands.\n":"Використовуючи опцію B<--discrete>, викликається окрема команда для кожної деталі, що збігається. Ви можете побачити різницю за допомогою наступних команд.\n","Invoke new command individually for every matched part.\n":"Викликати нову команду окремо для кожної знайденої частини.\n","By default, the command is executed as a single process, and all matched data is sent to it mixed together. If the matched text does not end with newline, it is added before and removed after. Data are mapped line by line, so the number of lines of input and output data must be identical.\n":"За замовчуванням команда виконується як окремий процес, і всі знайдені дані надсилаються до нього упереміш. Якщо знайдений текст не закінчується новим рядком, його буде додано до початку і видалено після закінчення. Дані зіставляються рядок за рядком, тому кількість рядків вхідних і вихідних даних має бути однаковою.\n","Lines of input and output data do not have to be identical when used with B<--discrete> option.\n":"При використанні опції B<--discrete> рядки вхідних і вихідних даних не обов'язково повинні бути однаковими.\n","Next command will find some indented part in LICENSE document.\n":"Наступна команда знайде у документі LICENSE частину з відступами.\n","The dedicated module L<App::Greple::xlate::deepl> is more effective for this purpose, though. In fact, the implementation hint of B<tee> module came from B<xlate> module.\n":"Однак для цієї мети ефективніше використовувати спеціальний модуль L<App::Greple::xlate::deepl>. Насправді, підказка щодо реалізації модуля B<tee> прийшла з модуля B<xlate>.\n","App::Greple::tee - module to replace matched text by the external command result\n":"App::Greple::tee - модуль для заміни знайденого тексту на результат зовнішньої команди\n","Greple's B<-Mtee> module sends matched text part to the given filter command, and replace them by the command result. The idea is derived from the command called B<teip>. It is like bypassing partial data to the external filter command.\n":"Модуль B<-Mtee> у Greple надсилає частину тексту, що відповідає заданій команді фільтрації, і замінює її на результат команди. Ідея походить від команди з назвою B<teip>. Це схоже на пересилання частини даних до зовнішньої команди фільтрації.\n","Because B<greple> is designed to process document files, it has many features that are appropriate for it, such as match area controls. It might be worth using B<greple> to take advantage of those features.\n":"Оскільки B<greple> призначено для обробки файлів документів, вона має багато можливостей, які підходять для неї, наприклад, елементи керування областями збігів. Можливо, варто скористатися перевагами B<greple>, щоб скористатися цими можливостями.\n","Also, B<teip> cannot handle multiple lines of data as a single unit, while B<greple> can execute individual commands on a data chunk consisting of multiple lines.\n":"Крім того, B<teip> не може обробляти декілька рядків даних як єдине ціле, тоді як B<greple> може виконувати окремі команди над фрагментом даних, що складається з декількох рядків.\n","L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n":"L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n","First of all, whenever you can do it with the B<teip> command, use it. It is an excellent tool and much faster than B<greple>.\n":"Перш за все, якщо ви можете зробити це за допомогою команди B<teip>, використовуйте її. Вона є чудовим інструментом і працює набагато швидше, ніж B<greple>.\n","Filter command follows module declaration (C<-Mtee>) and terminates by two dashes (C<-->). For example, next command call command C<tr> command with C<a-z A-Z> arguments for the matched word in the data.\n":"Команда фільтрації слідує за оголошенням модуля (C<-Mtee>) і завершується двома тире (C<-->). Наприклад, наступна команда викликає команду C<tr> з аргументами C<a-z A-Z> для знайденого слова у даних.\n","L<https://github.com/greymd/teip>\n":"L<https://github.com/greymd/teip>\n","Above command convert all matched words from lower-case to upper-case. Actually this example itself is not so useful because B<greple> can do the same thing more effectively with B<--cm> option.\n":"Наведена вище команда перетворює всі знайдені слова з малих літер у великі. Насправді цей приклад не дуже корисний, оскільки B<greple> може зробити те саме ефективніше за допомогою опції B<--cm>.\n"}