{"Filter command follows module declaration (C<-Mtee>) and terminates by two dashes (C<-->). For example, next command call command C<tr> command with C<a-z A-Z> arguments for the matched word in the data.\n":"Het filtercommando volgt op de moduleverklaring (C<-Mtee>) en eindigt met twee streepjes (C<-->). Bijvoorbeeld, het volgende commando roept commando C<tr> op met C<a-z A-Z> argumenten voor het gezochte woord in de gegevens.\n","L<https://github.com/greymd/teip>\n":"L<https://github.com/greymd/teip>\n","Also, B<teip> cannot handle multiple lines of data as a single unit, while B<greple> can execute individual commands on a data chunk consisting of multiple lines.\n":"Ook kan B<teip> niet omgaan met meerdere regels gegevens als een enkele eenheid, terwijl B<greple> individuele opdrachten kan uitvoeren op een gegevensbrok die uit meerdere regels bestaat.\n","L<https://github.com/tecolicom/Greple>\n":"L<https://github.com/tecolicom/Greple>\n","Because B<greple> is designed to process document files, it has many features that are appropriate for it, such as match area controls. It might be worth using B<greple> to take advantage of those features.\n":"Omdat B<greple> is ontworpen om documentbestanden te verwerken, heeft het veel functies die daarvoor geschikt zijn, zoals controles van het matchgebied. Het kan de moeite waard zijn om B<greple> te gebruiken om van die functies te profiteren.\n","Above command convert all matched words from lower-case to upper-case. Actually this example itself is not so useful because B<greple> can do the same thing more effectively with B<--cm> option.\n":"Bovenstaand commando zet alle overeenkomende woorden om van kleine letters naar hoofdletters. Eigenlijk is dit voorbeeld zelf niet zo nuttig omdat B<greple> hetzelfde effectiever kan doen met de optie B<--cm>.\n","Next command will find text blocks inside L<perlpod(1)> style document included in Perl module file.\n":"Het volgende commando vindt tekstblokken in L<perlpod(1)> stijldocument opgenomen in het Perl-modulebestand.\n","You can translate them by DeepL service by executing the above command convined with B<-Mtee> module which calls B<deepl> command like this:\n":"U kunt ze vertalen door DeepL service door het bovenstaande commando uit te voeren in combinatie met B<-Mtee> module die het commando B<deepl> als volgt oproept:\n","App::Greple::tee - module to replace matched text by the external command result\n":"App::Greple::tee - module om gematchte tekst te vervangen door het externe opdrachtresultaat\n","L<App::Greple::xlate>\n":"L<App::Greple::xlate>\n","L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n":"L<App::Greple>, L<https://github.com/kaz-utashiro/greple>\n","The dedicated module L<App::Greple::xlate::deepl> is more effective for this purpose, though. In fact, the implementation hint of B<tee> module came from B<xlate> module.\n":"De speciale module L<App::Greple::xlate::deepl> is echter effectiever voor dit doel. In feite kwam de implementatiehint van de module B<tee> van de module B<xlate>.\n","Because B<deepl> works better for single line input, you can change command part as this:\n":"Omdat B<deepl> beter werkt voor invoer op één regel, kunt u het commandogedeelte als volgt wijzigen:\n","By default, the command is executed as a single process, and all matched data is sent to it mixed together. If the matched text does not end with newline, it is added before and removed after. Data are mapped line by line, so the number of lines of input and output data must be identical.\n":"Standaard wordt het commando uitgevoerd als een enkel proces, en alle gematchte gegevens worden erdoor gemengd. Als de gematchte tekst niet eindigt met een newline, wordt hij ervoor toegevoegd en erna verwijderd. De gegevens worden regel voor regel in kaart gebracht, dus het aantal regels invoer- en uitvoergegevens moet identiek zijn.\n","Next command will find some indented part in LICENSE document.\n":"Het volgende commando vindt een ingesprongen deel in het LICENSE document.\n","First of all, whenever you can do it with the B<teip> command, use it. It is an excellent tool and much faster than B<greple>.\n":"Allereerst, wanneer u het kunt doen met het commando B<-teip>, gebruik het. Het is een uitstekend hulpmiddel en veel sneller dan B<greple>.\n","Invoke new command individually for every matched part.\n":"Roep nieuw commando individueel op voor elk onderdeel.\n","You can reformat this part by using B<tee> module with B<ansifold> command:\n":"U kunt dit deel opnieuw formatteren door de module B<tee> te gebruiken met het commando B<ansifold>:\n","Lines of input and output data do not have to be identical when used with B<--discrete> option.\n":"Bij gebruik van de optie B<--discreet> hoeven de regels invoer- en uitvoergegevens niet identiek te zijn.\n","Greple's B<-Mtee> module sends matched text part to the given filter command, and replace them by the command result. The idea is derived from the command called B<teip>. It is like bypassing partial data to the external filter command.\n":"Greple's B<-Mtee> module stuurt gematchte tekstdelen naar het gegeven filtercommando, en vervangt ze door het resultaat van het commando. Het idee is afgeleid van het commando B<teip>. Het is als het omzeilen van gedeeltelijke gegevens naar het externe filtercommando.\n","Using B<--discrete> option, individual command is called for each matched part. You can tell the difference by following commands.\n":"Met de optie B<--discreet> wordt voor elk gematcht onderdeel een afzonderlijk commando opgeroepen. U kunt het verschil zien aan de hand van de volgende commando's.\n"}