<html>
<head>
<style type="text/css">
.searchword, .searchword0, .searchword1, .searchword2, .searchword3, 
.searchword4, .searchword5, .searchword6, .searchword7, .searchword8,
.searchword9 {
   background-color: #FFFF66;
}
</style>
<script src="/common/searchhi.js" type="text/javascript"> </script>

<title>N&auml;chtliches Jucken</title>
</head>
<body>
<h2>N&auml;chtliches Jucken</h2>
<i>Nicht alles was wie eine Allergie oder wie Neurodermitis aussieht, 
ist es auch</i>

<h3>Die Geschichte</h3>

<p>Unsere Tochter ist jetzt (Juli 2005) 4 Jahre alt. 
Sie hat in ihrem 2ten Lebensjahr 
angefangen, sich nachts zu kratzen. Die Diagnose war "Schwache 
allergische Reaktion auf Hausstaub". Das Kratzen wurde langsam schlimmer, 
wir fingen an die Betten in Encasings zu packen, sie w&ouml;chentlich 
frisch zu beziehen und generell viel zu putzen. Das half etwas, aber 
trotz abendlicher Gabe von Fenistil mussten wir schliesslich 
fast jede Nacht 
das sich wild kratzende Kind mit einer k&uuml;hlenden Creme einreiben, 
um den Juckreiz zu lindern.
</p>
<p>Als sich im letzten Winter auch unser Sohn zu kratzen anfing
schied die Ursache Hausstauballergie aus. Ein Acarex-Test mit unserem 
Hausstaub war zudem negativ, es wurde kein auf Milbenkot hindeutendes Guanin 
gefunden. Ich fing also an, Wohngifte zu recherchieren, fand aber nichts,
was von den Symptomen her passte. Vor allem h&ouml;rte das Jucken ausser
Haus (z.Bsp. im Urlaub) erst einmal nicht auf.
</p>
<p>Die Antwort war schliesslich ersch&uuml;tternd
einfach. Welcher Baustoff juckt? Glaswolle juckt. Unser Haus besteht
im wesentlichen aus in ein Stahlger&uuml;st eingeh&auml;ngten Rigipsplatten, 
zwischen denen sich Glaswollematten befinden.
Eine Kreuzung zwischen Zelt und Pullover also. 
Im ersten Stock, wo wir schlafen, hatten die Vorbesitzer eine abgeh&auml;ngte
Holzdecke mit Halogenstrahlern in jeweils ca. 1 Meter Abstand eingebaut.
Um den Abstand zwischen Holz und Decke gering zu halten, waren die Strahler
in L&ouml;cher in den Rigipsplatten eingesenkt. Hinter diesen Rigipsplatten ist
Glaswolle. Waaaaaah!
</p>
<p>Wir haben daraufhin unseren Schlafplatz sofort ins G&auml;stezimmer
im Keller verlegt, die Kinder und uns jeden Abend geduscht und
t&auml;glich die W&auml;sche gewechslt. Auf die Decke habe wir statt der 
Holzverschalung eine Sperrfolie und eine weitere Schicht Rigipsplatten 
gemacht. 
</p>

<p>Zwei Monate nach dem Abdichten der Decke kratzte sich 
unsere Tochter kaum noch, es sei denn sie hatte wieder Kontakt mit 
Glaswollestaub. Nach einem solchen Kontakt (Wohnung von Freundin, 
nie ges&auml;uberter Kindersitz) dauert es eine Woche, bis die Symptome 
abklingen. Inzwischen hat das Kratzen ganz aufgehört.
</p>

<h3>Fazit</h3>

<p>Wir haben Gl&uuml;ck gehabt, wir haben die Ursache gefunden. Dieses Dokument
existiert, um anderen bei der Ursachenforschung zu helfen. 
</p>

<h3>Kontamination mit Glasfaserstaub erkennen</h3>

<ul>
<li>Der juckende Staub besteht aus gr&ouml;sseren Fasern und liegt 
daher insbesondere auf waagerechten Fl&auml;chen. </li>
<li>Husten ist evtl. ein Indiz f&uuml;r Kontamination mit 
lungeng&auml;ngigen Fasern.</li>
<li>Im Gegensatz zu anderen Wohngiften <b>bleibt der Juckreiz 
auch nach dem Verlassen der Wohnung lange Zeit bestehen</b>. 
Dies liegt zum einen
daran, das die in die Haut eingedrungenen Fasern erst herauswachsen
m&uuml;ssen. Zum anderen nimmt man &uuml;blicherweise Kleidung 
und mit dieser
Staub aus der Wohnung mit.</li>
</ul>

<h3>... und bek&auml;mpfen</h3>

<p>Wirkliche Abhilfe schafft nur das Verschliessen der Quelle. 
Bis dahin kann man aber auch schon einiges tun.
</p>
<ul>
<li>Abends duschen und in einem unbelasteten Bett schlafen.</li>
<li>T&auml;glich die W&auml;sche wechseln und auch die Betten 
h&auml;ufig frisch 
beziehen, um eingeschleppten Staub auszuwaschen.</li>
<li>H&auml;ufiges Wischen der Fußb&ouml;den und waagerechten Fl&auml;chen, 
im Schlafraum m&ouml;glichst t&auml;glich.</li>
</ul>


<p>Kontakt:<a href="mailto:jz-2006@heute-morgen.de">Joachim Zobel</a></p>
<p>Letzte &Auml;nderung: 2005-11-03</p>

</body>
</html>

