Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-Plack/share/locale/Padre__Plugin__Plack-*.po
Languages: it_it, tr

source: New PSGI App
it_it: Nuova applicazione PSGI
tr: Yeni PSGI Uygulaması

source: Online References
it_it: Documentazione online
tr: Çevrimiçi Başvuru Kaynakları

source: Plack Advent Calendar
it_it: Calendario dell'avvento di Plack
tr: Plack Varış Takvimi

source: About
it_it: Informazioni su
tr: Hakkında

source: Failed to open template file %s
it_it: Impossibile aprire il file modello '%s'
tr: Şablon dosyası %s açılırken hata oluştu

source: 'Sorry Dave, I can't do that - you need to close the corresponding file tab to close this panel
it_it: Mi dispiace Dave, non posso farlo - devi chiudere la scheda file corrispondente per chiudere questo pannello
tr: 'Üzgünüm Dave, bunu yapamam - bu paneli kapatabilmek için, ilişkili dosya sekmesini kapatmalısın

source: Expected a PSGI document, but instead got: %s
it_it: Atteso un documento PSGI, invece ottenuto: %s
tr: Bir PSGI belgesi beklenirken, bunun yerine %s alındı

source: PSGI/Plack support for Padre
it_it: Supporto PSGI/Plack per Padre
tr: Padre için PSGI/Plack desteği

source: by
it_it: Di
tr: ile

source: This system is running Plack version
it_it: Questo sistema sta eseguendo la versione Plack
tr: Bu dizgede çalışan Plack sürümü

source: Let plackup guess
it_it: Lascia che plackup supponga
tr: plackup tahmin etsin

source: plackup command not found, please check your Plack installation and $PATH
it_it: Impossibile trovare il comando plackup, verifica la tua installazione Plack e $PATH
tr: plackup komutu bulunamadı. Lütfen Plack kurulumunuzu ve PATH çevre değişkenini denetleyin

source: Wx::Perl::ProcessStream is version %s which is known to cause problems. Get at least 0.20 by typing cpan Wx::Perl::ProcessStream
it_it: La versione di Wx::Perl::ProcessStream è la %s che è nota per causare problemi. Procurati almeno la 0.20 digitando cpan Wx::Perl::ProcessStream
tr: Wx::Perl::ProcessStream sürümünüz %s için bilinen uyumluluk sorunları mevcut. Şu komutu girerek en azından 0.20 sürümünü kurun cpan Wx::Perl::ProcessStream

source: Failed to start server via '%s'
it_it: Impossibile avviare il server mediante '%s'
tr: Sunucuyu '%s' ile başlatma girişimi başarısız oldu

source: Error
it_it: Errore
tr: Hata

source: Server
tr: Sunucu

source: Port
it_it: Porta
tr: Kapı numarası

source: Options
it_it: Opzioni
tr: Seçenekler

source: Auto-Restart
it_it: Riavvio automatico
tr: Otomatik Yeniden Başlat

source: Start
it_it: Avvio
tr: Başlat

source: View in Browser
it_it: Visualizza nel browser
tr: Tarayıcıda Göster

source: Stop
it_it: Arresto
tr: Durdur
