{
   "votes" : "43677",
   "rating" : "8.5",
   "studio" : [
      "HBO",
      "BBC",
      "DreamWorks SKG",
      "DreamWorks Television",
      "Playtone. Broadcast: HBO Network"
   ],
   "genre" : [
      "War"
   ],
   "year" : "2001",
   "duration" : "705",
   "topic" : [
      "II World War",
      "Army",
      "Based on a true story",
      "TV Miniseries"
   ],
   "originaltitle" : "Band of Brothers (TV)",
   "id" : "640188",
   "title" : "Band of Brothers (TV)",
   "synopsis" : "TV Series (2001). 10 episodes. War (II World War). Created by Tom Hanks, Steven Spielberg and Stephen Ambrose after \"Saving Private Ryan\". Camp Toccoa, Georgia. Summer, 1942. A diverse group of young American men begin their voluntary training in one of America's newest military experiments: the paratroops. Their unit, Easy Company of the 506th Parachute Infantry Regiment, is commanded by the petty, autocratic Lt. HERBERT SOBEL (David Schwimmer). His job is to turn these eager civilians into the U.S. Army's most elite soldiers. But Sobel fails to win the respect of his men, and a rivalry emerges between him and a junior officer, Lt. DICK WINTERS (Damian Lewis). Winters' best friend, Lt. LEWIS NIXON (Ron Livingston), becomes an intelligence officer and tells Winters their first combat assignment will be to invade occupied Europe. Training for this mission in England, Sobel continues to harass Winters by citing him for failing to inspect a latrine. When Winters requests a trial by court martial, the sergeants in the company decide to turn in their stripes rather than lose Winters and have to follow Sobel into combat. Their Commanding Officer, Col. ROBERT SINK (Dale Dye), upbraids them for this, but decides to transfer Sobel out of the company before the upcoming D-day mission. The episode ends as the company -- Winters included -- board planes headed for Normandy.  EPISODES: 1 \"Currahee\" (Director: Phil Alden Robinson). Easy Company undergoes training and are introduced to Captain Sobel. The company is shipped to England and prepare for D-DAY.  2 \"Day of Days\" (Director: Richard Loncraine). The Company lands in Normandy and Lieutenant Winters completes their mission by assuming command.  3 \"Carentan\" (Director: Mikael Salomon). The Company battles in Carentan. Private Albert Blithe struggles with fear.  4 \"Replacements\" (Director: David Nutter). Easy Company, along with replacements, parachute into and fight in the Netherlands as part of Operation Market Garden.  5 \"Crossroads\" (Director: Tom Hanks). Winters writes a report on the challenge of an unexpected resistance to a German attack, and is haunted by his conscience after shooting a teenage German soldier.  6 \"Bastogne\" (Director: David Leland). Easy Company experiences the Battle of the Bulge and have to hold ground near Bastogne.  7 \"The Breaking Point\" (Director: David Frankel). The Company battles near Foy, Belgium, and the actions of Lieutenant Norman Dike are examined and questioned.  8 \"The Last Patrol\" (Director: Tony To). Easy Company carries out a dangerous mission in Haguenau, and Captain Winters is promoted to Major and David Webster returns from a hospital  9 \"Why We Fight\" (Director: David Frankel). A concentration camp near Landsberg is discovered by the Company. Based on the liberation of Kaufering IV in the area of Hurlach.  10 \"Points\" (Director: Mikael Salomon). July 1945. The company captures Eagle's Nest in Berchtesgaden, and the end of the war is announced.",
   "country" : "United States",
   "cover" : "http://pics.filmaffinity.com/Band_of_Brothers_TV-949176562-main.jpg",
   "cinematographer" : [
      "Remi Adefarasin",
      "Joel Ransom"
   ],
   "website" : "http://www.hbo.com/band",
   "director" : [
      "Stephen Ambrose",
      "David Frankel",
      "Tom Hanks",
      "David Leland",
      "Richard Loncraine",
      "David Nutter",
      "Phil Alden Robinson",
      "Mikael Salomon",
      "Tony To"
   ],
   "cast" : [
      "Damian Lewis",
      "Ron Livingston",
      "Donnie Wahlberg",
      "Scott Grimes",
      "Peter Youngblood Hills",
      "Shane Taylor",
      "Neal McDonough",
      "Dexter Fletcher",
      "Rick Gomez",
      "Michael Cudlitz",
      "Nicholas Aaron",
      "James Madio",
      "Michael Fassbender",
      "Kirk Acevedo",
      "Philip Barantini",
      "Ross McCall",
      "Joseph Liegbott",
      "Nolan Hemmings",
      "Rick Warden",
      "Robin Laing",
      "Doug Allen",
      "George Calil",
      "David Schwimmer",
      "Matthew Settle",
      "Jamie Bamber",
      "Colin Hanks",
      "Tom Hardy",
      "Stephen Graham",
      "Simon Pegg",
      "Andrew Scott",
      "James McAvoy"
   ],
   "composer" : [
      "Michael Kamen"
   ],
   "screenwriter" : [
      "Erik Jendresen",
      "Tom Hanks",
      "John Orloff",
      "E. Max Frye",
      "Graham Yost",
      "Bruce C. McKenna",
      "Erik Bork"
   ]
}