Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/T/Test-Unit-GTestRunner/po/*.po
Languages: bg, de

source: _File
bg: _Файл
de: _Datei

source: _Run
bg: _Пускане
de: _Start

source: Run _Selected
bg: _Пускане на избрани
de: S_tarte Auswahl

source: _Settings
bg: _Настройки
de: _Einstellungen

source: _Refresh suites before every run
bg: _Опресняване на пакетите преди всяко пускане
de: Testsuites vor jedem Lauf _neu laden

source: _Help
bg: _Помощ
de: _Hilfe

source: _About
bg: _Прекъсване
de: _Info

source: Run
bg: Пускане
de: Start

source: Selected
bg: Само избрани
de: Auswahl

source: Refresh the test suite
bg: Опресняване на тестовият пакет
de: Test-Suite neu laden

source: Refresh suites before every run
bg: Опресняване на пакетите преди всяко пускане
de: Testsuites vor jedem Lauf neu laden

source: Quit
bg: Изход
de: Beenden

source: Failures
bg: Провали
de: Fehlschläge

source: Test Hierarchy
bg: Тестова Йерархия
de: Test-Hierarchie

source: Starting GTestRunner.
bg: Стартиране на GTestRunner
de: GTestRunner startet.

source: Test Case
bg: Тестови случай
de: Testfall

source: Source
bg: Източник
de: Quelle

source: Test cannot be started: {cmd}: {err}.
bg: Тестът не може да започне: {cmd}: {err}.
de: Test kann nicht gestartet werden: {cmd}: {err}.

source: Running ...
bg: Пускане ...
de: Läuft ...

source: The test suite you want to run has changed. Please make a new selection, and run again.
de: Die aktuelle Auswahl ist ungültig, weil die Test-Suite verändert wurde. Ein erneuter Lauf ist erst nach einer neuen Auswahl möglich.

source: Waiting for test to terminate ...
bg: Изчакване да завърши теста ...
de: Warten auf Testende ...

source: Refreshing the test suite.
bg: Опресняване на тестовите пакети
de: Die Test-Suite wird neu geladen.

source: Testsuite cannot be listed: {cmd}: {err}.
bg: Тестът не може да бъде показан: {cmd}: {err}.
de: Testsuite kann nicht aufgelistet werden: {cmd}: {err}.

source: Corrupt test listing: {line}
bg: Развален списък с тестове: {line}
de: Fehlerhaftes Test-Listing: {line}

source: Invalid change in test depth ({old} to {new}).
bg: Невалидна промяна на тестово ниво ({old} към {new}).
de: Unmöglicher Wechsel in Testsuite-Tiefe ({old} zu {new}).

source: translator-credits
bg: Viktor Kojouharov <viktor@imperia.net>
de: Guido Flohr <guido@imperia.net>

source: Select a test suite or test case to run!
bg: Изберете тестов пакет или единичен тест за пускане
de: Test-Suite oder Testfall auswählen!

source: Select on pipe to child process failed: {err}.
de: Select() auf Pipe zum Kindprozess fehlgeschlagen: {err}.

source: Unexpected end of file while reading from child process.
bg: Неочакван край на файл докато бива прочетен от дъщерен процес.
de: Unerwartetes Dateiende beim Lesen vom Kindprozess.

source: Read from pipe to child process failed: {err}.
de: Lesen aus Pipe zum Kindprozess fehlgeschlagen: {err}.

source: Test terminated.
bg: Тестът е спрян.
de: Test beendet.

source: Running: {test}
bg: Пускане: {test}
de: Test »{test}« läuft.

source: one test,
bg: един тест,
de: Ein Test,

source: one error,
bg: една грешка,
de: ein Fehler,

source: one failure
bg: един провал
de: ein Fehlschlag

source: Success: {test}
bg: Успех: {test}
de: Erfolg: {test}

source: Failure: {test}
bg: Провали: {test}
de: Fehlgeschlagen: {test}

source: Test aborted.
bg: Тестът е спрян.
de: Test abgebrochen.

source: Test process terminated.
bg: Тестовият процес е спрян.
de: Testprozess beendet.

source: Child process cannot be terminated.
bg: Дъщерният процес не може да бъде спрян.
de: Kindprozess kann nicht beendet werden.

source: Child process signaled with SIG{NAME}.
bg: Дъщерен процес е сигнализиран със SIG{NAME}.
de: Kindprozess erhält Signal »{NAME}«.

source: Internal error: Unrecognized error state "{state}". This should not happen.
bg: Вътрешна грешка: Непознат стадий "{state}". Това не трябва да се случва.
de: Interner Fehler: Unbekannter Zustand »{state}«. Dies sollte nicht passieren.

source: Standard output cannot be duplicated: {err}.
de: Die Standardausgabe kann nicht dupliziert werden: {err}.

source: Standard output cannot be closed: {err}.
de: Die Standardausgabe kann nicht geschlossen werden: {err}.

source: Standard output cannot be redirected to standard error: {err}.
de: Die Standardausgabe kann nicht auf die Standardfehlerausgabe umgeleitet werden: {err}.

source: Standard output cannot be tied: {err}.
de: Tie() für Standardausgabe ist fehlgeschlagen: {err}.

source: Standard error cannot be tied: {err}.
de: Tie() für Standardfehlerausgabe fehlgeschlagen: {err}.

source: _Tests
bg: _Тестове

source: Test
bg: Тест

source: Protocol error: Invalid number of bytes in reply from child process.
bg: Грешка в протокола: Невалиден номер от байтове в отговора на дъщерен процес.
