Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-SpellCheck/share/locale/Padre__Plugin__SpellCheck-*.po
Languages: ar

source: Spell check
ar: تمت التهجئه

source: Check spelling F7
ar: فحص التهجئه F7

source: Preferences
ar: الاعدادات

source: No document opened.
ar: لا توجد أي وثيقة مفتوحة.

source: Spell check finished.
ar: تمت التهجئه

source: Spelling (%s)
ar: التهجئه (%s)

source: Add to dictionary
ar: اضافه الى المعجم

source: Replace
ar: تغيير

source: Replace all
ar: تغيير الكل

source: Ignore
ar: تجاهل

source: Ignore all
ar: تجاهل الكل

source: Close
ar: اغلاق

source: Not in dictionary:
ar: ليس بالمعجم:

source: Suggestions
ar: اقتراحات

source: Spelling preferences
ar: اعدادات التهجئه

source: Dictionary:
ar: المعجم:
