Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Padre-Plugin-DataWalker/share/locale/Padre__Plugin__DataWalker-*.po
Languages: de, ja, nl_nl, tr, zh_tw

source: About
de: Über
ja: このプラグインについて
nl_nl: Betreft
tr: Hakkında
zh_tw: 關於

source: Browse YAML dump file
de: YAML-Dump-Datei durchsuchen
ja: YAMLのダンプファイルを表示する
nl_nl: Doorblader het YAML dump bestand
tr: YAML döküm dosyasını tara
zh_tw: 瀏覽 YAML dump 檔

source: Browse current document object
de: Aktuelles Dokumentenobjekt ansehen
ja: 現在のドキュメントオブジェクトを表示する
nl_nl: Doorblader het huidige document object
tr: Geçerli belge nesnesini tara
zh_tw: 瀏覽目前文件的物件

source: Browse Padre IDE object
de: Padre-IDE-Objekt ansehen
ja: Padre IDEオブジェクトを表示する
nl_nl: Doorblader Padre IDE object
tr: Padre IDE nesnesini tara
zh_tw: 瀏覽 Padre IDE 物件

source: Browse Padre main symbol table
de: Padre-Symboltabelle ansehen
ja: Padreのメインシンボルテーブルを表示する
nl_nl: Doorblader Padre hoofd symbool tabel
tr: Padre ana simge tablosunu tara
zh_tw: 瀏覽 Padre 主要符號表

source: Open file
de: Datei öffnen
ja: ファイルを開く
nl_nl: Open bestand
tr: Dosya aç
zh_tw: 開啟檔案

source: Could not find the specified file '%s'
de: Datei %s konnte nicht gefunden werden
ja: 指定されたファイル「%s」が見つかりませんでした
nl_nl: Het bestand '%s' niet gevonden
tr: Belirtilen '%s' dosyası bulunamıyor
zh_tw: 找不到特殊檔案 '%s'

source: File not found
de: Datei nicht gefunden
ja: ファイルが見つかりません
nl_nl: Bestand niet gevonden
tr: Dosya bulunamadı
zh_tw: 未發現檔案

source: Could not read the YAML file.%s
de: Kann YAML-Datei nicht lesen: %s
ja: YAMLファイルを読み込めません。%s
nl_nl: Kon het YAML bestand niet lezen. %s
tr: YAML dosyası bulunamıyor.%s
zh_tw: 無法讀取這個 YAML 檔.%s

source: Invalid YAML file
de: Ungültige YAML-Datei
ja: YAMLファイルが不正です
nl_nl: Invalide YAML file
tr: Geçersiz YAML dosyası
zh_tw: 不合法的 YAML 檔案
