Repository: metacpan/metacpan-cpan-extracted
Catalog: distros/P/Parley/lib/Parley/I18N/*.po
Languages: it

source: %1 wrote:
it: %1 ha scritto:

source: %quant(%1,post)
it: %quant(%1,messaggio,messaggi)

source: %quant(%1,Forum)
it: %quant(%1,Forum,Forum)

source: %quant(%1,Reply)
it: %quant(%1,Risposta,Risposte)

source: %quant(%1,reply)
it: %quant(%1,risposta,risposte)

source: %quant(%1,View)
it: %quant(%1,Lettura,Letture)

source: %quant(%1,view)
it: %quant(%1,lettura,letture)

source: 404 Not Found
it: Errore 404

source: ACCEPT TERMS
it: È necessario accettare i Termini e Condizioni per continuare ad utilizzare questo sito

source: Access Denied
it: Accesso Negato

source: Access to this application is not permitted from %1
it: Non è permesso accedere all'applicazione da %1

source: Activate Your %s Registration
it: Attivare Registrazione %s

source: Active
it: Attivo

source: ADD THREAD WATCH
it: Aggiungi un Thread Watch

source: Add Reply
it: Aggiungi Risposta

source: Add T-and-Cs
it: Add T&amp;C

source: Add Watch
it: Aggiungi Watch

source: ADMIN LOCK POST
it: Chiudi questo messaggio

source: ADMIN SPECIFY LOCK THREAD
it: Bisogna specificare il discussione da chiudere

source: ADMIN SPECIFY STICK THREAD
it: Bisogna specificare il discussione di rilievo

source: Administration
it: Amministrazione

source: ago
it: fa

source: All Forums
it: Tutti i Forum

source: All Rights Reserved
it: Tutti i Diritti Riservati

source: An email has been sent to
it: Un'email è stato mandato a

source: An error has occurred
it: È stato riscontrato un errore

source: AUTHENTICATION FAILED
it: Non è stato possibile effettuare l'autenticazione con le credenziali fornite

source: Cancel
it: Annulla

source: CHANGE AVATAR
it: Cambia l'avatar selezionando un file e cliccando il bottone Upload qui sotto

source: Click on the login link to continue
it: Cliccare sul link login per continuare

source: Close
it: Chiudi

source: Comment
it: Commenta

source: Confirm Password
it: Conferma Password

source: Contents
it: Contenuti

source: Continue
it: Continua

source: Continue reading
it: Continua lettura

source: Create New Thread
it: Crea Nuovo Thread

source: created by
it: creato da

source: created by (%1)
it: creato da %1

source: Current Avatar
it: Avatar Attuale

source: Current Forum
it: Forum Attuale

source: Current User
it: Utente Attuale

source: DATABASE CRITERIA MISSING
it: Mancano criteri per la ricerca del database

source: DATABASE TOO MANY RECORDS
it: La ricerca del database ha fornito troppi record

source: DFV FIELDS MISSING
it: Manca almeno un campo richiesto.

source: DFV FIELDS INVALID
it: Almeno un campo ha dati invalidi.

source: DFV FILL REQUIRED
it: Tutti i campi richiesti devono essere riempiti.

source: EDIT LOCKED POST
it: Non si può modificare un messaggio chiuso.

source: EDIT LOGIN REQUIRED
it: È necessario effettuare il login prima di modificare i propri post.

source: EDIT OWN POSTS ONLY
it: Si possono modificare solo i propri messaggi.

source: Edit
it: Modifica

source: Edited
it: Modificato

source: Email Address
it: Indirizzo Email

source: Email Engine
it: Motore Email

source: EMAIL FAILED STORE
it: Non è stato possibile archiviare l'informazione. Per favore provare più tardi.

source: EMAIL IN USE (%1)
it: L'indirizzo email fornito è già in uso.<br />Per favore provarne uno diverso o utilizzare la pagina <a href="%1">Password Dimenticata</a>.

source: EMAIL SEND PROBLEM
it: È stato riscontrato un problema nel mandare un'email dal sistema

source: EMAIL MISSING SUBJECT
it: Manca Oggetto

source: ENTER REPLY
it: Scrivere la risposta nel modulo sottostante

source: FILE NOT IMAGE
it: Il file uploadato sembra non essere un'immagine

source: FILE NEWDIR FAILED
it: Non è stato possibile creare la directory. Archiviazione di upload fallita.

source: FILE STORE FAILED
it: Non è stato possibile archiviare l'upload.

source: FILE TOO LARGE
it: Le dimensioni del file sono troppo grandi. Il file non può avere dimensioni maggiori di 20K.

source: First
it: Primo

source: First Name
it: Nome

source: Forgotten Password
it: Password Dimenticata

source: Forums
it: Forum

source: Forum List
it: Elenco di Forum

source: Forum Moderators
it: Moderatori di Forum

source: Forum Summary
it: Sommario di Forum

source: FORUMNAME IN USE
it: Il nome dato al forum è già in uso. Provare un nome diverso.

source: FORUMNAME USED
it: è già stato usato da un altro utente.

source: General
it: Generale

source: Guest User
it: Utente Ospite

source: Go
it: Vai

source: Help
it: Aiuto

source: Incomplete authentication URL
it: Autenticazione URL Incompleta

source: Incomplete URL
it: URL Incompleta

source: IP Bans
it: Indirizzi IP banditi

source: IP Logged
it: IP Loggato

source: Invalid %1
it: %1 invalido

source: Invalid requested value
it: Valore richiesto invalido

source: Last
it: Ultimo

source: Last Modified
it: Ultima Modifica

source: Last Name
it: Cognome

source: Last Post
it: Ultimo Messaggio

source: last post by
it: ultimo messaggio:

source: last post by (%1)
it: ultimo messaggio: %1

source: Last Viewed
it: Ultima Lettura

source: LOCK AFTER POSTING
it: Chiudi discussione dopo aver inviato il messaggio

source: Lock Thread
it: Chiudi Thread

source: Locked
it: Chiuso

source: Locked Post
it: Messaggio Chiuso

source: Locked Topic
it: Discussione Chiusa

source: LOGIN ADD REPLY
it: Bisogna aver effettuato il login prima di potere scrivere una risposta.

source: LOGIN NEW TOPIC
it: Bisogna aver effettuato il login prima di aggiungere una discussione.

source: LOGIN REQUIRED
it: Bisogna aver effettuato il login prima di poter accedere qui.

source: LOGIN THREAD CONTINUE
it: Bisogna aver effettuato il login prima di poter usare la funzione continuazione discussione.

source: LOGIN USE NEW
it: Effettuare login usando nome utente e la <u>nuova</u> password.

source: LOGIN VIEW WATCHES
it: Bisogna aver effettuato il login prima di potere vedere i discussione seguiti.

source: LOGIN WATCH TOPIC
it: Bisogna aver effettuato il login prima di poter seguire una discussione.

source: Logged in as
it: Utente:

source: Login Not Allowed
it: Login Non Permesso

source: Logins are not permitted from %1
it: Login non permessi da %1

source: Manage
it: Amministra

source: Manage user roles
it: Amministra ruoli utenti

source: Me
it: Personale

source: Main Page
it: Pagina Principale

source: Message
it: Messaggio

source: Moderate
it: Moderare

source: My Preferences
it: Preferenze

source: My Profile
it: Profilo

source: My Watched Threads
it: Thread Seguiti

source: Name
it: Nome

source: Never Posted
it: Mai Scritto Messaggi

source: New Password
it: Nuova Password

source: Next
it: Prossimo

source: Nickname
it: Nick

source: No Moderators
it: Non ci sono moderatori

source: No posts
it: Non ci sono messaggi

source: No reason given
it: Non è data nessuna ragione

source: NO MATCHING USERS
it: Non ci sono utenti che corrispondo alle informazioni fornite

source: NO RECENT THREADS
it: Non ci sono discussione recenti da visualizzare

source: NO SEARCH RESULTS
it: La ricerca non ha fornito risultati

source: NO SITE TERMS
it: Il sito non ha Termini e Condizioni

source: No Such Form
it: Il modulo non esiste

source: No User Avatar
it: L'utente non ha un Avatar

source: No User Specified
it: Nessun utente specificato

source: non-integer forum id passed
it: L'id del forum non è un numero intero

source: non-integer post id passed
it: L'id del messaggio non è un numero intero

source: non-integer thread id passed
it: L'id del discussione non è un numero intero

source: non-integer user id passed
it: L'id dell'utente non è un numero intero

source: None
it: Nessuno

source: No moderators
it: Non ci sono moderatori

source: Notifications
it: Avvertimenti

source: Not Authenticated
it: Non Autenticato

source: of
it: di

source: or
it: o

source: Page
it: Pagina

source: Page %1 of %2
it: Pagina %1 di %2

source: PASSWORD DETAILS SENT
it: Nei prossimi minuti dovrebbe essere mandata un'email con ulteriori istruzioni per aggiornare la password.

source: PASSWORD EMAIL SEND FAILED
it: Il sistema non è riuscito a mandare l'email di aggiornamento password.

source: PASSWORD ENTER DETAILS
it: Scrivere nome utente e password

source: PASSWORD GAIN
it: Per accedere all'account si può mandare un'email per effettuare un reset della password.

source: PASSWORD IMPOSSIBLE
it: Questo rende impossibile fornire la password, anche se viene dimenticata.

source: PASSWORD PROCEED
it: Per continuare fornire il nome utente o l'indirizzo email utilizzati per la registrazione.

source: PASSWORD RESET
it: Per cambiare la password scrivere il nome utente e la nuova password nei campi sottostanti, poi cliccare il bottone <em>cambiare la password</em> per continuare.

source: PASSWORD RESET ID BOGUS
it: URL Reset Password Invalido

source: PASSWORD RESET SUCCESS
it: La password è stata aggiornata.

source: PASSWORD RESET URL INCOMPLETE
it: URL Reset Password Incompleta.

source: PASSWORD STORES
it: archivia una copia criptata della password o dell'email usati per la registrazione.

source: Password Reminder
it: Dimenticato la Password?

source: person
it: persona

source: Please choose a language
it: Scegli una lingua

source: Please enter your information
it: Per favore fornire le proprie informazioni

source: Please enter suspension information
it: Immettere informazioni riguardanti la sospensione

source: Please enter your username and password
it: Per favore fornire il nome utente e la password

source: people
it: persone

source: posted by
it: inviato da

source: Post Edited By: %1
it: Messaggio Modificato Da: %1

source: Posted from %1
it: Inviato da %1

source: Posting Not Allowed
it: Non è permesso inviare messaggi

source: Posting is not permitted from %1
it: Non è permesso inviare messaggi da %1

source: Posts
it: Messaggi

source: posts
it: messaggi

source: Posts Made
it: Messaggi Scritti

source: PREFS ADD WATCHES
it: Aggiorna watch per messaggi nuovi automaticamente

source: PREFS DESIRED LOCATION
it: Scegliere il paese di provenienza. Questa informazione sarà usata per visualizzare l'ora di scrittura dei messaggi calcolando i fusi orari.

source: PREFS EMAIL NOTIFICATION
it: Ricevere email di notifica per discussione sotto osservazione

source: Previous
it: Precedente

source: PROFILE NOT FOUND
it: Non è possibile trovare il profilo dell'utente richiesto.

source: Post New Terms
it: Aggiornare i Termini

source: Post New Topic
it: Crea Nuova Discussione

source: Quote
it: Cita

source: Reason for suspension
it: Ragione per sospensione

source: Recently Updated Threads
it: Thread Aggiornati Recentemente

source: Registration Not Allowed
it: Non è permesso effettuare la registrazione

source: Registrations are not permitted from %1
it: Non è permesso effettuare la registrazione da %1

source: Register
it: Crea un account

source: Registration Complete
it: Registrazione Completata

source: Remove Watch
it: Rimuovi Watch

source: REPLY LOCKED THREAD
it: Non è possibilie rispondere a discussione chiusi.

source: Reply
it: Rispondi

source: Replying To
it: Rispondendo a

source: Reset My Password
it: Cambiare la Password

source: Return to
it: Ritornare a

source: Return to the forum
it: Ritornare al forum

source: Reset Your %s Password
it: Resettare la password di %s

source: said
it: ha detto

source: Search
it: Cerca

source: Search For
it: Trova

source: Search Results
it: Risultati Ricerca

source: Searching for
it: Cercando per

source: Select Zone
it: Seleziona Fuso Orario

source: Service
it: Servizio

source: Services
it: Servizi

source: Show timezone
it: Visualizza Fuso Orario

source: Sign Up
it: Crea Account

source: SIGNUP COMPLETE FORM
it: Completare il modulo sottostante per creare un nuovo account utente.

source: SIGNUP EMAIL
it: Indirizzo Email

source: SIGNUP EMAIL CONFIRM
it: Conferma Indirizzo Email

source: SIGNUP EMAIL USAGE
it: L'indirizzo email non verrà dato terzi. Verrà usato solamente per mandare un link di attivazione per il nuovo account. Se sono stati richiesti avvertimenti di aggiornamenti email a questo indirizzo verranno anche mandati email di notificazione.

source: SIGNUP ERRORS
it: Sono stati riscontrati i seguenti errori

source: SIGNUP FORUMNAME
it: Nome Forum

source: SIGNUP FORUMNAME DESCRIPTION
it: Il <em>Nome Forum</em> verrà visualizzato con tutti i messaggi scritti sui forum. I nomi dei forum sono tutti unici, quindi se si registrano due "John Smith", solo il primo verrà visualizzato come "John Smith" nei messaggi inviati.

source: SIGNUP PASSWORD
it: Password

source: SIGNUP PASSWORD CONFIRM
it: Conferma Password

source: SIGNUP USERNAME
it: Nome Utente

source: SITE MODERATOR REQUIRED
it: Bisogna essere un moderatore del sito per accedere a questa sezione.

source: Site
it: Sito

source: Snippet
it: Frammento

source: Start A New Topic
it: Crea una nuova discussione

source: Stick Thread
it: Segnare come discussione di rilievo

source: Sticky
it: Rilievo

source: Sticky Topic
it: Discussione di Rilievo

source: Subject
it: Oggetto

source: Summary of Changes
it: Sommario di Modifiche

source: Suspend Account
it: Sospendi Account

source: Suspended
it: Sospeso

source: TERMS ADD NEW
it: Aggiungi Nuovi Termini &amp; Condizioni del sito

source: TERMS AGREE
it: ACCETTO le condizioni sovrastanti

source: TERMS REJECT
it: NON ACCETTO le condizioni sovrastanti

source: Terms and Conditions
it: Termini &amp; Condizioni

source: Thanks for signing up
it: Grazie per aver effettuato la registrazione

source: The following error message was returned by the application
it: L'applicazione ha dato il seguente messaggio di errore

source: There is no current forum to view
it: Non è stato selezionato un forum da visualizzare

source: There is no current thread to view
it: Non è stato selezionato un discussione da visualizzare

source: THREAD NO INFORMATION
it: Non ci sono informazioni per il discussione o il messaggio al quale si è provato a rispondere.

source: THREAD NO POSTS
it: Non si può rispondere a discussione che non contiene messaggi.

source: THREAD WATCH FAILED
it: Non è stato possibile aggiungere un watch ai discussione richiesti.

source: threads
it: thread

source: Thread Locked
it: Thread Chiuso

source: Time
it: Ora

source: Time formatting example
it: Esempio formattazione ora

source: Topic
it: Discussione

source: Unauthorized!
it: Non autorizzato!

source: Unknown field name
it: Nome campo sconsociuto

source: Unlock Thread
it: Apri Thread

source: Unread posts
it: Messagi nuovi

source: Unstick Thread
it: Rimuovi 'Rilievo' da Thread

source: Update
it: Aggiorna

source: Update Reply
it: Aggiorna Risposta

source: Use UTC
it: Usare UTC

source: USER ACTIVATE
it: Per attivare l'account cliccare sul link nella email

source: USER ALMOST THERE
it: Quasi finito...

source: USER AUTHENTICATED
it: La registrazione è stat autenticata

source: User Profile
it: Profilo Utente

source: User Roles
it: Ruoli Utente

source: User has never posted
it: L'utente non ha mai inviato messaggi

source: USERNAME IN USE
it: Il nome utente fornito è già in uso. Selezionare un altro nome.

source: USERNAME INCORRECT
it: Nome Utente Fornito Sbagliato.

source: Username
it: Nome Utente

source: Users
it: Utenti

source: View
it: Visualizza

source: View all
it: Visualizza tutti

source: View Threads
it: Visualizza Thread

source: Watch this thread
it: Segui questo discussione

source: watching this thread
it: questo discussione è sotto osservazione

source: We're not in Kansas any more
it: Non siamo più in Kansas

source: wrote
it: ha scritto

source: Yes
it: Sì

source: You are not watching any threads
it: Non stai seguendo alcun discussione

source: You are watching this thread
it: Stai seguendo questo discussione

source: You don't have the required privileges to do that
it: Non hai l'autorizzazione necessaria per farlo

source: Your Details
it: Le tue Informazioni

source: Your Preferences
it: Le tue Preferenze

source: Your %s Username
it: Il tuo Nome Utente %s

source: second
it: secondo

source: seconds
it: secondi

source: minute
it: minuto

source: minutes
it: minuti

source: hour
it: ora

source: hours
it: ore

source: day
it: giorno

source: days
it: giorni

source: month
it: mese

source: months
it: mesi

source: year
it: anno

source: years
it: anni
